{
  "content": "# Bank reconciliation\n\n## Learn how to reconcile your Stripe payouts with cash in your bank.\n\nThe [Bank reconciliation\nreport](https://dashboard.stripe.com/reconciliation/bank?src=docs) enables you\nto reconcile payouts generated by Stripe with the cash in your bank account,\nhelping you track the cash from your business as it moves from Stripe to your\nbank.\n\n!\n\nThe Bank reconciliation report allows you to:\n\n- Understand the monthly summary of activity on your Stripe account and its\nimpact on payouts and the cash in your bank.\n- Track the amount of cash realized from Stripe in your bank account.\n- Track all Stripe payouts and their reconciliation status with bank deposits in\na single place.\n- Make sure you have the data required to accurately close your books.\n\nBank reconciliation is currently only available for users with direct US-based\nStripe accounts using an automated payout schedule. This feature isn’t yet\naccessible for:\n\n- Stripe Connect accounts\n- Users based outside the United States\n- Manual or instant payouts\n\n#### Note\n\nStripe’s reconciliation features aren’t a substitute for professional services\nor professional advice.\n\n## How Bank reconciliation works\n\nBank reconciliation helps you reconcile Stripe payouts with the deposits in your\nbank account, so you can keep track of all the funds received from Stripe and\nconnect your revenue with cash in your bank. To enable the reconciliation, [link\nyour bank\naccount](https://docs.stripe.com/bank-reconciliation#link-bank-account) to\nStripe and approve access for reconciliation.\n\nAfter you provide access to your bank statement, Stripe automatically reconciles\nthe Stripe payouts with the corresponding deposit in your bank account to\ndetermine the amount received and any outstanding balance. You can then access\nthe details of each Stripe payout, the bank deposit, and the corresponding\nreconciliation statuses from the Dashboard. We prepare the summaries based on\nyour Stripe account’s timezone and UTC.\n\n### Link your bank account\n\nIf you already have a linked bank account with Stripe, you can skip this step.\nTo link your bank account (or relink and inactive account):\n\n- Click **Link bank account** from the bank reconciliation page.\n- Review and consent to Stripe’s privacy policy, linked account terms, and the\ndetails of the bank account where your Stripe payouts are being deposited.\n- Select your bank either from the list of the most frequently chosen banks\nshown in the tiles or by searching for it.\n- Sign in to your banking portal and select the account where your Stripe\npayouts are being deposited.\n\nAfter a few minutes, a successful link displays a confirmation page.\n\n## Summary\n\nThe Dashboard summary offers an overview of activities affecting your Stripe\nbalance and the related payouts to your bank account. It breaks down your\nactivity by reporting categories, linking it with Stripe’s payouts and the funds\nreceived in your bank. It helps you understand the Stripe payment amounts and\ncorresponding cash reconciled with your bank each month. This aids in creating a\nrevenue-to-cash breakdown necessary for your monthly close process.\n\n#### Note\n\nThe activity available in the bank reconciliation summary corresponds to the\n[Balance change from activity](https://docs.stripe.com/reports/balance) report.\nThis includes all activity that affects your balance, including charges,\nrefunds, disputes, other adjustments, and fees during a month.\n\nThe following example shows 8 days of activity for a Stripe account with daily\nautomatic payouts and a payout speed of 2 business days. The account accepted a\npayment of 10 USD on January 28 and the funds became available on January 30,\ntriggering the first payout to the bank account.\n\nFor simplicity, assume no fees or other debits on the example transactions.\n\nDateTransactionPayoutReceived in bankJanuary 2810 USDJanuary 2930 USDJanuary\n3050 USD10 USD10 USDJanuary 3170 USD30 USD30 USDFebruary 160 USD50 USD50\nUSDFebruary 2100 USD70 USD70 USDFebruary 3110 USD60 USD60 USDFebruary 4100 USD*\n* Banks typically don’t credit payouts on Sundays, which is reflected by the\nempty amount for Sunday, February 4 in this example.\n\nGiven the above account activity, the bank reconciliation summary on February 4\nshows the following data:\n\nJanuaryFebruaryTotal payable Total160 USD270 USDPending0 USD110 USDPaid160\nUSD160 USDReconciled with bank Total160 USD60 USDIn same month40 USD60 USDIn\nsubsequent months120 USD0 USDUnreconciled0 USD100 USD\nThe reconciliation example shows transactions totaling 160 USD and 270 USD were\nprocessed in January and February respectively.\n\nIn January:\n\n- Stripe disbursed the entire 160 USD.\n- Your bank processed 40 USD of the total in the same month as the transaction\n(January)\n- Your bank processed 120 USD of the total in the following months (February).\n\nIn February:\n\n- Stripe disbursed 160 USD of the 270 USD transaction total.\n- 110 USD from February 3 hasn’t met the 2-day payout speed as of February 4, so\nis `Pending`.\n- Your bank processed 60 USD of the paid out total in the same month as the\ntransaction (February).\n- Your bank hasn’t processed 100 USD paid on Sunday, February 4, which is\n`Unreconciled`.\n\n## Cash realized in bank\n\nThe **Cash realized in bank** section shows you the total amount received from\nStripe in your bank account during a calendar month. This helps you monitor your\nmonthly cash inflow from Stripe. We capture this information from your bank\nstatement and you can use it to update your cash accounts during the close\nprocess for the month.\n\nUsing the preceding example of account activity, the **Cash realized in bank**\nsection has the following data:\n\nJanuaryFebruaryTotal cash realized in bank40 USD180 USD\nThe total amount reconciled with the bank (220 USD) matches the sum of the\namounts received in your bank account over the two months. Moreover, the sum of\nthe amount reconciled from January’s subsequent months and the amount reconciled\nwithin the same month from February (120 USD + 60 USD = 180 USD) equals the\ntotal cash realized from Stripe in February (180 USD).\n\n## Payouts\n\nThe **Payouts** section provides a list of all the payouts made by Stripe, the\nbank deposits, and their corresponding reconciliation and payout statuses. You\ncan filter and view this data based on payout date, method, payout status, and\nreconciliation status.\n\nIn the account activity example, the payouts have the following data:\n\nPayout dateMatching keyPayout statusPayout amountReceived in bankBank receipt\ndateReconciliation statusFebruary 5`ST-1239R12DF`In transit120 USDFebruary\n4`ST-1334R12DG`Paid100 USDUnreconciledFebruary 3`ST-1436R12DH`Paid60 USD60\nUSDFebruary 3ReconciledFebruary 2`ST-1537R12DI`Paid70 USD70 USDFebruary\n2ReconciledFebruary 1`ST-1639R12DJ`Paid50 USD50 USDFebruary 1ReconciledJanuary\n31`ST-1738R12DK`Paid30 USD30 USDJanuary 31ReconciledJanuary\n30`ST-1839R12DL`Paid10 USD10 USDJanuary 30Reconciled\n### Payouts report\n\nColumn nameDescription`payout_date`The date that the payout is expected to\narrive in the bank.`matching_key`The common reference key between Stripe payouts\nand your bank statements that we use to match records and perform\nreconciliation.`payout_status`The status of the payout paid by\nStripe.`payout_amount`The net amount paid by Stripe against the\npayout.`received_in_bank`The amount received in your bank account against the\npayout.`bank_receipt_date`The date that the payout is received in your bank\naccount. Stripe fetches this information from your bank\ndeposits.`reconciliation_status`The reconciliation status of the payout. We\nmatch Stripe payouts with your bank deposits and assign each payout one of the\nfollowing statuses: ‘Reconciled’ or ‘Unreconciled’.\n## How we use your data\n\nThe Bank reconciliation report uses your Stripe transactions and Financial\nConnections accounts to provide you with bank reconciliation services. You can\ncontrol which Stripe products receive and use your financial accounts data from\nthe [Link external account\nsettings](https://dashboard.stripe.com/settings/linked-accounts) page.\n\n#### Note\n\nThe bank reconciliation services are provided “as-is.” There might be delays in\ndata rendering. You’re responsible for checking the accuracy and completeness of\nthe data.\n\n## Links\n\n- [Bank reconciliation\nreport](https://dashboard.stripe.com/reconciliation/bank?src=docs)\n- [Balance change from activity](https://docs.stripe.com/reports/balance)\n- [Link external account\nsettings](https://dashboard.stripe.com/settings/linked-accounts)",
  "metadata": {
    "title": "Bank reconciliation | Stripe Documentation",
    "description": "Reconcile Stripe payouts with the cash in your bank account and verify the monthly summary of your revenue to cash breakdown.",
    "sourceURL": "https://docs.stripe.com/bank-reconciliation"
  }
}