{
  "content": "# Regulatory compliance guidelinesPrivate preview\n\n## Learn about the requirements and guidelines for regulatory compliance.\n\nTo offer and promote Stripe Capital to your users, your platform’s marketing and\nuser interfaces must adhere to the following regulatory compliance guidelines.\nThese guidelines can help your platform and users (connected accounts) navigate\nthe financial regulations applicable to Capital.\n\n#### Caution\n\nThese guidelines aren’t legal advice. Platforms using Capital must seek their\nown legal advice in respect to product branding and use of the product to offer\nfinancial services.\n\n## Compliance checklist\n\nEnsure you’ve completed the following checklist prior to launching your program:\n\n- Read the requirements for managing complaints\n- Read the CAN-SPAM Act\n- Read the UDAP guidelines\n- Create a mandatory recordkeeping process\n\n## Managing complaints\n\nTo create a responsive and equitable complaints handling process, you must\ndetail and distribute clear pathways to where your customers can report\ncomplaints. Complaints are an important and mandatory part of the compliance\nsystem for financial services products. We regard complaints as *any expressions\nof dissatisfaction about our organization, products and services, policies,\nemployees, and contracted partners*.\n\nIf your customer contacts your support team with a complaint regarding the\nStripe Capital product, direct them to Stripe Servicing\n([capital-support@stripe.com](mailto:capital-support@stripe.com)). Stripe\nServicing will handle any complaints received by your customers, and you must\nforward any Stripe Capital complaints your platform directly receives back to\nStripe ([capital-support@stripe.com](mailto:capital-support@stripe.com)).\n\n### Complaints reporting template\n\nIn summary:\n\n- A complaint is *any expression of dissatisfaction about our organization,\nproducts and services, policies, employees, and contracted partners*.\n- An executive complaint is *(i) any Complaint from a regulatory authority (such\nas a federal agency, a state agency, or a court with jurisdiction over Stripe or\nthe relevant Bank Partner) and (ii) any other person (including individuals and\nlegal entities) threatening material litigation.*\n- You must provide a clear pathway for your customers to file a complaint\n- You must report all Stripe Capital complaints your platform receives directly\nto Stripe\n\n## CAN-SPAM Act\n\nThe CAN-SPAM Act regulates marketing activity conducted by email.\n\n- An email is deemed a commercial message, subject to the CAN-SPAM act, if the\nprimary purpose of the email is to convey a commercial advertisement, or to\npromote a product or service.\n- A transactional email is an email sent to a customer that has a primary\npurpose relating to a particular transaction or relationship between you and the\ncustomer (e.g. loan terms and conditions). The CAN-SPAM Act imposes more\nrigorous requirements on commercial email messages, as compared with\ntransactional messages. Transactional messages are not subject to most of the\nrequirements of the CAN-SPAM Act. If a message contains both transactional\ncontent and commercial content, the CAN-SPAM Act’s commercial email requirements\nmay apply, if the message’s primary purpose may be considered to be commercial.\n\nTo facilitate compliance with the CAN-SPAM Act, any employee or staff utilizing\nor having access to your email systems and resources for marketing must adhere\nto the following requirements:\n\n- **Misleading Header Information**: Any email message, whether commercial or\ntransactional, must not contain: (i) false or misleading header information;\n(ii) a “from” line that does not accurately identify any person (individual or\nbusiness) who initiated the message; and (iii) inaccurate or misleading\nidentification of a protected computer used to initiate the message for purposes\nof disguising its origin.\n- **Deceptive Subject Headings**: Any commercial email message must not contain\ndeceptive subject headings. For example, a deceptive subject heading is one that\nwould be likely to mislead the recipient about a material fact regarding the\nmessage’s contents or subject matter.\n- **Opt-out Mechanism**: You must provide your customers with the ability to\nopt-out of receiving future commercial messages, and you must honor customer\nrequests to opt-out within ten days. You cannot require a user to pay a fee or\nprovide information other than an email address to opt-out.\n- **Advertisement Identification**: Any commercial email message must contain\nclear and conspicuous identification that the message is an advertisement or\nsolicitation.\n- **Physical Address Disclosure**: Any commercial email message must disclose a\nvalid physical address of the sender.\n\n#### Caution\n\nFailure to comply with CAN-SPAM could result in hefty fines for every single\nviolation.\n\nIn summary:\n\n- Subject lines must not contradict email body copy\n- The sender or “from” email address can’t be confusing or misleading\n- Email disclosures MUST include a physical business address\n- Email disclosures must clearly identify the message as an advertisement\n- There MUST be a clear and conspicuous opt-out link\n- Email opt-outs must be honored within 10 days\n\n## Testimonials\n\nIf you use a testimonial or endorsement to advertise Stripe products to your\ncustomers, you must consider the following:\n\n- The person giving a testimonial must be a real person and a real user of the\nservice or product they’re talking about.\n- You must have their written permission to use their quote, and save this\nwritten documentation in a place that can be easily accessed during audits. You\nmust also update this permission every 24 months.\n- Product benefits, costs, or features in any quotes must be verifiable and true\nto what most users can expect to experience when using the product or service.\n- If you have paid someone for their quote, or given them anything of value, you\nmust put a disclaimer near the quote that says the following:- “This includes\neven paid actors, if their scripting makes it sound like they’re giving a\npersonal testimonial.”\n\n## UDAP and correct messaging\n\nFederal regulation prohibits unfair and deceptive acts or practices (UDAP). To\navoid UDAP violations, you must think of the end user first when developing and\ndeploying any marketing materials.\n\nMake sure that marketing materials use clear messaging that fully explains\nproduct features, costs, benefits, and limitations. Don’t leave out key terms or\nfees, and don’t advertise product uses or features that aren’t true.\n\nDoDon’tOnly use statements about products that are true, accurate, and aligned\nwith how users engage with the products.Don’t leave out key information from\nmarketing content. If the information is likely to affect whether someone uses\nthe product, then it’s “key.\"If you make claims that require additional data to\nsupport them, or if an end user needs to know more details to know how a certain\nclaim is true, you must:- Provide documented evidence.\n- Disclose that information.\nMake exaggerated claims that are hard to prove. Don’t make absolute statements\nthat are disproved by a single exception. For example, “number 1,\" “every,\"\n“only,\" “all,\" “never,\" “always.\"Clearly explain all qualifying limitations and\nrequirements needed by end users to get the product or features that you’ve\nadvertised.Don’t advertise features or programs that only a few applicants\nactually qualify for.All disclosures must meet a “clear and conspicuous”\nstandard:- Font size must be large enough to read.\n- Font color must visibly contrast with the background.\n- Dynamic or video ads must have the disclosure on screen long enough to read.\nDon’t make disclosures hard to read.Disclosures used to explain or modify a\nclaim must be ‘tied’ to the claim they’re explaining.- Use a hyperlink directly\nlinking to the disclosure, or include the disclosure next to the claim in the\ncopy itself.\n- Use reference text or symbols (for example, an asterisk) directly after the\nclaim and before the disclosure language.\nDon’t bury disclosures in other non-key disclosures or footnotes.Disclose all\naccount fees, costs, benefits, and terms as part of onboarding before your end\nusers take out a product.Don’t advertise products as “free” if you’re charging\nfees.Make sure all images used are properly licensed and that you can document\nthis fact.Don’t use images, formatting, or copy that implies products are\nendorsed by, or affiliated with, government entities or celebrities.\n## Recordkeeping\n\nIn order to demonstrate your adherence to the requirements listed above, we ask\nthat you keep thorough records of all marketing materials, customer data,\naccount information, and other disclosures you make to customers for at least 5\nyears. The following is a list of records you should keep, and examples of what\ncould constitute as a record.\n\nRecord TypeExample formProduct UXScreenshots of all deployed versions of the\nproduct UX, include application flow, customer dashboard, support pages,\netc.MarketingInventory of all marketing copy deployed, Email distribution\nlistsmand targeting, used Email solicitation opt out lists (including timestamps\nof user opt outs), and adherence to opt-out requestsCustomer communications and\ncomplaintsEmail interactions or documentation developed in the course of\nresolving complaints\n## See also\n\n- [Customer support](https://docs.stripe.com/capital/servicing)\n- [Metrics](https://docs.stripe.com/capital/reporting)\n\n## Links\n\n- [Customer support](https://docs.stripe.com/capital/servicing)\n- [Metrics](https://docs.stripe.com/capital/reporting)",
  "metadata": {
    "title": "Regulatory compliance guidelines | Stripe Documentation",
    "description": "Learn about the requirements and guidelines for regulatory compliance.",
    "sourceURL": "https://docs.stripe.com/capital/regulatory-compliance"
  }
}