{
  "content": "# Supported Organization setupsPublic preview\n\n## Learn about different account setups that you can add to an organization.\n\nOrganizations support the following account setups: multiple standalone\naccounts, platforms, and connected accounts.\n\n## Multiple standalone accounts\n\nIt’s common to manage multiple Stripe accounts that represent different business\nlines, countries of operation, legal entities, and acquisitions.\n\n![Multiple standalone\naccounts](https://b.stripecdn.com/docs-statics-srv/assets/structure_1_before.c8b529f41e4ff0dbe8beea36e1dca3b6.png)\n\nMultiple standalone accounts representing different business lines.\n\nAfter you [add these accounts to an\norganization](https://docs.stripe.com/get-started/account/orgs/build), you can\nsearch and download consolidated reports across your accounts without any\nchanges to your Stripe integration. After you create an organization, you can\nadd new business lines or add existing accounts.\n\n![Organization with multiple standalone\naccounts](https://b.stripecdn.com/docs-statics-srv/assets/structure_1.fccd75f80ce664be76a7f5dc6f51008b.png)\n\nOrganization with multiple accounts representing different business lines.\n\n## Multiple platform accounts\n\nIf you have several platform accounts that correspond to different countries of\noperation or business lines, you can add them to an organization.\n\n![Organization with multiple Connect\nplatforms](https://b.stripecdn.com/docs-statics-srv/assets/structure_2_before.fba9132b399f3a6155b36fdb092493b2.png)\n\nMultiple standalone platform accounts representing different business lines,\neach with connected accounts.\n\nAfter you add your platforms to an organization, you can search for connected\naccounts under all your platforms, as well as data within each platform account.\n\n![Organization with multiple Connect\nplatforms](https://b.stripecdn.com/docs-statics-srv/assets/structure_2.7a6b0bd2eb1da064944eb16f21e047d0.png)\n\nOrganization with multiple platform accounts representing different business\nlines, each with connected accounts.\n\n## Multiple connected accounts under a Connect platform\n\nIn certain cases, you might own multiple connected accounts under a platform.\nThis commonly occurs in franchise groups where several franchises are under\ncommon ownership.\n\n![Organization with multiple Connect\nplatforms](https://b.stripecdn.com/docs-statics-srv/assets/structure_3_before.702c4fa894523d6e1a66e1111b9d3bac.png)\n\nMultiple connected accounts (Acme Dealer of Seattle and Acme Dealer of Tacoma)\nthat belong to the same owner and under a platform.\n\nEven though your connected accounts are under a platform, you can still add them\nto an organization. This allows you to use the unified search and reporting\nacross your accounts.\n\n![Organization with multiple Connect\nplatforms](https://b.stripecdn.com/docs-statics-srv/assets/structure_3.e8675ca3654841a4397bc2e2eacc4771.png)\n\nOrganization (Acme Dealer Group) with multiple connected accounts (Acme Dealer\nof Seattle and Acme Dealer of Tacoma) under common ownership.\n\n## Multiple business lines represented as connected accounts\n\nIn some cases, you might have represented different business lines as connected\naccounts under one platform account, even though your business isn’t a\ntraditional platform or marketplace. This is common if you want to consolidate\npayment integrations or clone payment methods stored in the platform to\nconnected accounts.\n\n![Organization with multiple accounts setup using\nConnect](https://b.stripecdn.com/docs-statics-srv/assets/structure_4_before.e35e09f6d8127fb01f240a30834b99b7.png)\n\nA platform account and multiple connected accounts, each representing different\nbusiness lines.\n\nYou can create an organization that encompasses the platform account and\nconnected accounts so that your team can benefit from unified search and\nreporting across all the accounts, without impacting your payment integrations.\n\n![Organization with multiple accounts setup using\nConnect](https://b.stripecdn.com/docs-statics-srv/assets/structure_4.29084c115c8f08dc82468dfc03005096.png)\n\nOrganization with a platform account and multiple connected accounts,\nrepresenting different business lines.\n\n## See also\n\n- [Build an\norganization](https://docs.stripe.com/get-started/account/orgs/build)\n\n## Links\n\n- [add these accounts to an\norganization](https://docs.stripe.com/get-started/account/orgs/build)",
  "metadata": {
    "title": "Supported Organization setups | Stripe Documentation",
    "description": "Learn about different account setups that you can add to an organization.",
    "sourceURL": "https://docs.stripe.com/get-started/account/orgs/setup"
  }
}