{
  "content": "# Choose a cardholder type\n\n## Learn how to select the best cardholder type for your use case.\n\nWhen creating a [Cardholder\nobject](https://docs.stripe.com/api/#issuing_cardholder_object), you can specify\na type: either `individual` or `company`—you can’t change the type after you\ncreate the cardholder. Setting a type is optional and defaults to individual if\nnone is specified.\n\nYou might have to collect additional information, depending on the cardholder\ntype you choose. For individual cardholders, you must provide first name and\nlast name, and proof of acceptance of [Authorized User\nTerms](https://docs.stripe.com/issuing/cards/virtual/issue-cards#accept-authorized-user-terms).\nThis data isn’t required for company cardholders.\n\n## Find your use case\n\nChoosing a cardholder type depends on your use case. View your use case and\nother program details from the [Card\nprograms](https://dashboard.stripe.com/settings/issuing/card-programs) page in\nthe Dashboard.\n\n### Individual cardholders\n\nCreate *individual cardholders* if you’re issuing the card to an employee or\ncontractor of your business or to an owner, employee, or contractor of one of\nyour connected accounts.\n\nThis is the default and most common type.\n\nSome example use cases for individual cardholders include:\n\n- Building a new expense management product for small businesses where the\nplatform issues cards to employees or contractors of those small businesses\n- Giving cards to your own employees to make purchases for your company\n- Building a fleet card product that issues cards to drivers\n- Running a platform that enables businesses to give cards to their employees\nfor disbursing employee benefits or perks\n\n### Company cardholders\n\nCreate *company cardholders* if you’re issuing the card directly to an entity.\n\nThis type is less common, and may not be available depending on the use-case you\nprovided at onboarding. If you’re restricted, Stripe returns the `Cardholder\ntype must be individual` error.\n\nHere are some example use cases for company cardholders:\n\n- A platform that creates virtual cards to use programmatically for online\npurchases with company funds and for its benefit. For example, purchasing\ninventory for resale or paying for cloud services. The cards are *not* given to\nindividual employees for individual expenses (for example, expensing a business\nlunch).\n- A platform that creates cards assigned to a vehicle (like a rental car or\nsemi-truck). The cards stay with the vehicle at all times. Alternating drivers\nuse the card to refuel the vehicle. The card does not belong to any one\nindividual.\n\n#### Caution\n\nIn some cases, you may not be able to create company cardholders, depending on\nStripe’s review of your use case at onboarding. If this restriction applies to\nyou, Stripe notifies you. You receive an error message if you try to create a\ncompany cardholder and your account has this restriction.\n\n## Changing cardholder type\n\nAfter a cardholder has been created, you can’t change its type.\n\nIf you have linked a card to the cardholder, you can’t change who the cardholder\nis.\n\nIf you haven’t linked any cards to the cardholder, you can create a new\ncardholder with the correct type. In most cases, you don’t need to delete the\nexisting cardholder. But make sure that you assign the appropriate type to new\ncardholders to avoid any potential disruption in service.\n\n## Links\n\n- [Cardholder object](https://docs.stripe.com/api/#issuing_cardholder_object)\n- [Authorized User\nTerms](https://docs.stripe.com/issuing/cards/virtual/issue-cards#accept-authorized-user-terms)\n- [Card programs](https://dashboard.stripe.com/settings/issuing/card-programs)",
  "metadata": {
    "title": "Choose a cardholder type | Stripe Documentation",
    "description": "Learn how to select the best cardholder type for your use case.",
    "sourceURL": "https://docs.stripe.com/issuing/other/choose-cardholder"
  }
}