{
  "content": "# Manage imported data\n\n## Search for and manage existing imported data.\n\nAfter you import data, you can manage it through the\n[Dashboard](https://dashboard.stripe.com/revenue-recognition/data-import).\n\n## CSV imports\n\nAfter you upload a CSV, you can refresh this tab to see the status of the\nimport. To help you identify the import type, a **Transaction** (for general\nimport) or **Exclusion** (for exclusion import) tag appears before each import.\n\nSuccessful imports show the number of lines imported. Click **View\ntransactions** or **View exclusions** to navigate to the list of imported\ntransactions or exclusions. Unsuccessful imports show the errors that occurred\nand each line that the error occurred on.\n\n![Data import CSV import\nlist](https://b.stripecdn.com/docs-statics-srv/assets/data-import-csv-import-list.897afffbbe75c6ae284aab92deb87eb3.png)\n\n## Transactions\n\nFrom the list view, you can see a paginated view of all transactions that you’ve\nimported. For Stripe transactions, we provide a link to the main transaction\npage in the Dashboard.\n\n![Data import transaction\nlist](https://b.stripecdn.com/docs-statics-srv/assets/data-import-transaction-list.c1a3c2b2e2e9238500d5836767260cf7.png)\n\nThe column format follows the CSV format, with the addition of a status column.\nAn **Active** status indicates that the Revenue Recognition reports include the\nimported data. A **Processing** status indicates that our system has recorded\nthe imported data, but revenue recognition reports don’t yet include this data.\n\nTransactions that have been split into multiple components have a caret icon\nthat you can click to reveal the applicable split transactions.\n\n![Data import transaction list with split transactions\nexpanded](https://b.stripecdn.com/docs-statics-srv/assets/data-import-transaction-list-expanded-split-transactions.44a4f3a52c496de09d7b90e27dee887b.png)\n\n### Filtering\n\nThe transaction list supports filtering on all of the dates associated with the\nimported data. Additionally, you can filter on **Source**, **Transaction ID**\nand **Split transaction ID**, but these values must be exact matches.\n\n### Deletion\n\nTo delete a transaction, select its checkbox and click **Delete**. It can take\nup to 24 hours for Revenue Recognition reports to reflect deletions.\n\n## Exclusions\n\nFrom the list view, you can see a paginated view of all excluded transactions\nthat you imported. For transactions other than invoice items, we provide a link\nto the main transaction page in the Dashboard.\n\n![Data import exclusion\nlist](https://b.stripecdn.com/docs-statics-srv/assets/data-import-exclusion-list.601b3ad27aae399df66edfcfc36dfe94.png)\n\nThe column follows the exclusion CSV format, with the addition of a status\ncolumn. An **Active** status indicates that the transaction is excluded from\nyour Revenue Recognition reports. A **Processing** status indicates that our\nsystem has recorded the transaction to be excluded, but Revenue Recognition\nreports don’t yet exclude this data.\n\n### Filtering\n\nThe exclusion list supports filtering on the ID of the excluded transactions on\nexactly matched values.\n\n### Deletion\n\nTo reverse the exclusions, select the transaction checkbox and click **Delete**.\nIt can take up to 24 hours for Revenue Recognition reports to reflect reversals.\n\n## Links\n\n- [Dashboard](https://dashboard.stripe.com/revenue-recognition/data-import)",
  "metadata": {
    "title": "Manage imported data | Stripe Documentation",
    "description": "Search for and manage existing imported data.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/data-import/manage-imported-data"
  }
}