{
  "content": "# Supported uses cases and locations for Stripe Identity\n\n## Learn about the verification use cases and business locations supported by Stripe Identity.\n\nEligibility to use Stripe Identity depends on a combination of your business\nlocation, how you plan to use Stripe Identity, and the type of business you\noperate. Check the following lists to determine if Stripe Identity currently\nsupports your use case and industry in your location.\n\n## Business location\n\nWhile you can [verify identity\ndocuments](https://docs.stripe.com/identity/verification-checks?type=document)\nfrom hundreds of countries across the globe, Stripe Identity is generally\navailable for businesses based in the following countries:\n\nJapanUnited KingdomUnited States\nStripe Identity is also available in self-serve public beta for businesses based\nin the following countries:\n\nAustraliaAustriaBelgiumBulgariaCanadaCroatiaCyprusCzech\nRepublicDenmarkEstoniaFinlandFranceGermanyGreeceHungaryIrelandItalyLatviaLithuaniaLuxembourgMaltaNetherlandsNew\nZealandNorwayPolandPortugalRomaniaSloveniaSpainSwedenSwitzerland\n## Use cases\n\nIf you have any questions about supported and unsupported use cases, please\n[reach out to support](https://support.stripe.com/contact). Our [Services\nTerms](https://stripe.com/ssa#services-terms) describe the purposes for which\nStripe Identity may be used.\n\n### Unsupported use cases\n\nYou may not use Stripe Identity for any of the following purposes:\n\n- Reselling as an independent ID verification service or selling or renting the\ndata you receive from Stripe Identity: Resale, provision, or further\ndistribution of identity verification services or data to third parties. For\nexample, your primary business is selling ID verification to other businesses.\n- Processing Personal Health Information (PHI) by a HIPAA-covered entity:\nVerification or storage of PHI protected by the Health Insurance Portability and\nAccountability Act of 1996 (HIPAA). This only applies for businesses that are\nsharing data covered by the US HIPAA.\n- Eligibility for Credit, Employment, Housing, or Insurance or any “Permissible\nPurpose” under the US Fair Credit Reporting Act (FCRA): Conducting ID\nverification to determine if an individual is eligible for credit, housing,\nemployment, insurance—or other purposes under the FCRA. This only applies to\nbusinesses that are using Identity for an activity that is covered by the US\nFCRA.\n- Government or law enforcement use\n- Verifying anyone considered a minor or who is under the age of 16.\n- Verifying anyone who is linked directly or indirectly with the jurisdictions\nlisted below or that Stripe has deemed high risk, as may be updated from time to\ntime on our [Prohibited and Restricted\nBusiness](https://stripe.com/restricted-businesses) page:- Cuba, Iran, North\nKorea, Syria, and the Crimea, Donetsk, and Luhansk Regions, or persons Stripe\nhas deemed high risk, such as those individuals or entities named to a\nrestricted person or party list of the U.S., United Kingdom, European Union or\nUnited Nations, including the sanctions lists maintained by the U.S. Office of\nForeign Assets Control or the Denied Persons List or Entity List maintained by\nthe U.S. Department of Commerce\n- Russian Federation\n- China\n- As, or in furtherance of, any [Prohibited or Restricted\nBusiness](https://stripe.com/restricted-businesses); provided, however, that for\nthe purpose of using Stripe Identity as a stand-alone service and only in the US\nor UK, the following restricted business categories may use Stripe Identity\nwithout pre-approval:- Financial products and services\n- Non-fiat currency and stored value\n- Pharmaceuticals, medical devices and telemedicine, as long as the data\nprovided to Stripe Identity isn’t subject to the Health Insurance Portability\nand Accountability Act of 1996 (HIPAA)\n- Tobacco\n- Travel\n\n## See also\n\n- [Stripe Identity terms](https://stripe.com/identity/legal)\n\n## Links\n\n- [verify identity\ndocuments](https://docs.stripe.com/identity/verification-checks?type=document)\n- [reach out to support](https://support.stripe.com/contact)\n- [Services Terms](https://stripe.com/ssa#services-terms)\n- [Prohibited and Restricted Business](https://stripe.com/restricted-businesses)\n- [Stripe Identity terms](https://stripe.com/identity/legal)",
  "metadata": {
    "title": "Supported uses cases and locations for Stripe Identity | Stripe Documentation",
    "description": "Learn about the verification use cases and business locations supported by Stripe Identity.",
    "sourceURL": "https://docs.stripe.com/identity/use-cases"
  }
}