{
  "content": "# Enable subscriptions for Adobe Commerce products\n\n## Configure the Stripe Connector for Adobe Commerce to enable subscriptions for any Adobe Commerce product.\n\nYou can turn any\n[virtual](https://experienceleague.adobe.com/docs/commerce-admin/catalog/products/types/product-create-virtual.html?lang=en)\nor\n[simple](https://experienceleague.adobe.com/docs/commerce-admin/catalog/products/types/product-create-simple.html?lang=en)\nAdobe Commerce product into a subscription product from its configuration page\nin your admin panel. When a customer buys a subscription product, the module\nregisters a recurring payment against that order using [Stripe\nBilling](https://stripe.com/billing). Stripe manages this subscription,\nattempting payment collection on a recurring basis based on the subscription\nsettings in Adobe Commerce. Stripe can also notify the customer if the payment\nfails and ask them to update their billing details. You can control this in your\n[Subscriptions and emails\nsettings](https://dashboard.stripe.com/settings/billing/automatic).\n\nOn payment success, your website receives a\n[webhook](https://docs.stripe.com/connectors/adobe-commerce/payments/configuration#webhooks)\nnotification from Stripe. The module automatically creates a new order in your\nAdobe Commerce admin panel for each renewal. These recurring orders don’t\ninclude the initial subscription fees, and the module recalculates the shipping\nand tax amounts for each individual recurring subscription product.\n\n## How to enable and configure subscriptions\n\nYou can enable\n[subscriptions](https://docs.stripe.com/billing/subscriptions/creating) for any\nAdobe Commerce product from the product configuration page. When creating or\nediting a product, scroll down until you see the **Stripe Subscriptions**\nsection:\n\n!\n\nConfiguration options for subscriptions\n\nHere, you have the following options:\n\n- **Subscription Enabled:** Turn this on to convert this product into a\nsubscription and automatically create a subscription plan when customers check\nout with this product. You don’t need to create a subscription plan in your\nStripe account. A subscription plan is automatically created for this product\nwhen your customers check out.\n- **Frequency:** Select **Days**, **Weeks**, **Months**, or **Years**. The\ncustomer sees whatever you select here for the frequency. If you prefer to\ndisplay **30 Days** instead of **1 Month**, set this to **Days** instead. If you\nselect **Days**, the subscription cycle in your Stripe account reflects this.\n- **Repeat Every:** Set the length of the billing cycle based on the specified\nfrequency. For example, a value of 30 here with frequency of **Days** bills\nevery 30 days.\n- **Trial Days:** Enter the number of days before the first charge for the\nsubscription (that is, the number of free days).\n- **Initial Fee:** Enter an amount to charge in addition to the subscription\nprice.\n- **Start on specific date:** Enable to expose custom start date specification\noptions. When customers purchase the subscription, it begins on the specified\ndate instead of starting immediately.\n- **Pick start date:** Specify the start date for the subscription. The format\nis a specific date, but the start date forwards to the next applicable billing\ncycle after the start date has passed. For example, if the start date is\n`01/01/2024`, a monthly subscription always starts on the 1st of the month,\nwhile a 6-month subscription always starts on either January 1st or July 1st.\n- **First payment:** Specify how to collect the first payment when you enable a\nstart date:- Collect it on the specified start date.\n- Collect the first payment when the order is placed, and all subsequent\npayments on the specified start date. This option is useful for physical product\nsubscriptions that ship the first product immediately when ordered, with\nsubsequent shipments conforming to the start date of the billing cycle.\n- **Prorate first payment:** Setting an immediate first payment exposes this\nfield. Enable this setting to account for the number of days from the date of\nthe order placement to the subscription start date so the first payment reflects\nthe shortened cycle before the full subscription begins.\n- **Customers can change subscription:** Enable to allow customers to edit their\nsubscription from the customer account section. They can change the quantity,\ncustomizable options, configurable options or bundle options of each order item.\nThese are additional edit options to the shipping address, shipping method or\npayment method, which customers can always change at any time.\n- **Prorate upgrades:** Enable to apply a fee to account for any price\ndifference when a customer upgrades their subscription between billing cycles.\nDisable to defer the new subscription price until the next billing cycle.\n- **Prorate downgrades:** Enable to credit the customer’s account balance when\nthey downgrade their subscription mid-cycle and apply the credit to future\nsubscription payments. Disable to apply the lower price to the next billing\ncycle.\n\n## Configurable subscriptions\n\nYou can use Magento [configurable\nproducts](https://experienceleague.adobe.com/docs/commerce-admin/catalog/products/types/product-create-configurable.html?lang=en)\nto offer multiple options to your customers for a single product. Customers can\nchoose their preferred option using either a drop-down, a visual swatch, or a\ntext swatch. Each option can be a simple or virtual product and that product can\nitself be a subscription.\n\n!\n\nConfigurable subscription\n\n- Go to **Stores** > **Attributes** > **Product**.\n- Create an\n[attribute](https://experienceleague.adobe.com/docs/commerce-admin/catalog/products/types/product-create-configurable.html?lang=en#step-1%3A-choose-the-attributes)\nand choose your preferred input type and labels.\n- Make sure to set the attribute to be on the **Global** scope.\n- Go to **Stores** > **Attributes** > **Attribute Set** and add the attribute to\nan attribute set.\n- Add the attribute set to your single products.\n- You can now create a configurable product using the single products updated\nabove.\n\n## Bundled subscriptions\n\nAdobe Commerce allows you to [bundle\nproducts](https://experienceleague.adobe.com/docs/commerce-admin/catalog/products/types/product-create-bundle.html?lang=en)\nwhen you want to sell multiple products together. This prevents customers from\nremoving an individual product from the cart before checkout.\n\nWhen a bundle product includes at least one subscription, Stripe treats the\nprice of the entire bundle as the subscription price. For recurring payments,\nStripe collects both the amount of the entire bundle item and the individual\nsubscription item of the bundle.\n\nAfter payment collection, Adobe Commerce automatically creates a recurring order\nthat includes the entire bundle item (the subscription items and regular items\nfrom the original order). Inventory is then processed for the subscription and\nthe other products in the bundle. This contrasts with carts that include\nsubscriptions and regular products separately. In that case, recurring orders\nonly include the subscription product.\n\nIf you want to combine a subscription product with a regular product and only\nbill the subscription product in the next cycle, you can use [grouped\nproducts](https://experienceleague.adobe.com/docs/commerce-admin/catalog/products/types/product-create-grouped.html?lang=en).\nAlternatively, you can configure an initial fee for the subscription when\nthere’s no inventory to process.\n\n## Switch subscription plans\n\nCustomers can change the following from their account:\n\n- Configurable, bundled, simple, and virtual subscriptions\n- Customizable or configurable options\n- Quantities\n- Bundle options\n- Shipping address or method\n- Payment method\n\nCustomers can also switch between two or more plans as long as they belong to\nthe same [configurable\nproduct](https://docs.stripe.com/connectors/adobe-commerce/payments/subscriptions#configurable-subscriptions).\n\n- The customer logs into their account and goes to **My subscriptions**.\n- They select the subscription they want to change and click **Change\nsubscription**.\n- The customer is redirected to the subscription product page, where they can\nchange their plan, quantities, or other product options.\n- When they click **Update cart**, they’re automatically redirected to the\ncheckout page, where they can review the old and new subscription prices.\n- The customer clicks **Update subscription**, which immediately updates the\nsubscription price or plan. The customer is then redirected to **My\nsubscriptions** in their account.\n\n!\n\nConfigurable subscription\n\nYou can enable or disable subscription changes for each subscription product\nseparately or you can use the global setting under **Stores** >\n**Configuration** > **Sales** > **Payment Methods** > **Stripe** >\n**Subscriptions**.\n\n!\n\nConfigurable subscription\n\n## Prorations for virtual subscriptions\n\nThe module supports\n[prorations](https://docs.stripe.com/billing/subscriptions/prorations) for\nvirtual subscriptions. You can enable prorations for upgrades or downgrades\nseparately.\n\n!\n\nConfigurable subscription\n\nThe module compares what both the current and new plan cost for a 30-day period\nto determine whether or not it’s an upgrade or downgrade. If the cost of the new\nplan is lower, we consider it a downgrade. If the price remains the same or if\nit’s higher, we consider it an upgrade.\n\n- For downgrades, we create a refund that we record as a credit memo on the\noriginal order.\n- For upgrades that require an extra payment, we immediately create a new order\nwith the prorated amount for the remainder of the billing period.\n- For upgrades with the same cost, there’s no payment or refund and we add a\ncomment to the original order to indicate that the customer changed their\nsubscription.\n\nIn all three cases, the module creates the renewal order with the new plan at\nthe next billing cycle.\n\n## Changing customer subscriptions in bulk from the command line\n\nYou can increase or reduce the subscription price for a specific product, or\nchange the shipping cost, product name, or tax rates of an order. To do so, you\nmust migrate existing subscriptions from an old plan to a new one using a CLI\ncommand within the Stripe module.\n\n```\nphp bin/magento stripe:subscriptions:migrate-subscription-price\n<original_product_id> <new_product_id> [<starting_order_id> [<ending_order_id>]]\n```\n\nThis creates a new order for `new_product_id` as if the customer placed the\norder during checkout. The billing and shipping details are the same as the\ninitial order, and it uses the same payment method for the subscription.\n\nThe module recalculates the order totals based on the new tax rules, shipping\nmethod, price changes, and so on. If the original order had any discounts, they\nalso apply to the new order. The total doesn’t include any of the initial fees.\n\nSuccessfully placing the order cancels the original order, including the\n`original_product_id`. The module adds a comment to the original order\nmentioning the migration to a new order, and the cancellation of the associated\nsubscription in Stripe. The customer also receives a new order email that tells\nthem their subscription billing details have changed. They can review the new\ntotals in the same email.\n\nIf the module can’t place the order for any reason, the built-in rollback system\ncancels the new order creation and leaves the original order intact.\n\nYou can use the `original_product_id` as the `new_product_id`, which means that\nthe module only recalculates the order totals. It’s possible to migrate from\nsimple subscription products (physical products with a single\n[SKU](https://docs.stripe.com/api/skus)) to virtual subscription products, but\nnot the other way around. This limitation is because physical products require a\nshipping address but virtual products don’t.\n\nThe order ID parameters are optional. If they’re not specified, the script\nprocesses all orders in your website from all store views and all Stripe modes.\nIf you have multiple Stripe accounts configured, the script migrates\nsubscriptions from all Stripe accounts.\n\n## Migrate Stripe Subscriptions from another platform to Adobe Commerce\n\nTo migrate subscriptions from another platform, you need to perform the\nfollowing tasks:\n\n- Create a mapping between your Adobe Commerce customer IDs and the Stripe\ncustomer IDs in the “stripe_customers” database table of Adobe Commerce. You can\ndo this with the following SQL statement in your database:\n\n```\nINSERT INTO stripe_customers(customer_id, stripe_id, customer_email) VALUES\n('2', 'cus_xxxxxxxxxx', 'janedoe@example.com');\n```\n- Create and configure all subscription products for old orders from the\n**Subscriptions by Stripe** tab under each product’s configuration page:\n\n!\n\nSubscription configuration form\n- Migrate the orders from your old platform to Adobe Commerce. If you plan on\ncreating them manually from the Adobe Commerce admin area, you can use the\n**Check / Money Order** payment method so it doesn’t collect a live payment.\nAfter you finish the order migration, you can replace this payment method with\nStripe using the following SQL command:\n\n```\nUPDATE sales_order_payment SET method='stripe_payments' WHERE method='checkmo';\n```\n- After creating the orders and products successfully in Adobe Commerce, update\nthe existing Subscriptions in your Stripe account to set the following metadata:\n\n!\n\nSubscription metadata list\n\n#### Note\n\nSee also how to [create](https://docs.stripe.com/api/subscriptions/create) or\n[update](https://docs.stripe.com/api/subscriptions/update) subscriptions.\n- Test the creation of recurring orders based on subscription renewals:\n- Check that you have at least one configured\n[webhook](https://docs.stripe.com/webhooks) in your Stripe Dashboard under\n**Developers** > **Webhooks**.\n- From your **Stripe Events** section, locate an event that you want to test.\nThe event type must be `invoice.payment_succeeded` and the Invoice must belong\nto a Subscription.\n- From your Magento root directory, trigger the event with the following\ncommand: `bin/magento stripe:webhooks:process-event <event_id>`.\n- Make sure there were no errors in the console and that the module created a\nrecurring subscription order in Adobe Commerce.\n\n## See also\n\n- [Use the Adobe Commerce admin\npanel](https://docs.stripe.com/connectors/adobe-commerce/payments/admin)\n-\n[Troubleshooting](https://docs.stripe.com/connectors/adobe-commerce/payments/troubleshooting)\n\n## Links\n\n-\n[virtual](https://experienceleague.adobe.com/docs/commerce-admin/catalog/products/types/product-create-virtual.html?lang=en)\n-\n[simple](https://experienceleague.adobe.com/docs/commerce-admin/catalog/products/types/product-create-simple.html?lang=en)\n- [Stripe Billing](https://stripe.com/billing)\n- [Subscriptions and emails\nsettings](https://dashboard.stripe.com/settings/billing/automatic)\n-\n[webhook](https://docs.stripe.com/connectors/adobe-commerce/payments/configuration#webhooks)\n- [subscriptions](https://docs.stripe.com/billing/subscriptions/creating)\n- [configurable\nproducts](https://experienceleague.adobe.com/docs/commerce-admin/catalog/products/types/product-create-configurable.html?lang=en)\n-\n[attribute](https://experienceleague.adobe.com/docs/commerce-admin/catalog/products/types/product-create-configurable.html?lang=en#step-1%3A-choose-the-attributes)\n- [bundle\nproducts](https://experienceleague.adobe.com/docs/commerce-admin/catalog/products/types/product-create-bundle.html?lang=en)\n- [grouped\nproducts](https://experienceleague.adobe.com/docs/commerce-admin/catalog/products/types/product-create-grouped.html?lang=en)\n- [prorations](https://docs.stripe.com/billing/subscriptions/prorations)\n- [SKU](https://docs.stripe.com/api/skus)\n- [create](https://docs.stripe.com/api/subscriptions/create)\n- [update](https://docs.stripe.com/api/subscriptions/update)\n- [webhook](https://docs.stripe.com/webhooks)\n- [Use the Adobe Commerce admin\npanel](https://docs.stripe.com/connectors/adobe-commerce/payments/admin)\n-\n[Troubleshooting](https://docs.stripe.com/connectors/adobe-commerce/payments/troubleshooting)",
  "metadata": {
    "title": "Enable subscriptions for Adobe Commerce products | Stripe Documentation",
    "description": "Configure the Stripe Connector for Adobe Commerce to enable subscriptions for any Adobe Commerce product.",
    "sourceURL": "https://docs.stripe.com/connectors/adobe-commerce/payments/subscriptions"
  }
}