{
  "content": "# Order a custom bundle\n\n## Order your custom physical bundle.\n\nAfter reviewing the [manufactured and\npersonalized](https://docs.stripe.com/issuing/cards/choose-bundle#manufacturing-personalization)\noverview, learn the process to make your custom bundle available in the Issuing\nDashboard. Stripe supports you every step of the way when placing a custom\nbundle order. We provide all the necessary input forms and design templates for\neach phase through email and hold live sessions to explain the requirements and\nwork through your design ideas.\n\nOn average, this process can take 12 to 14 weeks before you can start issuing\ncards. This can vary depending on design readiness and complexity. The following\ntable explains what’s required from you during this process:\n\nPhaseEstimated durationWhat’s required from youWhat Stripe doesPhase 1: Intake1\nweek- Reach out to your Account Executive to express your interest in a custom\nphysical bundle. They’ll connect you with Stripe’s Physical Cards team.\n- Fill out the getting started form that we emailed you with your account\ninformation such as company name, primary contact, estimated order size, and any\ninitial design inspirations and mockups you have.\n- Stripe reviews your responses to ensure we have all the information required\nto proceed to the design phase.\nPhase 2: Design1-2 weeks1- Review the [custom bundle\noptions](https://docs.stripe.com/issuing/cards/choose-bundle#custom-bundle-options)\nsection.\n- Fill out the design form we emailed you with your selections.\n- Add your proposed artwork to the Adobe Illustrator template following the\nguidelines in the email.2\n- Schedule a design session with Stripe to finalize your design form and\nartwork.\n- Approve design proof and pricing.\n- Stripe conducts live sessions with your team and an expert card design artist\nto finalize your design and bundle selections. We also ensure you meet network\nand bank requirements.\n- Stripe submits your designs to our partner printers and provides a final proof\nand pricing for your review and approval to proceed to the manufacturing phase.\nPhase 3: Manufacturing8-10 weeks- Stripe handles everything at this stage. We\nnotify you when we have an estimated shipment date for the order.\n- Stripe works with our printing partner to manufacture your design and ship it\nthrough secure transport to the personalization site.\n- Stripe conducts quality checks and performs transaction testing when the\nbundle arrives at the site.\n- Stripe notifies you when the custom bundle is available in the Issuing\nDashboard.\nPhase 4: Go live1-2 days- Go to the **Designs** tab in the Issuing Dashboard to\n[create and name your\ndesign](https://docs.stripe.com/issuing/cards/physical/create-design).\n- [Create a\ncardholder](https://docs.stripe.com/issuing/cards/physical/issue-cards#create-cardholder)\nand a [new\ncard](https://docs.stripe.com/issuing/cards/physical/issue-cards#create-card) in\nthe Issuing Dashboard or API.\n- Select a [shipping\nspeed](https://docs.stripe.com/issuing/cards/physical/ship-cards).\n- Stripe works with the personalization site to print the cardholder details on\nthe bundle and ship your card based on the speed you selected.\n\n1 We might need more time for complex design requests. In some cases, we produce\nprototypes that can take an additional 3 weeks to produce.2 If you aren’t\nfamiliar with Adobe Illustrator, Stripe can review your design and update the\ntemplate.\n\n## Links\n\n- [manufactured and\npersonalized](https://docs.stripe.com/issuing/cards/choose-bundle#manufacturing-personalization)\n- [custom bundle\noptions](https://docs.stripe.com/issuing/cards/choose-bundle#custom-bundle-options)\n- [create and name your\ndesign](https://docs.stripe.com/issuing/cards/physical/create-design)\n- [Create a\ncardholder](https://docs.stripe.com/issuing/cards/physical/issue-cards#create-cardholder)\n- [new\ncard](https://docs.stripe.com/issuing/cards/physical/issue-cards#create-card)\n- [shipping speed](https://docs.stripe.com/issuing/cards/physical/ship-cards)",
  "metadata": {
    "title": "Order a custom bundle | Stripe Documentation",
    "description": "Order your custom physical bundle.",
    "sourceURL": "https://docs.stripe.com/issuing/cards/physical/order-custom-bundle"
  }
}