{
  "content": "# Configure taxes with Stripe and NetSuite\n\n## Learn about options for configuring taxes with Stripe and NetSuite.\n\nYou must configure your payment front end to calculate tax before Stripe\nreceives the transaction and the connector syncs it to NetSuite. You can’t use\nthe NetSuite tax tables to calculate tax through Stripe.\n\nInstead, you have the following options:\n\n- Automatically calculate taxes using [Stripe Tax](https://docs.stripe.com/tax).\n- Create and maintain your own tax rates and apply them to products using\n[Stripe tax rates](https://docs.stripe.com/billing/taxes/tax-rates).\n- Calculate taxes outside of Stripe and record the amount using an [invoice\nitem](https://docs.stripe.com/api/invoiceitems/create) added to the Stripe\ninvoice.\n- Work with a [Stripe partner](https://stripe.partners/) to calculate tax.\n\n## Considerations\n\nConsider the following as you review your tax situation during the onboarding\nprocess for the Stripe Connector for NetSuite:\n\n- **Determine what system is creating the payment**: Determine if the payment is\nfrom an e-commerce shop (such as Shopify or Magento) or an automated\nsubscription generated by Stripe.\n- **Charge tax based on location**: Determine whether you only need to charge a\nflat tax because a customer is in a specific state or providence, or if you need\nto charge tax based on a customer’s exact location.\n- **Determine whether tax is inclusive or exclusive**: Determine whether your\nprice includes tax (inclusive), or if tax is a separate line item on the invoice\nor order (exclusive). Tax is primarily inclusive in the European Union.\n- **Determine how you manage tax remittance**: Determine whether you use\nNetSuite to remit tax, or if you use a third-party tool (such as Avalara).\n- **Determine how you represent taxes in NetSuite**: Determine whether you use\nline-level taxes, header-level taxes, multi-component taxes, or represent taxes\nas a unique liability item.\n\nConsult with a tax advisor who understands your business model to determine your\ntax obligations. Advice or suggestions provided here don’t qualify as official\ntax or legal advice. Information supplied by the Stripe Connector for NetSuite\nis strictly related to the configuration options available in the connector to\nhandle taxes.\n\n## Recommended tax workflows\n\nThe Stripe Connector for NetSuite offers several options for tax workflows,\ndepending on your integration.\n\n### Stripe Billing\n\nIf you use [Stripe Billing](https://docs.stripe.com/billing) or [Stripe\nInvoicing](https://docs.stripe.com/invoicing) and [invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation), we\nrecommend the following:\n\n- Use [Stripe Tax](https://docs.stripe.com/tax) to automatically calculate taxes\nin Stripe.\n- After billing the customer with a Stripe invoice, the connector records the\nStripe-calculated tax amounts to NetSuite.\n- Use NetSuite as a ledger of taxes owed and paid. The connector syncs the data\nfor net taxes owed from Stripe to NetSuite. Don’t use NetSuite for detailed\nreporting on state or local taxes owed.\n- Use [Stripe Tax reports](https://docs.stripe.com/tax/reports) to manage\ndetailed tax reporting and remittance.\n\nLearn how to [set up](https://docs.stripe.com/tax/subscriptions) Stripe Billing\nwith Stripe Tax.\n\n### E-commerce\n\nIf you run an e-commerce store using an application (such as Shopify,\nWooCommerce, or Magento), you can use that app to help with tax calculation. You\ncan then use an app like Celigo or In8 to sync order data to NetSuite. Stripe\nand the connector aren’t involved in the tax calculation process.\n\n### Billing managed in NetSuite\n\nStripe and the connector aren’t involved in the tax calculation or recording\nprocess if you manage your invoicing process in NetSuite. If you use a tax\nsystem other than Stripe Tax or Avalara, you might need to build a custom\nintegration into Stripe. For more details, see the [tax systems that work with\nStripe](https://stripe.partners/?search=tax).\n\n### Payments without a Stripe invoice\n\nIf you create payments without an invoice, then Stripe and the connector can’t\nhelp with recording taxes in NetSuite. Because there’s no line-level detail,\nStripe can’t determine the product purchased, the amount paid for the product,\nor the amount of tax paid.\n\n## Tax representation in NetSuite\n\nRepresent taxes in NetSuite by either:\n\n- Adding to the invoice a line item that posts to a liability account\n*(recommended)*\n- Setting a tax rate on the line-item level of the invoice\n\nYou can find tax settings in the connector app by navigating to **Settings** >\n**Controls** > **Taxes**.\n\nIf you’re an international company, the price might include tax. You can specify\nthe gross amount at the line item level and let NetSuite calculate the correct\ntax owed based on the customer’s address.\n\nIf you use a tax integration bundle in NetSuite, such as AvaTax, you can\nautomatically calculate taxes based on the NetSuite invoice information.\n\n### (Recommended) Taxes as a separate line item\n\nWhen representing taxes in NetSuite, specify the taxes as a separate line item\non the invoice to record the taxes calculated in Stripe. If you use this option,\ntaxes aren’t recorded at the line item or header level of the NetSuite record.\nEven if you use the NetSuite tax engine, you might want to specify taxes as a\nseparate line item. For example, Stripe might have more detailed address data or\nproduct tax codes compared to NetSuite.\n\nIf you use Stripe Tax or Stripe Tax Rates, you can find the tax amount, source,\nand tax percent for each tax rate in the line item’s description.\n\nFor example, if you use Stripe Tax, you see `8.88 of Sales Tax - New York at\n8.875% generated by Stripe Tax`. For multiple tax rates, you see `.38 of Tax -\nSeattle at 3.75%, .65 of Sales Tax - WA at 6.5%`. If you only use Avalara, the\ncalculated tax rate displays and you see `6.00% Tax by Avalara`.\n\n#### Tax reports for recording tax as a NetSuite line item\n\nUse [Stripe tax reporting](https://docs.stripe.com/tax/reports) to see a\nbreakdown of the taxes generated in Stripe. Complete tax reporting isn’t\navailable in NetSuite; however, you can use the tax line item to see the total\namount of taxes paid.\n\n### Taxes represented on every line item\n\nDifferences in features between Stripe and NetSuite might lead to incorrect tax\npercentages. To account for this, the connector matches the total amount of tax\ncalculated on each line in NetSuite with the total amount of taxes on each line\nin Stripe.\n\n#### Multiple tax rates on a line item\n\nWhile NetSuite only supports two tax rates, Stripe supports multiple tax rates\non a line item. To account for this difference, the connector combines the tax\nrates from Stripe into a single percentage that’s set on the `tax_rate1`\nproperty for each NetSuite line item. In most cases, you can add all of the tax\nrates to generate the total tax rate.\n\nIn rare cases, adding the tax rates won’t generate the combined tax rate.\nInstead, you can calculate the tax rates based on the total tax amount. To\nproduce the total tax amount for the line, you can apply each tax rate to the\npre-tax amount. The total tax amount from a summed percentage might differ from\nthe total tax amount from separate tax percentages. This is because of\ncompounding rounded tax amounts when the tax rates are separate.\n\nFor example, a line item has a value of 1.00 USD and tax rates of 9.5% and 9.6%.\nBoth tax rates generate a tax amount of 0.10 USD, totaling 0.020 USD of tax for\nthe line. Adding the tax rates results in a total tax rate of 19.1%, which\ngenerates 0.19 USD of tax instead of the total 0.020 USD. The connector matches\nthe tax amounts on each line in NetSuite with the line amounts in Stripe. For\nthis example, the connector calculates a tax rate of 20% so that a total tax of\n0.020 USD generates on the line in NetSuite.\n\n#### Tax on credit note line items\n\nYou can’t use credit note automation if you represent taxes as line items in\nNetSuite. Because NetSuite has limitations that prevent setting the tax rate on\ncredit memo line items, you can use Taxes as a separate line item instead.\n\n### Tax rates with discounts on line items\n\nThe connector uses the tax rate to calculate the proper tax amount for any items\nwith a discount applied. The invoice that the connector creates in NetSuite\nincludes separate line items for the original prices (pre-discounted) and the\ntotal discounts.\n\nFor example, say you have a line item on your invoice with the following\namounts:\n\nPriceDiscountPost-discounted price100 USD20 USD80 USD\nThe tax rate is 10% and applies to the post-discounted amount of 80 USD. This\nresults in a tax amount of 8 USD.\n\nThe connector generates an 8% tax rate in NetSuite for the line item, based on\nthe pre-discounted amount of 100 USD and tax amount of 8 USD. This differs from\nthe tax percentage used in Stripe.\n\n### Inclusive line-level tax\n\nIf your company is based in the European Union, the amount shown to customers\nmost likely includes tax. In NetSuite, the amount charged to the customer\nappears in the gross amount transaction column. NetSuite calculates tax through\neither the NetSuite tax engine or the Avalara NetSuite integration.\n\n## Integrate a custom tax system with Stripe Billing\n\nYou can also calculate taxes using a custom system. If you do, complete the\nfollowing for the connector to correctly categorize the tax line item:\n\n- Use a standalone Stripe invoice item for the exact tax amount.\n- Add a `netsuite_tax` metadata key that’s set to `true`.\n\n## See also\n\n- [Calculate tax with\nAvalara](https://docs.stripe.com/connectors/netsuite/avalara-connector)\n\n## Links\n\n- [Stripe Tax](https://docs.stripe.com/tax)\n- [Stripe tax rates](https://docs.stripe.com/billing/taxes/tax-rates)\n- [invoice item](https://docs.stripe.com/api/invoiceitems/create)\n- [Stripe partner](https://stripe.partners/)\n- [Stripe Billing](https://docs.stripe.com/billing)\n- [Stripe Invoicing](https://docs.stripe.com/invoicing)\n- [invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation)\n- [Stripe Tax reports](https://docs.stripe.com/tax/reports)\n- [set up](https://docs.stripe.com/tax/subscriptions)\n- [tax systems that work with Stripe](https://stripe.partners/?search=tax)\n- [Calculate tax with\nAvalara](https://docs.stripe.com/connectors/netsuite/avalara-connector)",
  "metadata": {
    "title": "Configure taxes with Stripe and NetSuite | Stripe Documentation",
    "description": "Learn about options for configuring taxes with Stripe and NetSuite.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/configure-taxes"
  }
}