{
  "content": "# Capital metricsPrivate preview\n\n## Access financing offer data in the Stripe Dashboard.\n\nThe [Capital Dashboard](https://dashboard.stripe.com/connect/capital) helps you\nunderstand the performance of your Capital program. The Dashboard contains key\nmetrics for originations, conversion, and connected account engagement with\nfinancing offers being delivered, and ways to see the details and state of these\noffers.\n\nThese metrics refresh nightly and include:\n\n- Topline metrics for pending offers, active offers, in-progress financings and\nfully repaid financings where pending offers denote accounts that have potential\noffers, but the offers haven’t been created yet\n#### Note\n\nThese offers might not be able to be created if the user is deny-listed or has\nunsubscribed from offers, or if we don’t have a valid email address for the\naccount.\n- Monthly charts with the amount of loans originated, and loan balances repaid\n- A daily chart with all time adoption\n- A daily chart with 30-day conversion\n- A daily chart with the rolling weekly average number of users who are eligible\nfor Capital including an export option that allows you to download a CSV of\nusers who are eligible for Capital today\n- A daily chart with the rolling weekly average loan size\n\nIn the **Financing offers** table, you can view the status of the different\nfinancing offers and active loans.\n\nStatusDefinitionUndeliveredThe financing offer has been created but hasn’t been\nmarketed to the connected account.DeliveredThe financing offer has been\ndelivered to the connected account, either by you or by Stripe.AcceptedAn\napplication for the offer has been submitted and is pending review by Stripe\nServicing.Paid outThe application has passed review and the accepted financing\nhas been disbursed.RejectedThe application didn’t pass review and has been\nrejected by Stripe Servicing.CanceledThe application has been canceled.Fully\nrepaidThe financing has been fully paid down.ExpiredThe 30-day period has passed\nfor the connected account to apply for and accept the offer. When the offer is\nexpired, it’s inaccessible to the user.\n## Financing offer details\n\nView a financing offer from the table to get the following information:\n\n- Offered and accepted financing details including terms such as fee and\nwithholding rate\n- Offer creation date\n- Remaining balance\n- Engagement events for the offer if Stripe delivered the offer email\n- Paydown activity\n\nTo improve navigation, you can also copy the connected account’s account ID and\nfinancing offer ID, which you can use to filter or search.\n\n## Download data\n\nFrom the financing offer table, you can export the table’s data as a CSV file.\nClick **Export** and select the time zone, date range, and columns you want to\nexport. If any filters are applied to the financing offer table, these filters\nwill apply to the resulting data export.\n\n## Capital Data in Sigma\n\nSigma makes all your transactional data available in an interactive SQL\nenvironment in the Stripe Dashboard. You can find Capital data in three tables\nwithin Sigma:\n\nTable nameTable contentsfinancing_offersThis table contains all information\nabout the financing offers we have created for merchants on your platform, such\nas an offered principal or premium, and the terms for offers that have been\naccepted.financing_balancesThis table contains daily balance snapshots for each\npaid out loan for connected accounts on your platform. Starting from payout to\nbeing fully paid down, each loan has a daily balance snapshot in the table. You\ncan see these broken down by the remaining principal and\npremium.connected_account_financing_transactionsThis table contains all\nfinancing transactions, such as payouts, paydowns, and reversals, for all\nCapital loans for connected accounts on your platform. This information mirrors\nwhat’s available in the Financing Transactions API.\nFor detailed documentation on how to use Sigma for Capital data, refer to\n[Financing\noffers](https://dashboard.stripe.com/stripe-schema?tableName=financing_offers)\nin the Stripe Data Schema.\n\n## Revshare\n\nCapital revshare is calculated per financing and paid out on a monthly cadence\nat the start of the month. It’s categorized as a Stripe fee.\n\nYou can check your Capital revshare in two places in the Dashboard:\n\n- The **All activity** section of the [Balances\npage](https://dashboard.stripe.com/balance). Use the Dashboard filter **Type:\nStripe fees** to identify the line item with a description that matches\n**Revenue Share: Capital**.\n- The [Balance Report](https://dashboard.stripe.com/reports/balance). Navigate\nto the **Balance change from activity** section and download the file for\n**Additional Stripe fees** to identify transactions with a description that\nmatches **Revenue Share: Capital**.\n\n## Links\n\n- [Capital Dashboard](https://dashboard.stripe.com/connect/capital)\n- [Financing\noffers](https://dashboard.stripe.com/stripe-schema?tableName=financing_offers)\n- [Balances page](https://dashboard.stripe.com/balance)\n- [Balance Report](https://dashboard.stripe.com/reports/balance)",
  "metadata": {
    "title": "Capital metrics | Stripe Documentation",
    "description": "Access financing offer data in the Stripe Dashboard.",
    "sourceURL": "https://docs.stripe.com/capital/reporting"
  }
}