{
  "content": "# Stripe for SAP Digital Payments Add-on v2\n\n## Learn how to add Stripe payment capabilities to SAP Digital Payment Add-on (DPA).\n\nThe Certified Stripe adapter for SAP Digital Payments Add-on integrates with\nStripe, delivering a wide range of payment features for both SAP and Stripe\nusers.\n\n- Works on SAP S/4 HANA Private or Public cloud with no additional\nconfiguration.\n- The app enables a variety of payment card services and integrates various\nexternal payment methods, including digital wallets such as Apple Pay and Google\nPay, local payment methods such as iDeal and Bancontact, and buy now, pay later\noptions.\n- The app simplifies automatic bank reconciliation, which eliminates the need to\ndo it manually.\n\n## Customer benefits\n\nThe Stripe adapter for the SAP DPA app Connector enhances the functionality of\nthe SAP Digital Payment Add-On, and addresses a range of user needs for\nbusinesses that use SAP S/4HANA. Some of the key use-cases for SAP DPA include:\n\n- **Online sales**: The SAP DPA eases the process for orders made through\ne-commerce platforms or directly through an ERP, which is common in B2B\ntransactions. It automates the entire payment flow from authorization and\ncapture of payments, to reconciling them.\n- **Managing payment methods**: DPA provides an option to store default payment\nmethods for SAP business partners, which creates seamless transactions that can\nbe initiated and completed without requiring any customer action.\n- **Accounts receivable**: For orders that are managed outside of SAP, DPA\noffers a support system that reconciles external payments with SAP Accounting.\n- **Automated Fulfillment**: When payments are authorized outside of SAP in\ne-commerce transactions, a customer portal, or a terminal device, DPA acts as a\nlink between the fulfillment from SAP and capture of the payment, which ensures\nthat customers are charged correctly for their purchase.\n\n## Supported payment methods\n\nThe SAP DPA is built to use Stripe [payment\nelements](https://docs.stripe.com/payments/payment-element), and it supports 40+\npayment methods.\n\n## External payments processes\n\nThe SAP DPA supports “external payments.” External payments are payments made\nusing external channels, or bank debits or redirects, rather than payment cards.\n\nYou can implement external payments in two ways. You can use a one-step process\n(known as “direct capture”) where the payment is charged directly to the payer’s\naccount without any prior authorization. You can also use a two-step process\n(known as “manual capture” or “separate authorization and capture”) where the\npayment is first authorized against the payer’s account before being charged.\n\nThe Stripe V2 connector supports the following business processes:\n\n- External payment direct capture\n- External payment separate authorization and capture\n- External payment authorization\n- External payment settlement\n- External payment refund\n- Digital payment advice\n- External payment authorization preparation\n- External payment direct capture preparation\n\n## Connector pricing\n\nThe connector is free. New Stripe users must create a Stripe account separately\nfrom the extension installation. There are no setup, monthly, or other fees.\n\n#### Note\n\nCharges from SAP apply for the usage of the SAP DPA.\n\n## See also\n\n-\n[Installation](https://docs.stripe.com/connectors/sap-digital-payments/installation)\n\n## Links\n\n- [payment elements](https://docs.stripe.com/payments/payment-element)\n-\n[Installation](https://docs.stripe.com/connectors/sap-digital-payments/installation)",
  "metadata": {
    "title": "Stripe for SAP Digital Payments Add-on v2 | Stripe Documentation",
    "description": "Learn how to add Stripe payment capabilities to SAP Digital Payment Add-on (DPA).",
    "sourceURL": "https://docs.stripe.com/connectors/sap-digital-payments"
  }
}