{
  "content": "# 1099 Tax Reporting Express Dashboard walkthrough\n\n## Learn how to manage 1099 tax forms for connected accounts that use the Express Dashboard.\n\nThe images in this section describe an example of the product flow that\nconnected accounts can encounter when using the Express Dashboard. We provide\nthese images to help give you and your support teams an idea of the overall user\nexperience. If you have any questions, contact Stripe Support.\n\n[The Stripe Express\nDashboard](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough#express-dashboard)\nFor your connected accounts not using Connect embedded components, enabling\ne-delivery for tax year 2024 gives them access to the Stripe Express Tax Forms\npage. That page is a prebuilt web and mobile dashboard for managing their tax\ninformation and receiving their 1099s electronically.\n\nAs you configure your [tax form\nsettings](https://dashboard.stripe.com/settings/connect/tax_forms), you can also\nchoose to have Stripe send pre-filing confirmation emails to collect tax\ninformation and paperless delivery consent directly from your connected\naccounts. We’ll email your eligible connected accounts starting the week of\nNovember 4.\n\n![Stripe Express dashboard for connected account\ntaxes](https://b.stripecdn.com/docs-statics-srv/assets/stripe-express-tax-dashboard-2023.4fc699b9b7f560443aacd25b89d14a59.png)\n\nThe Stripe Express Dashboard where payees can grant e-delivery consent, download\ntheir 1099 tax forms, and update their tax information.\n\n![Stripe Express dashboard for connected\naccounts](https://b.stripecdn.com/docs-statics-srv/assets/stripe-express-dashboard.75de9515d0222275afb3c67a4d6117c4.png)\n\nConnected accounts can also use the Express Dashboard to view their available\nbalance, see upcoming payouts, and track their earnings in real time.\n\n#### Note\n\nTo prevent accounts that don’t normally access the Express Dashboard from using\nit, or if you don’t want Stripe to email your connected accounts, select postal\ndelivery and disable electronic delivery in your [tax form\nsettings](https://dashboard.stripe.com/settings/connect/tax_forms).\n\n[Your connected account receives an email from\nStripe](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough#receive-email)\nYour connected account receives an email from Stripe asking them to confirm\ntheir tax information and update their delivery preferences. The subject line\nreads ‘Get your [Platform_Name] 2024 tax forms faster by enabling e-delivery.’\nThe following image displays the content of the email.\n\n![Stripe Express Tax form email from\nStripe.](https://b.stripecdn.com/docs-statics-srv/assets/tax-reporting-prever-email-2024.3a2bddb9602387c7cf916aa9b9829a45.png)\n\nPre-filing confirmation email from Stripe\n\n[Connected Accounts are prompted to claim their account on Stripe\nExpress](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough#verify-info)\nFor connected accounts without existing access to the Express Dashboard,\nclicking the **Get Started** button in Stripe’s email takes them to this screen.\n\nFor connected accounts that can access the Express Dashboard but aren’t logged\nin, the button opens a login screen. Authenticated accounts with Express\nDashboard access proceed directly to the next step.\n\n![The Stripe Express page to create an\naccount.](https://b.stripecdn.com/docs-statics-srv/assets/tax-create-stripe-express-account.7bfe7be3830ecb6ca313cadfa256e758.png)\n\nThe Stripe Express page to create an account\n\n[Connected account owners with existing accounts are presented with phone number\nverification](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough#two-factor)\nThis screen requests a code sent to the phone number associated with the\nconnected account.\n\n![Stripe Express account two-factor authentication\ndialog.](https://b.stripecdn.com/docs-statics-srv/assets/tax-verify-phone.a6b5b1e2455c322950902d1355324d4d.png)\n\nThe Stripe Express account phone number verification dialog.\n\n[After passing phone number verification, accounts new to Express are asked to\nverify their\nidentity](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough#verify-identity)\nThis step applies only to connected accounts that claimed Express Dashboard\naccess in the earlier step and haven’t onboarded to Stripe Express. Other\naccounts proceed to the next step.\n\nStripe provides the connected account with prompts to verify their identity by\nproviding details matching their account information. If, after a few attempts,\nthey’re unable to enter matching details, we prompt them to confirm their\ndetails with you, the platform. The error message reads “One of the fields\ndidn’t match the information we received from [Platform_Name]. You can try\nagain, or check that your information with [Platform_Name] is up to date.”\n\n![Stripe Express account Verify your identity\ndialog](https://b.stripecdn.com/docs-statics-srv/assets/tax-verify-identity.7f5df7551dfbb1801cdde12ed9c0dd36.png)\n\nThe Stripe Express account **Verify your identity** dialog.\n\n[After verifying their identity, connected accounts are taken to the Tax forms\npage of Stripe\nExpress](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough#tax-forms-page)\nAfter the connected account’s details are verified, they’re taken to the **Tax\nforms** page in Stripe Express where they can confirm their tax information they\nhave on file for their account and agree to paperless delivery of their 1099 tax\nform.\n\n![The Tax forms page of the Express\nDashboard](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-page.0430a010ebfa14b6c8914a90376e7a49.png)\n\nThe Tax forms page of the Express Dashboard.\n\nThey’re prompted to confirm tax information but can choose to skip temporarily\nif they want to leave their information as is. Your accounts could get blocked\nif you’ve applied 1099 capabilities and the connected account updates their\nvalue to a name and TIN combination that doesn’t match against IRS records. If\nthe connected account is verified and then changes their name or TIN, they’re\nasked to re-sign a new Stripe Terms Of Service Agreement. Similarly, if Stripe\nis unable to complete KYC requirements on them based on the information they\nprovided, their account payouts are blocked until they log back in to Stripe\nExpress and correct their information.\n\n![The dialog displayed to connected accounts to confirm their\ninformation.](https://b.stripecdn.com/docs-statics-srv/assets/tax-confirm-information.1801e85e31759f80b4e3ffd7fe974778.png)\n\nThe dialog displayed to users to confirm their information.\n\n[Connected account owners agree to paperless\ndelivery](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough#for-delivery)\nAfter the tax information is confirmed, Stripe prompts the connected account to\nagree to paperless delivery.\n\n![The dialog to consent to paperless delivery of tax\nforms](https://b.stripecdn.com/docs-statics-srv/assets/tax-consent-edelivery.603807401bba412dd0c3bc383d5abd52.png)\n\nThe dialog to consent to paperless delivery of tax forms.\n\nIf you’ve enabled optional postal delivery, after agreeing to paperless delivery\nconsent, your connected accounts can choose to request a paper copy in addition\nto the e-delivery of the tax form.\n\n![The dialog to optionally request a paper copy of tax\nforms](https://b.stripecdn.com/docs-statics-srv/assets/stripe-express-tax-postal-delivery-option.9fe97c25a15822fbe4713b2c281ec96a.png)\n\n[Your connected account receives an email from\nStripe](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough#email-from-stripe)\nAfter filing 1099 tax forms in your Stripe dashboard, your connected account\nreceives an email from Stripe to view their tax form electronically. The subject\nline reads ‘Your [Platform_Name] 1099 tax form is ready.’ The following image\ndisplays the content of the email.\n\n![The 1099 electronic delivery email to\nusers](https://b.stripecdn.com/docs-statics-srv/assets/tax-reporting-edelivery-email-2024.8e2ee57ace01f94b25d9d97068a0f8e1.png)\n\n[Connected account owners can download their tax\nforms](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough#display-tax-forms-page)\nAfter a connected account agrees to the e-delivery terms, they can download\ntheir form when your platform makes it available.\n\n![Stripe Express dashboard where payees can download their 1099 tax\nforms](https://b.stripecdn.com/docs-statics-srv/assets/stripe-express-tax-dashboard.78c8723a939c34a01e17ae807ffa31d2.png)\n\nThe dashboard where payees can download their 1099 tax forms.\n\nMost connected account owners are prompted to enter the last four digits of the\nTIN on their 1099 tax form before being able to download a copy of the form.\nDownloads aren’t available for 24 hours after an update has been made to any\npersonal identity information including name, address, business type, or TIN.\n\n![The dialog to verify your SSN information to securely access tax\nforms.](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-secure-access.5d000d31ccbd402d50cb3a2731dce4f2.png)\n\n#### Caution\n\nConnected accounts that do not agree to paperless delivery are unable to\ndownload their 1099 tax forms and resolve the call to action in their dashboard.\nTurn on paper delivery in your Stripe [Tax form\nsettings](https://dashboard.stripe.com/settings/connect/tax_forms) to make sure\nthat recipients who don’t consent to e-delivery still receive paper forms.\n\n## Links\n\n- [tax form settings](https://dashboard.stripe.com/settings/connect/tax_forms)",
  "metadata": {
    "title": "1099 Tax Reporting Express Dashboard walkthrough | Stripe Documentation",
    "description": "Learn how to manage 1099 tax forms for connected accounts that use the Express Dashboard.",
    "sourceURL": "https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough"
  }
}