{
  "content": "# Calculate tax with Avalara\n\n## Learn how the Stripe Connector for NetSuite supports the Avalara AvaTax Connector for Stripe Invoicing to calculate tax.\n\nThe Stripe Connector for NetSuite supports using the [Avalara\nAvaTax](https://marketplace.stripe.com/apps/avalara-avatax) connector to\ncalculate tax with Avalara on Stripe invoices. The NetSuite connector syncs\nthese invoices to NetSuite and records the calculated tax.\n\n## How it works\n\nThe Avalara AvaTax connector calculates the tax and then adds it to the Stripe\ninvoice as a standalone invoice item. Stripe invoices must remain open for a\nperiod of time for Avalara to apply the calculated tax amount. The tax amount\nappears as an additional line item (or Stripe [Invoice\nItem](https://docs.stripe.com/api/invoiceitems)) labeled `Sales Tax`.\n\nTo use this functionality, enable the `pay_immediately` parameter on your\naccount. Tax calculation then occurs automatically after the first billing\ncycle. You can also calculate tax with just a postal code. Consult your tax\nprofessional about the best approach for your business.\n\n#### Warning\n\nAvalara has limited support for the Avalara Connector for Stripe Invoicing and\nuse of this connector with the Stripe Connector for NetSuite is at your own\nrisk.\n\n## Set up Avalara\n\nYou must have an Avalara test environment to fully test the Stripe Connector for\nNetSuite with Avalara. Stripe live mode and test mode transactions can’t process\nat the same time.\n\nConfigure the Avalara environment to match your Stripe test account:\n\n- For **Tax On Invoices**, select **Recurring** and **Normal**.\n- Set up the item mapping to determine the Stripe items for Avalara to tax.\n\nWhen you successfully integrate Avalara with Stripe, address information gets\nadded on Stripe customer metadata fields that are specific to Avalara. When\nStripe initiates a subscription, we make sure tax gets added to a payment by\nusing the `pay_immediately: false` parameter to delay immediate payment. When\nStripe generates an invoice for the next subscription billing period, an Avalara\nline item gets added automatically to the Stripe invoice.\n\n### Webhook setup\n\nAvalara doesn’t automatically receive webhooks from your Stripe account. You\nmust manually add the Avalara webhook URL to each environment that you want to\ntest Avalara. To do so, copy the Avalara webhook endpoint from the AvaTax setup\nand add it to the Stripe webhooks admin (**API** > **Webhooks**).\n\nTo process test webhooks, connect to Avalara’s sandbox system through the\n[AvaTax for Stripe](https://avataxforstripe.com/) dashboard. You can only\nconnect to one Avalara environment at a time. Learn about how to use [Avalara\nAvaTax](https://knowledge.avalara.com/bundle/wgx1671615018330_wgx1671615018330/page/ale1671617118294.html)\nfor tax calculation.\n\n## AvaTax tax code\n\nIf you use a tax engine in NetSuite, it likely calculates and records taxes due\non any invoices created in NetSuite. If you use Stripe Billing invoices, Avalara\ncalculates and records the tax amount before the invoice syncs to NetSuite. To\nmake sure that Avalara doesn’t calculate taxes in NetSuite, the connector sets\nthe tax code on the invoice and line item level to `Not Taxable`.\n\nIf a Stripe price links to a NetSuite item that has an AvaTax tax code, the\nAvalara tax system overrides the Stripe Connector defaults and calculates the\ntax twice. Make sure that all NetSuite items linked to Stripe prices don’t have\nan AvaTax tax code.\n\n## Tax representation in NetSuite\n\nStripe represents the taxes calculated by Avalara as a Stripe Tax line item on\nthe NetSuite invoice. You can rename the line item, edit the liability account,\nor edit other aspects of the item. Customize the name and account to align with\nhow you manage taxes in NetSuite.\n\nIf you use Avalara outside of the NetSuite environment to calculate tax, you\ncan’t use the `Avatax` sales tax item to represent tax in NetSuite. This special\ntax item triggers a call to Avalara that records the taxes for that order again.\nTaxes calculated by Avalara outside of NetSuite aren’t represented by tax codes\nor groups.\n\n## Avalara race condition\n\nThe Avalara Connector has a race condition to consider. If you use the\n`invoice.created` webhook, Avalara might calculate taxes after you add\nusage-based billing through Stripe standalone invoice items. This means tax\nmight not calculate and record properly.\n\n## Links\n\n- [Avalara AvaTax](https://marketplace.stripe.com/apps/avalara-avatax)\n- [Invoice Item](https://docs.stripe.com/api/invoiceitems)\n- [AvaTax for Stripe](https://avataxforstripe.com)\n- [Avalara\nAvaTax](https://knowledge.avalara.com/bundle/wgx1671615018330_wgx1671615018330/page/ale1671617118294.html)",
  "metadata": {
    "title": "Calculate tax with Avalara | Stripe Documentation",
    "description": "Learn how the Stripe Connector for NetSuite supports the Avalara AvaTax Connector for Stripe Invoicing to calculate tax.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/avalara-connector"
  }
}