{
  "content": "# Common types of online fraud\n\n## Learn about the different kinds of fraud and what your liability is.\n\nA payment is considered fraudulent when the cardholder didn’t authorize it. Most\nfraudulent payments are made using stolen cards or card numbers. When a\ncardholder is notified that the payment has been made or they review their card\nstatement, they contact their card issuer to dispute it.\n\nOnline fraud is fundamentally different to fraud that occurs at brick-and-mortar\nbusinesses as it’s harder to be certain that the person you’re selling to is who\nthey say they’re. Some fraudulent actors adopt more sophisticated methods than\njust trying to make purchases on a stolen card. When accepting payments online,\nit’s important to be aware of the different kinds of fraud and what your\nliability is.\n\n## Suspected fraud\n\nStripe’s machine learning system continuously monitors all payments processed by\nour users. In rare cases, you might receive a notification from Stripe that we\nsuspect a payment is fraudulent after the card issuer authorizes it. This can\noccur if we detect subsequent activity on the card that now suggests it’s being\nused fraudulently.\n\nAlthough we notify you as soon as we become aware of any suspicious activity, it\nmight be several days after a payment is made. Keep in mind that this prediction\nisn’t a guarantee that a payment is fraudulent—only that we have reason to\nbelieve it is.\n\nWe provide this information to you to make sure that you can make an informed\ndecision and take action where necessary (for example, contact the customer or\nplace their order on hold). If you have any concerns about the payment after\nreviewing it, consider [refunding it\nimmediately](https://docs.stripe.com/disputes/prevention/best-practices#consider-proactively-refunding-suspicious-payments)\nto proactively prevent a dispute and avoid a dispute fee.\n\n#### Caution\n\nWhile a customer can’t dispute fully refunded payments, they can dispute\npartially refunded payments. Card network rules even allow for a payment that\nwas partially refunded to be disputed for the full payment amount.\n\n## Stolen cards\n\nThis type of fraud makes use of stolen credit or card details to make a purchase\nonline. The fraudulent actor might be in possession of a physical card, but it’s\nmore likely that the cardholder’s details were stolen electronically. A business\nships goods or provides service to the fraudulent actor, with the assumption\nthat the payment is legitimate.\n\nIf a cardholder hasn’t realized yet that their card is lost or stolen (and so\nhasn’t notified the card issuer), you can still process payments successfully.\nEven if a payment isn’t declined, this doesn’t mean that it was authorized.\n\nAfter the cardholder discovers the fraudulent use of their card, they dispute\nthe payment with the card issuer. If the dispute is resolved in favor of the\ncardholder, the business suffers a loss equal to the amount of the payment, and\nthe cost of any goods or services already provided. The business is also subject\nto a dispute fee.\n\n### Overpayment fraud\n\nOverpayment fraud (also known as a [payout](https://docs.stripe.com/payouts)\nscam) is a variant of stolen card fraud. The fraudulent actor presents\nthemselves as requiring the services of a third-party service in connection with\nthe purchase. The fraudulent actor then offers to pay the seller the cost of the\ngoods, an extra sum for the fraudulent third-party, and often an additional\nconvenience (tip) for accommodating the request. The fraud being committed here\nis that the third-party service doesn’t exist—the fraudulent actor has taken the\nadditional funds while the seller is left with a dispute.\n\nFor example, an online antique business may be approached by a fraudulent actor\nclaiming to live overseas. They request that the business use their preferred\nfreight company, who they ask the business to make payment to. Using stolen card\ninformation, the fraudulent actor pays the business for the goods and fake\nfreight fee, and includes a gratuity for the seller as an incentive.\n\nThe business complies and pays the fee to this fake freight company but no\nshipment ever occurs because there is no legitimate shipper. The actual\ncardholder discovers the unauthorized payment and disputes it with their card\nissuer. The payment is automatically refunded and a dispute fee deducted, even\nthough they’ve already paid out funds separately to a fraudulent third-party.\n\n## Card testing\n\nThis is the practice of testing a card (or multiple cards) on one site to see if\nit’s still valid before using it on another site to make a fraudulent payment.\nSites with free text fields, such as donation sites and “pay what you like”\ne-commerce businesses, are predominately the targets of card testing.\nImplementing [CAPTCHA](http://captcha.net/) or rate-limiting charges can help\ncombat this type of fraud. To learn more see, [Protect yourself from card\ntesting](https://docs.stripe.com/disputes/prevention/card-testing).\n\n## Alternative refunds\n\nIn this form of fraud, the fraudulent actor deliberately pays more than was\nrequired, then contacts the business, and claims they accidentally entered the\nwrong amount. The fraudulent actor requests a partial refund to rectify this,\nbut claims they have closed the card that was used and would like a refund sent\nusing an alternative method that’s outside of the card network (for example,\ncheck or wire transfer).\n\nFor example, a fraudulent actor donates 500 USD to a charity and contacts them\nshortly after to say that it should have been a 50 USD donation. The fraudulent\nactor asks for the return of 450 USD using a different method, so no refund is\nmade back to the original card. When the legitimate cardholder disputes the\nfraudulent payment, the charity isn’t only responsible for the disputed amount,\nthey have also lost the amount sent using the alternative method.\n\nNever refund payments using a different method than the one originally used. If\na card has legitimately been closed, you can still perform a refund. The\ncustomer should then contact that card issuer to arrange the funds to be\nretrieved.\n\n## Marketplace fraud\n\nIf you run a marketplace business (such as a\n[Connect](https://docs.stripe.com/connect) platform) where your users are\nresponsible for providing service to your customers, this type of fraud occurs\nwhen a fraudulent business takes payments without providing the services or\ngoods to customers.\n\nFor example, a marketplace that connects buyers and sellers can run the risk of\na seller taking payment from the buyer and not sending the goods. In such cases,\nif the funds can’t be recovered from the seller,\n[responsibility](https://docs.stripe.com/connect/account-balances#accounting-for-negative-balances)\nfor the disputed amount and fee is ultimately on the platform.\n\n## Friendly fraud\n\nFriendly fraud—also known as “first-party misuse” or “first-party fraud”—occurs\nwhen a legitimate cardholder makes a purchase, but then disputes it at a later\ndate. This can either be accidental, because they didn’t recognize the\ntransaction on their statement, or deliberate (for example, due to buyer’s\nremorse or as an attempt to fraudulently obtain merchandise without paying).\n\nIt can be difficult to know whether friendly fraud has occurred, especially in\ndigital sales. For those selling physical goods, shipping to a verified billing\naddress and requiring signature on delivery can help combat this. In addition,\nhaving clear return policies prominently displayed at checkout to which the\ncustomer must agree prior to making a purchase can also help.\n\n[Visa Compelling Evidence\n3.0](https://docs.stripe.com/disputes/categories#visa-ce-30) established new\nrules to challenge friendly fraud by showing previous non-fraud transactions\nwith the same cardholder within a specified period. Stripe supports Visa CE 3.0\nby identifying qualifying transactions in your history on our platform to\ndetermine eligibility for evidence submission under the Visa CE 3.0 rules. We\nthen pre-populate the dispute response with most of the required evidence you\nneed to significantly increase your likelihood of overturning the dispute in\nyour favor. You can also self select previous non-fraud transactions and submit\nthem to Visa as CE 3.0 using the [Stripe\nAPI](https://docs.stripe.com/disputes/api/visa-ce3).\n\n## See also\n\n- [Verification\nchecks](https://docs.stripe.com/disputes/prevention/verification)\n- [Best practices for preventing\nfraud](https://docs.stripe.com/disputes/prevention/best-practices)\n- [Identifying\nfraud](https://docs.stripe.com/disputes/prevention/identifying-fraud)\n- [Using Radar with Connect](https://docs.stripe.com/connect/radar)\n\n## Links\n\n- [early fraud\nwarning](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\n- [refunding it\nimmediately](https://docs.stripe.com/disputes/prevention/best-practices#consider-proactively-refunding-suspicious-payments)\n- [payout](https://docs.stripe.com/payouts)\n- [CAPTCHA](http://captcha.net/)\n- [Protect yourself from card\ntesting](https://docs.stripe.com/disputes/prevention/card-testing)\n- [Connect](https://docs.stripe.com/connect)\n-\n[responsibility](https://docs.stripe.com/connect/account-balances#accounting-for-negative-balances)\n- [Visa Compelling Evidence\n3.0](https://docs.stripe.com/disputes/categories#visa-ce-30)\n- [Stripe API](https://docs.stripe.com/disputes/api/visa-ce3)\n- [Verification\nchecks](https://docs.stripe.com/disputes/prevention/verification)\n- [Best practices for preventing\nfraud](https://docs.stripe.com/disputes/prevention/best-practices)\n- [Identifying\nfraud](https://docs.stripe.com/disputes/prevention/identifying-fraud)\n- [Using Radar with Connect](https://docs.stripe.com/connect/radar)",
  "metadata": {
    "title": "Common types of online fraud | Stripe Documentation",
    "description": "Learn about the different kinds of fraud and what your liability is.",
    "sourceURL": "https://docs.stripe.com/disputes/prevention/fraud-types"
  }
}