{
  "content": "# Review tools\n\n## Learn how to use manual reviews to supplement programmatic systems with human expertise.\n\nWhile Stripe’s programmatic systems work to detect fraudulent verifications, you\ncan perform manual reviews to provide an extra layer of fraud protection.\n\nFor example, you might want to review verifications when:\n\n- Your customer submits a document from an unexpected country\n- Your customer contacts you about a potential mistake in their verification\n- Your business requirements differ from Stripe Identity’s default risk\nthresholds\n\nManual reviews and [insights](https://docs.stripe.com/identity/insights) in\nStripe Identity allow you to examine unusual verifications and update\nverification statuses.\n\n## Reviewing verifications\n\nYou can review verifications in two ways. The [list\nview](https://docs.stripe.com/identity/review-tools#list-view) allows you to\nscan a list of verifications without seeing details about a verification, while\nthe [detailed view](https://docs.stripe.com/identity/review-tools#detailed-view)\nprovides more context.\n\n### List view\n\nThe list view contains information to help you quickly get a sense of the state\nof each verification. It includes information on overall verification status,\ndocument country, extracted name, and individual verification check status.\n\n### Detailed view\n\nTo see more information about a verification before making a decision, select\nthe verification from the list view to navigate to a detailed view. In this\nview, you can inspect the individual images collected alongside available\n[insights](https://docs.stripe.com/identity/insights).\n\n### Actions\n\nAfter you review a verification, take one of the following actions:\n\n- **Override status**: Manually override the verification status to match your\ndecision on whether or not the customer is verified. Stripe sends a [webhook\nevent](https://docs.stripe.com/identity/handle-verification-outcomes) with the\nnew status.\n- **Add to blocklist**: Add the document to a blocklist to programmatically\nblock future verifications completed with the same document.\n\n### Biometric duplicates\n\nWhen processing new verification attempts, Stripe reviews your completed\nverifications for duplicate identities using biometric data (for example, based\non a selfie) to make sure that each identity is unique.\n\nIf we detect a duplicate selfie, we’ll share a list of verification sessions\nwhere the duplicate is detected and how many times it’s found in each session.\n\n## Blocklist\n\nTo prevent Stripe Identity from using a document or selfie in programmatic\nverifications, add it to the blocklist. When a verification includes data that\nmatches a blocklist entry, Stripe automatically sets that verification’s status\nto ‘unverified‘ until you review it in the Dashboard.\n\nWe support adding blocklist entries of the following types:\n\n- **Document**: matches against the combination of the type of the document, the\ndocument number, and the document country.\n- **Selfie**: matches against the facial mapping of the selfie image uploaded\nduring verification.\n\n#### Note\n\nManually review each verification marked as `unverified` by the blocklist. If\nany of them are incorrect, you can manually [override their verification\nstatus](https://docs.stripe.com/identity/review-tools#actions).\n\n### Add a blocklist entry\n\nFrom the [Identity](https://dashboard.stripe.com/identity) page in the\nDashboard, find the Verification session containing the data you want to add to\nthe blocklist. Click the overflow menu ​​() in the top right, then select **Add\nto blocklist**.\n\n### Disable a blocklist entry\n\nOn the blocklist entry details page, click **Disable** in the top right. A\ndisabled blocklist entry no longer causes Stripe Identity to automatically set\nverifications matching it to `unverified`.\n\nYou can’t re-enable a disabled blocklist entry. To restore a disabled entry,\nopen the Verification session containing that document or selfie, and create a\nnew entry with the same data.\n\n#### Note\n\nRedacting a Verification session deletes any blocklist entries created from it.\n\n## Identity analytics\n\nOn the [Analytics](https://dashboard.stripe.com/identity/overview) tab of the\nIdentity Dashboard, you can view usage and verification rates over time and\ntrack user progression through verification funnel stages. This data comes from\nlive verification sessions and excludes test sessions.\n\n### About the data\n\nStripe calculates analytics for\n[VerificationSessions](https://docs.stripe.com/identity/verification-sessions)\nin the following ways:\n\n- **Verifications created**: The total number of verifications created,\nincluding those that are abandoned, canceled, redacted, or otherwise unfinished.\n- **Verifications started**: The number of verifications that a user visited and\nthen started the verification process for.\n- **Verification submitted**: The number of verifications that were completed\nand submitted by a user. You’re charged for every submitted verification,\nregardless of the outcome.\n- **Verifications successful**: The number of verifications that were verified\nsuccessfully after submission.\n- **Completion rate**: The rate at which started verifications were completed\nand submitted by a user. Stripe divides the number of submitted verifications by\nthe number of started verifications.\n- **Verification rate**: The rate at which submitted verifications were verified\nsuccessfully. Stripe divides the number of verified verifications by the number\nof submitted verifications.\n\nVerification sessions can have multiple attempts (in case the user is unverified\nafter an initial attempt). Each attempt generates a new\n[VerificationReport](https://docs.stripe.com/api/identity/verification_reports),\nand Stripe calculates a number of verification report metrics:\n\n- **Verification reports created**: The number of verification attempts that\nwere completed and submitted.\n- **Verification reports successful**: The number of verification attempts that\nwere verified successfully after submission.\n\n## Best practices\n\nUse the following best practices to get the most out of reviews and perform them\nefficiently:\n\n- **Focus on verifications where human judgment or manual review adds valuable\ninsight to the determination of whether the customer’s identity is verified.**\n\nOur systems can make determinations on identity verification on the majority of\nverification sessions, but human judgment can improve accuracy for some cases.\n- **Use insights and context from your business to make an informed decision.**\n\nUse the data in the [Insights](https://docs.stripe.com/identity/insights)\nsection to see how Stripe made the decision on the document or face image.\nCombining Insights, knowledge about your business, and human judgment can help\nyou make an informed choice about when to trust or ignore the risk signals that\nIdentity indicates.\n- **Apply what reviewers learn to develop fraud prevention strategies.**\n\nAs reviewers sort through your verifications, they develop intuitions for fraud\nprevention that you can translate into updates to your integration with\nIdentity.\n- **Customize the process by presenting data unique to your business at review\ntime.**\n\nPass along any additional customer information as metadata so that all relevant\ninformation is in the Dashboard at the time of review.\n- **Don’t slow down your customer.**\n\nA review implies some amount of time between verification completion and\nenabling the capabilities within your business for the customer. If your\nbusiness has an inherent delay of this type (for example, Identity is a part of\na more long form review process), taking the time to review a verification\ndoesn’t change the customer experience. If you don’t have a built-in delay,\nadding a review process could slow down customers—consider the impact on them\nbefore you implement a review process. For example, build out workflows for\nhandling situations when the verification status changes for a customer after\nthey’ve already been verified.\n- **Implement customer support workflows.**\n\nPrepare to handle customer requests regarding their verification status and\noffer a non-biometric method for identity verification if they request it.\n\n## See also\n\n- [Insights](https://docs.stripe.com/identity/insights)\n\n## Links\n\n- [insights](https://docs.stripe.com/identity/insights)\n- [webhook event](https://docs.stripe.com/identity/handle-verification-outcomes)\n- [Identity](https://dashboard.stripe.com/identity)\n- [Analytics](https://dashboard.stripe.com/identity/overview)\n- [VerificationSessions](https://docs.stripe.com/identity/verification-sessions)\n-\n[VerificationReport](https://docs.stripe.com/api/identity/verification_reports)",
  "metadata": {
    "title": "Review tools | Stripe Documentation",
    "description": "Learn how to use manual reviews to supplement programmatic systems with human expertise.",
    "sourceURL": "https://docs.stripe.com/identity/review-tools"
  }
}