{
  "content": "# Stripe disputes in NetSuite\n\n## Learn about how NetSuite automatically represents Stripe disputes or chargebacks.\n\nThe Stripe Connector for Netsuite automatically creates a corresponding object\nin NetSuite for disputes (or chargebacks) immediately after they occur in\nStripe. Depending on your payment flow, the disputes might appear differently.\n\n## How it works\n\nWhen a customer [disputes](https://docs.stripe.com/disputes) a charge, the\ndispute process occurs as follows:\n\n- Stripe charges you a processing fee for the dispute and withdraws the full\namount of the charge from your Stripe account balance.\n- You respond to the dispute with evidence, which Stripe sends to the bank for\nevaluation and determination of the dispute outcome.\n- The connector records the dispute fee as a cash-back line item. By default,\nthe dispute fee posts to the same account as your credit card processing fees.\nYou can customize where to post fees by going to **Settings** > **Accounts\nmapping** > **Dispute fees** in the Stripe app.\n- The connector creates a customer refund and records the fee on the bank\ndeposit.\n- If you applied the customer payment to a NetSuite invoice, the connector also\ncreates a credit memo against the invoice.\n- If you win the dispute, Stripe returns the dispute amount and fee to your\nStripe balance.\n- The connector records the returned funds and fee reversal to the bank deposit.\n\n## Dispute reversals\n\nWinning a dispute (or receiving a chargeback reversal) occurs when the bank\ngrants a dispute in your favor. When you win a dispute, Stripe refunds the\ndispute fee and includes the full amount of the original charge in your next\npayout.\n\nNetSuite represents this as follows:\n\n- The fee refund appears as an **Other Deposit** line item on the next payout.\n- The chargeback reversal appears as an **Other Deposit** line item and posts to\nyour default income account. You can specify which account to post this line\nitem to.\n\nThe connector makes sure to properly account for cash from dispute reversals,\nwhile allowing you to handle income, revenue recognition, and cash application\nusing your own manual or automated process.\n\nAfter you win a dispute, you can specify which account to return the disputed\ncharge to. To do so, go to **Settings** > **Accounts mapping** > **Dispute\nreversals** in the Stripe app.\n\nFor example, you can configure the connector to post dispute reversal cash to\naccounts receivable instead of income. Then you can manually or automatically\ncreate journal entries or invoices to represent any income entries associated\nwith the won chargebacks.\n\n## Customize the dispute general ledger impact\n\nCredit memos are always created if the disputed payment is applied to an\ninvoice. When creating a credit memo for a dispute, the connector includes the\noriginal items on the invoice, by default.\n\nIf you don’t want to use the original items on the invoice, you can use a\n`Stripe Dispute Item` instead. Use this approach if you want the dispute to post\nto a specific account, or you sell physical products and don’t want the\ndispute’s credit memo to affect NetSuite inventory levels.\n\nThe `Stripe Dispute Item` posts to your default income account. You can specify\nwhere to post dispute items and credit memos. To do so, edit the account of the\nitem in NetSuite. You can also edit any other aspect of the item, and the\nconnector won’t override those modifications.\n\n## Handle mismatched amounts\n\nThe dispute amount might not match the original payment amount in the following\ncases:\n\n- If the connector isn’t managing payment creation, calculation of the cash\namount of the original payment might be incorrect. For example, you might have\nshipping and tax calculations that aren’t synced correctly from an external\nsystem, such as Shopify or Magento.\n- If Stripe receives a dispute that’s greater than the original charge amount.\nFor example, you could have a [currency-converted\npayment](https://docs.stripe.com/currencies/conversions#conversions-disputes-refunds)\nthat’s disputed, but the amount you received is converted back to the\npresentment currency.\n\nIf you have a mismatch between the amounts:\n\n- For a single item on the original invoice, the connector adjusts the item to\nmatch the dispute amount.\n- For multiple items on the original invoice, the connector can’t determine\nwhich items to adjust. Instead of using the original items on the invoice, the\nconnector uses a global `Stripe Dispute Item` to represent the full dispute\namount on the credit memo.\n\n## Test disputes with the connector\n\nTo test disputes, use a [test card](https://docs.stripe.com/testing#disputes) to\ncreate a dispute in your Stripe test environment.\n\n## See also\n\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Stripe payouts in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-payouts-netsuite)\n- [Stripe refunds in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-refunds-netsuite)\n\n## Links\n\n- [disputes](https://docs.stripe.com/disputes)\n- [currency-converted\npayment](https://docs.stripe.com/currencies/conversions#conversions-disputes-refunds)\n- [test card](https://docs.stripe.com/testing#disputes)\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Stripe payouts in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-payouts-netsuite)\n- [Stripe refunds in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-refunds-netsuite)",
  "metadata": {
    "title": "Stripe disputes in NetSuite | Stripe Documentation",
    "description": "Learn about how NetSuite automatically represents Stripe disputes or chargebacks.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/stripe-disputes-netsuite"
  }
}