{
  "content": "# Map payment data\n\n## Map payment data to existing Stripe Customers.\n\nOur standard process creates new customers alongside the payment method data\nfrom your previous provider. If you’ve been processing new transactions on\nStripe during the migration, you might already have some customers in Stripe.\nMap imported payment data to these existing Stripe customers to avoid creating\nduplicates.\n\nAfter you submit the migration intake form, reply in the same email thread with\na CSV file that includes two columns:\n\n- **old_customer_id**: The unique identifier from your former processor.\n- **stripe_customer_id**: The corresponding Stripe customer ID in the `cus_xxxx`\nformat.\n\nTo download a list of customers with their Stripe IDs:\n\n- Go to the Customers section in the [Stripe\nDashboard](https://dashboard.stripe.com/customers).\n- Filter the list based on your desired parameters.\n- Click **Export**.\n- Select the `ID` field for export.\n- Export your list.\n\n## How it works\n\n![Shows the migration mapping\nprocess.](https://b.stripecdn.com/docs-statics-srv/assets/dm-mapping.5205a45bfb84e031c593db5525349ce2.jpg)\n\n## Example mapping file\n\nold_customer_idstripe_customer_id`PSP_buyer_ID_1``cus_NsKvEuOxdDP111``PSP_buyer_ID_2``cus_Nrt6IryCjAK222``PSP_buyer_ID_3``cus_OAiRfxde7Ya333`\n## Customer data overwrite\n\nOur current tooling preserves existing customer level data. Mapping doesn’t\noverwrite any information already present in the customer’s record. Rather, it\nappends data for any new cards that aren’t already included without altering the\ncustomer level information displayed in the Dashboard. If the data file flags a\ncard as the default card, it overrides any previously set default cards in the\nDashboard.\n\n## Links\n\n- [Stripe Dashboard](https://dashboard.stripe.com/customers)",
  "metadata": {
    "title": "Map payment data | Stripe Documentation",
    "description": "When you migrate to Strpe from another payment processor, you can map payment data from your previous processor into existing customer records if some of your customers already existed in Stripe before the migration.",
    "sourceURL": "https://docs.stripe.com/get-started/data-migrations/map-payment-data"
  }
}