{
  "content": "# Configure an invoice finalization grace period\n\n## Learn how to configure a grace period for finalizing your invoices.\n\nDuring the configured finalization grace period, you can continue to report\nusage for the previous billing period. When the invoice finalizes, Stripe\nupdates it to reflect the latest quantity for its billing period. Use this\nsetting if you need to record late arriving usage data in a previous billing\ncycle, or you need more time to record usage for a billing period that already\nended.\n\nConfigure how long it takes for invoices enabled for automatic collection to\ntransition from `draft` to\n[finalized](https://docs.stripe.com/invoicing/integration/workflow-transitions#finalized).\nYou can set a delay of up to 72 hours (3 days). Don’t specify a value that’s\nlonger than your subscription period. For example, if your subscription period\nis daily, don’t set a grace period greater than or equal to 24 hours.\n\n#### Regional considerations\n\nInvoice finalization requirements vary by region. Consult your legal advisor for\nadvice specific to your business.\n\n## Configure the default grace period\n\n- Go to the [Invoice settings\npage](https://dashboard.stripe.com/test/settings/billing/invoice).\n- Under **Invoice finalization grace period**, review the configured\nfinalization behavior. The default is set to 1 hour for all invoices.\n- To change the default behavior for all invoices, do the following:- Click the\noverflow menu () in the **Account default** row, and select **Edit**.\n- Under **Invoice finalization delay**, specify the duration between invoice\ncreation and finalization\n- Click **Save**.\n\n## Configure rules for the grace period\n\nRules allow you to set the grace period for specific groups of invoices. If the\nconditions on your rules aren’t met, Stripe uses the default behavior.\n\nYou can change the order that we apply rules by clicking **Change order**. You\ncan’t change the order of the default behavior, which is always applied last.\nYou can revert to the Stripe default behavior by deleting all other rules and\nsetting the **Invoice finalization delay** to `1 hour`.\n\nFor invoices with multiple products that might satisfy more than one rule,\nStripe applies the more conservative grace period. For example, if an invoice\nincludes one line item for a usage-based product (72 hours) and a simple\nsubscription product (1 hour), the invoice finalizes after 72 hours.\n\nThe first invoice generated by a subscription set to [charge\nautomatically](https://docs.stripe.com/api/subscriptions/create#create_subscription-collection_method)\nfinalizes immediately, regardless of the rules you configure.\n\n- On the [Invoice settings\npage](https://dashboard.stripe.com/test/settings/billing/invoice), under\n**Invoice finalization grace period**, click **Add rule**.\n- On the **Create new rule** page, under **Invoice finalization delay**, specify\nthe duration between invoice creation and finalization.\n- Under **Conditions**, do the following to set the grace period:For invoicesDo\nthe followingGenerated at the end of a subscription periodSelect Invoice is from\na subscription cycle from the dropdown.With usage-based productsSelect Has a\nmetered price from the dropdown.With usage-based products from a subscription\ncycleSelect Has a metered price from the dropdown. Click Add more conditions,\nthen select Invoice is from a subscription cycle from the dropdown.\n- Click **Save**.\n\n## Add usage to draft invoices\n\nBy default, newly recorded usage appears on an invoice when it’s finalized, and\nnot on the draft invoice. You can delay finalization if you need more time to\naggregate and add usage to your draft invoices. To add usage to existing\ninvoices, they must meet the following conditions:\n\n- The invoice is in a `draft` state.\n- The timestamp from the [meters\nrequest](https://docs.stripe.com/billing/subscriptions/usage-based/configure-grace-period#configuring-meter)\nis within the subscription period for the invoice.\n\nIf the usage timestamp is for any time after the creation time of the draft\ninvoice, we append the usage to the next invoice.\n\nYou can verify added usage on the [Meters\npage](https://dashboard.stripe.com/test/meters) in the Dashboard or using the\n[Meters API](https://docs.stripe.com/api/billing/meter).\n\n## Links\n\n-\n[finalized](https://docs.stripe.com/invoicing/integration/workflow-transitions#finalized)\n- [Invoice settings\npage](https://dashboard.stripe.com/test/settings/billing/invoice)\n- [charge\nautomatically](https://docs.stripe.com/api/subscriptions/create#create_subscription-collection_method)\n- [Meters page](https://dashboard.stripe.com/test/meters)\n- [Meters API](https://docs.stripe.com/api/billing/meter)",
  "metadata": {
    "title": "Configure an invoice finalization grace period | Stripe Documentation",
    "description": "Learn how to configure a grace period for finalizing your invoices.",
    "sourceURL": "https://docs.stripe.com/billing/subscriptions/usage-based/configure-grace-period"
  }
}