{
  "content": "# Activate PayPal payments\n\n## Learn how to activate PayPal payments when you're ready to go live.\n\nYou can activate the PayPal payment method directly from the Stripe Dashboard.\n\n- Go to the [Payment Methods settings\npage](https://dashboard.stripe.com/settings/payment_methods).\n- Locate PayPal in the **Wallets** section.\n- Click **Turn on**.\n- Select your **settlement preference**. If you select **Add PayPal funds to\nyour Stripe balance**, PayPal money flow is similar to other payment methods at\nStripe. If you select **Keep PayPal funds in PayPal balance**, you’ll need to\nmanage payouts on PayPal with the option to automate the frequency of payouts.\nFind more information about [settlement\nmodes](https://docs.stripe.com/payments/paypal/choose-settlement-preference).\n- Click **Continue to PayPal** to complete the integration and connect your\nStripe and PayPal accounts. You can connect an existing PayPal account or create\na new one as part of the process.\n- After clicking **Continue to PayPal**, PayPal redirects you back to Stripe\nwhere you can check the status of your integration on the **Payment Methods\nsettings** page.\n\n#### Note\n\nIn some cases, you might see your integration appear in a **pending** state\nafter connecting your Stripe and PayPal accounts, which can happen for the\nfollowing reasons:\n\n- You haven’t confirmed the email address to activate your PayPal account.\n- PayPal needs to perform additional verifications on your account. If you’ve\nverified all of these possibilities and think they don’t apply to your PayPal\naccount, please [contact Stripe Support](https://support.stripe.com/) and we’ll\nhelp you resolve the issue.\n\nCurrently, only PayPal business accounts in the European Economic Area\n(excluding Hungary), the UK, and Switzerland are supported.\n\n### Connect users\n\n- Check whether your Connect configuration [is compatible with\nPayPal](https://docs.stripe.com/payments/paypal#connect).\n- If your use case is supported, request PayPal access by submitting an\nonboarding request from the [Stripe\nDashboard](https://dashboard.stripe.com/settings/payment_methods).\n- Receive a confirmation email from Stripe.\n- Prepare the following documents to provide to PayPal:- Your Acceptable User\nPolicy (AUP) or Terms & Conditions (T&C).\n- Details of the controls you have in place to make sure that sellers conform to\nyour policies and terms. Examples of controls include web screening, ongoing\nreviews of top sellers, and restricting sellers to a fixed list of items they\ncan offer.\n- A PayPal representative contacts you directly over phone and email to complete\nthe onboarding. Provide them with the documents that you prepared in the\nprevious step.\n\nStripe sends email updates about the progress of onboarding requests. You can\nalso check your onboarding status in your [Payment Methods\nsettings](https://dashboard.stripe.com/settings/payment_methods).\n\n## Switch to a different PayPal account Not supported with Stripe Connect\n\nYou can switch to a different PayPal account in your Dashboard. It can be an\nexisting account, or you can create a new one.\n\nConnect platforms and connected accounts can’t switch PayPal accounts.\n\n#### Caution\n\nIf you have recurring payments enabled, switching PayPal accounts disables them.\nAfter switching accounts, you must re-enable recurring payments and collect\nmandates from buyers again.\n\n- Go to the [Payment Methods settings\npage](https://dashboard.stripe.com/settings/payment_methods).\n- In the **Wallets** section, find **Paypal**.\n- Expand the **PayPal** section.\n- Click **Switch account**.\n- Read the information dialog.\n- Click **Switch PayPal account**.\n\nSwitching accounts doesn’t take effect immediately. Payments continue to flow\nthrough your previous account until the new account is successfully connected.\n\nAfter switching PayPal accounts, payments processed with your previous account\nare still eligible for refunds and disputes.\n\nIn some cases, you might see your new PayPal account appear in a pending state\non the Stripe dashboard. That can happen for the following reasons:\n\n- You haven’t confirmed the email address to activate the new PayPal account.\n- PayPal needs to perform additional verifications on the new account. If you\nbelieve that you’ve fulfilled all of the PayPal requirements, contact Stripe\nSupport.\n\n## Start accepting PayPal payments\n\nSee how to [accept PayPal\npayments](https://docs.stripe.com/payments/paypal/accept-a-payment) at Stripe.\n\n## Links\n\n- [Payment Methods settings\npage](https://dashboard.stripe.com/settings/payment_methods)\n- [settlement\nmodes](https://docs.stripe.com/payments/paypal/choose-settlement-preference)\n- [contact Stripe Support](https://support.stripe.com/)\n- [is compatible with PayPal](https://docs.stripe.com/payments/paypal#connect)\n- [accept PayPal\npayments](https://docs.stripe.com/payments/paypal/accept-a-payment)",
  "metadata": {
    "title": "Activate PayPal payments | Stripe Documentation",
    "description": "Learn how to activate PayPal payments when you're ready to go live.",
    "sourceURL": "https://docs.stripe.com/payments/paypal/activate"
  }
}