{
  "content": "# Backdate subscriptions\n\n## Learn how to backdate subscriptions.\n\nYou can backdate a subscription to bill customers for time that has already\nelapsed. This is often used when migrating to Stripe or for record keeping\npurposes. The `backdate_start_date` field specifies the subscription’s backdated\nstart date. You also have the option to bill customers for this elapsed time and\nset the next billing date.\n\n## Backdating and charging users\n\nSometimes users can have access to your service before you create a subscription\nfor them, and you want to charge them for that access.\n\nDashboardAPI\nTo charge users for this time through the Dashboard:\n\n- Go to the **Payments** > **Subscriptions** page.\n- Click **+Create subscription**.\n- Find or add a customer.\n- Enter the pricing and product information.\n- In the **Subscription details** section, select the start and end dates of the\nsubscription. To backdate it, select a start date in the past.\n- Select the date that you want to start the billing cycle on.\n- (Optional) Set the **Payment** or **Advanced** options.\n- Click **Create subscription**. The subscription starts on the date you\nselected.\n\nThis creates an [invoice](https://docs.stripe.com/api/invoices) with a prorated\namount for the time between the backdated start date and the current time. The\nprorated amount is calculated based on an imagined interval that starts on the\nbackdated start date. For example, if the billing interval is monthly on the\nfirst of the month, and you set the `backdate_start_date` to February 15 (in a\nnon-leap year), the proration calculation is based on a month running February\n15 to March 15. Because that imagined month is 28 days, the prorated amount for\nthe 14 days of February 15 to March 1 is exactly half the amount of a normal\nmonthly charge.\n\nSimilarly, if you set the `backdate_start_date` to January 15, the proration\ncalculation is based on an imagined month running January 15 to February 15.\nBecause that month is 31 days, the prorated amount for the 17 days of January 15\nto February 1 is 17 divided by 31 (or 0.548) of a normal monthly charge.\n\nAnother way to think about the calculation is to look at the backdated start\ndate as the original start date and the beginning of the first full billing\nperiod as an updated start date.\n\n## Backdating without charging users\n\nYou can also backdate a subscription without charging the customer for the\nbackdated period, which you can use if you’re migrating to Stripe. To do so,\npass `proration_behavior: 'none'` when you create the subscription. That sets\nthe `start_date` to the same value as `backdate_start_date`, but it doesn’t\ncharge the customer for backdated time.\n\n## Backdating and setting the billing cycle anchor\n\nYou can combine `backdate_start_date` with `billing_cycle_anchor` to backdate a\nsubscription and set the billing cycle anchor to a date in the future. This\ncreates a prorated item on the next invoice for the time between the backdated\nstart date and the billing cycle anchor. You can use this if you’re migrating to\nStripe and need to carry over the next billing date for your subscriptions while\nbilling customers for elapsed time.\n\nFor example, say it’s October 15 and you’re migrating to Stripe. You have a\nsubscription that started on September 1, and the next billing date is November\n1. To migrate that subscription, create a new subscription and set\n`backdate_start_date` to September 1 and `billing_cycle_anchor` to November 1.\n\n```\ncurl https://api.stripe.com/v1/subscriptions \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d customer={{CUSTOMER_ID}} \\\n -d backdate_start_date=1575176400 \\\n -d billing_cycle_anchor=1572580800 \\\n -d \"items[0][price]\"={{PRICE_ID}}\n```\n\nThis immediately issues an invoice for the prorated amount covering the time\nbetween September 1 and November 1. It also sets the `start_date` of the\nsubscription to September 1. Stripe issues the next invoice on November 1.\n\n!\n\n## Backdating an update\n\nTo set the effective date of\n[prorations](https://docs.stripe.com/billing/subscriptions/prorations) when\nupdating a subscription, use the\n[proration_date](https://docs.stripe.com/api/subscriptions/update#update_subscription-proration_date)\nparameter. Pass an integer Unix timestamp within the subscription’s current\nperiod. If the subscription is backed by a subscription schedule, make sure that\nthe timestamp is before the start date of the next phase of the subscription\nschedule.\n\nYou can set a `proration_date` earlier than the current period only during the\nfirst period of a backdated subscription. In this case, the `proration_date` can\nbe on or after the `subscription[start_date]` (backdated start date). In all\nother cases, the `proration_date` can’t be before the `current_period_start`.\n\n## Links\n\n- [invoice](https://docs.stripe.com/api/invoices)\n- [prorations](https://docs.stripe.com/billing/subscriptions/prorations)\n-\n[proration_date](https://docs.stripe.com/api/subscriptions/update#update_subscription-proration_date)",
  "metadata": {
    "title": "Backdate subscriptions | Stripe Documentation",
    "description": "Learn how to backdate subscriptions.",
    "sourceURL": "https://docs.stripe.com/billing/subscriptions/backdating"
  }
}