{
  "content": "# Deploy your app in the Dashboard\n\n## Learn how to deploy your Android app to your devices in the Dashboard.\n\nAfter Stripe reviews and approves your app for deployment, we [notify\nyou](https://docs.stripe.com/terminal/features/apps-on-devices/submit#monitor-status)\nby email in the Dashboard. You can then follow the instructions below to deploy\nyour app.\n\nDuring deployment, your app is immediately sent and downloaded to your device,\nand the device reboots to install it. Devices reboot every 24 hours and apply\nany updates automatically. To check for and apply updates immediately, you can\nmanually reboot your device.\n\nYou can deploy new and updated apps for Terminal devices in the Dashboard.\n\n## Add or edit a deploy group\n\nBefore you can add or edit a deploy group, you must create a Terminal\n[location](https://docs.stripe.com/terminal/fleet/locations-and-zones) and add\n[readers](https://docs.stripe.com/api/terminal/readers/object) to that location.\nYou can then assign locations to a deploy group, meaning all readers in the\nlocation receive updates from that deploy group.\n\nAfter you create a deploy group, you can edit it at any time by selecting it.\n\n### Add a deploy group\n\n- On the [Terminal\napps](https://dashboard.stripe.com/terminal/apps_on_devices/apps) tab, click\n**Manage deploy groups**.\n- Click **Add deploy group**.\n- Complete the following steps in the **Add deploy group** drawer:- Enter a\ngroup name.\n- Choose your Terminal device type.\n- If desired, select the **Default deploy group** checkbox to create a default\ndeploy group. A default deploy group automatically contains all locations that\naren’t explicitly assigned to a different deploy group. You can create one\ndefault deploy group per device type.\n- Click **Done**.\n\n### Manage deploy groups with destination charges\n\n- On the [Terminal\napps](https://dashboard.stripe.com/terminal/apps_on_devices/apps) tab, click\n**Manage deploy groups**.\n- Select the deploy group from the list.\n- Click **Add locations**.\n- Choose the locations to add.\n- Click **Done**.\n\n### Manage deploy groups with direct charges\n\n- On the [Terminal\napps](https://dashboard.stripe.com/terminal/apps_on_devices/apps) tab, click\n**Manage deploy groups**.\n- Select the deploy group from the list.\n- Click **Add locations**.\n- Select the account that you want to add locations from in the account\ndropdown. You must select an account before adding locations.\n- Choose the locations to add.\n- Click **Done**.\n\n## Deploy an app version\n\nYou can deploy your app after a [Stripe reviewer\napproves](https://docs.stripe.com/terminal/features/apps-on-devices/app-review)\nit.\n\n- On the [Terminal\napps](https://dashboard.stripe.com/terminal/apps_on_devices/apps) tab, choose\nthe app that you want to deploy.\n- On the app details page, click **Deploy version**.\n- Choose a version of the approved app, and then click **Next**. You can’t\ndeploy an earlier version of an app—the app version must be newer than the\ncurrently deployed app.\n- Choose the deploy group, then click **Next**.\n- Choose your preferred kiosk app, then click **Next**. This is the default app\nthat launches when the Stripe reader turns on. If you only have one app to\ndeploy, choose that app instead.\n- Confirm the deployment details, then click **Deploy**. The app deploys\nimmediately.\n\n## Share apps across multiple accounts\n\nUse this feature if you have multiple Stripe accounts and want to deploy the\nsame app across accounts. Sharing one app across accounts avoids constraints\nwith package name uniqueness and duplicate app reviews.\n\nDesignate one account to create and manage the app. Only the account that owns\nthe app can upload new app versions, but other accounts can view and deploy the\napp by searching for the app ID.\n\n- On the [Terminal\napps](https://dashboard.stripe.com/terminal/apps_on_devices/apps) tab, click the\noverflow menu ().\n- Click **Search for app**.\n- Enter the app ID and click **View app details**.\n- Click **Deploy version** and enter the deployment details.\n\n## Deploy group best practices\n\nYou can sort devices into different deploy groups to roll out software\nindependently and isolate fault in case of any issues. You might have fewer or\nmore deploy groups based on tooling, risk tolerance, and specific business\nneeds.\n\nWe recommend the following deploy group setup:\n\n- **Alpha**: Contains locations that correspond to your internal devkits or\ninternal production devices.\n- **Beta**: Contains a small number of actual user locations. You can randomly\nchoose these locations, select them based on meaningful criteria (for example,\nless risky locations), or have users opt in to the `Beta` deploy group based on\ntheir risk tolerance.\n- **General**: Contains all remaining actual user locations, except those in the\n`Alpha` or `Beta` groups. You can use a default deploy group to avoid manually\nassigning each remaining location.\n\nWhen your app is ready for deployment, promote deploy groups from least to most\nrisky:\n\n1AlphaFirst, deploy to the `Alpha` deploy group to test your app in a way that\nminimizes risk to users. Discovering a bug or undesirable behavior at this stage\nonly affects a small number of internal devices, rather than actual users and\nreal payments.2BetaSecond, deploy to the `Beta` deploy group. This balances\nexposing your app to real users and not exposing all users to potential\nissues.3GeneralFinally, deploy to the `General` deploy group after addressing\nany issues or confirming that no issues existed for the `Beta` deploy group.\n## Deploy an app to a deploy group in progressive stages\n\nAfter your deploy groups are set up, use progressive deployments to roll out\nyour application to readers within a deploy group in stages. Each stage\ncorresponds to a percentage of the deploy group’s readers that’s greater than\nthe previous stage’s percentage, with the final stage always at 100%. You can\nuse one of our predefined plans or create your own custom plan.\n\n### Set up a progressive deployment\n\nTo set up a progressive deployment:\n\n- Navigate to the desired app details page, click **Deploy version**, then\nselect the intended app version and deploy group.\n- Select a custom or predefined plan under **Progressive Deployments**.- After\ncreating the deploy plan, you can’t edit the percentage associated with each\nstage.\n- Confirm your deploy plan, then click **Deploy**.\n- The deployment starts according to the percentage specified for the initial\nstage.- If you selected a predefined plan, the deployment starts at 0%. You need\nto manually advance to the next stage for any readers to receive the new version\nof the Terminal app.\n- To advance a deployment, click **Update** under **Deployed Group** on the app\ndetails page. Confirm the next stage to advance the plan.\n- To pause a deployment, click **Update** to open a drawer, then click\n**Pause**. This stops the rollout of your application to any additional\nreaders.- Pausing the rollout doesn’t affect devices that have already received\nthe app. Devices that are currently downloading or installing the new app\nversion continue the process.\n\nKeep the following in mind when using progressive deployments:\n\n- Deployments don’t automatically advance. If you never manually advance the\ndeploy plan, the deployment remains at its current percentage.\n- Readers are randomly selected within a deploy group for inclusion in a stage\nof the progressive deploy plan. For example, if Version 2.0 of an app is\ncurrently deployed to 40% of Deploy Group A, then 40% of readers in Deploy Group\nA have Version 2.0 of the app and 60% have the version prior to 2.0.\n- As the deployment advances, the group of readers receiving the new version\nincludes all readers that received it in the previous stage.\n- You need to select the desired progressive deploy plan each time you create a\nnew deploy plan. Rollout stages don’t persist between old and new deployment\nplans.\n\n## Next step\n\n- [Monitor your\ndeployment](https://docs.stripe.com/terminal/features/apps-on-devices/monitor)\n\n## Links\n\n- [notify\nyou](https://docs.stripe.com/terminal/features/apps-on-devices/submit#monitor-status)\n- [location](https://docs.stripe.com/terminal/fleet/locations-and-zones)\n- [readers](https://docs.stripe.com/api/terminal/readers/object)\n- [Terminal apps](https://dashboard.stripe.com/terminal/apps_on_devices/apps)\n- [Stripe reviewer\napproves](https://docs.stripe.com/terminal/features/apps-on-devices/app-review)\n- [Contact your sales representative](https://stripe.com/contact/sales)\n- [Monitor your\ndeployment](https://docs.stripe.com/terminal/features/apps-on-devices/monitor)",
  "metadata": {
    "title": "Deploy your app in the Dashboard | Stripe Documentation",
    "description": "Learn how to deploy your Android app to your devices in the Dashboard.",
    "sourceURL": "https://docs.stripe.com/terminal/features/apps-on-devices/deploy-in-Dashboard"
  }
}