{
  "content": "# Revenue Recognition with refunds and disputes\n\n## Understand how refunds and disputes impact your revenue.\n\nRefunds and disputes can happen to any transaction on Stripe, which affects your\nrevenue numbers.\n\n## Handling a refund or dispute\n\nStripe handles refunds and disputes in a similar manner, but the contra revenue\ngenerated go to the refunds and disputes accounts respectively.\n\nWhen a refund or dispute is made,\n\n- Cash is returned to the customer.\n- Prior recognized revenue is offset by contra revenue in the refund or dispute\naccount.\n- Deferred revenue that hasn’t been recognized is cleared.\n\nThis next example is a one-time payment refund.\n\n- On January 1, a customer made a one-time payment for 90 USD.\n- On February 1, the transaction was refunded.\n\nIn this situation, the full amount of 90 USD is recognized as revenue, and\nsubsequently the full amount of 90 USD is added to the refunds contra revenue\naccount.\n\nAccountJanFebRevenue+90.00Refunds+90.00\nIn this example, the [invoice](https://docs.stripe.com/api/invoices) for a\nsubscription was disputed.\n\n- On January 1, a customer starts a three month subscription for 90 USD, which\ngenerates and finalizes an invoice.\n- The customer pays 90 USD.\n- On February 1, the customer disputes the transaction.\n\nIn this case, the customer received 31 days worth of service, so 31 USD is\nplaced in the disputes account. The dispute also reduces the cash by 90 USD, and\nthe remaining 59 USD of deferred revenue is cleared. At the end of February, the\naccount balances looks like the following:\n\nAccountJanFebRevenue+31.00DeferredRevenue+59.00-59.00Cash+90.00-90.00Disputes+31.00\n## Winning a dispute\n\nDisputes are different from refunds in one way—you can win disputes.\n\nWhen you win a dispute,\n\n- Cash is returned to you.\n- Recognized and deferred revenue don’t change.\n- Cash is offset by an increase in the recoverables account.\n\nIn the previous example, assume that you win the dispute on March 1. If you then\nlooked at the account balances at the end of March, you’d see that cash\nincreased by 90 USD, which is offset by recoverables.\n\nAccountJanFebMarRevenue+31.00DeferredRevenue+59.00-59.00Cash+90.00-90.00+90.00Disputes+31.00Recoverables+90.00\n\n## Links\n\n- [invoice](https://docs.stripe.com/api/invoices)",
  "metadata": {
    "title": "Revenue Recognition with refunds and disputes | Stripe Documentation",
    "description": "Understand how refunds and disputes impact your revenue.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/methodology/refunds-and-disputes"
  }
}