{
  "content": "# Contra examples\n\n## Learn about revenue recognition with contra examples.\n\nUnless stated otherwise, these contra examples assume that revenue recognition\ntakes place on a per-day basis.\n\n## Customer credit balance\n\nThis example uses the following assumptions:\n\n- On January 15, at 00:00:00 UTC, a customer starts a monthly subscription that\ncosts 31 USD.\n- The subscription generates an invoice.\n- The invoice finalizes on January 15, at 00:00:00 UTC.\n- The customer has -11 USD in its customer credit balance. Stripe automatically\napplies -11 USD to the invoice and adjusts the customer credit balance to 0 USD.\n- The customer pays 20 USD on February 9.\n\nIn this example, the invoice and revenue periods are from 1/15/2019 to\n2/14/2019. The 31 USD is recognized across 17 days in January and 14 days in\nFebruary. If you looked at the summary after January ends, you might see\nsomething like:\n\nAccountJanFebAccountsReceivable+20.00-20.00Cash+20.00CustomerBalance-11.00Revenue+17.00+14.00DeferredRevenue+14.00-14.00\nIn this scenario, the customer has an existing customer credit balance that’s\nused to pay the invoice. It’s also possible for a negative amount on an invoice\nto credit the customer credit balance, which is then used to pay the invoice.\nThis often happens when a customer downgrades to a cheaper subscription. For\nexample, assume that:\n\n- A -31 USD invoice with one invoice line item finalizes on January 15, at\n00:00:00 UTC.\n- The service period for the -31 USD invoice line item is from January 15\n00:00:00 UTC to February 15 00:00:00 UTC.\n- Stripe automatically credits 31 USD to the customer credit balance and closes\nthe invoice.\n\nThe -31 USD line item books a journal entry that debits DeferredRevenue and\ncredits AccountsReceivable. When Stripe credits the customer credit balance, it\nbooks another journal entry that debits AccountsReceivable and credits\nCustomerBalance. In the summary at the end of January, you might see something\nlike:\n\nAccountJanFebAccountsReceivableCashCustomerBalance+31.00Revenue-17.00-14.00DeferredRevenue-14.00+14.00\nNotice that eventually the net revenue is -31 USD.\n\n## Refund\n\nThis example uses the following assumptions:\n\n- On January 1, at 00:00:00 UTC, a customer starts a three month subscription\nthat costs 90 USD.\n- The subscription generates an invoice.\n- The invoice finalizes and the customer pays 90 USD.\n- On February 1, they receive a full refund.\n\nWhen you make a full refund:\n\n- The customer receives cash.\n- Recognized revenue is offset by contra revenue in the refunds account.\n- Deferred revenue from the subscription that hasn’t been recognized is cleared.\n\nIn this example, the customer received one month of service, so they receive a\n31 USD refund. The refund also decreases the cash balance in your Stripe account\nby 90 USD. At the time of the refund, there was 59 USD remaining in deferred\nrevenue, so this is also cleared. If you viewed the summary after March ends, it\nmight look something like this:\n\nAccountJan 2019Feb 2019Mar\n2019Revenue+31.00DeferredRevenue+59.00-59.00Cash+90.00-90.00Refunds+31.00\n## Partial refund\n\nThis example uses the following assumptions:\n\n- On January 1, at 00:00:00 UTC, a customer starts a three month subscription\nthat costs 90 USD.\n- The subscription generates an invoice.\n- The invoice finalizes and the customer pays 90 USD.\n- On February 1, they receive a partial refund of 9 USD.\n\nWhen the partial refund is made:\n\n- The customer receives 9 USD.\n- Recognized revenue is proportionally offset by contra revenue in the refunds\naccount.\n- Deferred revenue from the subscription that hasn’t been recognized is also\nproportionally reduced.\n\nIn this example, the customer received one month of service, so 31 USD has been\nrecognized. There is 59 USD remaining in deferred revenue. The partial refund of\n9 USD is 10% of 90 USD. Therefore, the refunds account (part of contra revenue)\nincreased by 3.10 USD (10% of 31 USD), and deferred revenue decreased by 5.90\nUSD (10% of 59 USD). If you viewed the summary after March ends, it might look\nsomething like this:\n\nAccountJan 2019Feb 2019March\n2019Revenue+31.00+25.20+27.90DeferredRevenue+59.00-31.10 (= -25.20 +\n-5.90)-27.90Cash+90.00-9.00Refunds+3.10\n## Void\n\nThis example uses the following assumptions:\n\n- On January 1, at 00:00:00 UTC, a customer starts a three month subscription\nthat costs 90 USD.\n- The subscription generates an invoice.\n- The invoice finalizes, but the customer hasn’t paid yet.\n- On February 1, you void the invoice.\n\nWhen you void the invoice:\n\n- The accounts receivable account is cleared because we don’t expect to get\npaid.\n- Recognized revenue is offset by contra revenue in the voids account.\n- Deferred revenue from the subscription that hasn’t been recognized is cleared.\n\nIn this example, the customer received one month of service, so 31 USD in\nrecognized revenue is voided. At the time of the invoice being voided, there was\n59 USD remaining in deferred revenue, so this is also cleared. If you viewed the\nsummary after March ends, it might look something like this:\n\nAccountJan 2019Feb 2019Mar\n2019AccountsReceivable+90.00-90.00Revenue+31.00DeferredRevenue+59.00-59.00Voids+31.00\n## Uncollectible\n\nThis example uses the following assumptions:\n\n- On January 1, at 00:00:00 UTC, a customer starts a three month subscription\nthat costs 90 USD.\n- The subscription generates an invoice.\n- The invoice finalizes, but the customer hasn’t paid yet.\n- On February 1, the invoice is marked as uncollectible.\n\nWhen the invoice is marked as uncollectible:\n\n- The accounts receivable account is cleared because we don’t expect to get\npaid.\n- Recognized revenue is offset by contra revenue in the bad debt account.\n- Deferred revenue from the subscription that hasn’t been recognized is cleared.\n\nIn this example, the customer received one month of service, so 31 USD in\nrecognized revenue becomes bad debt. At the time of the invoice being marked as\nuncollectible, there was 59 USD remaining in deferred revenue, so this is also\ncleared. If you viewed the summary after March ends, it might look something\nlike this:\n\nAccountJan 2019Feb 2019Mar\n2019AccountsReceivable+90.00-90.00Revenue+31.00DeferredRevenue+59.00-59.00BadDebt+31.00\nAn uncollectible invoice might still be paid. When the invoice is paid, the bad\ndebt account is cleared out using a part of the received cash amount. The\nremaining cash amount goes to the recoverables account. If the invoice is paid\nin April, the summary might look something like this:\n\nAccountJan 2019Feb 2019Mar 2019Apr\n2019AccountsReceivable+90.00-90.00Revenue+31.00DeferredRevenue+59.00-59.00BadDebt+31.00-31.00Cash+90.00Recoverables+59.00\nAn uncollectible invoice might still be voided. When the invoice is voided, the\nbad debt account is cleared out and the contents are moved into the void\naccount. If the invoice is voided in April, the summary might look something\nlike this:\n\nAccountJan 2019Feb 2019Mar 2019Apr\n2019AccountsReceivable+90.00-90.00Revenue+31.00DeferredRevenue+59.00-59.00BadDebt+31.00-31.00Void+31.00\n## Uncollectible invoice with applied customer credit balance\n\nThis example uses the following assumptions:\n\n- On January 15 at 00:00:00 UTC, a customer starts a monthly subscription that\ncosts 31 USD.\n- The subscription generates an invoice.\n- The invoice finalizes on January 15 at 00:00:00 UTC.\n- The customer’s credit balance is -11 USD. Stripe automatically applies -11 USD\nto the invoice and adjusts the credit balance accordingly.\n- On February 15, the invoice is marked as uncollectible.\n\nIn this example, the invoice and revenue periods are from January 15, 2019 to\nFebruary 14, 2019. Stripe recognizes the 31 USD across 17 days in January and 14\ndays in February.\n\nStripe automatically offsets recognized revenue with the bad debt account if an\ninvoice is set as uncollectible. With the customer’s 11 USD credit balance,\nStripe considers 6 USD (11 × 17 / 31) as recognized revenue and 5 USD (11 × 14 /\n31) as deferred revenue. The portion of paid deferred revenue is considered as a\ngain and booked in the recoverables account.\n\nThe summary after February end might look something like:\n\nAccountStartingJanFebEndingAccountsReceivable0.00+20.00-20.000.00BadDebt0.00+11.0011.00CustomerBalance11.00-11.000.00Recoverables0.00+5.005.00Revenue0.00+17.0017.00DeferredRevenue0.00+14.00-14.000.00\nAs another example, you can increase the customer’s invoice due amount when\nthere’s an outstanding balance (that is, they owe some amount to you). Consider\nthe following:\n\n- A 31 USD invoice with one invoice line item finalizes on January 15 at\n00:00:00 UTC.\n- The service period for the 31 USD invoice line item is from January 15\n00:00:00 UTC to February 15 00:00:00 UTC.\n- There is a customer credit balance of 10 USD. Because of this, Stripe adds\nthat amount to the invoice making the outstanding balance be 0 USD.- This debits\nAccountsReceivable and credits CustomerBalance for 10 USD.\n- Stripe marks the invoice as uncollectible on February 15.\n\nFor an uncollectible invoice, the portion of due customer credit balance isn’t\ncollected. Because of this, it’s considered a negative gain and booked as a\nnegative amount to the recoverables account.\n\nThe summary after February end might look something like:\n\nAccountStartingJanFebEndingAccountsReceivable0.00+41.00-41.000.00BadDebt0.00+17.0017.00CustomerBalance-10.00+10.000.00Recoverables0.00-10.00-10.00Revenue0.00+17.0017.00DeferredRevenue0.00+14.00-14.000.00\n## Uncollectible and disputed or refunded\n\nAn uncollectible invoice can be paid, then later disputed or refunded.\n\nThis example uses the following assumptions:\n\n- On January 1, at 00:00:00 UTC, a customer starts a three month subscription\nthat costs 90 USD.\n- The subscription generates an invoice.\n- The invoice finalizes, but the customer hasn’t paid yet.\n- On February 1, the invoice is marked as uncollectible.\n- On April 1, the invoice is paid.\n- On May 1, the corresponding charge is disputed.\n\nAs shown in the\n[uncollectible](https://docs.stripe.com/revenue-recognition/examples/contra#uncollectible)\nexample, when the invoice is marked as uncollectible and later paid:\n\n- The bad debt account is cleared out.\n- The remainder is booked as recoverables.\n\nIn this example, the customer later decides to dispute the charge. When a\ndispute occurs, the summary might look something like:\n\nAccountJan 2019Feb 2019Mar 2019Apr 2019May\n2019AccountsReceivable+90.00-90.00Revenue+31.00DeferredRevenue+59.00-59.00BadDebt+31.00-31.00Cash+90.00-90.00Disputes+31.00Recoverables+59.00-59.00\nAn invoice marked as uncollectible, paid, and later refunded works in a similar\nmanner except that it uses the refunds account instead of the disputes account.\n\n## Dispute\n\nIn case of a dispute, Revenue Recognition works similarly to how a refund works\nexcept that it uses the disputes account instead.\n\nThis example also shows what happens if you win a dispute. It uses the following\nassumptions:\n\n- On January 1, at 00:00:00 UTC, a customer starts a three month subscription\nthat costs 90 USD.\n- The subscription generates an invoice.\n- The invoice finalizes and the customer pays 90 USD.\n- On February 1, they dispute the payment.\n- On April 1, you win the dispute because the bank rules in your favor.\n\nWhen the customer makes the dispute:\n\n- Cash is returned to the customer.\n- Recognized revenue is offset by contra revenue in the disputes account.\n- Deferred revenue from the subscription that hasn’t been recognized is cleared.\n\nWhen you win the dispute:\n\n- Cash is returned to you.\n- Recognized revenue and deferred revenue don’t change.\n- Cash is offset by an increase in the recoverables account.\n\nIn this example, the customer received one month of service, so 31 USD in\nrecognized revenue is disputed. The dispute also decreases the cash balance in\nyour Stripe account by 90 USD. At the time of the dispute, there was 59 USD\nremaining in deferred revenue, so this is also cleared. Later in time, in April,\nthe bank rules in your favor, so the cash is returned to you.\n\nIf you viewed the summary after April ends, it might look something like this:\n\nAccountJan 2019Feb 2019Mar 2019Apr\n2019Revenue+31.00DeferredRevenue+59.00-59.00Cash+90.00-90.00+90.00Disputes+31.00Recoverables+90.00\n## Other loss\n\nThis example is based on the following details:\n\n- On January 1, at 00:00:00 UTC, a customer starts a 10 month subscription that\ncosts 100 USD.\n- One month of revenue is recognized (10 USD).\n- The invoice is paid.\n- On February 1, an 80 USD refund happened, and a proportionate amount of\nrevenue was recognized.\n- On March 1, an 80 USD dispute happened.\n\nAccountJanFebMarCash+100.00-80.00-80.00Revenue+10.00+2.00DeferredRevenue+90.00-74.00-16.00Refund+8.00Dispute+4.00OtherLoss+60.00",
  "metadata": {
    "title": "Contra examples | Stripe Documentation",
    "description": "Learn about revenue recognition with contra examples.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/examples/contra"
  }
}