{
  "content": "# Tax year changeover\n\n## Learn how to manage tax forms for a new tax year.\n\n#### Getting your 1099 Forms\n\nIf you work for a platform that pays you via Stripe and want to learn about your\n1099 forms and how to get them, see [1099 tax\nforms](https://support.stripe.com/express/topics/1099-tax-forms) on the Stripe\nSupport site.\n\n# Preparing for tax year changeover\n\nWhen a new tax year starts, you need to collect financial data for the new year\nin a new tax form for the new tax year. This is often before a user completes\nand submits tax forms from the previous year and before you provide them to\nusers on your platform. To view the tax forms for the new year, you need to\nchange the year selected either on the **Tax reporting** page or on the **Tax\nform settings** page.\n\n## About tax year settings\n\nWhen a new tax year starts, we apply your settings from the previous year to the\nnew one. If no settings are in place from the previous tax year, the **Tax year\nsettings** dialog displays so you can configure settings for that tax year.\n\nTax forms are generated as soon as a new tax year starts and a payment is made.\nTo see the tax forms that belong to the new tax year, users need to go through a\nchangeover process. This means they need to enable the tax year picker either on\nthe tax forms list or on the Tax Forms settings pages, and they need to create\nnew settings.\n\n## Selecting a tax year\n\nThe **Tax reporting** page displays tax forms and settings for the *current tax\nyear*.\n\nYou can display a different tax year by doing one of the following:\n\n- Selecting a new tax year from the drop-down on the **Tax reporting** page\n- Selecting a new tax year from the drop-down on the **Tax form settings** page\n\nWhen you select a tax year from the drop-down for a year that has no activity,\nthe **Tax form defaults** dialog opens. To activate the tax year, configure and\nsave the Tax form default settings. If you don’t configure and save settings,\nyou see the onboarding page when you open the **Tax reporting** page. Select a\ndifferent tax year from the drop-down to change to that year.\n\nThe selection persists between sessions, so it displays the same tax year when\nyou next use the Dashboard. This lets you start working with tax forms for the\ncurrent year and then switch back to the previous year to file or correct\nexisting forms.\n\n## Frequently asked questions\n\nThe following section provides answers to common questions about tax year\nchangeover.\n\n### How does the user change between tax years?\n\nClick the small downward arrow next to the current tax year. All available tax\nyears appear in a dropdown menu. Click one of these years to change the user’s\nview to that tax year.\n\n### What is the default tax year?\n\nAfter the new year’s forms become available, your Dashboard automatically\nchanges over to that year.\n\n### Does the default tax year reset when you log in? Will it remember what year I last looked at?\n\nThe year you select to view persists between logins. If you select to view your\n2024 forms, the UI defaults to your 2024 forms when you log back in.\n\n### What determines how many tax years are available to me?\n\nEvery time a tax year launches and those forms become available while you have a\nStripe account with [Tax Form\nDefaults](https://docs.stripe.com/connect/get-started-tax-reporting) configured,\nthat year becomes available to you in your drop-down. If you began processing\ntransactions in 2022, you won’t see 2021 forms in your Dashboard because you\ndidn’t have an account when those were launched.\n\n### Will I see tax years from before I used Stripe?\n\nNo. You only see years that launched while you had a Stripe account.\n\n### Will I see tax years for which I filed no forms?\n\nYou are able to see any year in which you previously generated 1099 forms in the\nConnect dashboard, regardless of whether or not they were filed.\n\n## Links\n\n- [1099 tax forms](https://support.stripe.com/express/topics/1099-tax-forms)\n- [Tax Form Defaults](https://docs.stripe.com/connect/get-started-tax-reporting)",
  "metadata": {
    "title": "Tax year changeover | Stripe Documentation",
    "description": "Learn how to manage tax forms for a new tax year.",
    "sourceURL": "https://docs.stripe.com/connect/tax-year-changeover"
  }
}