{
  "content": "# Update verified user information\n\n## Learn what verified information you can update for your connected accounts.\n\nFor connected accounts where your platform collects updated information for due\nor changed requirements, you collect the [required\ninformation](https://docs.stripe.com/connect/required-verification-information)\nfor each account during onboarding, and Stripe verifies it. If you update\nverified user information, Stripe must review it. If Stripe can’t verify it, you\nhave a grace period of 14 days to resolve any issues and complete verification.\n\nDuring this grace period, the account functionality remains the same. For\nexample, if charges or [payouts](https://docs.stripe.com/payouts) were\npreviously enabled, they’ll continue to be enabled until the grace period ends.\nThe value of\n[requirements.current_deadline](https://docs.stripe.com/api/capabilities/object#capability_object-requirements-current_deadline)\ndetermines the end of the grace period and isn’t extended if you update\nadditional information. Resolve all requirements by the end of the grace period\nto prevent charges or payouts from being disabled.\n\nThese fields can be updated, with a grace period, after they’ve been verified:\n\n- Business name\n- Business type\n- First name\n- Last name\n- Date of birth\n- Business tax ID\n- Tax ID registrar\n- Personal ID number\n\nThese fields can’t be updated after a company has been verified:\n\n- Verification documents\n\n## Change the account representative\n\nYou must specify a representative to activate the account, agree to Stripe’s\nterms, and act as primary contact for the account. You can change the account\nrepresentative for any reason (for example, the designated representative left\nthe company or they no longer serve as owner or executive).\n\nDo the following to change the account representative:\n\n- If necessary, add a\n[Person](https://docs.stripe.com/api/persons/object#person_object-verification)\nobject for the new representative. Stripe recommends that you verify the\n`Person` before proceeding, whether you designate an existing `Person` as the\nnew representative or add a new `Person`.\n- Update the\n[Person](https://docs.stripe.com/api/persons/object#person_object-verification)\nobject to remove them as the current representative:\n\n```\ncurl\nhttps://api.stripe.com/v1/accounts/{{CONNECTED_ACCOUNT_ID}}/persons/{{PERSON_ID}}\n\\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d \"relationship[representative]\"=false\n```\n\n- Update the\n[Person](https://docs.stripe.com/api/persons/object#person_object-verification)\nobject to nominate the new representative:\n\n```\ncurl\nhttps://api.stripe.com/v1/accounts/{{CONNECTED_ACCOUNT_ID}}/persons/{{PERSON_ID}}\n\\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d \"relationship[representative]\"=true\n```\n\n- Monitor the `requirements.currently_due` and `requirements.past_due` arrays to\nmake sure that verification of the new representative is complete. Even if the\nnew representative `Person` is already verified, there might be additional\nrequirements for the representative role.\n\nAfter you set a representative to `false`, Stripe allows a grace period of 14\ndays for you to set the new representative to `true` and to complete\nverification.\n\n## Update the account tax identification number\n\n#### Note\n\nConnected account owners in Brazil can’t update Tax IDs (personal* or business)\nafter verification.\n\nWhen your connected account updates its verified Tax ID (personal* or business),\nthe account must agree again to the Stripe Services Agreement (SSA). Doing so\naccepts the transfer of ownership of their account and its balances from the\nentity assigned the initial Tax ID to the one assigned the new Tax ID. The\ninformation below describes the process for collecting this requirement when\nchanging an account’s verified Tax ID.\n\n- This applies when you update or resubmit a verified representative’s existing\nID number and ssn_last_4.\n\n### Update Tax ID with a grace period\n\nAfter the account updates its Tax ID, the account enters a 14-day grace period\nduring which it must re-accept the Stripe Services Agreement (SSA) and make sure\nit’s compliant with all requirements. If the connected account can’t meet its\nrequirements after 14 days, Stripe pauses charges and payouts for the account.\n\nTo collect this requirement, you can:\n\n- If you use Connect Onboarding, provide a link to Stripe’s onboarding flow.\nFrom there, the account can fulfill any necessary requirements.\n\n- For accounts with access to [the Stripe Express\nDashboard](https://docs.stripe.com/connect/express-dashboard), create a\nsingle-use Dashboard login link that allows the account to edit their tax\nidentification number and re-accept the Stripe Services Agreement (SSA).\n- For accounts with no Stripe-hosted Dashboard access, provide a link to\n[Connect\nOnboarding](https://docs.stripe.com/connect/custom/hosted-onboarding#account_update),\nwhere your account can edit their tax identification number and re-accept the\nStripe Services Agreement (SSA).\n- If you onboard your connected accounts through your platform rather than using\nConnect Onboarding, you must collect this requirement by following the\ninstructions in the following section.\n\n### Collect agreement of the Stripe Services Agreement once again\n\nIf you allow accounts with no Stripe-hosted Dashboard access, including Custom\naccounts, to update their verified Tax ID through your platform, you must add a\nsection to make it clear that the account agrees once again to the Stripe\nServices Agreement (SSA). You must also make it clear that the account owner\nassociated with the original TIN agrees to transfer ownership of the account and\nits balances to the owner associated with the updated TIN.\n\nOne way to achieve this is by including a clear reference and link to the\nagreement language below, then documenting that the account agrees using the\n[update account](https://docs.stripe.com/api/accounts/update) API:\n\nFrenchSpanishItalianPortugueseGermanJapanese\n*If you own the Stripe account associated with the original TIN, you agree to\ntransfer ownership of the account and balances to the updated account owner\n(associated with the updated TIN), and that the updated owner has agreed to\nassume your agreements with Stripe. If you are the updated owner, you\nacknowledge that the ownership of this Stripe account has been transferred to\nyou and that you assume the agreements that the prior account owner has with\nStripe.*\n\nUse the [update account](https://docs.stripe.com/api/accounts/update) API to\ncollect the requirements, providing the user’s IP address and the acceptance\ndate as a timestamp. The acceptance date of the signature\n(`tos_acceptance[date]`) must be the time that your connected account requested\nthe update to the Tax ID number. It can also be any time after they requested\nthe update.\n\n```\ncurl https://api.stripe.com/v1/accounts/{{CONNECTED_ACCOUNT_ID}} \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d \"tos_acceptance[date]\"=1609798905 \\\n -d \"tos_acceptance[ip]\"=\"8.8.8.8\"\n```\n\n## Links\n\n- [configured with\nproperties](https://docs.stripe.com/connect/update-to-typeless-connect)\n- [required\ninformation](https://docs.stripe.com/connect/required-verification-information)\n- [payouts](https://docs.stripe.com/payouts)\n-\n[requirements.current_deadline](https://docs.stripe.com/api/capabilities/object#capability_object-requirements-current_deadline)\n-\n[Person](https://docs.stripe.com/api/persons/object#person_object-verification)\n- [the Stripe Express\nDashboard](https://docs.stripe.com/connect/express-dashboard)\n- [Connect\nOnboarding](https://docs.stripe.com/connect/custom/hosted-onboarding#account_update)\n- [update account](https://docs.stripe.com/api/accounts/update)",
  "metadata": {
    "title": "Update verified user information | Stripe Documentation",
    "description": "Learn what verified information you can update for your connected accounts.",
    "sourceURL": "https://docs.stripe.com/connect/update-verified-information"
  }
}