{
  "content": "# Billing metric definitions\n\n## Metric definitions and examples for Billing metrics.\n\nBelow you’ll find definitions and examples for metrics found in the [Billing\nanalytics Dashboard](https://dashboard.stripe.com/billing) and in downloadable\nreports.\n\n## Metric definitions\n\n### Customers, subscribers, and subscriptions\n\nIn Stripe, you create [Customer](https://docs.stripe.com/api/customers) and\n[Subscription](https://docs.stripe.com/billing/subscriptions/creating) objects.\nIf a customer has one or more subscriptions attached, Stripe considers that\ncustomer to be a subscriber. If any of the customer’s subscriptions are paid\nsubscriptions in an `active` or `past_due` state, the customer is an active\nsubscriber.\n\nWhen a subscriber’s subscription is canceled or marked as `unpaid`, then the\nsubscription is considered churn and no longer counts towards MRR.\n\nWhen all of a subscriber’s subscriptions are canceled or marked as `unpaid`,\nthen the subscriber is considered to have churned and no longer counts as an\nactive subscriber.\n\n### Monthly Recurring Revenue (MRR)\n\nMRR is the sum of the monthly-normalized value of all your `active` and\n`past_due` subscriptions. MRR calculations exclude subscriptions in trial\nperiods, any taxes applied to the subscription, any subscribers on free plans,\nand any metered (usage based) products.\n\n#### Example\n\nIn a given period, 100 subscribers are on Plan A (100 USD per month) and 50\nsubscribers are on Plan B (600 USD per year). MRR = (100 × 100 USD) + (50 × (800\nUSD/12)) = 12,500 USD\n\nLearn more about how your [MRR is impacted by taxes, trials, delinquency, and\nrefunds](https://support.stripe.com/questions/understanding-monthly-recurring-revenue-(mrr)).\n\nIf you charge your customers based on usage and want to include usage based\nproducts in your MRR and subscription metrics, sign up below to receive updates\nabout sign up below for updates.\n\n### MRR growth\n\nMRR growth is the net change in your MRR over a period of time starting with the\nMRR at the beginning of the period, adding any new MRR and expansion MRR,\nsubtracting any contraction MRR and any churn MRR and adjusting for any foreign\ncurrency (FX) impact.\n\nMRR Growth = [(New MRR) + (Reactivation MRR) + (Expansion MRR)] − [(Churned MRR)\n+ (Contraction MRR)] + FX adjustment MRR\n#### Example\n\nAt the start of the period, your MRR is 1,000 USD.\n\n- **New MRR**: During the period, you have one subscriber convert from a free\ntrial to Plan A (100 USD per month). This is a positive change of +100 USD to\nyour MRR.\n- **Expansion**: During the period, you have one subscriber upgrade from Plan A\n(100 USD month) to Plan C (150 USD per month). This is a positive change of +50\nUSD to your MRR.\n- **Contraction**: During the period, you have one subscriber downgrade from\nPlan A (100 USD per month) to Plan B (60 USD per month). This is a negative\nchange of -40 USD to your MRR.\n- **Churn**: During the period, you have one subscriber downgrade from Plan B\n(60 USD per month). This is a negative change of -60 USD to your MRR.\n- **FX Adjustment**: You have a single customer paying in a foreign currency.\nThey subscribed to Plan A in a foreign currency last period. During that period\nit was worth (100 USD per month) but the currency lost value in the current\nperiod and it’s now worth 95 USD per month. This is a negative change of -5 USD\nto your MRR.\n\nHere’s a summary breakdown:\n\nMetricAmountBeginning MRR1,000 USDNew MRR100 USDExpansion MRR50 USDContraction\nMRR40 USDChurn MRR-60 USDFX adjustment-5 USDMRR growth45 USDEnding MRR1,045 USD\n### Active subscribers\n\nActive subscribers only includes subscribers with positive MRR that are in an\n`active` or `past_due` state ([read more about subscription states\nhere](https://docs.stripe.com/billing/subscriptions/overview#subscription-lifecycle)).\nIt doesn’t include subscribers on free plans or trials. A customer with multiple\nactive subscriptions is counted as a single active subscriber.\n\nIf a subscriber drops to 0 USD in MRR, we consider them churned in the period.\nThis most commonly happens when a subscription is canceled. It can also occur if\nyou’re choosing to subtract discounts from your MRR. In this case, we consider a\nsubscriber churned if they have a 100% coupon applied and they become active\nagain if you remove the coupon.\n\nTotal active subscribers = Active subscribers + Past due subscribers\n### Active subscriber growth\n\nActive subscriber growth is the net change in your number of active subscribers\nover a period of time. Start with the number of active subscribers at the\nbeginning of the period, add any new active subscribers and any reactivated\nsubscribers, and subtract any churned subscribers.\n\nActive Subscriber Growth = (New subscribers) + (Reactivated subscribers) -\n(Churned subscribers)\n### New subscribers\n\nThe sum of paid subscribers who became active for the first time during the\nperiod. This doesn’t include subscribers on free plans or trials. We don’t count\nexisting paid subscribers who add additional subscriptions multiple times. We\nalso don’t include reactivated customers.\n\n### New trials\n\nNew trials refers to the sum of subscriptions that started a trial during the\nperiod. We count the number of trials at the subscription level rather than at\nthe customer level so a single customer could count as multiple trials.\n\n#### Example\n\n- Jane creates two subscriptions in January.- Each subscription starts with a\n7-day free trial period on January 1.\n- Jane counts as two new trials in January.\n- John enters a 7-day free trial period on January 1.- John doesn’t renew.\n- John then enters another 7-day free trial on January 21.\n- John counts as two new trials in January.\n\n### Trial conversion rate\n\nThe trial conversion rate is the number of subscriptions that converted from a\ntrial to a paid plan in the last 30 days divided by the number of trials that\nended in the last 30 days. The number might exceed 100% if some subscriptions\nconvert to a paid plan after the end of their trial period.\n\nThe number reflects the trial conversion rate at the end of the selected time\nperiod.\n\nThe trial conversion rate = (Total subscriptions that converted from trial to\npaid in the last 30 days) / (Total trials that ended in the last 30 days)\n#### Example\n\nDuring the month, 100 new trials were created and 15 trials converted. The trial\nconversion rate equals 15 divided by 100, or 15\n\n### Subscriber churn rate\n\nThe number of active subscribers lost due to churn over the last 30 days divided\nby the number of active subscribers in a given period divided by the number of\nactive subscribers at the start of the period.\n\nThe subscriber churn rate is the total churned subscribers in the past 30 days,\ndivided by the number of active subscribers 30 days ago, plus the total new\nsubscribers in the past 30 days:\n\n(Total churned subscribers in the past 30 days) / [(Number of active subscribers\n30 days ago) + (Total new subscribers in the past 30 days)]\n#### Example\n\nAt the start of the month, the business had 1000 subscribers. During the month,\nthe business added 100 subscribers and churned 100 subscribers. The subscriber\nchurn rate for the period equals the number of churned subscribers (100) divided\nby the number of existing subscribers plus the number of added subscribers (1000\n+ 100) or, 9.1\n\n### Churned revenue\n\nThe sum of churned MRR and contraction MRR in the period.\n\nChurned revenue = (total churned MRR) + (total contracted MRR)\n#### Example\n\nDuring the period, Jane cancels her 120 USD per year plan and John downgrades\nfrom a 50 USD per month plan to a 25 USD per month plan. The churned revenue\nduring the period equals 10 (Jane) + 25 USD (John) = 35 USD.\n\n### Retention by cohort\n\nStripe assigns cohorts to subscribers based off of when they first started\ngenerating positive Monthly Recurring Revenue (MRR) by starting active paying\nsubscriptions. Revenue retention considers expansion and thus can increase above\n100%.\n\nFor subscriber retention:\n\n- The start value is the initial number of active subscribers in the cohort.\n- Month x refers to the remaining number of active subscribers at the end of\neach subsequent month.\n\nFor revenue retention:\n\n- The start MRR is the MRR of all active subscribers in the cohort.\n- Month x refers to the amount of MRR remaining from subscribers in the cohort\nat the end of the each subsequent month. The MRR for a cohort can change due to\nupgrades, downgrades, and cancellations and thus can exceed 100%.\n\n#### Example\n\nIn January, 100 subscribers become active subscribers. Each month the subscriber\nchurn rate is 10%. Consequently you’d expect to the following retention rates in\neach month:\n\n- Month 1: 90\n- Month 2: 81\n- Month 3: 73\n- Month 4: 66\n- Month 5: 59% and so on.\n\nIn January, 100 subscribers became active on 10 USD per month plans. The\nstarting MRR is 1,000 USD. At the end of month 1, 10 subscribers have churned\nand 5 subscribers have upgraded to 25 USD per month plans. The net MRR impact\nis: 125 USD of expansion MRR − 100 USD of churn MRR = +25 USD. Therefore in\nMonth 1, you see 102.5% revenue retention.\n\n### Average revenue per user (ARPU)\n\nThis is your average MRR per paid subscriber. ARPU is calculated by dividing\nyour total MRR by the number of active subscribers. The number reflects the ARPU\nat the end of the selected time period.\n\nARPU = (Total MRR) / (Total active subscribers)\n#### Example\n\nYou have 100 active subscribers at the end of January. The total MRR at the end\nof January is 50,000 USD. Your ARPU at the end of January is 500 USD\n\n### Subscriber lifetime value (LTV)\n\nThe subscriber lifetime value is calculated by dividing the Average revenue per\nuser (ARPU) by the subscriber churn rate. This is an estimate of LTV based on\nthe values at various points in time.\n\nSubscriber lifetime value = (ARPU) / (Subscriber churn rate)\n#### Example\n\nJanuary started with 110 subscribers and finished with 100 after 10 subscribers\nchurned. The total MRR at the end of January is 50,000 USD. The ARPU at the end\nof January is 500 USD while the January subscriber churn rate was 9%. Subscriber\nlifetime value at the end of January is therefore (500 USD) / (9%) = 5,555 USD\n\n## Links\n\n- [Billing analytics Dashboard](https://dashboard.stripe.com/billing)\n- [Customer](https://docs.stripe.com/api/customers)\n- [Subscription](https://docs.stripe.com/billing/subscriptions/creating)\n- [MRR is impacted by taxes, trials, delinquency, and\nrefunds](https://support.stripe.com/questions/understanding-monthly-recurring-revenue-(mrr))\n- [read more about subscription states\nhere](https://docs.stripe.com/billing/subscriptions/overview#subscription-lifecycle)",
  "metadata": {
    "title": "Billing metric definitions | Stripe Documentation",
    "description": "Metric definitions and examples for Billing metrics.",
    "sourceURL": "https://docs.stripe.com/billing/subscriptions/analytics/glossary"
  }
}