{
  "content": "# Hosted Invoice Page\n\n## Use the Hosted Invoice Page to securely collect payment from your customers.\n\nThe Hosted Invoice Page provides a secure, private URL where your customers can:\n\n- View the details, amounts, and status of the invoice.\n- Pay the invoice using any of the enabled payment methods.\n- Download PDF copies of the invoice and receipt.\n\n!\n\nA sample Hosted Invoice Page\n\nStripe assigns all invoices a unique URL that you can send to your customer. We\nhost these invoices, which means you can securely collect payments without any\nextra implementation code.\n\n## Invoice URLs\n\nWhen you create and send an invoice, Stripe generates a unique URL for the\nHosted Invoice Page. The URL includes a secure, long, and random identifier,\nresembling the following example:\n\n```\n\nhttps://invoice.stripe.com/i/acct_abcdefghijklmno/test_YWNjdF8xRGZ3UzJDbENJS2xqV3ZzLF9MNGJvMDBzY0xFQ2c1cG1QZzZ6Wk5jV0RXR2lOS1V6LDM0Mjk3NjEz0200wpYOWgBE?s=em\n\n```\n\nInvoice URLs expire 30 days after the due date. If the invoice doesn’t have a\ndue date, the invoice expires 30 days after it finalizes. In all cases, the\nexpiration window is never longer than 120 days.\n\n#### Note\n\nEven after expiration, any URLs that the Dashboard displays or a user retrieves\nthrough the API are guaranteed to be valid for at least 10 days.\n\nDashboardAPI\nWhen a URL expires, it no longer loads the intended resource. Instead, Stripe\nredirects invoiced customers to a page that states that the URL has expired and\nto contact the merchant. This page also provides the merchant’s contact\ninformation.\n\n#### Note\n\nIf you sent an invoice through the Dashboard or API, any email recipients are\nautomatically associated with that invoice. In this case, Stripe redirects the\nuser to a recovery page where they can enter their email address to receive a\nnew copy of the original email with non-expired links.\n\n## Invoice email links\n\nYou can configure the invoice email to include a link to the Hosted Invoice\nPage. When enabled, the Hosted Invoice Page URL appears in:\n\n- Invoice emails as a payment link.\n- The footer of invoice PDFs.\n- The Invoice API response as\n[hosted_invoice_url](https://docs.stripe.com/api/invoices/object#invoice_object-hosted_invoice_url).\n\nTo enable the Hosted Invoice Page for all newly created invoices, select the\ncheckbox for **Include a Stripe-hosted link to an invoice payment page in the\ninvoice email** in the [Invoice\nsettings](https://dashboard.stripe.com/settings/billing/invoice) of the\nDashboard.\n\nWhen sending an invoice, you can use the **Delivery** section to have Stripe\nautomatically send an email to your customer with the Hosted Invoice Page or\ngenerate a Hosted Invoice Page that you can send yourself. To send the Hosted\nInvoice Page yourself, create the invoice and then copy the link to send to your\ncustomer.\n\n## Page customization\n\nThe Hosted Invoice Page is customizable with your:\n\n- Brand color\n- Logo\n- Icon\n\nYou can customize these [branding\nsettings](https://dashboard.stripe.com/account/branding) in the Dashboard.\n\n## Set allowed payment methods\n\nUsing the Hosted Invoice Page, you can configure invoices to allow payment with\none or more of the [supported payment\nmethods](https://docs.stripe.com/invoicing/payment-methods). You can set\ndefaults to apply to all of the newly created invoices from the [Invoice default\npayment method\nconfiguration](https://dashboard.stripe.com/settings/billing/invoice). You can\nalso select the payment method on a per-invoice basis when you’re [creating an\ninvoice](https://dashboard.stripe.com/invoices/create) through the Dashboard.\n\nWith the Hosted Invoice Page, you can display the allowed payment method list to\nthe customer. This gives them the option to choose a payment method that suits\nthem best. Additionally, enabling the Hosted Invoice Page gives the customer the\nbenefit of having Stripe handle complex payment and authentication flows\n(without any extra implementation effort from you).\n\n#### Note\n\nFor example, the [Strong Customer\nAuthentication](https://docs.stripe.com/strong-customer-authentication) (SCA)\nregulation in Europe requires customers to confirm their payment with [3D\nSecure](https://docs.stripe.com/payments/3d-secure) (3DS). In this case, the\nHosted Invoice Page displays the payment confirmation modal to your customer.\n\n## Payment method persistence\n\nCards, Bacs Direct Debit and BECS Direct Debit details that you enter on the\nHosted Invoice Page are stored on the customer for use in subsequent payments.\nWe don’t store single-use payment methods like iDEAL, and Bancontact for reuse.\n\n## Public support information\n\nInvoices include any public information that you specified under [Public\nbusiness information](https://dashboard.stripe.com/settings/public), such as\nyour support email address or business website. Using these settings, you can\nalso choose to include a support phone number in customer-facing documents—like\ninvoice PDFs and emails—or default to your business address.\n\n## Links\n\n-\n[hosted_invoice_url](https://docs.stripe.com/api/invoices/object#invoice_object-hosted_invoice_url)\n- [Invoice settings](https://dashboard.stripe.com/settings/billing/invoice)\n- [branding settings](https://dashboard.stripe.com/account/branding)\n- [supported payment methods](https://docs.stripe.com/invoicing/payment-methods)\n- [creating an invoice](https://dashboard.stripe.com/invoices/create)\n- [Strong Customer\nAuthentication](https://docs.stripe.com/strong-customer-authentication)\n- [3D Secure](https://docs.stripe.com/payments/3d-secure)\n- [Public business information](https://dashboard.stripe.com/settings/public)",
  "metadata": {
    "title": "Hosted Invoice Page | Stripe Documentation",
    "description": "Use the Hosted Invoice Page to securely collect payment from your customers.",
    "sourceURL": "https://docs.stripe.com/invoicing/hosted-invoice-page"
  }
}