{
  "content": "# How Climate Orders work\n\n## Learn how to create, monitor, and manage your carbon removal orders.\n\nClimate Orders enables companies to buy permanent carbon removal from the\n[Frontier offtake portfolio and its individual\nsuppliers](https://frontierclimate.com/portfolio?track=offtake). When you\npurchase carbon removal, your company can help contribute to the world’s net\nzero carbon goals and help fund emerging carbon removal technologies.\n\nTo help you incorporate carbon removal into your climate offering, Frontier does\nthe following for you:\n\n- **Procures supply**: This requires establishing purchasing criteria, sourcing\npromising projects, and negotiating contracts.\n- **Monitors supplier progress**: This includes monitoring supplier performance\nagainst key milestones.\n- **Manages deliveries**: This includes validating delivery and retiring\npurchases.\n\n![Diagram describing the life cycle of a carbon removal\norder](https://b.stripecdn.com/docs-statics-srv/assets/frontier-diagram.9a70cf7ffa99c0589082ee922804e333.svg)\n\n## Procure supply\n\nFrontier’s in-house team of experts and a group of [60+ technical\nreviewers](https://frontierclimate.com/who-we-are#section-technical-reviewers)\nsource and vet all suppliers. We look for permanent carbon removal solutions\nthat have the potential to be low-cost and high-volume in the future, even if\nthey aren’t today.\n\nWe use these factors to make purchasing decisions:\n\nApproachExecutionPortfolioDoes the carbon removal approach meet our target\ncriteria?Can this team deliver on the proposal, given where the technology is\ntoday?Does this purchase help us build a diverse, risk-adjusted portfolio of\ncarbon removal approaches?\nSpecifically, Frontier focuses on technologies that meet the following criteria:\n\nCriteria Description DurabilityStore carbon permanently (>1,000 years)Physical\nfootprintTake advantage of carbon sinks and sources that don’t compete for\narable landCostHave a path to being affordable at scale (<100 USD per\nton)CapacityHave a path to being a meaningful part of the carbon removal\nsolution portfolio (>0.5 gigatons per year)Net negativityMaximize net removal of\natmospheric carbon dioxideAdditionalityResult in net new carbon removed, rather\nthan taking credit for removal that was already going to occurVerifiabilityHave\na published protocol that addresses key pathway uncertainties, has responded to\nscientific community feedback, and has a plan for independent verification of\noutcomesSafety and legalityHave a compelling case for why they don’t cause\nadditional ecosystem damage or other ongoing externalities, has published\necosystem impact data and responded to feedback from the scientific community,\nand will actively manage the minimal remaining uncertainty within their\ndeployments based on ongoing ecosystem monitoringPerformance dataHave technology\nthat has been validated by data obtained through a pilot deploymentCommunity\nengagementHave a community benefits plan and has proactively engaged\nstakeholders and incorporated feedback into their deployment plans\nWe conduct diligence and sign long-term offtake agreements with the most\npromising suppliers that meet our criteria so that you don’t have to. Early\nofftakes are a unique way to buy carbon removal because they help projects start\nbuilding today so that they can deliver tons in the near future.\n\nLearn more about [our available\ninventory](https://docs.stripe.com/climate/orders/carbon-removal-inventory).\n\n## Monitor supplier progress\n\nBecause the carbon removal industry is in its early stages, it’s likely that\nsome suppliers will be delayed or fail. Apart from conducting careful diligence,\nFrontier minimizes delivery delays and failures by actively monitoring progress\nagainst supplier-specific milestones, reallocating offtake agreements across\nsuppliers as needed, and maintaining an inventory buffer.\n\n#### Note\n\nIf an order is delayed or fails, we’ll send you an email and the relevant\nwebhook at least 60 days in advance.\n\n- **Delays**. You’ll have the option of receiving a full refund or waiting for\nthe tons to be delivered.\n- **Individual supplier failures**. We’ll try to substitute your order with\nanother similar supplier in the Frontier portfolio. Substituted carbon removal\nunits might vary by pathway, geography, and price. If you don’t want a\nsubstitute, you can cancel the order and receive a full refund.\n\n## Manage deliveries\n\nWhen Frontier receives the verified carbon removal from the supplier, the carbon\nremoval units are retired on an independent third party registry. All deliveries\nare third party verified.\n\nAt the time of delivery, Frontier shares a delivery certificate and important\ndetails about the suppliers that fulfilled your order.\n\n![Preview of a carbon removal order\ncertificate](https://b.stripecdn.com/docs-statics-srv/assets/frontier-certificate.377888457bcfecad08286964dd7e1751.svg)\n\nWhen possible, Frontier retires the carbon removal units on your behalf (or on\nbehalf of your\n[beneficiary](https://docs.stripe.com/api/climate/order/object#climate_order_object-beneficiary_reference)).\nIf we can’t name the buyer on the third party registry, we’ll retire orders in\nFrontier’s name.\n\nAfter delivery of your order, you can use your carbon removal units for net\nzero¹ or carbon neutrality claims.² You can’t make these claims prior to\ndelivery.\n\n## Get started\n\nYou can purchase carbon removal programmatically using the Climate API or\nmanually using the [Dashboard](https://dashboard.stripe.com/climate/orders).\n\n[Use the APIGet up and running using the Climate\nAPI.](https://docs.stripe.com/climate/orders/order-carbon-removal)[Order\nmanuallyNo CodePurchase manually from the\nDashboard.](https://docs.stripe.com/climate/orders/order-carbon-removal?dashboard-or-api=dashboard)\n\n¹ The [Science Based Targets Initiative](https://sciencebasedtargets.org/)\n(SBTi) has become the de facto standard for companies setting net zero targets.\nSBTi [requires\nthat,](https://sciencebasedtargets.org/resources/files/Net-Zero-Standard.pdf) to\nmake a net zero claim, companies must (i) plan to reduce their current emissions\nby at least 90% relative to current levels, (ii) purchase permanent carbon\nremoval—such as that being sold through the Climate API—on behalf of the\nremaining 10% of emissions, and (iii) support beyond value chain mitigation—a\nsomewhat unclear concept that’s meant to capture all the various ways that\ncompanies can contribute to mitigating climate change or reducing its impacts\noutside of reducing their own emissions (or neutralizing them through permanent\ncarbon removal purchases).\n\n² Carbon neutrality is somewhat poorly defined, but is generally claimed when a\ncompany purchases an amount of carbon credits (or carbon removal units) equal to\ntheir remaining emissions.\n\n## Links\n\n- [Frontier offtake portfolio and its individual\nsuppliers](https://frontierclimate.com/portfolio?track=offtake)\n- [60+ technical\nreviewers](https://frontierclimate.com/who-we-are#section-technical-reviewers)\n- [our available\ninventory](https://docs.stripe.com/climate/orders/carbon-removal-inventory)\n-\n[beneficiary](https://docs.stripe.com/api/climate/order/object#climate_order_object-beneficiary_reference)\n- [Dashboard](https://dashboard.stripe.com/climate/orders)\n- [Use the APIGet up and running using the Climate\nAPI.](https://docs.stripe.com/climate/orders/order-carbon-removal)\n- [Order manuallyNo CodePurchase manually from the\nDashboard.](https://docs.stripe.com/climate/orders/order-carbon-removal?dashboard-or-api=dashboard)\n- [Science Based Targets Initiative](https://sciencebasedtargets.org/)\n- [requires\nthat,](https://sciencebasedtargets.org/resources/files/Net-Zero-Standard.pdf)",
  "metadata": {
    "title": "How Climate Orders work | Stripe Documentation",
    "description": "Learn how to create, monitor, and manage your carbon removal orders.",
    "sourceURL": "https://docs.stripe.com/climate/orders/how-it-works"
  }
}