{
  "content": "# Authorization signalsDeprecated\n\n## Make informed, real-time decisions with authorization signals.\n\nWe provide a set of signals at authorization that you can use to make informed\ndecisions.\n\n## Verification data\n\nFor every authorization that takes place, we compare the values provided during\ncheckout with the ones on file. We notify you if we detect a mismatch on:\n\n- CVV2 (or security code)\n- Card expiration date\n- Billing address\n- Billing zip code\n- PIN number (when entered)\n\n### Identify fraudulent activity\n\nIdentifying a mismatch between the card details on file and those entered at\ncheckout might help you identify fraudulent activity. For example:\n\n- A mismatch between the billing postal code and the one provided at checkout\nmight represent a card that’s been stolen by a fraudulent actor who’s unaware of\nthe cardholder’s postal code and attempts to use the card to make a purchase.\n- A mismatch between the CVV2 on file and the one entered at checkout might\nrepresent a fraudulent actor cycling through card numbers to find one that\nworks, without knowledge of the CVV associated with it.\n\n### Reject authorizations\n\nDepending on your risk tolerance and the characteristics of the authorization,\nsuch as whether it’s in person or online, you can reject authorizations if any\nmismatches are identified in the verification data values.\n\n## Fraud disputability assessment\n\nStripe’s fraud disputability assessment evaluates whether an authorization can\nbe disputed in the event of fraud.\n\n### Make informed decisions based on authorization disputability\n\nKnowing whether or not you can dispute an authorization in the event of fraud at\nthe time of authorization allows you to make informed decisions. For example,\nconsider an authorization that is otherwise classified as “medium risk”:\n\n- If you know that you can dispute the authorization if fraud occurs, you can\napprove it\n- If you know that you can’t dispute the authorization (if fraud occurs), you\ncan decline it or only approve a lower amount than what’s requested\n\nStripe assesses disputability likelihood by comparing the characteristics of the\nauthorization (such as whether 3DS was used or if the card was present with a\nchip). We make this assessment against network rules for disputes to proactively\ndetermine what would happen in the event of a dispute.\n\n### Determine the likelihood a dispute can be filed\n\nTo determine the disputability likelihood of an authorization in the event of\nfraud, examine the\n[fraud_disputability_likelihood](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-fraud_disputability_likelihood)\nfield on the `Authorization` object. This field populates with various enums\nthat inform you about whether you can dispute the authorization. We label every\nauthorization as `very_likely`, `neutral`, or `very_unlikely`, or `unknown`:\n\n- When authorizations receive a score of `very_likely`, it’s highly probable\nthat disputes filed based on these authorizations are accepted by the card\nnetwork. The card network rarely rejects `very_likely` authorization disputes.\nWhen they do, it’s typically due to exceptional circumstances. These\ncircumstances might include a card filing a fraud dispute for the second time or\nexceeding the allowable number of disputes for a card within a specific\ntimeframe defined by Visa.\n- When authorizations receive a score of `very_unlikely`, disputes are almost\nalways automatically rejected by the card network.\n- When authorizations receive a score of `neutral`, Stripe assesses that the\ndispute outcome depends on various factors. Historically, these disputes are\nmore likely to be accepted by the card network. However, this behavior might\nchange at any given point.\n\nLearn more about [fraud disputability\nlikelihood](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-fraud_disputability_likelihood).\n\n## High-risk business alerts\n\nUse webhook notifications to receive detailed risk assessments of the acquiring\nbusiness involved in an authorization.\n\n### Make informed decisions based on risk level\n\nIf you have data on the risk level of a business and the likelihood of a\ndispute, you can make more informed decisions about which authorizations you\napprove or reject. To make this assessment, Stripe evaluates all of the\nacquiring transaction activity for a business on Stripe Issuing, including data\nsuch as its historical dispute rate.\n\n### Determine the risk level\n\nTo determine the risk level, examine the\n[risk_assessment.merchant_dispute_risk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-merchant_risk)\nhash field on the `Authorization` object. The following example demonstrates how\nto use each value.\n\n### Example responses\n\nA low (normal) risk transaction:\n\n```\n{\n \"id\": \"iauth_1CmMk2IyNTgGDVfzFKlCm0gU\",\n \"object\": \"issuing.authorization\",\n // ...\n \"risk_assessment\": {\n \"merchant_dispute_risk\": {\n \"risk_level\": \"normal\",\n \"dispute_rate\": 5\n }\n }\n}\n\n```\n\nA high-risk transaction:\n\n```\n{\n \"id\": \"iauth_1CmMk2IyNTgGDVfzFKlCm0gU\",\n \"object\": \"issuing.authorization\",\n // ...\n \"risk_assessment\": {\n \"merchant_dispute_risk\": {\n \"risk_level\": \"high\",\n \"dispute_rate\": 47\n }\n }\n}\n\n```\n\nLearn more about [merchant dispute\nrisk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-merchant_dispute_risk).\n\n## Card testing risk\n\nCard testing is a prevalent form of fraud where fraudulent actors test stolen\ncard numbers or cycle through primary account numbers (PANs) until they find a\nvalid one. They use this valid PAN at a business with weak verification\ncontrols. To counteract this, Stripe assesses the likelihood of your involvement\nin a card testing attack, takes action on your behalf, and notifies you through\nthe API about the severity of the incident. Additionally, we assess if any cards\nmay have been compromised during the attack.\n\n### Make informed decisions based on card testing risk\n\nStripe automatically intervenes in the most obvious card testing scenarios. We\noffer a balanced approach in medium-risk situations to avoid being overly\nconservative. These cases require careful consideration of various factors,\nincluding the authorization and cardholder details. As a result, we recommend\nthe careful evaluation of all relevant considerations before making a decision\non whether to block an authorization.\n\nWe assess card testing risk by, among other things, evaluating the frequency and\nintensity of “card does not exist” declines associated with a specific bank\nidentification number (BIN) or merchant. These declines are the most definitive\nsignificant indicator because they often exhibit a noticeable increase in speed\nand frequency compared to regular card declines.\n\n### Determine card testing risk\n\nTo determine card testing risk, examine the\n[risk_assessment.card_testing_risk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-card_testing_risk)\nfield on the `Authorization` object. The following example demonstrates how to\nuse each value. We also provide the following fields:\n\n- `invalid_account_number_decline_rate_past_hour`: Stripe calculates and returns\nthis value when a decline contains a non-existent PAN.\n- `invalid_credentials_decline_rate_past_hour`: Stripe calculates and returns\nthis value on declines where the PAN exists (or existed in the past), but other\nverifications such as the CVV, expiration, and postal code are failing.\n\n#### Example responses\n\nA low risk transaction:\n\n```\n{\n \"id\": \"iauth_1CmMk2IyNTgGDVfzFKlCm0gU\",\n \"object\": \"issuing.authorization\",\n // ...\n \"risk_assessment\": {\n \"card_testing_risk\": {\n \"invalid_account_number_decline_rate_past_hour\": 5,\n \"invalid_credentials_decline_rate_past_hour\": 3\n }\n }\n}\n\n```\n\nA high-risk transaction:\n\n```\n{\n \"id\": \"iauth_1CmMk2IyNTgGDVfzFKlCm0gU\",\n \"object\": \"issuing.authorization\",\n // ...\n \"risk_assessment\": {\n \"card_testing_risk\": {\n \"invalid_account_number_decline_rate_past_hour\": 79,\n \"invalid_credentials_decline_rate_past_hour\": 83\n }\n }\n}\n\n```\n\nLearn more about [card testing\nrisk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-card_testing_risk).\n\n## Recommended settings\n\nTo get started, enable the following settings that align with your business\nneeds. While these settings might not be customized to your business model,\ngeography, or cardholder behavior, you can use them as a source of directional\nguidance when using Stripe’s tools. Contact us for support in adjusting these\nthresholds.\n\nOptimize for approval rateBalance approval rate and fraud preventionOptimize for\nfraud preventionVerification dataBlock on `mismatch` valueBlock on `mismatch`\nvalueBlock on `mismatch` and `not_provided` valuesFraud disputability\nlikelihoodNo actionBlock on `very_unlikely` value if fraud is suspectedBlock on\n`very_unlikely` value if fraud is suspectedHigh risk merchant alertsBlock on\n`high` value if fraud is suspectedBlock on `high` valueBlock on `high` valueCard\ntesting riskNo actionBlock on `high` value if fraud is suspectedBlock on\n`elevated` and `high` values if fraud is suspected\nAuthorization signals are currently limited to beta users. You must be an\nIssuing customer to join the beta. To request access to the beta, log in to your\nStripe account and refresh the page. [Contact\nStripe](https://stripe.com/contact/sales) for more information.\n\n## Links\n\n-\n[fraud_disputability_likelihood](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-fraud_disputability_likelihood)\n-\n[risk_assessment.merchant_dispute_risk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-merchant_risk)\n- [merchant dispute\nrisk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-merchant_dispute_risk)\n-\n[risk_assessment.card_testing_risk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-card_testing_risk)\n- [Contact Stripe](https://stripe.com/contact/sales)",
  "metadata": {
    "title": "Authorization signals | Stripe Documentation",
    "description": "Make informed, real-time decisions with authorization signals.",
    "sourceURL": "https://docs.stripe.com/issuing/controls/advanced-fraud-tools/authorization-signals"
  }
}