{
  "content": "# Risk management with Connect\n\n## Learn how Connect can help you manage risk and losses.\n\nAll business owners assume a certain amount of risk when accepting payments for\ngoods and services. This guide defines the risks to consider as a Connect\nplatform owner and the approaches you can take to mitigate those risks.\n\n## Components of payments risk\n\nAny approach to risk management involves many potential sources of payments\nrisk, which can be split into two general categories:\n\n- **Transaction risk**: The risk that a customer might charge back a\ntransaction, such as [disputes](https://docs.stripe.com/disputes) or fraud\nidentified from card testing. With [direct\ncharges](https://docs.stripe.com/connect/direct-charges), transaction risk\nprimarily affects connected accounts; with [destination\ncharges](https://docs.stripe.com/connect/destination-charges) and [separate\ncharges and\ntransfers](https://docs.stripe.com/connect/separate-charges-and-transfers),\ntransaction risk primarily affects platforms.\n- **Merchant risk**: The risk that a connected account is unable or unwilling to\ncover the costs of chargebacks on its transactions, leading to unrecoverable\nnegative balances. Merchant risk primarily affects platforms.\n\nThere are two main types of merchant risk: credit risk and fraud risk. Both can\nresult in chargebacks and unrecoverable negative balances.\n\nTypeDescriptionExamplesCredit riskThe risk that connected accounts are unable to\nfulfill their obligations to their customers, such as failing to deliver orders\ndue to unforeseen supply issues. If a connected account accumulates more refunds\nand chargebacks than it can financially cover, it can result in default.During\nthe COVID pandemic, some hotels and short-term accommodation providers\nrepresented by connected accounts went out of business. As a result, customers\nwho had pre-paid for future stays submitted chargebacks, which were covered by\nthe platforms that processed those payments.Fraud riskThe risk that dishonest\nowners or employees of connected accounts intentionally don’t fulfill their\nobligations to their customers, such as taking orders for unavailable goods and\nservices.- **No intent to deliver**: A fraudulent online storefront charged\ncustomers for goods that they didn’t intend to deliver. The connected account\nthen paid out the money to their external bank account. When the customers\nrealized that their orders were never going to arrive, they submitted\nchargebacks, which were covered by the platform.\n- **Payment method cashing**: A fraudster stole a customer’s credit card number,\nopened a connected account, and made purchases through that account using the\nstolen payment method credentials. When the customer discovered the fraudulent\ncharges, they submitted chargebacks, which were covered by the platform.\n\n## Connect merchant risk options\n\nEach connected account’s Account object has a\n[controller.losses.payments](https://docs.stripe.com/api/accounts/object#account_object-controller-losses-payments)\nproperty that determines who’s [responsible for covering any negative payments\nbalance](https://docs.stripe.com/connect/risk-management) on that account.\n\n#### Note\n\nThe `controller.losses.payments` property applies only to the connected\naccount’s payments balance. It doesn’t affect responsibility for covering\nnegative Issuing or Treasury balances.\n\nYou can select whether you or Stripe is responsible for negative balance\nliabilities on your accounts. Because your choice of negative balance liability\ncan significantly impact your platform and connected accounts, consider it\ncarefully before onboarding any accounts. This table describes some important\nelements of the decision:\n\nStripePlatform[API\nvalue](https://docs.stripe.com/api/accounts/object#account_object-controller-losses-payments)`stripe``application`LossesStripe\ncovers losses due to your connected accounts’ negative balances.Your platform\ncan incur losses due to your connected accounts’ negative balances.Operational\nresponsibilitiesStripe’s risk teams fully manage all payments-related merchant\nrisk.The platform maintains an internal risk team capable of adequately managing\nall payments-related merchant risk.Connected account experienceStripe directly\ncontacts your connected accounts to prevent, mitigate, and resolve payments\nrisk-related issues, and in some cases can take action against them.Your\nplatform has a greater degree of control over the payments risk-related\nexperience of your connected accounts.Stripe feesIf you pay Stripe’s listed\nprices for other fees, we don’t charge additional fees for negative balance\nliability.Stripe charges no additional fees.\nWe recommend that new platforms have Stripe take responsibility for negative\nbalances on connected accounts. Only consider taking responsibility as the\nplatform if you’re highly confident in your ability to manage merchant risk.\n\n## Stripe solutions for risk management\n\nStripe provides a variety of solutions to help manage both transaction and\nmerchant risk. These solutions fall into two categories:\n\n- **Tools to manage risk**: Tools that Stripe provides to help platforms manage\nrisks without Stripe being liable for any resulting losses.\n- **Full service risk management**: Risk-management services that Stripe\nprovides where Stripe covers the costs of any resulting losses.\n\nThis table describes the main solution that Stripe provides in each category for\neach type of risk:\n\nRisk typeTools to manage riskFull service risk managementTransaction\nrisk[Radar](https://docs.stripe.com/radar): Scans every payment to help detect\nand prevent fraud.Merchant riskMerchant risk tooling: Tools that help your risk\nteams prevent, detect, and mitigate risks posed by your connected\naccounts.[Stripe Managed\nRisk](https://docs.stripe.com/connect/risk-management/managed-risk): A\nfull-service solution that protects your platform by managing risk and covering\nany negative balances on your connected accounts.\n## Know Your Customer (KYC) and compliance\n\nIn addition to operational risk management solutions, Stripe provides KYC and\nrisk-based screening to help onboard connected accounts and maintain compliance\nwith evolving regulations. Stripe screens include the following:\n\n- Identity verifications\n- Risk-based KYC and AML checks for individuals and businesses\n- Sanctions screening\n- MATCH (Member Alert To Control High-risk businesses) list checks\n- Secure credit card data tokenization for PCI compliance\n- Money transmitter licenses (MTL) in the US and e-money (EMI) licenses in the\nEU\n- [Prohibited business checks](https://stripe.com/legal/restricted-businesses)\n\n## Links\n\n- [disputes](https://docs.stripe.com/disputes)\n- [direct charges](https://docs.stripe.com/connect/direct-charges)\n- [destination charges](https://docs.stripe.com/connect/destination-charges)\n- [separate charges and\ntransfers](https://docs.stripe.com/connect/separate-charges-and-transfers)\n-\n[controller.losses.payments](https://docs.stripe.com/api/accounts/object#account_object-controller-losses-payments)\n- [responsible for covering any negative payments\nbalance](https://docs.stripe.com/connect/risk-management)\n- [Radar](https://docs.stripe.com/radar)\n- [Stripe Managed\nRisk](https://docs.stripe.com/connect/risk-management/managed-risk)\n- [Prohibited business checks](https://stripe.com/legal/restricted-businesses)",
  "metadata": {
    "title": "Risk management with Connect | Stripe Documentation",
    "description": "Learn how Connect can help you manage risk and losses.",
    "sourceURL": "https://docs.stripe.com/connect/risk-management"
  }
}