{
  "content": "# Flexible payment scenarios\n\n## Support complex payment flows through flexible and customizable acquiring features.\n\nStripe’s payment acquiring features provide the flexibility needed to manage\ncomplex payment scenarios, such as capturing funds as you fulfill shipments or\nincrementing an authorization amount when order details change.\n\nThe functionality highlighted below is available to all users on [IC+\npricing](https://support.stripe.com/questions/understanding-blended-interchange-pricing).\n\n[MulticapturePartially capture a PaymentIntent multiple times, for example when\nprocessing orders with multiple\nshipments.](https://docs.stripe.com/payments/multicapture)[OvercaptureCapture\nmore than the authorized amount of a PaymentIntent, for example when collecting\na tip.](https://docs.stripe.com/payments/overcapture)[Incremental\nauthorizationIncrease the authorized amount of a PaymentIntent before capturing\nit, for example when adding a good or service to an existing\norder.](https://docs.stripe.com/payments/incremental-authorization)[Extended\nauthorizationExtend the time period to capture an authorized PaymentIntent from\n7 to up to 30 days, for example when processing a hotel\nreservation.](https://docs.stripe.com/payments/extended-authorization)[Partial\nauthorizationAuthorize a partial amount of the originally requested amount for a\ncard transaction when the available balance is insufficient to cover the full\namount.](https://docs.stripe.com/payments/partial-authorization)\n\n## Links\n\n- [IC+\npricing](https://support.stripe.com/questions/understanding-blended-interchange-pricing)\n- [MulticapturePartially capture a PaymentIntent multiple times, for example\nwhen processing orders with multiple\nshipments.](https://docs.stripe.com/payments/multicapture)\n- [OvercaptureCapture more than the authorized amount of a PaymentIntent, for\nexample when collecting a tip.](https://docs.stripe.com/payments/overcapture)\n- [Incremental authorizationIncrease the authorized amount of a PaymentIntent\nbefore capturing it, for example when adding a good or service to an existing\norder.](https://docs.stripe.com/payments/incremental-authorization)\n- [Extended authorizationExtend the time period to capture an authorized\nPaymentIntent from 7 to up to 30 days, for example when processing a hotel\nreservation.](https://docs.stripe.com/payments/extended-authorization)\n- [Partial authorizationAuthorize a partial amount of the originally requested\namount for a card transaction when the available balance is insufficient to\ncover the full amount.](https://docs.stripe.com/payments/partial-authorization)",
  "metadata": {
    "title": "Flexible payment scenarios | Stripe Documentation",
    "description": "Support complex payment flows through flexible and customizable acquiring features.",
    "sourceURL": "https://docs.stripe.com/payments/flexible-payments"
  }
}