{
  "content": "# Understanding Connect account balances\n\n## Learn how Stripe account balances work when using Connect.\n\nBoth your platform account and a connected account are still just Stripe\naccounts, each with their own, separate account balance.\n\nAll Stripe accounts can have balances in two states:\n\n- `pending`, meaning the funds are not yet available to pay out\n- `available`, meaning the funds are available to pay out now\n\nWith non-Connect accounts, processing charges increases the Stripe account\nbalance. The charged amount, less any Stripe fees, is initially reflected on the\npending balance, and becomes available on a 2-day rolling basis. (This timing\ncan vary by country and account.) Available funds can be paid out to a bank\naccount or debit card. [Payouts](https://docs.stripe.com/payouts) reduce the\nStripe account balance accordingly.\n\nWith [Connect](https://docs.stripe.com/connect), your platform account and each\nconnected account has its own `pending` and `available` balances. The allocation\nof funds between them depends on [the type of\ncharges](https://docs.stripe.com/connect/charges) that you use.\n\nFurther, a platform account can also have a `connect_reserved` balance, used to\noffset negative balances on connected accounts.\n\n#### Note\n\nWhen you transfer funds between your platform’s balance and a connected\naccount’s balance, Stripe doesn’t automatically retry failures. For example, if\nyou attempt to transfer funds from your platform’s balance to a connected\naccount’s balance, but your platform has insufficient available funds, that\ntransfer attempt fails. If you then add funds to your available balance, they\ndon’t automatically transfer to the connected account’s balance. You must\nexplicitly attempt the transfer again.\n\n## Check a connected account’s balance\n\nTo check the balance of a connected account, perform a [retrieve\nbalance](https://docs.stripe.com/api/balance/balance_retrieve) call\nauthenticated as the connected account. The returned [Balance\nobject](https://docs.stripe.com/api#balance_object) reflects the `pending` and\n`available` balances.\n\n```\ncurl https://api.stripe.com/v1/balance \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -H \"Stripe-Account: {{CONNECTED_ACCOUNT_ID}}\"\n```\n\n## Accounting for negative balances\n\nSome actions, such as refunds and chargebacks, create negative transactions in a\nStripe account. Stripe handles negative transactions to help maintain a positive\nStripe balance for related accounts:\n\n- If at all possible, Stripe automatically offsets negative transactions against\nfuture payments\n- Stripe first assigns negative transactions to the account on which the\nassociated charge was made. For example, when charging on a connected account, a\nrefund or chargeback comes from the connected account. When charging on your\nplatform, a refund or chargeback comes from your platform account.\n\nDespite these measures, if a connected account balance becomes negative,\nultimate responsibility depends on the account’s\n[controller.losses.payments](https://docs.stripe.com/api/accounts/create#create_account-controller-losses-payments)\nproperty:\n\n- `stripe` (Including Standard accounts): The connected account is responsible\nfor covering its own negative Stripe balances.\n- `application` (Including Express and Custom accounts): The platform is\nresponsible for covering the connected account’s negative Stripe balances.\n\nIf a connected account balance is negative, Stripe debits their external account\non file up to the maximum number of attempts allowed. If all attempts fail,\nStripe pauses payouts to and debits from the external account until the external\naccount on file is updated.\n\nWhile an account’s balance is negative, you can’t send payouts to the account’s\nbank or debit card on their behalf. Stripe will resume sending payouts to the\nconnected account when the account’s Stripe balance becomes positive.\n\n### Automatically debit connected accounts\n\nIf Stripe hasn’t already attempted to debit a connected account’s external\naccount for a negative balance, you can allow Stripe to do so by setting\n[debit_negative_balances](https://docs.stripe.com/api/accounts/object#account_object-settings-payouts-debit_negative_balances)\nto true.\n\n#### Caution\n\nStripe can’t correct a negative Stripe account balance using a debit card.\n\nAuto debit for negative balances is supported for banks in the following\ncountries:\n\n- Australia\n- Canada\n- Europe (SEPA countries, which includes the UK)\n- New Zealand\n- United States\n\nSee the [Auto Debit FAQ](https://support.stripe.com/questions/auto-debit-faq)\nfor a detailed breakdown of which countries and account types are supported.\n\nEnabling `debit_negative_balances` triggers debits as needed, even when the\nconnected account is on manual payouts. For more details, see [Impact from\nchargebacks and negative\nbalances](https://docs.stripe.com/connect/risk-management/best-practices#impact-from-chargebacks-and-negative-balances).\n\n## Understanding connected reserve balances\n\nTo protect against negative connected account `available` balances that your\nplatform is responsible for, Stripe holds a reserve on your platform account’s\n`available` balance. Depending on the connected account’s country, Stripe\ninitiates a bank withdrawal on the account’s bank account to cover the [negative\nbalance](https://support.stripe.com/questions/negative-balances-in-stripe-handling-by-country).\nAlthough the `available` balance for the account zeroes out as soon as the\nwithdrawal is posted, the platform reserve for that account is held for an\nadditional 3 business days. You’ll see this reserve reflected in the\n[Dashboard](https://dashboard.stripe.com/test/balance/overview) and exported\nreports (as a **reserve transaction**).\n\nThere are three kinds of balance activities related to reserves:\n\n- Funds reserved to cover a negative balance on a connected account. When a\nconnected account’s balance becomes negative, Stripe temporarily reserves a\nportion of your balance to ensure that funds can be covered by creating a\nbalance transaction with the type `reserve_transaction`.\n- Funds released after a positive balance change on a connected account. When a\nconnected account’s previously negative balance becomes less negative due to\nactivity on that account (for example, through new charges), a corresponding\nportion of your platform’s reserve balance is released through a balance\ntransaction with the type `reserve_transaction`.\n- Funds collected due to a long-standing negative balance on a connected\naccount. When a connected account holds a negative balance amount for 180 days,\nStripe transfers a portion of your balance to zero out that account’s balance by\ncreating a balance transaction with the type `connect_collection_transfer`.\n\nTo see the current reserves held on your account, perform a retrieve balance API\ncall but for your own account (that is, not authorized as another user as in the\nabove).\n\nTo clear a connected account’s negative balance, and thereby remove the reserve\non your account, send a\n[transfer](https://docs.stripe.com/connect/separate-charges-and-transfers) to\nthe applicable account. If a connected account has a negative balance for more\nthan 180 days, Stripe will automatically transfer your reserves to the connected\naccount to zero out the balance. Dashboard pages and reports show these\ntransfers as Connect collection transfers.\n\n#### Caution\n\nAfter a connected account’s balance is cleared through a collection transfer, we\nrecommend that you [reject](https://docs.stripe.com/api#reject_account) the\naccount to prevent future losses.\n\n## Holding funds\n\nIf you need more granular control over scheduling payouts to connected accounts\nwhere your platform is responsible for negative balances, you can take one of\nthe following approaches:\n\n- Hold funds in the platform balance before [transferring them to a connected\naccount balance](https://docs.stripe.com/connect/separate-charges-and-transfers)\n- Hold funds in a connected account’s balance before [paying them\nout](https://docs.stripe.com/connect/manual-payouts) to an external account\n\nWe recommend that platforms hold funds only when there’s a clear purpose and a\ncommitment to transfer them or pay them out when an event occurs or a\nprecondition is satisfied. The typical use case for holding funds is on-demand\nservices platforms, where the marketplace usually waits for the service to be\ncompleted and confirmed before paying out to the service provider (for example,\nrentals, delivery services, and ride-sharing).\n\nPlatforms should refrain from holding funds arbitrarily, and instead pay out to\ntheir connected accounts as soon as they’re identified. This is usually when the\ncharge is made. If you aren’t sure about holding funds, speak with your legal\nadvisor.\n\nFor compliance reasons, we can hold funds in reserve for a period of time that’s\nbased on the merchant’s country, as shown below:\n\nCountryHolding PeriodThailand10 daysUnited States2 yearsAll other countries90\ndays\n## See also\n\n- [Creating Direct Charges](https://docs.stripe.com/connect/direct-charges)\n- [Creating Destination Charges on Your\nPlatform](https://docs.stripe.com/connect/destination-charges)\n- [Creating Separate Charges and\nTransfers](https://docs.stripe.com/connect/separate-charges-and-transfers)\n\n## Links\n\n- [payment\nsource](https://docs.stripe.com/connect/manual-payouts#regular-payouts)\n- [Payouts](https://docs.stripe.com/payouts)\n- [Connect](https://docs.stripe.com/connect)\n- [the type of charges](https://docs.stripe.com/connect/charges)\n- [retrieve balance](https://docs.stripe.com/api/balance/balance_retrieve)\n- [Balance object](https://docs.stripe.com/api#balance_object)\n- [bank account](https://docs.stripe.com/connect/payouts-connected-accounts)\n-\n[controller.losses.payments](https://docs.stripe.com/api/accounts/create#create_account-controller-losses-payments)\n-\n[debit_negative_balances](https://docs.stripe.com/api/accounts/object#account_object-settings-payouts-debit_negative_balances)\n- [Auto Debit FAQ](https://support.stripe.com/questions/auto-debit-faq)\n- [Impact from chargebacks and negative\nbalances](https://docs.stripe.com/connect/risk-management/best-practices#impact-from-chargebacks-and-negative-balances)\n- [negative\nbalance](https://support.stripe.com/questions/negative-balances-in-stripe-handling-by-country)\n- [Dashboard](https://dashboard.stripe.com/test/balance/overview)\n- [transfer](https://docs.stripe.com/connect/separate-charges-and-transfers)\n- [reject](https://docs.stripe.com/api#reject_account)\n- [paying them out](https://docs.stripe.com/connect/manual-payouts)\n- [Creating Direct Charges](https://docs.stripe.com/connect/direct-charges)\n- [Creating Destination Charges on Your\nPlatform](https://docs.stripe.com/connect/destination-charges)",
  "metadata": {
    "title": "Understanding Connect account balances | Stripe Documentation",
    "description": "Learn how Stripe account balances work when using Connect.",
    "sourceURL": "https://docs.stripe.com/connect/account-balances"
  }
}