{
  "content": "# How disputes work\n\n## The lifecycle of payment card disputes.\n\nA dispute occurs when an account owner contacts their bank to contest a payment\nto you for a number of possible\n[reasons](https://docs.stripe.com/disputes/categories). When someone files a\ndispute, the process varies slightly across different card networks, but\ntypically follows this standard pattern:\n\n![Dispute lifecycle\ndiagram](https://b.stripecdn.com/docs-statics-srv/assets/lifecycle.b60ea78efb3b484b36c415a2b71887e3.png)\n\nWhen an account owner disputes a charge to their payment account, Stripe:\n\n- Notifies you of the dispute through the Stripe Dashboard, email,\n[webhooks](https://docs.stripe.com/webhooks), and the API.\n- Debits the disputed amount, plus a dispute fee, from your Stripe account.\n- Provides you with an explanation of the dispute and access to the account\nowner’s claim to their bank.\n- Walks you through the process of submitting convincing evidence to counter the\ndispute.\n\nThroughout this process, Stripe facilitates your case, but doesn’t have\ninfluence over the outcome, which is at the sole discretion of the account\nowner’s bank.\n\n## Before the dispute\n\nSometimes, Stripe alerts you to pre-dispute notifications before an actual\ndispute is filed. Pay attention to these notifications because:\n\n- You might avoid a dispute entirely with proactive customer service and\ntransaction clarification.\n- Failure to respond in the pre-dispute phase can have negative implications in\nthe formal dispute phase.\n\n### Early fraud warnings\n\nEarly fraud warnings (EFWs) are messages sourced from Visa TC40 reports and\nMastercard’s System to Avoid Fraud Effectively (SAFE) reports that card issuers\non these two networks generate to flag payments they suspect might be\nfraudulent. The networks require issuers to report fraud, but that requirement\ndoesn’t affect an issuer’s decision whether to initiate a dispute.\n\nAs with any fraud signal, EFWs don’t require any action or response from you.\nYou can proactively [refund the\ncharge](https://docs.stripe.com/disputes/prevention/best-practices#consider-proactively-refunding-suspicious-payments)\nto prevent the cardholder from initiating a dispute, or you might wait and see\nif a fraud dispute happens. Unless the payment was covered by the [liability\nshift](https://docs.stripe.com/payments/3d-secure/authentication-flow#disputed-payments)\nrule, 80% of EFWs convert into a fraud dispute if you do nothing. If the payment\nwas covered by liability shift, then you might still receive a dispute. In that\ncase, Stripe automatically provides some evidence for you, such as data from [3D\nSecure](https://docs.stripe.com/payments/3d-secure).\n\nAutomatically refunding all EFWs regardless of the likelihood of escalation\nisn’t a good strategy. If you’re too aggressive in issuing refunds for all EFWs,\nyou’ll inevitably refund some transactions that would never have become\ndisputes.\n\nAll other things being equal, our analysis suggests that the optimal point for\nissuing a refund on early fraud warnings is on charges that are roughly less\nthan or equal to your [dispute\nfee](https://docs.stripe.com/disputes/how-disputes-work#dispute-fees). It’s\nlikely not worthwhile to refund EFWs on charges more than 35 percent higher than\nyour dispute fee.\n\nProactively refunding a flagged payment doesn’t affect the fraud warning. The\nonly time a refund can prevent a fraud report is when it’s processed as a\nreversal, which usually happens within 2 hours of the payment capture.\n\nAlthough it’s called an early fraud warning, it’s possible to receive an EFW\neven after you receive a fraud dispute on a charge. This is generally because\nthe systems the networks use to process EFWs are separate from the systems they\nuse to process disputes, and the two aren’t necessarily in sync. Note that you\ncan listen for EFW [webhooks](https://docs.stripe.com/webhooks) using our\n[API](https://docs.stripe.com/api/radar/early_fraud_warnings).\n\n#### Cases where refunding makes more sense\n\nThe main exception to the optimal refund strategy previously described is if you\nhave reason to worry about the effect of the dispute itself on your business or\naccount.\n\nIf any of the conditions described under the [Best practices for preventing\nfraud](https://docs.stripe.com/disputes/prevention/best-practices#consider-proactively-refunding-suspicious-payments)\napply to your situation, it makes sense to more aggressively refund EFWs.\n\n### Inquiries\n\nSome card networks initiate a preliminary phase before creating a formal\ndispute, and [chargeback](https://docs.stripe.com/disputes). Stripe calls this\npreliminary phase an inquiry, though these are sometimes also called a\n“retrieval” or a “request for information.” American Express and Discover are\nthe networks that most often use this phase, while Mastercard and Visa no longer\nuse it. Note that Mexico Domestic charges that are disputed across card brands\nuse inquiries before creating a formal dispute. If left unanswered, some\ndisputes might escalate to unwinnable chargebacks.\n\nDuring the inquiry phase, the cardholder’s bank requests transaction\nclarification, often because the cardholder doesn’t recognize the transaction\ndescription. You can resolve the case without incurring a dispute fee by either:\n\n- Providing satisfactory evidence that answers the [dispute\ntype](https://docs.stripe.com/disputes/categories) for the inquiry\n- Issuing a full refund.\n\nInquiries on partially refunded charges can still escalate to a chargeback.\n\n#### Unwinnable chargebacks\n\nFailing to respond to an inquiry can signal to the issuer your implicit\nacceptance of the claim, resulting in an escalation to a formal, and *likely\nunwinnable*, chargeback. Unless you intend to accept financial liability, always\nrespond to inquiries immediately, making every effort to amicably resolve issues\nwith your customer during this stage.\n\nDashboardAPI\nThe Dashboard payment page describes inquiries as an **inquiry** or **dispute\ninquiry**. In the API events summary, they’re described as a **warning** or\n**dispute warning** to mirror the language in the API.\n\nIf an inquiry remains open for 120 days without escalating to a chargeback,\nStripe marks it as closed in both the Dashboard and API. At this point, the card\nnetwork won’t escalate it. Card networks don’t provide an explicit “win” message\nfor inquiries.\n\n## During the dispute\n\nWhen an account owner files a formal dispute against a payment, whether due to\nan escalated inquiry or for another reason, it initiates a chargeback. During\nthis process:\n\n- The card network pulls the funds for the dispute from your Stripe balance.\n- These funds are held for the entire duration of the dispute.\n- The disputed amount might be the full amount of the charge or a different\namount.\n\nTo learn why the debited amount might differ from the original payment, see\n[disputed\namounts](https://docs.stripe.com/disputes/how-disputes-work#disputed-amount).\n\n### Receive a dispute\n\nThe initiation of a dispute triggers several processes:\n\n- The card network debits Stripe for your disputed payment and related dispute\nfees.\n- Stripe in turn debits your Stripe balance for the disputed amount plus a\ndispute fee.\n- You can’t issue a refund outside the dispute process while the dispute is\nopen.\n- Your [dispute rate](https://docs.stripe.com/disputes/measuring) with that card\nnetwork increases.\n\n### Dispute timing\n\nCard networks typically allow cardholders to initiate disputes within 120 days\nof the original payment, but their rules allow more time in some situations.\nCertain industries, such as travel or event ticketing, are prone to longer\nintervals between the original purchase and a dispute. Generally, when a\ncustomer pays for a future event or service (like a vacation reservation,\nprofessional services appointment, or event ticket), the dispute window starts\non the event date, not the payment date.\n\nAfter a chargeback is created, you have a limited time to respond to the card\nissuer: usually 7-21 days, depending on the card network.\n\nIf you submit evidence, the issuer has a limited time to evaluate it and decide\nthe outcome: usually 60-75 days, depending on the card network.\n\nThe full dispute lifecycle, from initiation to the final decision, can take 2-3\nmonths to complete. You can’t reliably accelerate this timeline, except by\naccepting the dispute in the Dashboard or API.\n\nAt the end of the dispute process, the issuer either:\n\n- Overturns the dispute in your favor:\n\n- The issuer returns the debited chargeback amount to Stripe.\n- Stripe passes this amount back to you.\n- Upholds the dispute in their cardholder’s favor:\n\n- No money moves from your perspective.\n- Stripe has already credited the issuer when they initiated the chargeback.\n- The issuer will return the funds to the cardholder at their discretion, during\nor after this process.\n\n### Dispute fees\n\nThe dispute fees for your country can be found on Stripe’s [Pricing\npage](https://www.stripe.com/pricing). The fee for receiving a dispute is\ndeducted from your account balance when a cardholder initiates a dispute. Note\nthat dispute fees vary based on your business location:\n\n- For businesses outside Mexico, the fee for receiving a dispute is\nnon-refundable.\n- For businesses in Mexico, the fee for receiving a dispute might be returned if\nyou win or the cardholder withdraws.\n- Businesses in the Single Euro Payments Area (SEPA) incur no fee for receiving\na dispute on a card payment processed on the [Cartes Bancaires\nnetwork](https://docs.stripe.com/payments/cartes-bancaires).\n\n### Respond to a dispute\n\nIn most cases, you have the ability to challenge a disputed payment, as long as\nyou submit strong evidence to the card issuer that invalidates the dispute claim\nbefore the deadline.\n\nAs soon as a dispute is active, the only way to overturn it is by *submitting\nevidence in a response*. Even in cases where your customer claims to have\n[withdrawn the dispute](https://docs.stripe.com/disputes/withdrawing), you must\nrespond with evidence for the dispute to be closed in your favor. Submitting\nevidence is what signals to the issuer that you don’t accept the dispute and\nwant to have the funds returned to you.\n\nSee [Respond to disputes](https://docs.stripe.com/disputes/responding) for\ninformation on how to:\n\n- Review the cardholder’s claim.\n- Evaluate whether to accept or challenge the dispute.\n- Gather appropriate evidence to respond to the dispute.\n- Use the Dashboard or API to submit your response.\n\n### Unchallengeable disputes\n\nYou can’t challenge some types of disputes under the rules of the card network\nthey were processed on or due to local regulations. In general, Stripe\nimmediately closes them as lost as soon as we notify you about them, and you\nhave no opportunity to present evidence to the issuer.\n\nDashboardAPI\nThe Dashboard payment page and timeline describes these disputes as those where\nthe card issuer doesn’t allow you to submit evidence.\n\n- [Inquiries](https://docs.stripe.com/disputes/how-disputes-work#inquiries) for\nDiscover cards can turn into unchallengeable disputes if you don’t submit\nevidence for the inquiry.\n- The Cartes Bancaires network requires a higher standard of evidence from the\ncardholder before allowing them to initiate a dispute, but then prohibits you\nfrom challenging the dispute. This affects only businesses in the [Single Euro\nPayments Area (SEPA)](https://en.wikipedia.org/wiki/Single_Euro_Payments_Area)\nprocessing payments on the Cartes Bancaires network, and not businesses\nelsewhere charging cards *issued* by Cartes Bancaires. Learn more at [Cartes\nBancaires](https://docs.stripe.com/payments/cartes-bancaires).\n- Due to local regulations, you can’t challenge disputes submitted for Nigerian\npayment methods.\n\n### Receive multiple disputes\n\nIn extremely rare cases, you might receive more than one dispute per payment.\nThis can happen when a customer files a new dispute with a different reason\ncode, for a new line item in the original transaction, on multi-capture payments\nor simply because the issuer acquired new information about the payment allowing\nthem to refile a dispute.\n\nHandle each dispute the same way as any other dispute; each dispute requires you\nto either accept or counter the dispute. Pay special attention to the outlined\namount, currency, category, and claim details before managing the dispute.\n\n### Disputed amount\n\nA disputed amount might be lower or higher than the amount of the original\ncharge. The following table outlines some of the most common reasons for this\ndifference:\n\nScenarioDescriptionExampleCurrency conversionIf the currency of the payment\nrequires conversion (for example, when the currency of the seller differs from\nthat of the buyer), the conversion rate at the time of the purchase is likely\ndifferent from the rate at dispute initiation, which causes the converted\ndispute amount to differ from the original transaction amount.In January, a\npurchase from a business based in Ireland for 100 EUR by a customer in the\nUnited States converts to a payment on the customer’s USD account of 113.74 USD.\nIn April, the customer disputes the 113.74 USD payment, but the exchange rate\nhas changed, so the 113.74 USD chargeback is now 107.86 EUR to the business\ninstead of the original 100 EUR.Recurring paymentsSometimes, when an account\nowner disputes multiple payments within a recurring subscription plan, their\nbank creates a single dispute for the total amount against one of the charges.\nThis can also happen with non-recurring payments, but is rare.An account owner\ndisputes three 50 USD recurring charges, but the bank issues a dispute of 150\nUSD against one of the three payments.Partial disputesAn account owner disputes\nonly a portion of the total transaction amount.A purchase of multiple products\ncontains a single damaged item, so the account owner files a dispute to be\nreimbursed for only that item.Partially refunded chargesA business partially\nrefunded a payment, but the account owner disputes the entire payment. See our\n[Disputes on partially refunded payments best\npractice](https://docs.stripe.com/disputes/best-practices#partial-refund-bp) for\nmore information about submitting evidence to counter this kind of dispute.An\naccount owner contacts a business directly and the business refunds a portion of\nthe original purchase because one of several items in the purchase is damaged.\nThe account owner then disputes the entire purchase amount.\n## After the decision\n\nAfter you submit your evidence, the next notification from the card issuer to\nboth Stripe and you is the final decision. Stripe updates the status of the\ndispute to `won` or `lost` and notifies you through the Dashboard, email, and\nany other configured communication channels as soon as the issuer makes its\ndecision clear.\n\nThis outcome is final for all parties. You can’t overturn a lost dispute, but\nyour customer also can’t overturn a dispute decided in your favor. It should\nstill be possible, even after a loss, for a customer to change their mind and\n[withdraw the dispute](https://docs.stripe.com/disputes/withdrawing).\n\n#### Arbitration\n\nSome card networks support an arbitration phase for lost disputes that carries a\nsubstantial fee of around 500 USD, but Stripe doesn’t support this dispute\nphase.\n\n## Links\n\n- [reasons](https://docs.stripe.com/disputes/categories)\n- [webhooks](https://docs.stripe.com/webhooks)\n- [refund the\ncharge](https://docs.stripe.com/disputes/prevention/best-practices#consider-proactively-refunding-suspicious-payments)\n- [liability\nshift](https://docs.stripe.com/payments/3d-secure/authentication-flow#disputed-payments)\n- [3D Secure](https://docs.stripe.com/payments/3d-secure)\n- [dispute fee](https://docs.stripe.com/disputes/how-disputes-work#dispute-fees)\n- [API](https://docs.stripe.com/api/radar/early_fraud_warnings)\n- [chargeback](https://docs.stripe.com/disputes)\n- [dispute rate](https://docs.stripe.com/disputes/measuring)\n- [Pricing page](https://www.stripe.com/pricing)\n- [Cartes Bancaires network](https://docs.stripe.com/payments/cartes-bancaires)\n- [withdrawn the dispute](https://docs.stripe.com/disputes/withdrawing)\n- [Respond to disputes](https://docs.stripe.com/disputes/responding)\n- [Single Euro Payments Area\n(SEPA)](https://en.wikipedia.org/wiki/Single_Euro_Payments_Area)\n- [Disputes on partially refunded payments best\npractice](https://docs.stripe.com/disputes/best-practices#partial-refund-bp)",
  "metadata": {
    "title": "How disputes work | Stripe Documentation",
    "description": "The lifecycle of payment card disputes.",
    "sourceURL": "https://docs.stripe.com/disputes/how-disputes-work"
  }
}