{
  "content": "# Stripe Tax FAQ\n\n## Read the frequently asked questions about Stripe Tax.\n\n#### Note\n\nFor additional help navigating indirect tax compliance, check out our [Stripe\nTax guides](https://www.stripe.com/guides/tax-guides).\n\n## Set up\n\n### What tax code should I choose?\n\nStripe has a proprietary tax code system that maps our tax codes to tax codes\nglobally. Choose the category that best represents your business and products,\nand we’ll correctly determine the tax amounts and rules based on customer\nlocation. Consult with your tax advisor to determine the best tax codes for your\nbusiness.\n\n[Learn more about Product Tax Codes](https://docs.stripe.com/tax/tax-codes)\n\n### Do tax codes vary by country?\n\nTax codes, and tax code objects (for example, `txcd_xxx`) within Stripe are\nalways the same across different jurisdictions. However, individual products\nmight have tax treatments that differ by location, and Stripe maintains current\nrate and taxability information for you, while staying up to date with any\nchanging regulations.\n\n### What is the difference between inclusive and exclusive tax?\n\nInclusive tax means you include the tax in the final price, and is common for\nB2C purchases outside the US. Exclusive tax is when you add tax on top of the\nprice you defined, and is common for B2B transactions or B2C transactions in the\nUS.\n\n## Calculating Tax\n\n### Where does Stripe Tax support full “rooftop-accurate” address lookup?\n\nStripe Tax supports full rooftop-accurate address lookup for US customer\naddresses.\n\nRooftop-accurate address lookup means that you can attribute your customer’s\nlocation to a specific house or building. This provides greater accuracy in the\nUS, where two houses located side-by-side on the same street might be subject to\ndifferent tax rates, due to complex jurisdiction boundaries.\n\nOutside the US, we use the country, state, and postal code fields as necessary\nbut we don’t compare the addresses against an address database. See [“Special\njurisdictions and excluded\nterritories”](https://docs.stripe.com/tax/customer-locations#europe-excluded-territories)\nfor more about when the state and postal code are used.\n\n### Do you support PO Box addresses?\n\nYes, Stripe Tax supports PO Box addresses in the US. If we can’t find the\naddress for a PO Box or other address in the address database, we approximate\nthe location using the rest of the address details, such as the postal code (for\nexample, ZIP5).\n\n### How do I know which address was used as my Customer’s tax location?\n\nWhen you enable automatic tax calculation on an\n[invoice](https://docs.stripe.com/api/invoices) or Checkout session, the\nDashboard shows an **Automatic tax** section. This section shows where your\ncustomer was located for tax purposes and which address we used as the source of\nthis location. This is also returned in the [Customer\nAPI](https://docs.stripe.com/api/customers/object#customer_object-tax-location-source)\nif you expand the\n[tax](https://docs.stripe.com/api/customers/object#customer_object-tax) field.\n\n### How do I check how precisely my customer’s location was determined?\n\nWhen you enable automatic tax calculation on an invoice or Checkout session, the\nDashboard shows an **Automatic tax** section. This section shows how precisely\nwe determined your customer’s location. [Customer\nAPI](https://docs.stripe.com/api/customers/object#customer_object-tax) also\nprovides relevant location resolution information if you expand the\n[tax](https://docs.stripe.com/api/customers/object#customer_object-tax) field.\n\nThe table below lists the supported precisions and whether tax can be\ncalculated:\n\nPrecisionTax calculatedDescriptionAddressEverywhereThe address placed the\ncustomer at a known physical address.StreetEverywhereThe address placed the\ncustomer on a known street but didn’t identify a specific physical\naddress.Postal codeEverywhereThe address placed the customer within a postal\ncode area (for example, a ZIP5 or ZIP+4), but didn’t identify a particular\nstreet or address.CityOutside the USThe address placed the customer within a\nparticular city, but didn’t identify a postal code area (for example, a ZIP5) or\nstreet.StateOutside the USThe address had a valid ISO 3166-1 country code and\nISO 3166-2 state code.CountryOutside the USThe address had a valid ISO 3166-1\ncountry code.\n### How reliable and accurate is using an IP address to determine my customer’s location?\n\nIn most cases, we can resolve an IP address to a physical area, but its\nprecision varies and might not reflect the customer’s actual location. For a\ngiven transaction, if we can’t resolve the address to within a postal code, the\ntransaction fails.\n\nIn regions that impose local taxes, such as the US, we don’t recommend relying\non a customer’s IP address to determine their address. In regions that don’t\nimpose local taxes, such as the EU, an IP address is more likely to resolve to\nan accurate address.\n\n### How does Stripe Tax calculate tax for US Military and Diplomatic Overseas addresses?\n\nStripe Tax calculates no tax for US military and diplomatic mail going overseas.\nOverseas military and diplomatic addresses are assigned an APO, FPO, or DPO zip\ncode, and the USPS treats it as domestic mail before transferring it to the\nmilitary. Because sales to these special zip codes are sent out of the country,\ntheir sales taxes don’t apply.\n\n### When are tax calculations recorded in the Stripe Tax exports?\n\nStripe Tax calculates taxes and maintains a record of the total tax collected.\nYou can access the record of total tax collected through [Stripe Tax\nexports](https://docs.stripe.com/tax/reports).\n\nStripe Tax exports include transactions created using [Stripe Tax\nAPI](https://docs.stripe.com/tax/custom) and operations on Stripe objects with\n`automatic_tax[enabled]=true`.\n\n#### Note\n\nWe consider transactions effective on the date they finalize and we don’t\nrecalculate taxes afterwards.\n\nThe following operations *increase* the balance of total tax reported:\n\n- The customer completes a payment in a Checkout Session. This also applies to\nCheckout Sessions created through [Payment\nLinks](https://docs.stripe.com/api/payment_links/payment_links).\n- [Finalizing](https://docs.stripe.com/api/invoices/finalize) an invoice. This\napplies to one-off invoices and recurring (subscription) invoices. [Invoice\nfinalization](https://docs.stripe.com/invoicing/integration/workflow-transitions)\nhappens when the state of the invoice transitions from a `draft` to an `open`\nstate. This transition happens *before* the invoice is paid.\n- Transitioning the state of an invoice from `uncollectible` to `paid` through\nthe [Pay Invoices API](https://docs.stripe.com/api/invoices/pay).\n- [Voiding](https://docs.stripe.com/api/credit_notes/void) a credit note.\n-\n[Creating](https://docs.stripe.com/api/tax/transactions/create_from_calculation)\na tax transaction using the Stripe Tax API.\n\nThe following operations *decrease* the balance of total tax reported:\n\n- [Voiding](https://docs.stripe.com/api/invoices/void) an invoice.\n- [Marking](https://docs.stripe.com/api/invoices/mark_uncollectible) an invoice\nas uncollectible.\n- [Creating](https://docs.stripe.com/api/credit_notes/create) a credit note.\n- [Creating](https://docs.stripe.com/api/refunds) a refund of a charge\nassociated with an invoice or a Checkout Session.\n- [Creating a\nreversal](https://docs.stripe.com/api/tax/transactions/create_reversal) of a tax\ntransaction using the Stripe Tax API.\n\nThe following operations aren’t reflected in Tax reports:\n\n- [Disputes](https://docs.stripe.com/disputes) that are upheld by the\ncardholder’s bank. Stripe Tax doesn’t decrease the balance of the collected\ntotal tax.\n- Refunds of [uncaptured\namounts](https://docs.stripe.com/api/payment_intents/capture#capture_payment_intent-amount_to_capture)\nof a payment. This can happen when performing a [partial\ncapture](https://docs.stripe.com/api/payment_intents/capture#capture_payment_intent-amount_to_capture)\nfor payments of Checkout sessions using\n[capture_method=manual](https://docs.stripe.com/api/checkout/sessions/create#create_checkout_session-payment_intent_data-capture_method).\nWhen the capture amount is lower than the original amount, Stripe Tax doesn’t\nreduce the total balance of the collected tax.\n\n### If I create a draft invoice today, but it’s set to finalize in the future, and the tax rates change in between, which tax rate is used?\n\nStripe calculates the tax at the published rate on the date that an invoice is\nfinalized. For example, if an invoice draft is initialized on December 20th and\nset to finalize on January 15th but a new tax rate is introduced on January 1st,\nthe tax on the invoice will be calculated at the new rate.\n\n- December 1st: Tax Rate: 6\n- December 20th: Invoice draft initialized set to finalize January 15th\n- January 1st: Tax Rate 5\n- January 15th: Invoice finalized with a tax rate of 5\n\n### How do chargebacks work?\n\nA chargeback **doesn’t** reduce the balance of total tax collected.\n\nStripe Tax calculates taxes and maintains a record of the total tax collected.\nYou can access the record of total tax collected through [Stripe Tax\nexports](https://docs.stripe.com/tax/reports).\n\nFor example, for a transaction with an amount of 100 USD and exclusive tax of 10\nUSD, the total tax collected is 10 USD. In the event of a chargeback, we won’t\nreduce Stripe Tax reporting total tax collected from 10 USD to 0 USD.\n\n### How do you handle credit notes?\n\nA credit note **reduces** the balance of total tax collected.\n\nStripe Tax calculates taxes and maintains a record of the total tax collected.\nYou can access the record of total tax collected through [Stripe Tax\nexports](https://docs.stripe.com/tax/reports).\n\nFor example, for an invoice with an amount of 100 USD and exclusive tax of 10\nUSD, the total tax collected is 10 USD. Issuing a credit note that fully refunds\nthe invoice shows as a negative amount in your Stripe Tax reporting, reducing\nyour liability from 10 USD to 0 USD.\n\n### How is tax liability calculated when using credit notes?\n\nApplying credit notes reduces the tax liability of a transaction proportionately\nacross all the items in a basket.\n\nFor example, applying a credit note of 33 USD to an order of 2 items costing 66\nUSD and 33 USD with a 10% tax rate (total 108.90 USD) reduces tax liability by\n2.20 USD and 1.10 USD respectively.\n\n### How is tax liability determined in the case of partial refunds?\n\nIf an order’s total amount is > 0 after a refund, then the remaining amount will\nkeep at least 0.01 USD in tax liability. This is because it uses a cumulative\nremainder approach to deal with rounding.\n\n### How do you handle discounts?\n\nWe apply discounts before tax.\n\nFor example, for an exclusive price of 100 USD, a tax rate of 10%, and a\ndiscount of 10 USD, the resulting values are:\n\n- Amount: 100 USD\n- Discount: 10 USD\n- Post discount amount: 90 USD\n- Tax: 9 USD\n- Total: 99 USD (90 USD + 9 USD)\n\nFor example, for a inclusive price of 100 USD, a tax rate of 10%, and a discount\nof 10 USD the resulting values are:\n\n- Amount: 100 USD\n- Discount: 10 USD\n- Post discount amount: 90 USD\n- Tax: 8.18 USD\n- Total: 90 USD\n\n### Do you mandate two pieces of non conflicting evidence for B2C transactions in Europe?\n\nNo, we don’t mandate two pieces of non conflicting evidence for business to\nconsumer transactions in the EU. However, we do store and retain the evidence\nused on the [Customer](https://docs.stripe.com/api/customers) object that you\ncan review before requesting additional information from a customer after the\ntransaction.\n\n### Are Apple Pay and Google Pay available to use with Stripe Tax?\n\nStripe Tax supports Apple Pay and Google Pay if your customer enters their\nshipping or billing address during the payment process.\n\nIf you enable Apple Pay or Google Pay on your account and enable Stripe Tax on\nyour integration, Stripe:\n\n- Automatically calculates the tax of the customer’s subtotal before they submit\npayment.\n- Enables Apple Pay as a payment option if the user’s browser supports Apple Pay\nversion 12 and above.\n- Enables Google Pay as a payment option to customers only when the user\ncollects the customer’s shipping address information.\n\n### Where does Stripe get its tax rates from?\n\nWe have a team of tax researchers focused on monitoring tax laws and tax\nauthority publications for changes. We make the updates directly to Stripe Tax\nwhen the change is effective.\n\n### In which currency are tax calculations recorded?\n\nTax calculation amounts are recorded in the [presentment\ncurrency](https://docs.stripe.com/currencies#presentment-currencies), which can\ndiffer from both the settlement currency and the tax authority’s local filing\ncurrency.\n\nYou have the option to view amounts in both the presentment and filing\ncurrencies through [Stripe Tax exports](https://docs.stripe.com/tax/reports).\n\n### When do conversions to other currencies occur?\n\nStripe converts tax amounts from the presentment currency to the tax authority’s\nlocal filing currency when we record the tax calculations.\n\n## Reporting and filing\n\n### Does Stripe Tax handle remitting and reporting tax, or filing tax returns?\n\nStripe Tax doesn’t handle remitting and reporting tax, or filing tax returns.\nStripe Tax provides itemized and summarized exports to help users prepare, file,\nand remit the tax that was automatically calculated and collected. For more\ninformation, browse the [Tax Stripe\nApps](https://marketplace.stripe.com/categories/tax) on the App Marketplace.\n\n### How frequently do I need to file returns?\n\nEach jurisdiction determines the required information and frequency for\nreporting and filing taxes. If you’re a business collecting taxes, you must\nreport, file, and remit the taxes collected in every jurisdiction that you’re\nregistered in. Make sure you understand the obligations of each jurisdiction and\nconsult your tax advisor if you need help.\n\n[Learn more about reporting and filing.](https://docs.stripe.com/tax/reports)\n\n### How can I complete my returns myself or with my accountant?\n\nStripe Tax provides [itemized and summarized\nexports](https://docs.stripe.com/tax/reports) to help you complete your returns.\nConsult with your tax advisor if you need help understanding the filing or\nreporting requirements for the jurisdictions where you’re registered.\n\n### How can I remit the funds I collected to each jurisdiction?\n\nEach jurisdiction mandates its own method and timing of remittance (direct\ndebits, bank transfers, and so on). Make sure you understand the rules for each\njurisdiction and consult your tax advisor if you need help. For more\ninformation, browse the [Tax Stripe\nApps](https://marketplace.stripe.com/categories/tax) on the App Marketplace.\n\n## Pricing\n\nStripe Tax pricing is usage-based and determined by the number of transactions\nor the sales volume that you process through Stripe Tax for tax calculation and\ncollection. The pricing varies based on the type of integration you use. No\nmatter which integration you use, you only incur fees for transactions in\njurisdictions where you have an active tax registration. To learn more, visit\nthe [support page on Stripe Tax\npricing](https://support.stripe.com/questions/understanding-stripe-tax-pricing).\n\nCustom pricing is available for companies with large payments volume, high\ntransaction volume, or unique business models. Contact our [sales\nteam](https://stripe.com/contact/sales) to learn more.\n\n### Is there a pricing plan that makes it predictable to pay for Stripe Tax?\n\nStripe has introduced subscription-based pricing in [certain\nareas](https://support.stripe.com/questions/subscription-and-cancellation-terms#:~:text=the%20Stripe%20Dashboard.-,Why%20don%E2%80%99t%20I%20see%20the%20option%20to%20sign%20up%20for%20a%20subscription%2Dbased%20plan%3F,-You%E2%80%99ll%20only%20see)\nwith four tiers, each offering different ranges of entitlements. If you exceed\nthese entitlements, Stripe charges an overage fee based on your usage.\n\nThe default pricing plan is\n[pay-as-you-go](https://support.stripe.com/questions/understanding-stripe-tax-pay-as-you-go-pricing).\n\nLearn more about the available levels at [Stripe Tax\npricing](https://stripe.com/tax/pricing). For details on terms of service and\ncancellation, refer to the [support page on subscription\npricing](https://support.stripe.com/questions/subscription-and-cancellation-terms).\n\n### When do you charge a fee for Stripe Tax?\n\nYou’re only charged for using Stripe Tax on transactions or calculations to\ncustomers in states or countries where you’re registered to collect tax. If the\nregistration options you have selected are either *VAT OSS - European Union* or\n*Small Seller - European Union*, you’re charged on all EU transactions.\n\nAs Stripe Tax is a tax calculation product, we charge a fee when Stripe Tax\ncalculates the tax for a live-mode transaction. It is important to note that\nthis fee is distinct from when a payments transaction is completed, as that fee\nrelates to payments and not calculation. The Stripe Tax fee might apply in cases\nin which the applicable payment isn’t collected or processed, or if a credit\ncard charge is disputed.\n\nBelow are the details of what qualifies as a transaction that triggers a fee for\nStripe Tax.\n\nNo-code/low-code integrationsTax API integrationsConnectSituationStripe Tax fees\nchargedOrigin address and active tax registrations configured in [Stripe Tax\nSettings](https://dashboard.stripe.com/settings/tax).No fee charged on Checkout\nSessions, Subscriptions, and Invoices without `automatic_tax`\nenabled.Subscription created with [automatic_tax\nenabled](https://docs.stripe.com/api/subscriptions/create#create_subscription-automatic_tax-enabled).Fee\ncharged each time the subscription renews and the renewal invoice is finalized,\nif there’s an active tax registration covering the customer jurisdiction at the\ntime.Checkout Session created with [automatic_tax\nenabled](https://docs.stripe.com/api/checkout/sessions/create#create_checkout_session-automatic_tax-enabled),\nin subscription\n[mode](https://docs.stripe.com/api/checkout/sessions/create#create_checkout_session-mode).Fee\ncharged each time the subscription renews and the renewal invoice is finalized,\nif there’s an active tax registration covering the customer jurisdiction at the\ntime.Checkout Session created with [automatic_tax\nenabled](https://docs.stripe.com/api/checkout/sessions/create#create_checkout_session-automatic_tax-enabled),\nin payment\n[mode](https://docs.stripe.com/api/checkout/sessions/create#create_checkout_session-mode).Fee\ncharged when the Checkout Session is completed, if there’s an active tax\nregistration covering the customer jurisdiction at the time.One-off invoice\ncreated with [automatic_tax\nenabled](https://docs.stripe.com/api/invoices/create#create_invoice-automatic_tax),\nand [finalized](https://docs.stripe.com/api/invoices/finalize) even if not paid\nby the customer.Fee charged when the invoice is finalized, if there’s an active\ntax registration covering the customer jurisdiction at the time.A payment is\nrefunded, a credit note is issued, an invoice is voided, or a chargeback is\nreceived.Fee is charged for the initial transaction. No additional fee is\ncharged for refund, credit note, voided invoice, or chargeback.Payment Link\nSession created with [automatic_tax\nenabled](https://docs.stripe.com/api/payment_links/payment_links/create#create_payment_link-automatic_tax),\nin payment mode.Fee is charged when the Payment Link Session is completed, if\nthere’s an active tax registration covering the customer jurisdiction at the\ntime.\n### Do you charge a fee when the tax collected is zero?\n\nYes, we charge the Stripe Tax fee even if the tax amount calculated is zero, for\nexample, if:\n\n- You have an active registration covering the customer jurisdiction\n- The products sold are exempt (from sales tax), out of scope (of VAT), or use\nthe product tax code Non-taxable (`txcd_00000000`)\n- The customer is tax exempt or a reverse charge applies\n- The country or state has no sales tax (for example, Montana in the US)\n\nThe Stripe Tax fee is only charged on that volume where you have an active\nregistration configured in live mode.\n\n### Do you calculate taxes on transactions in markets where I’m not registered?\n\nNo, we don’t charge a fee on transactions in markets where you’re not\nregistered. For markets where you’re not registered to collect tax, the\nresulting tax amount is zero.\n\n### Do you charge a fee for functionality other than calculating tax?\n\nWe don’t charge a fee to:\n\n- Configure your Stripe Tax settings, such as your origin address, preset tax\ncode, or tax registrations\n- Calculate tax on transactions that aren’t completed, such as abandoned\nCheckout Sessions or draft invoices that are never finalized\n- Calculate tax on credit notes\n- Monitor tax thresholds based on your past Stripe payments\n\nTo turn off Stripe Tax calculation (and thus any fees associated), make sure\nyour integration has `automatic_tax[enabled]=false`.\n\n### Do you charge a Stripe Tax fee for credit notes?\n\nWe don’t charge a fee to calculate the tax to refund on credit notes.\n\n### Do you refund the Stripe Tax fee when a payment is refunded or an invoice is voided?\n\nNo, we don’t refund the Stripe Tax fee in these situations.\n\n### Do you charge the Stripe Tax fee on the entire payments volume or only on the payments volume in markets where I’m registered to collect taxes?\n\nWe charge a fee only on transaction volume in locations where you’re registered\nto collect taxes. That means you incur a fee if we calculate tax to be 0 in a\nlocation where you have an active tax registration. We don’t charge you for\nvolume where you’ve no active registration.\n\nWe assess the fee based on the transaction volume **including** the calculated\ntax. Therefore, the transaction volume includes the calculated exclusive tax.\n\n### Do you charge a fee when there is a 100% off discount or coupon?\n\nFor low-code or no-code integrations, such as Stripe Tax on Billing, Invoices,\nSubscriptions, Payment Links, and Checkout, we charge a fee based on volume. We\ndon’t charge a fee if the transaction’s volume is zero.\n\nFor the Stripe Tax API, the fee applies to calls to the API, so that does\ninclude a charge even if the transaction volume is zero.\n\n### Do you charge a fee for Subscription trials?\n\nCreating a Subscription with a trial period creates an immediate zero-amount\nInvoice. We don’t charge a fee for these Invoices because the Invoice’s amount\nis zero.\n\nWhen the Subscription trial ends, it starts a new billing cycle for the Customer\nand generates a new Invoice. After this Invoice finalizes, we charge a fee if\nthe Invoice’s amount is greater than zero.\n\n[Invoice\nfinalization](https://docs.stripe.com/invoicing/integration/workflow-transitions)\nhappens when the Invoice’s state transitions from `draft` to `open`. This\ntransition happens *before* the Invoice is paid.\n\n### Where can I see my Stripe Tax fees?\n\nYou can find Stripe fees under **Balances** > **All activity** in the\n[Dashboard](https://dashboard.stripe.com/balance/all-activity).\n\nIf you have a low code or no code integration, you can find your Stripe Tax fees\nunder **Automatic Taxes: Automatic tax**.\n\nIf you have an [API integration](https://docs.stripe.com/tax/custom), you can\nfind your Stripe Tax fees under **Tax Api Calculation** or **Tax Api\nTransaction**, depending on your usage.\n\n## Integrations\n\n### How to turn off Stripe Tax\n\nYou can stop using Stripe Tax for tax calculations by turning off automatic tax\ncalculation in Tax Settings and setting `automatic_tax[enabled]=false` for API\ntransactions.\n\n### How to stop calculating taxes automatically on a subscription\n\nYou can use the Dashboard UI to remove the automatic calculation of taxes on a\nsubscription. Alternatively, you can [update the\nsubscription](https://docs.stripe.com/api/subscriptions/update) with the API to\nhave `automatic_tax[enabled]=false`.\n\n## Links\n\n- [Stripe Tax guides](https://www.stripe.com/guides/tax-guides)\n- [Learn more about Product Tax Codes](https://docs.stripe.com/tax/tax-codes)\n- [“Special jurisdictions and excluded\nterritories”](https://docs.stripe.com/tax/customer-locations#europe-excluded-territories)\n- [invoice](https://docs.stripe.com/api/invoices)\n- [Customer\nAPI](https://docs.stripe.com/api/customers/object#customer_object-tax-location-source)\n- [tax](https://docs.stripe.com/api/customers/object#customer_object-tax)\n- [Stripe Tax exports](https://docs.stripe.com/tax/reports)\n- [Stripe Tax API](https://docs.stripe.com/tax/custom)\n- [Payment Links](https://docs.stripe.com/api/payment_links/payment_links)\n- [Finalizing](https://docs.stripe.com/api/invoices/finalize)\n- [Invoice\nfinalization](https://docs.stripe.com/invoicing/integration/workflow-transitions)\n- [Pay Invoices API](https://docs.stripe.com/api/invoices/pay)\n- [Voiding](https://docs.stripe.com/api/credit_notes/void)\n-\n[Creating](https://docs.stripe.com/api/tax/transactions/create_from_calculation)\n- [Voiding](https://docs.stripe.com/api/invoices/void)\n- [Marking](https://docs.stripe.com/api/invoices/mark_uncollectible)\n- [Creating](https://docs.stripe.com/api/credit_notes/create)\n- [Creating](https://docs.stripe.com/api/refunds)\n- [Creating a\nreversal](https://docs.stripe.com/api/tax/transactions/create_reversal)\n- [Disputes](https://docs.stripe.com/disputes)\n- [uncaptured\namounts](https://docs.stripe.com/api/payment_intents/capture#capture_payment_intent-amount_to_capture)\n-\n[capture_method=manual](https://docs.stripe.com/api/checkout/sessions/create#create_checkout_session-payment_intent_data-capture_method)\n- [Customer](https://docs.stripe.com/api/customers)\n- [presentment\ncurrency](https://docs.stripe.com/currencies#presentment-currencies)\n- [Tax Stripe Apps](https://marketplace.stripe.com/categories/tax)\n- [support page on Stripe Tax\npricing](https://support.stripe.com/questions/understanding-stripe-tax-pricing)\n- [sales team](https://stripe.com/contact/sales)\n- [certain\nareas](https://support.stripe.com/questions/subscription-and-cancellation-terms#:~:text=the%20Stripe%20Dashboard.-,Why%20don%E2%80%99t%20I%20see%20the%20option%20to%20sign%20up%20for%20a%20subscription%2Dbased%20plan%3F,-You%E2%80%99ll%20only%20see)\n-\n[pay-as-you-go](https://support.stripe.com/questions/understanding-stripe-tax-pay-as-you-go-pricing)\n- [Stripe Tax pricing](https://stripe.com/tax/pricing)\n- [support page on subscription\npricing](https://support.stripe.com/questions/subscription-and-cancellation-terms)\n- [Stripe Tax Settings](https://dashboard.stripe.com/settings/tax)\n- [automatic_tax\nenabled](https://docs.stripe.com/api/subscriptions/create#create_subscription-automatic_tax-enabled)\n- [automatic_tax\nenabled](https://docs.stripe.com/api/checkout/sessions/create#create_checkout_session-automatic_tax-enabled)\n-\n[mode](https://docs.stripe.com/api/checkout/sessions/create#create_checkout_session-mode)\n- [automatic_tax\nenabled](https://docs.stripe.com/api/invoices/create#create_invoice-automatic_tax)\n- [automatic_tax\nenabled](https://docs.stripe.com/api/payment_links/payment_links/create#create_payment_link-automatic_tax)\n- [Dashboard](https://dashboard.stripe.com/balance/all-activity)\n- [update the subscription](https://docs.stripe.com/api/subscriptions/update)",
  "metadata": {
    "title": "Stripe Tax FAQ | Stripe Documentation",
    "description": "Find answers to frequently asked questions about Stripe Tax. Learn how to set up Stripe Tax for tax calculation accuracy, handling of addresses, pricing, reporting, and compliance.",
    "sourceURL": "https://docs.stripe.com/tax/faq"
  }
}