{
  "content": "# Migrate an extension to Stripe Apps\n\n## Learn why and how to migrate your extensions to Stripe Apps.\n\n[Extensions](https://docs.stripe.com/building-extensions) are legacy apps built\non Stripe, available to Stripe users in the [Partner\nDirectory](https://stripe.partners/). Through OAuth and API requests, they bring\npayments data into other business tools, like analytics dashboards or data\nwarehouses.\n\n[Stripe Apps](https://stripe.com/apps) replaces extensions as the preferred way\nto integrate Stripe with other tools. Stripe will redirect users from the\n[Partner Directory](https://stripe.partners/) to discover apps on the [Stripe\nApp Marketplace](https://marketplace.stripe.com/).\n\nAfter May 24, 2022, you can no longer create new extensions. On August 31, 2022,\nStripe will remove all mentions of extensions on the Partner Directory. If you\nown an extension, migrate to Stripe Apps now to ensure continued\ndiscoverability.\n\n## Reasons to migrate\n\nStripe Apps is an upgrade from the current extensions. By migrating, you get the\nfollowing:\n\n- Better discoverability, with broad visibility in the Stripe Dashboard and the\nStripe App Marketplace\n- More granular permissions, so you can set (and your users can understand) what\ndata and APIs an app can access\n- Interactive functionality, with embedded UI components in the Stripe Dashboard\n(so users can interact directly with your app without leaving Stripe)\n- No interruption to your existing extension users if they choose to migrate\n\n### What happens if you don’t migrate\n\nIf you choose not to migrate your extension to a Stripe App, your extension will\ncontinue to work as it does today, without impact to users until 2024. We’ll\ncontinue to support extensions on our backend until the end of 2024. However,\nnew users won’t be able to find any mention of extensions in the [Partner\nDirectory](https://stripe.partners/) starting August 31, 2022.\n\n## Stripe Apps vs. extensions\n\nAn app can do everything an extension does, with two key additions:\n\n- Interactive functionality, using embedded UI components in the Stripe\nDashboard\n- More granular permissions to help users understand what an app can access\n\nThe other difference is that any user can discover apps from the Stripe App\nMarketplace instead of the Partner Directory.\n\nExtensionsStripe AppsAny Stripe user can use.Any Stripe user can use.After\nAugust 31, 2022, Stripe will remove all mentions of extensions from the [Partner\nDirectory](https://stripe.partners/).Discoverable in the [Stripe App\nMarketplace](https://marketplace.stripe.com/), with better visibility to all\nStripe users.You can find your existing extensions in the Dashboard, under\nDevelopers > Extensions.You can find your apps in the Dashboard, under\nDevelopers > [Apps](https://dashboard.stripe.com/apps).Extensions are limited to\neither all read or all write permissions. No support for granular\npermissions.You can request a granular set of permissions from users as part of\napp installation.You can’t create new extensions after May 24, 2022.Any\ndeveloper can build on Stripe’s platform.After users link their Stripe accounts\nto your extension with OAuth, you can make API requests on their behalf.After\nusers authorize and install your app, you can make API requests on their\nbehalf.Users interact with your extension by installing additional tools and\nleaving Stripe.Users can interact with your app within the Stripe UI without\nleaving Stripe.No ability to extend the Stripe UI.You can build directly on top\nof the Stripe UI, starting with the Stripe Dashboard.\n## Impact on your extension’s users\n\nAfter migrating your extension, your existing users will see a badge in their\n[extension settings](https://dashboard.stripe.com/test/extensions) page\nprompting them to re-authenticate. Your users must accept permissions to begin\nusing your migrated app. If they choose not to accept permissions, they can\ncontinue to use their extension uninterrupted until 2024.\n\nMigrating lets you keep your existing extension code on the Stripe account\nyou’re already using. You can’t have both an existing extension and a Stripe app\non the same Stripe account—you can only have either an extension or an app. If\nyou choose to migrate, you must migrate using the Stripe account linked to your\nextension. Using the same Stripe account also ensures continuity in the user\nexperience, and users only need to accept a prompt in the Stripe Dashboard to\nswitch from an extension to your new app.\n\nIf you don’t want to migrate your extension, and you still want to create an\napp, you will encounter several restrictions:\n\n- You must create another Stripe account to publish the app.\n- The app must have a unique and different purpose than your existing\nextension’s service.\n\n## Migrate to Stripe Apps\n\nFollow the steps below to migrate your extension to a Stripe App.\n\n![Steps to migrate an extension to a Stripe\nApp](https://b.stripecdn.com/docs-statics-srv/assets/migrate_to_stripe_app_diagram.a741f6bfbd91e5840e123d581733bca9.png)\n\nMigrating an extension to a Stripe App\n\n## Before you begin\n\n- To protect your extension’s users while you develop your Stripe App,\n[test](https://docs.stripe.com/stripe-apps/test-app) and upload your app with a\nseparate or new Stripe account to fully separate the app’s users from your\nextension’s users.\n- To add an extra layer of safety, create a separate testing instance of your\nbackend. While testing your Stripe app, avoid making changes to the backend code\npowering your live extension.\n- After you have fully tested your Stripe app, upload the app to the same Stripe\naccount that links to your extension to submit for App Review.\n[Create an app\nmanifest](https://docs.stripe.com/stripe-apps/migrate-extension#create-app-manifest)\n[Create an app manifest by creating a Stripe\nApp](https://docs.stripe.com/stripe-apps/create-app).\n\n[Add interactive\nfunctionality](https://docs.stripe.com/stripe-apps/migrate-extension#add-additional-functionality)\nOptionally, you can add interactive functionality in the Stripe Dashboard with\nUI components:\n\n- [Build UI components on your Stripe\nApp](https://docs.stripe.com/stripe-apps/build-ui).\n- [Build a self-hosted backend and authenticate users to your\nbackend](https://docs.stripe.com/stripe-apps/build-backend).\n[Add a webhook\nlistener](https://docs.stripe.com/stripe-apps/migrate-extension#add-a-webhook-listener)\nMake sure your extension can make authenticated requests to Stripe. [Add a\nwebhook\nlistener](https://docs.stripe.com/stripe-apps/build-backend#receiving-events-webhooks)\nfor the `account.application.authorized` event.\n\nEach event for a connected account contains the documented response properties\nin the [event object reference](https://docs.stripe.com/api#events) and a\ntop-level `account` property. The `account` property identifies the unique user\nthe webhook is for:\n\n```\n{\n \"id\": \"evt_\",\n \"livemode\": true,\n \"object\": \"event\",\n \"type\": \"account.application.authorized\",\n \"account\": \"acct_\",\n \"pending_webhooks\": 2,\n \"created\": 1349654313,\n \"data\": {...}\n}\n```\n\nThe user is now connected to your platform. Store the `account` in your\ndatabase—this is the Stripe ID for the new account. You’ll use this value to\n[authenticate](https://docs.stripe.com/connect/authentication) as the connected\naccount by passing it into requests in the `Stripe-Account` header.\n\nFor more information, see [Connect\nwebhooks](https://docs.stripe.com/connect/webhooks).\n\n[Add permissions and upload your\napp](https://docs.stripe.com/stripe-apps/migrate-extension#add-permissions-and-upload)\n[Add permissions to your app manifest and upload your\napp](https://docs.stripe.com/stripe-apps/publish-app). After uploading the app,\nyou can use the permission migration tool on the App Details page to view\nrecommended missing permissions. Administrators of your connected accounts must\naccept these permissions to migrate to your app.\n\n#### Warning\n\nThe permissions model for Stripe Apps will overwrite the global permissions\npreviously accepted by a user that authorized an extension. To ensure your\nexisting users don’t experience permissions related interruptions, you must\nidentify which objects your extension (not your app) calls on the Stripe API to\nknow which permissions to add to your app.\n\nThe migration process between your connected account administrator, Stripe, and\nyour extension looks like:\n\n![migrated app permissions\ndiagram](https://b.stripecdn.com/docs-statics-srv/assets/migrated-app-permissions-diagram.8ed2661a5c4c75477ccd9aa77f02cd13.png)\n\nYou can find the migration tool by navigating to your app on the App Details\npage in the [Dashboard](https://dashboard.stripe.com/apps). The tool exists in\nmultiple locations highlighted below.\n\n![Entry point for permission migration tool for unpublished\napps](https://b.stripecdn.com/docs-statics-srv/assets/permission_tool_entry_point_unpublished.400af30ac4fb84772931a492e8b7edbe.png)\n\nCallout and button for unpublished apps\n\n![Entry point for permission migration tool for published\napps](https://b.stripecdn.com/docs-statics-srv/assets/permission_tool_entry_point_published.1c4da81be36b34728ab23812763573ab.png)\n\nPushed to overflow menu option when app is published\n\nAfter your app passes review and you publish your app, your extension’s users\nmust accept permissions in their Dashboard settings to see and use the migrated\napp. If you [add UI\nextensions](https://docs.stripe.com/stripe-apps/migrate-extension#add-additional-functionality),\nusers get redirected to the Stripe App Marketplace to accept changes instead of\nin the Dashboard.\n\n[Publish your\napp](https://docs.stripe.com/stripe-apps/migrate-extension#publish-app)\n[Submit your app for review and publish it on the Stripe App\nMarketplace](https://docs.stripe.com/stripe-apps/publish-app).\n\nTo increase your chances of passing app review, adhere to Stripe’s:\n\n- [App review\nrequirements](https://docs.stripe.com/stripe-apps/review-requirements)\n- [App listing\nguidelines](https://docs.stripe.com/stripe-apps/listing-guidelines)\n\n#### Caution\n\nWhen you provide test credentials, make sure the account has access to the new\napp installation flow.\n\nYour app **must pass** app review to list it in the Stripe App Marketplace. When\nyou’re ready to publish your app, use the primary Stripe account you use for\nlive mode traffic so that your extension’s users can migrate to your app.\n\n[Onboard\nusers](https://docs.stripe.com/stripe-apps/migrate-extension#onboard-users)\nAfter migration, your existing users must re-authenticate in the Dashboard to\nuse your Stripe app. If they don’t accept the permissions prompt, they can\ncontinue to use your extension uninterrupted until 2024.\n\nYou can onboard *new* users to your Stripe App in two ways:\n\n- You can list your migrated app in the Stripe App Marketplace after migrating\nyour app and passing the app listing requirements. Any Stripe App on the Stripe\nApp Marketplace will be available to install to Stripe account users starting\nlate June 2022.\n- New users can continue to onboard to your extension with OAuth from your\nwebsite. After users accept OAuth authorization and return to the Stripe\nDashboard, Stripe prompts them to use your migrated Stripe App instead. If they\ndecline, users can continue using the extension uninterrupted until 2024.\n\n#### Note\n\nTo avoid onboarding new users with OAuth after you complete the migration, you\ncan remove your OAuth callbacks and redirect new users to your app listing on\nthe Stripe App Marketplace by changing your website’s **Connect with Stripe**\nbutton. If you remove OAuth callbacks, you can’t onboard new users until late\nJune 2022, using the Stripe App Marketplace. If you don’t remove OAuth\ncallbacks, you’re responsible for managing the separate listings and users for\nboth your extension and Stripe App.\n\n## See also\n\n- [Stripe Apps](https://docs.stripe.com/stripe-apps)\n- [Sample apps](https://docs.stripe.com/stripe-apps/sample-apps)\n\n## Links\n\n- [Extensions](https://docs.stripe.com/building-extensions)\n- [Partner Directory](https://stripe.partners)\n- [Stripe Apps](https://stripe.com/apps)\n- [Stripe App Marketplace](https://marketplace.stripe.com)\n- [Apps](https://dashboard.stripe.com/apps)\n- [extension settings](https://dashboard.stripe.com/test/extensions)\n- [test](https://docs.stripe.com/stripe-apps/test-app)\n- [Create an app manifest by creating a Stripe\nApp](https://docs.stripe.com/stripe-apps/create-app)\n- [Build UI components on your Stripe\nApp](https://docs.stripe.com/stripe-apps/build-ui)\n- [Build a self-hosted backend and authenticate users to your\nbackend](https://docs.stripe.com/stripe-apps/build-backend)\n- [Add a webhook\nlistener](https://docs.stripe.com/stripe-apps/build-backend#receiving-events-webhooks)\n- [event object reference](https://docs.stripe.com/api#events)\n- [authenticate](https://docs.stripe.com/connect/authentication)\n- [Connect webhooks](https://docs.stripe.com/connect/webhooks)\n- [Add permissions to your app manifest and upload your\napp](https://docs.stripe.com/stripe-apps/publish-app)\n- [App review\nrequirements](https://docs.stripe.com/stripe-apps/review-requirements)\n- [App listing\nguidelines](https://docs.stripe.com/stripe-apps/listing-guidelines)\n- [Stripe Apps](https://docs.stripe.com/stripe-apps)\n- [Sample apps](https://docs.stripe.com/stripe-apps/sample-apps)",
  "metadata": {
    "title": "Migrate an extension to Stripe Apps | Stripe Documentation",
    "description": "Learn why and how to migrate your extensions to Stripe Apps.",
    "sourceURL": "https://docs.stripe.com/stripe-apps/migrate-extension"
  }
}