{
  "content": "# Fraud insights\n\n## Review fraud trends specific to your business so you can tailor your strategy.\n\nBuilding an effective fraud fighting strategy requires understanding the\nspecific drivers of fraud for your business. If you use [Radar for Fraud\nTeams](https://docs.stripe.com/radar), you can access the\n[Insights](https://dashboard.stripe.com/radar/insights) tab of the Radar page in\nyour Dashboard to:\n\n- Visualize the ratio of fraudulent and legitimate transactions across your\npayments.\n- Identify combinations of Radar attributes that have material impact on your\nfraud rates.\n- Adjust your Radar rules to effectively balance fraud prevention and legitimate\ncustomer conversion.\n\n## Configure your data set\n\nYou can specify the time period analyzed and what types of payment activity\nconstitute fraud to further customize your results.\n\n### Specify the time period\n\nBy default, we display statistics in near real-time for the prior 30 days of\ntransaction history. To see data for a different time period:\n\n- Click the **Date** filter to open the time period editor.\n- Use the dropdown to choose a relative comparator.\n- Depending on the comparator you choose, set the parameters, such as *in the\nlast 1 months* or *between 2/26/2024 and 3/18/2024*.\n- Choose your local time zone or Greenwich Mean Time (UTC).\n- Click **Apply**.\n\n### Configure your fraud definition\n\nClick **Configure** to choose which types of transactions to include as\nfraudulent in your Insights statistics.\n\n- **All fraudulent transactions**: Payments disputed for fraud, reported as\nearly fraud warning (EFW), or refunded as fraud\n- **Only disputes**: Any disputed payment, regardless of\n[category](https://docs.stripe.com/disputes/categories)\n- **Only fraudulent disputes**: Disputed payments in the fraud category\n- **Only early fraud warnings**: Issuer-flagged suspicious payment\n[EFWs](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\n\n## Evaluate your fraud markers\n\nStripe analyzes all the payments for the specified time period, then presents:\n\n- A summary of the total fraudulent and legitimate payments for the time period.\n- A table of the top rule attribute values that suggest a correlation with\nfraud, based on the ratio of fraudulent to legitimate payments.\n\nThe summary and each attribute in the table provide the following statistics:\n\nStatisticDescriptionFraud percentageThe percentage of fraudulent payment volume\nwhere this rule attribute was present.Legitimate percentageThe percentage of\nlegitimate payment volume where this rule attribute was present.Fraud volumeThe\ntotal amount of the fraudulent payments where this rule attribute was\npresent.Legitimate volumeThe total amount of the legitimate payments where this\nrule attribute was present.Fraud countThe total number of fraudulent payments\nwhere this rule attribute was present.Legitimate countThe total number of\nlegitimate payments where this rule attribute was present.\n\n![Personalized fraud indicator\nresults](https://b.stripecdn.com/docs-statics-srv/assets/fraud-insights-indicator-table.9f171b09a9e83d23e6cdb6b83a3fc2a7.png)\n\nPersonalized fraud indicator results\n\n## Use filters to discover high-risk attribute combinations\n\nYou can add any of the attribute values presented as your top fraud indicators\nas a filter. Doing so adjusts the table to show a new set of top attribute\nvalues that corresponded to fraud *in combination with the filtered rule\nattribute value*. Continue applying filters in this way to find a combination of\nrule attribute values that block transactions with the attributes you desire.\n\nFor example, say your top indicator shows that 19% of fraudulent payment volume\nhad Delaware as the billing state. Blocking all payments from Delaware isn’t\nsensible, but to further explore through filters, you might take the following\nsteps:\n\n- Filter on “billing state is Delaware” and identify which other rule attributes\ncorresponded most to fraud when the billing state is Delaware. In this case, you\nfind that 42% of fraudulent payment volume where Delaware is the billing state\nhas a shipping state that isn’t Delaware. That’s only 8% of the total fraudulent\npayment volume, and blocking all payments with billing state Delaware and a\ndifferent shipping state is too aggressive, so you continue.\n- Add “shipping state is not Delaware” as a second filter. Applying both filters\nand looking at the resulting fraudulent payment volume reveals that 75% of it\ninvolves payments of greater than 500 USD. This amounts to 6% of the total\nfraudulent payment volume.\n- Add “payment amount greater than 500 USD” as a third filter. Comparing the\nresults of all three filters to total payment volumes shows 6% of all fraudulent\npayment volume, but only 0.1% of all legitimate payment volume.\n- At this point, you might set up a rule to block payments of over 500 USD that\nhave Delaware as the billing state and a different state for shipping. You can\nexpect that rule to block 6% of fraudulent payment volume and only 0.1% of\nlegitimate payment volume.\n\nAs the example illustrates, you can apply a series of filters to determine a set\nof rule attribute values that together identify a material percentage of\nfraudulent payment volume. When that set also reflects a low percentage of\nlegitimate payment volume, a rule to block those values can effectively reduce\nfraud while having limited impact on legitimate payments.\n\n### Customize filters\n\n![Example chart about the risk score\nattribute](https://b.stripecdn.com/docs-statics-srv/assets/fraud-insights-custom-filter.09750cf1a92546047e0f096bf5585f5b.png)\n\nYou can also create a filter without using the rule attributes presented in the\ntable.\n\n- Click **More filters**.\n- Choose the rule attribute that you want to create a filter for.\n- Depending on the attribute you choose, set the parameters, such as *Risk score\nis greater than 15* or *Card bin is 4242*.\n- Click **Apply**.\n\n## Create a rule\n\nWhen you assemble the set of filters that represent your optimum ratio between\nblocking the most risky transactions without compromising legitimate payments,\nyou can automatically create a rule to prevent payments where all the selected\nattributes exist simultaneously.\n\n- Click **Add block rule** to slide open the rule editor.\n- Check that the rule accurately reflects the attributes you filtered.\n- (Optional) Augment the rule to include other attributes or your own custom\nmetadata, such as product codes or retail locations. Try [Radar\nAssistant](https://docs.stripe.com/radar/rules#how-to-create-effective-rules) to\ngenerate a rule based on your natural language prompts.\n- Click **Test rule**.\n- If necessary, correct any validation errors and retest.\n- On the **Review new rule** page, review how this rule performs against your\nrecent transactions to confirm whether you want to enable it.\n- Click **Add rule** to begin applying this rule to all future transactions.\n\n![Sliding drawer to create a rule from your applied\nfilters](https://b.stripecdn.com/docs-statics-srv/assets/fraud-insights-create-rule.a985df06aaeac7f3d30eb9426922bd8f.png)\n\n## Inspect charts\n\nYou can find visualizations of the attributes identified as your top drivers of\nfraud below the table of your most common fraud indicators. Each chart shows the\npercentages of total fraudulent and legitimate payment volume associated with\ngiven values of the attribute over a [specified time\nperiod](https://docs.stripe.com/radar/analytics/fraud-insights#specify-the-time-period).\n\n#### Note\n\nThe charts represent percentages of total payment volumes, not percentages of\ntotal numbers of payments. As an example, imagine that the **Billing state**\ngraph shows 6% of fraudulent payment volume for Utah. That means the total\namount charged for fraudulent payments with Utah as the billing state is 6% of\nthe total amount charged for all fraudulent payments. It doesn’t indicate that\n6% of all fraudulent payment transactions had Utah as the billing state.\n\nHover over any point in the chart to see additional metrics for both fraudulent\nand legitimate payments associated with that attribute value.\n\n![Example chart about the card count by IP address\nattribute](https://b.stripecdn.com/docs-statics-srv/assets/fraud-insights-chart.f60beaf9b98c5ece9587228c9b23b449.png)\n\nHovering displays additional volume and count metrics.\n\nMetricDescriptionPercentagePercent of payments by volume at the selected\npointVolumeTotal amount charged for payments at the selected pointCountNumber of\npayments at the selected point\n### Change chart attributes\n\nThe charts displayed reflect the [Radar rule\nattributes](https://docs.stripe.com/radar/rules/supported-attributes)\ncorresponding to your top fraud drivers. To generate visualizations for other\nattributes:\n\n- Click **Select attributes**.\n- Scroll through the list or enter keywords in the search bar to find\nattributes.\n- Click an attribute’s card to select or deselect it. Selected attributes\ndisplay a checkmark and the button displays the total number of attributes\nselected.\n- Click **Show x attributes** to generate the charts for your selected\nattributes.\n\n![Radar rule attribute selection\nmodal](https://b.stripecdn.com/docs-statics-srv/assets/fraud-analytics-attribute-selector.686f8b86dbac286e1d030236176134f8.png)\n\nThe Radar rule attribute modal allows you to choose from more than 150\nattributes.\n\n## Links\n\n- [Radar for Fraud Teams](https://docs.stripe.com/radar)\n- [Insights](https://dashboard.stripe.com/radar/insights)\n- [category](https://docs.stripe.com/disputes/categories)\n-\n[EFWs](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\n- [Radar\nAssistant](https://docs.stripe.com/radar/rules#how-to-create-effective-rules)\n- [Radar rule\nattributes](https://docs.stripe.com/radar/rules/supported-attributes)",
  "metadata": {
    "title": "Fraud insights | Stripe Documentation",
    "description": "Review fraud trends specific to your business so you can tailor your strategy.",
    "sourceURL": "https://docs.stripe.com/radar/analytics/fraud-insights"
  }
}