{
  "content": "# Compliant promotional emails\n\n## Follow these best practices to ensure compliant promotional emails.\n\n[Promotional\nemails](https://docs.stripe.com/payments/checkout/promotional-emails-consent)\npromote a product or service (for example, recovery emails, newsletters, or\npromotions) and represent an opportunity to strengthen and expand your\nrelationship with customers. Read through these best practices for enabling\ncompliance, but be aware of laws that restrict your ability to use your\ncustomers’ personal data for promotional content—check with your legal counsel\nif you’re unsure.\n\nPrivacy and marketing laws require companies to notify or gain consent from\ncustomers before sending promotional emails and promptly honor unsubscribe\nrequests.\n\n#### Caution\n\nReview the callouts which may require specific updates to your documentation or\npractices.\n\n## Customer consent\n\nCheckout helps you optimize collection of customer opt-in and opt-out\npermissions.\n\nThe laws around consent to use personal data such as emails to send promotional\nmessages differ by country. For US merchants and customers, laws generally allow\nsending promotional messages as long as you offer an opt-out opportunity and\nhonor any unsubscribe requests that you have received. Many rest of world\njurisdictions require an affirmative consent flow.\n\nWhen you enable promotional emails, Checkout presents a checkbox beneath the\nemail field that reads “Keep me updated with news and personalized offers.” It\ncan be unclear which country’s laws apply to a particular transaction. Because\nof this, Stripe uses logic that considers both the jurisdiction of your Stripe\naccount and the IP address of the customer to determine whether the default is\nfor the checkbox to be checked or unchecked. When our logic determines that\neither your Stripe account or the customer is located in a jurisdiction that\nrequires (or is otherwise advisable to obtain) affirmative consent, by default,\nwe present such customers with the unchecked checkbox.\n\nThis feature can also help you send [abandoned cart or\n“recovery\"](https://docs.stripe.com/payments/checkout/abandoned-carts) emails,\nwhich are encouraging emails sent to customers who almost made a purchase. In\nthe case of recovery emails, you only receive the email addresses of prospective\ncustomers who’ve entered their email addresses into your checkout form and have\ngiven permission to receive promotional emails (that is, the email address is\nvalidated and the checkbox is checked when the checkout session expires). We\nrecommend that you use these emails only for sending recovery emails and limit\ntargeting broader marketing campaigns to customers who have successfully\ncompleted a purchase and provided consent.\n\nIn either case, if the customer notifies you that they don’t want to receive\npromotional content or you have another reason to believe they don’t want their\npersonal data used to send promotional emails, don’t send the emails, despite\nthe permission provided from Checkout.\n\n## Customer unsubscribe requests\n\n#### Caution\n\nEnsure consumers can unsubscribe and requests are promptly honored.\n\nAll promotional emails must include information about the sender and a way for\ncustomers to unsubscribe, and you must promptly honor all unsubscribe requests.\n[Customers](https://docs.stripe.com/api/customers) who have unsubscribed\nshouldn’t receive promotional emails unless they subsequently express consent.\nTo make sure you meet requirements in your jurisdiction, provide customers the\nopportunity to withdraw their consent or unsubscribe to future marketing content\ndirectly from your website or an easily-accessible customer service process. The\nprocess for withdrawing consent should be as easy as providing consent.\n\nIf a customer reaches out to Stripe with a request to delete their personal\ninformation or to stop using it for promotional purposes, Stripe won’t act on\nthat request. Stripe acts as a service provider/processor to you, and will treat\nthese unsubscribe requests like other “data subject requests” that Stripe\nreceives regarding your customers. Stripe will redirect the customer back to you\nto respond to, and honor, their requests.\n\n## Privacy policy update\n\n#### Caution\n\nUpdate your privacy to disclose data collection and usage for promotional\nemails.\n\nAs outlined in our [Terms of Service](https://stripe.com/legal), you must\ndisclose the collection and use of your customers’ data for sending promotional\nemails in your privacy policy or other privacy notices. Because of the limited\nuse rights obtained in this checkbox, you may not use the information provided\nthrough this feature for any purposes beyond sending news and promotional emails\nunless you explicitly obtain those rights outside of this feature in Checkout.\n\nCheckout’s privacy policy, which is linked on every Checkout session, discloses\nthat Stripe collects information solely as a service provider to the merchant\nand isn’t an independent controller of customer data. We recommend that you also\nreview your privacy policy before using this feature. Your privacy policy should\ndisclose to customers all the ways you collect, retain, use, and share data—this\nincludes the data you collect through Checkout from prospective customers who\nvisit your webpage but don’t complete a transaction. It would be advisable to\nalso disclose that you may send them promotional emails based on their opt-in or\nopt-out selection during checkout. See the [Stripe Privacy\nCenter](https://stripe.com/privacy-center/legal) for more information.\n\n## Links\n\n- [Promotional\nemails](https://docs.stripe.com/payments/checkout/promotional-emails-consent)\n- [abandoned cart or\n“recovery\"](https://docs.stripe.com/payments/checkout/abandoned-carts)\n- [Customers](https://docs.stripe.com/api/customers)\n- [Terms of Service](https://stripe.com/legal)\n- [Stripe Privacy Center](https://stripe.com/privacy-center/legal)",
  "metadata": {
    "title": "Compliant promotional emails | Stripe Documentation",
    "description": "Follow these best practices to ensure compliant promotional emails.",
    "sourceURL": "https://docs.stripe.com/payments/checkout/compliant-promotional-emails"
  }
}