{
  "content": "# Treasury fees reportPublic preview\n\n## Analyze Treasury fees at an itemized level.\n\nUse Treasury fee reports to understand Stripe’s approach to the calculation,\napplication, and reporting of fees. You can create and download detailed reports\nin the Dashboard.\n\n## How Stripe assesses Treasury fees\n\n### Administrative Facilitation Fee\n\nStripe pays Treasury users the Administrative Facilitation Fee (“AFF”) on a\nmonthly basis. We compound the fee on a daily basis and use the minimum\navailable balance across all your Treasury financial accounts for that\nparticular day. Financial Accounts with a negative balance don’t accrue any\nfees. The balance is multiplied by: the 50th percentile Effective Federal Funds\nRate (EFFR) published for that day by the [Federal Bank of New\nYork](https://www.newyorkfed.org/markets/reference-rates/effr) and your\nnegotiated Administrative Facilitation Fee Rate Multiplier. For non-business\ndays, we use the previous business day’s EFFR value.\n\nThis methodology is as described in the latest Stripe Treasury standardized fee\nschedule. Your actual methodology might differ based on your negotiated terms\nwith Stripe.\n\nView an example calculation below.\n\nDayEOD Available BalanceEFFRRate MultiplierCalculationDaily Yield for one\nFA120,000 USD4.3392%20000 * (0.0433 * .92)/360 * .51.11 USD222,000\nUSD3.892%22000 * (0.038 * .92)/360 * .51.07 USD315,000 USD3.892%22000 * (0.038 *\n.92)/360 * .50.73 USD\nThe total yield for the 3 days is 1.11 + 1.07 + 0.73 = 2.91 USD.\n\n## Available columns\n\nYou can customize the columns that appear in the reports when you download them\nin the Dashboard. The available columns in each type of report are described\nbelow.\n\n- [Treasury Administrative Facilitation\nFee](https://docs.stripe.com/reports/treasury-fees-reporting#schema-treasury-fees-administrative-facilitation-fee)\n\n### Treasury Administrative Facilitation Fee\n\nAPI report type: `treasury_fees.administrative_facilitation_fee`\n\nColumn nameDefaultDescriptionbalance_amount\nThe single multi-currency balance of the FinancialAccount. Positive values\nrepresent money that belongs to the user while negative values represent funds\nthe user owes.\n\nbalance_currency\nDesignated currency of financial accounts balance. Currently, FinancialAccounts\ncan only carry balances in USD.\n\ndate\nDate associated with Administrative Facilitation Fee earned…\n\neffr_value\nEffective federal funds rate value (50th percentile) used to calculate fee.\nGathered from the [NY\nFED](https://www.newyorkfed.org/markets/reference-rates/effr).\n\nfee\nAmount of Administrative Facilitation fee paid out in user’s currency.\n\nfinancial_account\nUnique identifier of financial account for which Administrative Facilitation Fee\nwas incurred.\n\nmerchant\nUnique identifier of financial account associated with.\n\n## Links\n\n- [Federal Bank of New\nYork](https://www.newyorkfed.org/markets/reference-rates/effr)",
  "metadata": {
    "title": "Treasury fees report | Stripe Documentation",
    "description": "Analyze Treasury fees at an itemized level.",
    "sourceURL": "https://docs.stripe.com/reports/treasury-fees-reporting"
  }
}