{
  "content": "# Receive payouts\n\n## Set up your bank account to receive payouts.\n\nYou receive funds when Stripe (or your platform) makes payouts to your bank\naccount. Payout availability varies depending on your industry and country of\noperation. When you start processing live payments, Stripe typically schedules\nyour initial payout for 7-14 days after you successfully receive your first\npayment. Your first payout might take longer, depending on your industry risk\nlevel and country of operation. Subsequent payouts follow your account’s [payout\nschedule](https://docs.stripe.com/payouts#payout-schedule).\n\nYou can see a comprehensive list of your payouts and the expected dates of\ndeposit into your bank account in the\n[Dashboard](https://dashboard.stripe.com/test/payouts). If you’re a\n[Connect](https://docs.stripe.com/connect) platform, see [Connect\npayouts](https://docs.stripe.com/connect/payouts-connected-accounts).\n\n## Add or update your bank account\n\nYou can update your account details or add a new bank account using the [Payout\nsettings](https://dashboard.stripe.com/account/payouts) in the Dashboard. Based\non your bank’s location, Stripe might require different kinds of account details\nto activate your bank account. You must match the currency of the bank account\nto the currency in your [Payout\nsettings](https://dashboard.stripe.com/account/payouts). Click **Edit** next to\nthe applicable bank account to modify the banking information.\n\nUse the following table to see the required bank details for specific countries:\n\nAlbania (AL)Algeria (DZ)Angola (AO)Antigua and Barbuda (AG)Argentina (AR)Armenia\n(AM)Australia (AU)Austria (AT)Azerbaijan (AZ)Bahamas (BS)Bahrain (BH)Bangladesh\n(BD)Belgium (BE)Benin (BJ)Bhutan (BT)Bolivia (BO)Bosnia and Herzegovina\n(BA)Botswana (BW)Brazil (BR)Brunei (BN)Bulgaria (BG)Cambodia (KH)Canada\n(CA)Chile (CL)Colombia (CO)Costa Rica (CR)Côte d'Ivoire (CI)Croatia (HR)Cyprus\n(CY)Czech Republic (CZ)Denmark (DK)Dominican Republic (DO)Ecuador (EC)Egypt\n(EG)El Salvador (SV)Estonia (EE)Ethiopia (ET)Finland (FI)France (FR)Gabon\n(GA)Gambia (GM)Germany (DE)Ghana (GH)Gibraltar (GI)Greece (GR)Guatemala\n(GT)Guyana (GY)Hong Kong (HK)Hungary (HU)Iceland (IS)India (IN)Indonesia\n(ID)Ireland (IE)Israel (IL)Italy (IT)Jamaica (JM)Japan (JP)Jordan (JO)Kazakhstan\n(KZ)Kenya (KE)Kuwait (KW)Laos (LA)Latvia (LV)Liechtenstein (LI)Lithuania\n(LT)Luxembourg (LU)Macau (MO)Madagascar (MG)Malaysia (MY)Malta (MT)Mauritius\n(MU)Mexico (MX)Moldova (MD)Monaco (MC)Mongolia (MN)Morocco (MA)Mozambique\n(MZ)Namibia (NA)Netherlands (NL)New Zealand (NZ)Niger (NE)Nigeria (NG)North\nMacedonia (MK)Norway (NO)Oman (OM)Pakistan (PK)Panama (PA)Paraguay (PY)Peru\n(PE)Philippines (PH)Poland (PL)Portugal (PT)Qatar (QA)Romania (RO)Rwanda\n(RW)Saint Lucia (LC)Saudi Arabia (SA)San Marino (SM)Senegal (SN)Serbia\n(RS)Singapore (SG)Slovakia (SK)Slovenia (SI)South Africa (ZA)South Korea\n(KR)Spain (ES)Sri Lanka (LK)Sweden (SE)Switzerland (CH)Taiwan (TW)Tanzania\n(TZ)Thailand (TH)Trinidad & Tobago (TT)Tunisia (TN)Türkiye (TR)United Kingdom\n(GB)United States (US)United Arab Emirates (AE)Uruguay (UY)Uzbekistan\n(UZ)Vietnam (VN)Bank account information Example dataRouting Number111000000 (9\ncharacters)Account numberFormat varies by bank\n### Supported bank account types\n\nYou have the flexibility to link various types of bank accounts for your Stripe\npayouts. Supported options include traditional accounts offered by established\nfinancial institutions, including checking and savings accounts. Additionally,\nStripe lets you use virtual bank accounts such as N26, Revolut, Wise, and\nothers. If you’re eligible, you can also use a debit card for [instant\npayouts](https://docs.stripe.com/payouts#instant-payouts).\n\n#### Note\n\nWhile Stripe supports non-standard bank accounts, you might see higher payout\nfailures for these accounts.\n\n### Supported accounts and settlement currencies\n\nIn most cases, bank accounts must be located in the country where the settlement\ncurrency is the official currency. For example, SEK bank accounts must be based\nin Sweden. Stripe also allows you to settle and pay out to banks in select\nadditional currencies, or pay out to non-domestic bank accounts in the local\ncurrency, for a fee. Learn more about [presenting and settling in multiple\ncurrencies](https://docs.stripe.com/payouts/multicurrency-settlement).\n\nAt times, Stripe supports non-primary currencies that don’t incur a fee. See the\nfollowing table for the list of supported free currencies per country:\n\nViewing supported settlement currencies for Stripe accounts in:Albania\n(AL)Algeria (DZ)Angola (AO)Antigua & Barbuda (AG)Argentina (AR)Armenia\n(AM)Australia (AU)Austria (AT)Azerbaijan (AZ)Bahamas (BS)Bahrain (BH)Bangladesh\n(BD)Belgium (BE)Benin (BJ)Bhutan (BT)Bolivia (BO)Bosnia & Herzegovina\n(BA)Botswana (BW)Brazil (BR)Brunei (BN)Bulgaria (BG)Cambodia (KH)Canada\n(CA)Chile (CL)Colombia (CO)Costa Rica (CR)Côte d’Ivoire (CI)Croatia (HR)Cyprus\n(CY)Czech Republic (CZ)Denmark (DK)Dominican Republic (DO)Ecuador (EC)Egypt\n(EG)El Salvador (SV)Estonia (EE)Ethiopia (ET)Finland (FI)France (FR)Gabon\n(GA)Gambia (GM)Germany (DE)Ghana (GH)Gibraltar (GI)Greece (GR)Guatemala\n(GT)Guyana (GY)Hong Kong (HK)Hungary (HU)India (IN)Indonesia (ID)Ireland\n(IE)Israel (IL)Italy (IT)Jamaica (JM)Japan (JP)Jordan (JO)Kazakhstan (KZ)Kenya\n(KE)Kuwait (KW)Laos (LA)Latvia (LV)Liechtenstein (LI)Lithuania (LT)Luxembourg\n(LU)Macao SAR China (MO)Madagascar (MG)Malaysia (MY)Malta (MT)Mauritius\n(MU)Mexico (MX)Moldova (MD)Mongolia (MN)Morocco (MA)Mozambique (MZ)Namibia\n(NA)Netherlands (NL)New Zealand (NZ)Niger (NE)Nigeria (NG)North Macedonia\n(MK)Norway (NO)Oman (OM)Pakistan (PK)Panama (PA)Paraguay (PY)Peru\n(PE)Philippines (PH)Poland (PL)Portugal (PT)Qatar (QA)Romania (RO)Rwanda\n(RW)Saudi Arabia (SA)Senegal (SN)Serbia (RS)Singapore (SG)Slovakia (SK)Slovenia\n(SI)South Africa (ZA)South Korea (KR)Spain (ES)Sri Lanka (LK)St. Lucia\n(LC)Sweden (SE)Switzerland (CH)Taiwan (TW)Tanzania (TZ)Thailand (TH)Trinidad &\nTobago (TT)Tunisia (TN)Turkey (TR)United Arab Emirates (AE)United Kingdom\n(GB)United States (US)Uruguay (UY)Uzbekistan (UZ)Vietnam (VN)Settlement\ncurrencyCan be paid out to banks in these countriesUSDUnited States\nAcquiring fees, where applicable, are based on the settlement currency. You can\nfind these acquiring fees listed out by currency on your country’s pricing page.\n\n### Multiple bank accounts for different settlement currencies\n\nIn some countries, Stripe users can add extra bank accounts to enable\nsettlements and payouts in additional currencies. You can add one bank account\nper supported settlement currency. If you use multiple bank accounts, you must\nselect a default settlement currency, which you can change at any time.\n\nCharges that are\n[presented](https://docs.stripe.com/currencies#presentment-currencies) in any\nenabled settlement currency settle without [currency\nconversion](https://docs.stripe.com/currencies/conversions). However, payments\npresented in a currency that you haven’t configured an additional bank account\nfor automatically convert to your default currency.\n\nFor example, consider a Stripe user in the United Kingdom who has added both GBP\nand USD bank accounts, with GBP selected as the default settlement currency. USD\npayments (where USD is the presentment currency) are automatically paid out to\nthe USD bank account without conversion, whereas payments in all other\ncurrencies are converted into GBP.\n\nYou can manage your bank accounts and default settlement currency by visiting\n[Bank accounts and scheduling](https://dashboard.stripe.com/account/payouts) in\nthe Dashboard.\n\n## Payout schedule\n\nYour payout schedule determines when Stripe sends money to your bank account.\nYou can select your preferred payout schedule during onboarding or update it any\ntime in the Stripe Dashboard.\n\n### Types of payout schedules\n\nThe following payout schedules are available:\n\n- Manual payouts: You choose when to send payouts and how much to transfer.\n- Daily payouts: Stripe automatically transfers your available funds every\nbusiness day.\n- Weekly or monthly payouts: You set a specific day of the week or day of the\nmonth for payouts.\n- Monthly adjustments: If your selected payout day doesn’t exist in a given\nmonth (for example, the 31st in a 30-day month), Stripe moves the payout to the\nlast day of that month.\n- Non-business days: Payouts that are scheduled on weekends or holidays arrive\non the next business day.\n\n### How payout timing works\n\nChoosing a payout schedule doesn’t change how long it takes for your pending\nbalance to become available. It only controls when payouts are sent.\n\nFor example, if your account is set to daily payouts with a 3-business-day\n[payout speed](https://docs.stripe.com/payouts#payout-speed), Stripe pays out\nfunds daily from transactions that were captured three business days earlier.\n\n### Country-specific payout restrictions\n\nSome countries have preset payout schedules due to local regulations:\n\n- Brazil and India: Payouts are always automatic and daily.\n- Japan: Daily payouts aren’t available. The default schedule is weekly\n(Friday).\n- Thailand: The default schedule is daily automatic payouts.\n\nThese restrictions don’t apply if you’re using [Cross-border\npayouts](https://docs.stripe.com/connect/cross-border-payouts).\n\n### Manual payouts\n\nIf you turn off automatic payouts in the\n[Dashboard](https://dashboard.stripe.com/settings/payouts), you must manually\nsend funds to your bank account. You can do this either in the Dashboard or by\n[creating payouts](https://docs.stripe.com/api#create_payout) using the API.\nManual payouts are available in all regions except Brazil and India, where\npayouts are always automatic and daily. In most regions, manual payouts\ntypically take 1-4 business days to arrive in your bank account after initiating\nthe manual payout.\n\nIf your Stripe account that operates in the United Kingdom has a standard [T+3\npayout speed](https://docs.stripe.com/payouts#payout-speed) and you initiate a\nmanual payout during business hours, the funds typically arrive in your bank\naccount on the same business day. This same-day payout is limited to 10 same-day\nmanual payouts per day, with a maximum transaction amount of £1 million each.\nAll other manual payouts typically arrive within 2 business days in your bank\naccount.\n\n```\ncurl https://api.stripe.com/v1/payouts \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d amount=5000 \\\n -d currency=usd\n```\n\n## Payout speed\n\nWhile payout schedule refers to the cadence your funds are paid out on (for\nexample, day of the week), payout speed refers to the amount of time it takes\nfor your funds to become available. The payout speed varies per country and is\ntypically expressed as T+X days. Some payment processors might start “T” from\ntheir internal settlement time, meaning when the funds land in their bank\naccounts.\n\nIn Stripe, “T” refers to the transaction time, which indicates the time of the\noriginal payment confirmation or capture, and the counting starts earlier. If\nyour Stripe account is in a country with a T+3 standard payout speed and you use\na manual payout schedule, your Stripe balance is available for payout within\nthree business days of capturing a payment. However, if you use a daily\nautomatic payout schedule with a T+3 speed, Stripe pays out funds daily from\ntransactions captured 3 business days earlier.\n\nMost banks deposit payouts into your bank account as soon as they receive them,\nthough some might take a few extra days to make them available. The type of\nbusiness and the country you’re in can also affect payout timing.\n\n### Accelerated payout speeds\n\nStripe offers accelerated payout speeds for users and connected accounts where\nStripe manages credit and fraud risk in Europe, the UK, Mexico, and Canada. With\naccelerated payout speeds, funds are available within 3 business days.\n\nUsers become eligible for accelerated payout speeds after meeting certain\ncriteria based on risk and history with Stripe. When you’re eligible, you can\nchoose to opt in or out of accelerated payout speeds in the Dashboard by\nupdating your [Payout settings](https://dashboard.stripe.com/settings/payouts).\nYou remain at the starting 7 calendar day payout speed until you meet the\neligibility criteria. You can [configure\naccounts](https://docs.stripe.com/connect/manage-payout-schedule) where you\nmanage fraud and dispute liability separately. Some high risk industries might\nnot be eligible.\n\n### Delay behavior per account country\n\nAs the platform, you can set\n[delay_days](https://docs.stripe.com/connect/manage-payout-schedule#delay_days)\non your connected accounts. The delay applies as a **business day** or\n**calendar day** delay based on the country of the connected account. The\nfollowing table shows which countries apply the delay by business or calendar\nday.\n\nCountryDelay typeAustralia, India, Japan, Malaysia, New Zealand, Thailand,\nUnited Arab Emirates, United StatesBusiness day (Monday - Friday)Brazil1,\nCanada, Gibraltar, Hong Kong, Liechtenstein, Mexico, Norway, Singapore2,\nSwitzerland, United Kingdom, and supported EU countriesCalendar day (Sunday -\nSaturday)\n1 Delays for Pix, Boleto, debit, and prepaid payouts in Brazil apply in business\ndays.\n\n2 Delays for PayNow in Singapore apply in business days.\n\n### Payout speed by country\n\nUse the following table to determine your country’s payout speed. The initial\npayout speed applies until an account meets eligibility criteria for\n[accelerated\npayouts](https://docs.stripe.com/payouts#accelerated-payout-speeds).\n\n### Country and payout speed\n\n## Minimum payout amounts\n\nThe minimum payout amount depends on the lowest amount we can support with our\nbanking partners. For example, if you’re located in the US and you have less\nthan 1 cent (0.01 of 1 dollar) USD in your Stripe account, you must wait until\nyou accept more payments and increase your balance before you can receive a\npayout. If your available account balance is less than the minimum payout\namount, it remains in your Stripe account until your balance increases.\n\nIf you’re in a supported country, you can use [multi-currency\nsettlement](https://docs.stripe.com/payouts/multicurrency-settlement) to send a\npayout to your local bank accounts in a foreign currency. For example, a French\nuser can now receive a USD payout in their French bank account instead of having\nto pay for multiple currency exchanges.\n\nMinimum payout amounts are typically one base unit of the local currency. See\nthe following collapsed table for a list of countries and their minimum payout\namounts:\n\n### Minimum payout amounts per country\n\n### Cross-border minimum payout amounts\n\n[Minimum amounts for cross-border\npayouts](https://docs.stripe.com/connect/cross-border-payouts/special-requirements#cbp-minimum-payout-amounts)\nare typically one base unit of the recipient account’s local currency, but can\nbe higher. They don’t necessarily match the minimum amounts for regular payouts.\n\n## Negative payouts\n\nEach payout reflects your available account balance at the time it was created.\nIn some cases, you might have a negative account balance. For example, if you\nreceive 100 USD in payments but refund 200 USD of prior payments, your account\nbalance would be -100 USD. If you don’t receive further payments to balance out\nthe negative amount, Stripe creates a payout that *debits* your bank account.\n\nYour bank account must support both credit and debit transactions so that Stripe\ncan perform any required payouts.\n\n## Payout failures\n\nIf your bank account can’t receive a payout for any reason, your bank sends the\nfunds back to us. This returns an error with the [reason for the\nfailure](https://docs.stripe.com/api/payouts/failures). It can take up to 5\nadditional business days for your bank to return the payout and inform us that\nit failed. If this happens, you’re notified by email and in the\n[Dashboard](https://dashboard.stripe.com/test/payouts). To make sure that your\nbank account details are correct, you need to re-enter them if a payout fails.\nAfter you re-enter your bank account details, Stripe attempts to perform the\npayout again at the next scheduled payout interval.\n\n#### Caution\n\nWhen a payout fails, it’s possible that its state initially shows as `paid` but\nthen changes to `failed` (within 5 business days).\n\nMake sure that the bank account information you provide is correct because\nStripe sends the funds using the account information you enter. Therefore, if\nyou provide incorrect information (for example, a mistyped account number or an\nincorrect routing number), Stripe might send payouts to the wrong bank account\nand might not be able to recover the funds.\n\nAny fees or losses that you incur due to incorrect information fall under your\nresponsibility. If your banking details are correct and the payout failure is\nfor other reasons, contact your bank. After you resolve any issues with your\nbank, you can reactivate the payouts by clicking **Resume Payouts**. If you\ndon’t receive a payout from Stripe after clicking **Resume Payouts**, and\nhaven’t received a failure notification within a reasonable time frame, please\n[contact us](https://support.stripe.com/contact).\n\n## Instant Payouts\n\nWith [Instant Payouts](https://docs.stripe.com/payouts/instant-payouts), you can\ninstantly send funds to a supported debit card or bank account. You can request\nInstant Payouts any time, including weekends and holidays, and funds usually\nappear in the associated bank account within 30 minutes. New Stripe users aren’t\nimmediately eligible for Instant Payouts. You can check your\n[eligibility](https://docs.stripe.com/payouts/instant-payouts#eligibility-and-daily-volume-limits)\nin the\n[Dashboard](https://dashboard.stripe.com/payouts/instant_payouts_eligibility).\n\n## Payout fees\n\nStripe doesn’t charge you a fee to initiate normal payouts. However, most\n[non-primary currency\npayouts](https://docs.stripe.com/payouts/multicurrency-settlement), where you\npay out money in a currency other than your Stripe account’s local currency, do\nincur Stripe fees.\n\n## See also\n\n- [Payout reconciliation\nreport](https://docs.stripe.com/reports/payout-reconciliation)\n- [Financial reports](https://docs.stripe.com/reports/select-a-report)\n\n## Links\n\n- [Payouts FAQ](https://support.stripe.com/questions/payouts-faq)\n- [pricing guide](https://www.stripe.com/pricing)\n- [Dashboard](https://dashboard.stripe.com/test/payouts)\n- [Connect](https://docs.stripe.com/connect)\n- [Connect payouts](https://docs.stripe.com/connect/payouts-connected-accounts)\n- [Payout settings](https://dashboard.stripe.com/account/payouts)\n- [presenting and settling in multiple\ncurrencies](https://docs.stripe.com/payouts/multicurrency-settlement)\n- [presented](https://docs.stripe.com/currencies#presentment-currencies)\n- [currency conversion](https://docs.stripe.com/currencies/conversions)\n- [UTC](https://en.wikipedia.org/wiki/Coordinated_Universal_Time)\n- [except for Asia-Pacific (APAC)\nmarkets](https://support.stripe.com/questions/default-start-of-day-for-asia-pacific-%28apac%29-payouts)\n- [Cross-border payouts](https://docs.stripe.com/connect/cross-border-payouts)\n- [Dashboard](https://dashboard.stripe.com/settings/payouts)\n- [creating payouts](https://docs.stripe.com/api#create_payout)\n- [configure accounts](https://docs.stripe.com/connect/manage-payout-schedule)\n-\n[delay_days](https://docs.stripe.com/connect/manage-payout-schedule#delay_days)\n- [Minimum amounts for cross-border\npayouts](https://docs.stripe.com/connect/cross-border-payouts/special-requirements#cbp-minimum-payout-amounts)\n- [reason for the failure](https://docs.stripe.com/api/payouts/failures)\n- [contact us](https://support.stripe.com/contact)\n- [Instant Payouts](https://docs.stripe.com/payouts/instant-payouts)\n-\n[eligibility](https://docs.stripe.com/payouts/instant-payouts#eligibility-and-daily-volume-limits)\n- [Dashboard](https://dashboard.stripe.com/payouts/instant_payouts_eligibility)\n- [Payout reconciliation\nreport](https://docs.stripe.com/reports/payout-reconciliation)\n- [Financial reports](https://docs.stripe.com/reports/select-a-report)",
  "metadata": {
    "title": "Receive payouts | Stripe Documentation",
    "description": "Set up your bank account to receive payouts.",
    "sourceURL": "https://docs.stripe.com/payouts"
  }
}