{
  "content": "# Collect tax in the United States\n\n## Learn how to use Stripe Tax to calculate, collect, and report tax in the US.\n\nBusinesses selling goods and services to customers in the United States (US)\nmight need to collect sales tax. That’s the case even if your business isn’t\nestablished (based) in the US. Tax rates and rules vary by region. You can also\nuse [Stripe to regsiter](https://docs.stripe.com/tax/use-stripe-to-register) on\nyour behalf.\n\n[OptionalRegions in the\nUS](https://docs.stripe.com/tax/supported-countries/united-states#us-states)\n## When to register for tax collection\n\nDifferent rules determine when and how you need to register to collect tax\ndepending on the region. US regions can choose which level and type of activity\nin the region means a business needs to collect tax there. This is called\n*nexus*. A business can have nexus in a region if they have:\n\n- Physical activity, such as having remote employees based there or storing\ninventory in a warehouse.\n- Economic activity, such as an amount or total value of transactions within a\ntime period.\n\nIf you have nexus in a US region, you need to register for a license to collect\ntax on sales to customers in that region.\n\nTo understand the economic nexus thresholds in each region use the [links\nabove](https://docs.stripe.com/tax/supported-countries/united-states#us-states).\nStripe only monitors if you have reached an economic nexus tax threshold for\nsales outside of the region your business is based in. Learn more about\n[economic\nnexus](https://stripe.com/guides/introduction-to-us-sales-tax-and-economic-nexus).\n\nSee [Thresholds](https://dashboard.stripe.com/tax/thresholds) to get insights\nabout your potential tax registration obligations. Stripe also notifies you with\nemail and Dashboard alerts when you need to register to collect tax. Learn more\nabout how the [monitoring tool works](https://docs.stripe.com/tax/monitoring).\n\n## Register to collect tax\n\nEach US state, US territory, and the US capital has its own tax authority. You\nneed to individually register to collect sales tax in each region where you have\nmet the registration requirements. Start by going to the regional tax authority\nwebsite. If you need help finding the right links to register for tax, select a\nregion from the [list\nabove](https://docs.stripe.com/tax/supported-countries/united-states#us-states).\nYou can also use [Stripe to\nregister](https://docs.stripe.com/tax/use-stripe-to-register) on your behalf.\n\nLearn more about [the sales tax registration process in the United\nStates](https://stripe.com/guides/sales-tax-registration-process-us).\n\n### Streamlined Sales and Use Tax Agreement (SSUTA)\n\nThe Streamlined Sales and Use Tax Agreement (SSUTA) was created by a coalition\nof states to help businesses manage their sales and use tax obligations across\nthe United States. Twenty-four US states are members of the SSUTA agreement.\nHowever, individual states can still decide which products and services are\ntaxable in their state. You can learn more and register for sales and use tax\npermits in all SSUTA member states on the [streamlined sales tax registration\nwebsite](https://www.streamlinedsalestax.org/).\n\nAfter you’ve registered with a state, go to\n[Registrations](https://dashboard.stripe.com/tax/registrations?location=us) to\nadd your registrations to Stripe in the Dashboard and start collecting tax on\nyour transactions in that location.\n\n## How we calculate taxes\n\nWhat you sell and where you sell impacts how tax is calculated on your sales.\nDifferent rules apply when your customer is located in the same region as your\nbusiness or located somewhere else.\n\nStripe calculates tax on a transaction taking into account the following\nfactors:\n\n- the location of your business\n- the tax registrations you’ve added to Stripe\n- the location of the buyer\n- the type of the product sold (based on which [product tax\ncode](https://docs.stripe.com/tax/tax-codes) you assigned to your product)\n- the status of the customer (whether they’re an individual or a business)\n\nAs part of the tax calculation process, Stripe collects addresses for both your\nbusiness and customers. We verify these addresses, convert them into\ngeographical coordinates, and match them to the relevant tax jurisdiction\nboundaries. We then use these jurisdictions as input for the tax calculation\nprocess.\n\n### Sales to a customer located outside the state your business is based in\n\nIf your [origin address](https://docs.stripe.com/tax/set-up#origin-address) is\nin the US and is different from the state or territory your customer is located\nin, Stripe always calculates tax based on your customer’s location. This also\napplies if either your origin address or your customer’s location is in the\nDistrict of Columbia while the other is not.\n\n### Sales to a customer located within the same state as your business\n\nIf your [origin address](https://docs.stripe.com/tax/set-up#origin-address) is\nin the US and in the same state or territory as your customer’s state or\nterritory, Stripe generally calculates sales tax based on your customer’s\nlocation. The customer’s location is also used when your origin address and your\ncustomer’s location are both in the District of Columbia.\n\nHowever some states use your origin address instead of the customers location\ndepending on the type of product or service you sell:\n\n- In Arizona, Illinois, Missouri,Pennsylvania, Tennessee, and Virginia, Stripe\napplies tax based on your business location.\n- In California, state, county, and city taxes are based on the origin address,\nwhile district taxes are based on the customer’s location.\n- In Mississippi, Ohio, Texas, and Utah, Stripe applies tax based on the origin\naddress for physical and digital goods. Sales of services are taxed at the\ndestination address.\n\n### Sales to US customers from abroad\n\nIf your origin address is outside the US and you sell goods or services to US\ncustomers, Stripe generally calculates sales tax based on your customer’s\nlocation. However, if you don’t have a tax registration in your customer’s US\nstate, Stripe treats a cross-border sale of goods as a\n[zero-rated](https://docs.stripe.com/tax/zero-tax#exempt-or-zero-rated-products)\nexport in the country of your origin address.\n\n[OptionalSales tax\nholidays](https://docs.stripe.com/tax/supported-countries/united-states#us-sales-tax-holidays)\n## Report and file your taxes\n\nStripe Tax has filing partners—Taxually, Marosa, and Hands-off Sales Tax\n(HOST)—to help automate your tax filing. These partners automatically sync your\ntax transaction data in real time, eliminating the need for manual data entry or\nfile transfers. Learn more about [tax\nfiling](https://docs.stripe.com/tax/filing).\n\nStripe also provides reports of your completed tax transactions. Go to\n[Registrations](https://dashboard.stripe.com/tax/registrations) to access these\nreports. Learn more about [the different types of\nreports](https://docs.stripe.com/tax/reports).\n\n## Marketplace tax liability\n\nA marketplace facilitator is an entity that contracts with third parties to\npromote their sales of property, digital goods and services by performing\nvarious functions to initiate and complete transactions. In the US, marketplace\nfacilitator laws now exist in every state and territory with a sales tax, as\nwell as the District of Columbia. These laws generally require the marketplace\nfacilitator to collect and remit sales tax on behalf of the third-party sellers\nconducting business on the marketplace. As a marketplace facilitator, your\ncompliance obligations, from registration requirements to reporting and filing,\nare determined by the specific laws of each region.\n\n## Links\n\n- [Stripe to regsiter](https://docs.stripe.com/tax/use-stripe-to-register)\n- [links\nabove](https://docs.stripe.com/tax/supported-countries/united-states#us-states)\n- [economic\nnexus](https://stripe.com/guides/introduction-to-us-sales-tax-and-economic-nexus)\n- [Thresholds](https://dashboard.stripe.com/tax/thresholds)\n- [monitoring tool works](https://docs.stripe.com/tax/monitoring)\n- [the sales tax registration process in the United\nStates](https://stripe.com/guides/sales-tax-registration-process-us)\n- [streamlined sales tax registration\nwebsite](https://www.streamlinedsalestax.org/)\n- [Registrations](https://dashboard.stripe.com/tax/registrations?location=us)\n- [product tax code](https://docs.stripe.com/tax/tax-codes)\n- [origin address](https://docs.stripe.com/tax/set-up#origin-address)\n-\n[zero-rated](https://docs.stripe.com/tax/zero-tax#exempt-or-zero-rated-products)\n- [tax filing](https://docs.stripe.com/tax/filing)\n- [Registrations](https://dashboard.stripe.com/tax/registrations)\n- [the different types of reports](https://docs.stripe.com/tax/reports)",
  "metadata": {
    "title": "Collect tax in the United States | Stripe Documentation",
    "description": "Learn how to use Stripe Tax to calculate, collect, and report tax in the US.",
    "sourceURL": "https://docs.stripe.com/tax/supported-countries/united-states"
  }
}