{
  "content": "# Configure readers with a custom splash screen\n\n## Customize the default splash screen for your readers.\n\nA splash screen is the default screen that displays when your reader is ready to\naccept payments. You can set a custom splash screen for these readers in one of\ntwo ways:\n\n- In the Dashboard\n- Using the Configuration API\n\nYou can configure an account default splash screen, which applies to all readers\nin your fleet. You can also configure a custom splash screen for individual\nlocations, which overrides the splash screen configured at the account level.\nLocations without a custom splash screen inherit the account default splash\nscreen.\n\nDashboardAPI\nTo update the splash screen, navigate to the relevant configuration you want to\nchange and edit it. If adding a new configuration, create a new one first.\n\n- Navigate to the [Manage\nlocations](https://dashboard.stripe.com/terminal/locations) page.\n- Find the specific location you want to change.\n- Click the overflow menu () > **Edit configuration**.\n- Click **Edit** or **Override** next to the **Splash screen** icon.\n- Select the reader type (for example, S700, BBPOS WisePOS E) to indicate which\nreader type to apply the splash screen to.- You can’t upload or apply a single\nsplash screen across every reader type.\n- Upload an image to display on your readers. JPG and PNG images must be less\nthan 2MB. GIF images must be less than 4 MB. Each reader has a specific display\nresolution and you must crop your JPG or PNG image to fit those dimensions. GIF\nimages scale automatically.\n- Click **Done**.\n- Apply the configuration changes by clicking **Apply changes** on the\nconfiguration drawer.\n\n#### Note\n\nOnly Stripe S700 and BBPOS WisePOS E readers can use GIF images for the splash\nscreen.\n\n#### Caution\n\nGIF files under 4 MB might still fail to upload. If this occurs, reduce the file\nsize further by manually deleting frames. Try reducing the GIF’s frame count by\n50% until the upload succeeds.\n\nReaderResolution (W x H)Stripe S7001080 x 1920BBPOS WisePOS E720 x 1280Verifone\nP400320 x 480\nAfter uploading, save the changes and apply the configuration. The splash screen\nupdates on the reader within 10 minutes.\n\n## Links\n\n- [Manage locations](https://dashboard.stripe.com/terminal/locations)",
  "metadata": {
    "title": "Configure readers with a custom splash screen | Stripe Documentation",
    "description": "Customize the default splash screen for your readers.",
    "sourceURL": "https://docs.stripe.com/terminal/fleet/splash-screen"
  }
}