{
  "content": "# Collect tax in the United Kingdom\n\n## Learn how to use Stripe Tax to calculate, collect, and report tax in the UK.\n\nIn the United Kingdom (UK), Stripe Tax supports calculation and collection of\n[VAT](https://www.gov.uk/how-vat-works).\n\n## When to register for tax collection\n\nSee [Thresholds](https://dashboard.stripe.com/tax/thresholds) to get insights\nabout your potential tax registration obligations in the United Kingdom. Stripe\nalso notifies you with email and Dashboard alerts when you need to register to\ncollect tax. Learn more about how the [monitoring tool\nworks](https://docs.stripe.com/tax/monitoring).\n\nIf you’re based outside the United Kingdom, you must register in the UK within\n30 days of performing the first taxable transaction there. You’re also liable to\nregister if you have reasonable grounds to believe that you’ll perform taxable\ntransactions within the next 30 days. A taxable transaction is any sale made in\nthe UK that’s neither exempt from VAT nor subject to reverse charge. Taxable\ntransactions include those that are zero-rated for VAT purposes.\n\nFor example, if you’re based in the United States (US) and sell digital services\nto overseas customers, you must register in the UK as soon as you have\nreasonable grounds to believe that a UK customer will purchase your services. If\na UK consumer has already bought your digital services, you must register within\n30 days of performing the sale. However, if you only sell to UK businesses, you\ndon’t need to register because such sales are subject to reverse charge and\ndon’t constitute taxable transactions for UK VAT purposes.\n\nThe HMRC VAT Notice 700/1 [Who should register for\nVAT](https://www.gov.uk/government/publications/vat-notice-7001-should-i-be-registered-for-vat/vat-notice-7001-should-i-be-registered-for-vat#Exempt-supplies)\nprovides more information on registration in the UK.\n\n- **Threshold**: 1 transaction in the UK.\n- **Included transactions**: Any taxable transactions that reverse charge\ndoesn’t apply to.\n\nIf a remote business sells digital services or low-value goods into the UK\nexclusively through online marketplaces that are responsible for collecting tax\non these sales, the seller isn’t required to register for UK VAT. These sales\ndon’t count towards the seller’s registration threshold.\n\n## Register to collect tax\n\nFind more information on how to register for VAT in the United Kingdom on the\ngovernment website:\n\n- [General information about UK VAT](https://www.gov.uk/how-vat-works)\n- [How to register](https://www.gov.uk/register-for-vat)\n\nAfter you’ve registered to collect tax in the United Kingdom, go to\n[Registrations](https://dashboard.stripe.com/tax/registrations?location=gb) to\nadd your registrations to Stripe in the Dashboard. This turns on tax calculation\nand collection in Stripe for your transactions in the United Kingdom.\n\nNote that the [One-Stop Shop (OSS)\nregistrations](https://docs.stripe.com/tax/supported-countries/european-union#outside-eu-businesses-non-union-oss)\ndon’t allow tax calculations in the UK, as the UK is no longer part of the EU.\nUK businesses can register for OSS schemes to collect taxes within the EU.\n\nLearn more about [how to add your\nregistration](https://docs.stripe.com/tax/registering#track-your-registrations-in-the-tax-dashboard)\nin the Dashboard.\n\n## How we calculate taxes\n\nStripe calculates VAT for your transactions in the United Kingdom. Stripe\nassumes most sales to be taxable unless specifically exempted. If you’re a\nremote seller providing digital services to UK customers, UK VAT is typically\ncollected on sales to individuals. Tax isn’t charged on sales to business\ncustomers who provide their VAT identification number.\n\nStripe doesn’t calculate VAT on imported low-value goods that are shipped into\nthe UK in packages valued at 135 GBP or less.\n\nThe United Kingdom has some territories outside the scope of the standard tax\nsystem that have different rules. Stripe won’t calculate tax for customers based\nthere, even if you’ve added a registration for the UK. This applies to the\nfollowing locations:\n\n- British Virgin Islands\n- Channel Islands (Guernsey and Jersey)\n- Falkland Islands\n- Gibraltar\n\nLearn more about how Stripe handles [excluded\nterritories](https://docs.stripe.com/tax/zero-tax?#excluded-territories).\n\nNorthern Ireland applies its own special VAT rules. If you sell goods into\nNorthern Ireland, you have to follow the same rules as other European Union\ncountries. But if you sell services, you have to charge taxes based on the laws\nof the United Kingdom. Stripe Tax doesn’t support sales of goods to Northern\nIreland.\n\n## Report and file your taxes\n\nStripe Tax has filing partners—Taxually, Marosa, and Hands-off Sales Tax\n(HOST)—to help automate your tax filing. These partners automatically sync your\ntax transaction data in real time, eliminating the need for manual data entry or\nfile transfers. Learn more about [tax\nfiling](https://docs.stripe.com/tax/filing).\n\nStripe also provides reports of your completed tax transactions. Go to\n[Registrations](https://dashboard.stripe.com/tax/registrations) to access these\nreports. Learn more about [the different types of\nreports](https://docs.stripe.com/tax/reports).\n\n## Marketplace tax liability\n\nThe UK uses the terms “online marketplace operators” and “digital platform\noperators” to refer to marketplace operators that might have tax collection\nobligations. To qualify as an online marketplace operator, the business must set\nterms or conditions for the sale, process or enable customer payments, or handle\nordering or delivery of the product. A business isn’t considered an online\nmarketplace if it only processes payments, lists or advertises goods, or\nredirects customers to other websites or apps without further involvement in the\nsale.\n\nThe tax collection obligation for marketplace operators typically includes:\n\n- Sales of digital services\n- Sales of goods by remote sellers to UK private individuals when the goods are\nin the UK at the point of sale.\n- Sales of goods to UK private individuals if the goods are imported into the UK\nin packages valued at 135 GBP or less.\n\nMarketplace operators facilitating other types of sales might need to collect\nVAT based on different indicators and contractual arrangements.\n\nA marketplace operator that collects UK VAT on a sale is treated as if it were\nbuying the product from the merchant and selling it to the customer. This\napplies only for VAT purposes and doesn’t change the commercial position where\nthe title to the product passes from the seller to the buyer.\n\n## Links\n\n- [VAT](https://www.gov.uk/how-vat-works)\n- [Thresholds](https://dashboard.stripe.com/tax/thresholds)\n- [monitoring tool works](https://docs.stripe.com/tax/monitoring)\n- [Who should register for\nVAT](https://www.gov.uk/government/publications/vat-notice-7001-should-i-be-registered-for-vat/vat-notice-7001-should-i-be-registered-for-vat#Exempt-supplies)\n- [How to register](https://www.gov.uk/register-for-vat)\n- [Registrations](https://dashboard.stripe.com/tax/registrations?location=gb)\n- [One-Stop Shop (OSS)\nregistrations](https://docs.stripe.com/tax/supported-countries/european-union#outside-eu-businesses-non-union-oss)\n- [how to add your\nregistration](https://docs.stripe.com/tax/registering#track-your-registrations-in-the-tax-dashboard)\n- [excluded\nterritories](https://docs.stripe.com/tax/zero-tax?#excluded-territories)\n- [tax filing](https://docs.stripe.com/tax/filing)\n- [Registrations](https://dashboard.stripe.com/tax/registrations)\n- [the different types of reports](https://docs.stripe.com/tax/reports)",
  "metadata": {
    "title": "Collect tax in the United Kingdom | Stripe Documentation",
    "description": "Learn how to use Stripe Tax to calculate, collect, and report tax in the UK.",
    "sourceURL": "https://docs.stripe.com/tax/supported-countries/europe/united-kingdom"
  }
}