{
  "content": "# Stripe Connector for the Apple App Store\n\n## Manage your revenue recognition in Stripe by importing data from the Apple App Store.\n\nThe [Stripe Connector for the Apple App\nStore](https://docs.stripe.com/stripe-data/import-external-data/connectors/apple-app-store)\nlets you automatically import subscription purchases from the Apple App Store\ninto [Stripe Revenue Recognition](https://docs.stripe.com/revenue-recognition).\n\nThe benefits of using Revenue Recognition for the Apple App Store are:\n\n- **Near real-time availability**: Set up daily, automated imports from the\nApple App Store. This minimizes manual work and reduces corrections at\nmonth-end.\n- **Increased accuracy**: Improve recognition accuracy by considering time zone\ndifferences.\n- **Improved refund treatment**: Associate refunds with original purchases, and\ngenerate more accurate refund journal entries that adjust deferred revenue\ninstead of treating refunds as negative line items.\n- **Audit by subscribers**: Break down numbers on a per subscriber basis to help\nwith audits.\n\n## Get started\n\nTo import data from the Apple App Store, [set up the Stripe Connector for the\nApple App\nStore](https://docs.stripe.com/stripe-data/import-external-data/connectors/apple-app-store).\nIt can take up to 24 hours for your reports to reflect imported data.\n\n### Backfill historical data\n\nWhen you onboard, the connector backfills up to 1 year of historical data.\n\n### Handle Apple transactions previously imported through manual data import\n\nIf you previously imported data from the Apple App Store using the Revenue\nRecognition [data\nimport](https://docs.stripe.com/revenue-recognition/data-import#general-import)\nfeature, you want to avoid double-counting Apple revenue upon switching to the\nautomated connector.\n\nTo migrate from manual data imports to the connector,\n[delete](https://docs.stripe.com/revenue-recognition/data-import/manage-imported-data#transactions-deletion)\nall Apple transactions from the past year that you manually uploaded using data\nimport CSVs. The connector replaces these transactions with the entries it\ngenerates during import.\n\n#### Note\n\nBecause the connector only backfills up to 1 year of historical data, we\nrecommend keeping your data import CSV uploads for Apple transactions that\noccurred more than 1 year ago.\n\n## Examples\n\n### Subscription purchase\n\nA subscriber purchases 1 unit of a News Plan Monthly subscription on December 3.\nThe subscription is valid for 1 month, which means the service period is\nDecember 3 to January 3. The customer pays 32 USD, but the developer receives 31\nUSD.\n\nThe developer proceeds count toward revenue rather than customer price, because\nthe customer price also includes taxes and Apple commissions. Revenue is billed\nand paid in full on December 3. Stripe recognizes most of the revenue in\nDecember, and a smaller portion in January.\n\nAt the end of January, the summary might look like this:\n\nAccountDecemberJanuaryExternal Asset+31Revenue+28+3Deferred Revenue+3-3\n### Subscription refund\n\nA subscriber purchases a 3-month subscription on January 2. The service period\nis January 2 to April 2. The customer pays 91 USD, but the developer receives 90\nUSD. On February 1, the customer receives a full refund.\n\nDuring a full refund:\n\n- The customer receives their money back.\n- Recognized revenue is offset by the refunds in a contra revenue account.\n- The unused portion of the subscription revenue is cleared from the deferred\nrevenue.\n\nThe refund reduces the external assets balance by 90 USD. The customer received\n30 days of service, so you add 30 USD to the external refunds balance. The\nremainder of the deferred revenue–60 USD in this example–is also cleared.\n\nAt the end of April, the summary might look like this:\n\nAccountDecemberJanuaryRevenue+30Deferred Revenue+60-60External\nAsset+90-90External Refunds+30\n### Free trial\n\nStripe doesn’t generate journal entries for free trials.\n\n## Limitations\n\nThe most detailed level of reporting that Stripe can provide is audit by\nsubscriber. We can’t provide an audit by invoice view because the financial\nreports from the Apple App Store don’t include invoice IDs.\n\nStripe also can’t book tax liability and Apple commissions because Apple doesn’t\nprovide this data.\n\n## Audit numbers\n\nTo view account balances for an Apple subscriber:\n\n- Click a number in the [Monthly\nsummary](https://docs.stripe.com/revenue-recognition/reports/monthly-summary)\nsection to view a list of customers. Apple subscribers have names that consist\nsolely of numbers.\n- Click any Apple subscriber to enter the audit view.\n\n## Get answers to your questions about the Stripe Connector for the Apple App Store.\n\nProvide your email address below and our team will be in touch.\n\nCollect EmailSign upRead our [privacy policy](https://stripe.com/privacy).\n\n## Links\n\n- [Stripe Connector for the Apple App\nStore](https://docs.stripe.com/stripe-data/import-external-data/connectors/apple-app-store)\n- [Stripe Revenue Recognition](https://docs.stripe.com/revenue-recognition)\n- [data\nimport](https://docs.stripe.com/revenue-recognition/data-import#general-import)\n-\n[delete](https://docs.stripe.com/revenue-recognition/data-import/manage-imported-data#transactions-deletion)\n- [Monthly\nsummary](https://docs.stripe.com/revenue-recognition/reports/monthly-summary)\n- [privacy policy](https://stripe.com/privacy)",
  "metadata": {
    "title": "Stripe Connector for the Apple App Store | Stripe Documentation",
    "description": "Manage your revenue recognition in Stripe by importing data from the Apple App Store.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/data-import/apple-app-store"
  }
}