{
  "content": "# Revenue Recognition settings\n\n## Learn how to adjust the behavior of Revenue Recognition with settings.\n\nAccess the Revenue Recognition settings on the [settings\npage](https://dashboard.stripe.com/settings/revenue-recognition) to customize\nhow revenue is recognized specifically for your business.\n\nWhen completed, all Revenue Recognition charts and reports reflect the settings\nwithin 24 hours.\n\n## Accounting period\n\nUse accounting period control to configure how to close accounting periods. You\ncan either manually close the books with all checks and adjustments finished\neach month, or you can let Stripe automate closing the books.\n\nYou can also reopen past accounting periods using accounting period control.\nThis is useful when you first start using Revenue Recognition because it allows\nyou to make adjustments to past data without creating corrections in the current\nperiod. For example, when you apply\n[rules](https://docs.stripe.com/revenue-recognition/rules) to fit Revenue\nRecognition with your own business model, it changes the history of closed\naccounting periods. You can decide to reopen closed accounting periods or make\nadjustments in the current accounting period.\n\n## Amortization granularity\n\nAmortization refers to the process of gradually recognizing revenue over the\nduration of a service period. By default, Revenue Recognition recognizes revenue\nby the millisecond. We also support recognizing revenue by the day, or by the\nmonth with different treatment options for handling the first and last months of\nthe service period.\n\nAmortizationDescriptionsBy millisecond (default)Recognize revenue down to the\nmillisecond.By dayRecognize revenue down to the day. Cut off the last day.By\nmonth evenlyRecognize revenue down to the month. Cut off the last month.By month\nevenly, first and last month proratedRecognize revenue down to the month.\nProrate the amounts in the first and last months by millisecond.\nAdjusting this configuration affects all of your journal entries within Revenue\nRecognition. If you want to avoid creating corrections in the current period, we\nrecommend that you [open all accounting\nperiods](https://docs.stripe.com/revenue-recognition/revenue-settings/accounting-period-control)\nprior to the adjustment.\n\n## Catch-up revenue\n\nRevenue Recognition primarily recognizes revenue based on the service period\nattached to transactions. However, when the service period begins before the\nbooked date (the finalization date for an invoice, the creation date or imported\nbooked date for a standalone charge), the revenue from the prior periods is\ninstead recognized entirely in the month of the booked date to avoid making\nchanges to the past. We refer to this type of revenue as *catch-up* revenue.\n\nTo disable or enable this behavior, toggle **Apply catch-up revenue**.\n\nToggling this configuration affects any applicable journal entries you have\nwithin Revenue Recognition. If you want to avoid creating corrections in the\ncurrent period, we recommend that you [open all accounting\nperiods](https://docs.stripe.com/revenue-recognition/revenue-settings/accounting-period-control)\nprior to the adjustment.\n\n## See also\n\n-\n[Examples](https://docs.stripe.com/revenue-recognition/revenue-settings/examples)\n\n## Links\n\n- [settings page](https://dashboard.stripe.com/settings/revenue-recognition)\n- [rules](https://docs.stripe.com/revenue-recognition/rules)\n- [open all accounting\nperiods](https://docs.stripe.com/revenue-recognition/revenue-settings/accounting-period-control)\n-\n[Examples](https://docs.stripe.com/revenue-recognition/revenue-settings/examples)",
  "metadata": {
    "title": "Revenue Recognition settings | Stripe Documentation",
    "description": "Learn how to adjust the behavior of Revenue Recognition with settings.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/revenue-settings"
  }
}