{
  "content": "# What's new for tax year 2023\n\n## Learn about new features available for Connect platforms and marketplaces filing 1099s with Stripe.\n\nFor tax year 2023, Stripe is introducing features that help Connect platforms\nefficiently and accurately meet their 1099 tax reporting obligations for\n[Custom](https://docs.stripe.com/connect/custom-accounts) and\n[Express](https://docs.stripe.com/connect/express-accounts) US-based accounts.\nThe 2023 tax year features help platforms comply with their 1099 tax reporting\nobligations at scale.\n\n#### Note\n\nStripe delivers 1099 forms to Standard accounts through the Stripe Dashboard.\n\n## Early access to editable tax forms\n\nStarting in August, you can access preliminary 2023 tax forms and associated tax\nreporting features directly from your Stripe Connect Dashboard. Your team needs\neither Administrator or Tax analyst [user\npermissions](https://docs.stripe.com/get-started/account/teams) to get started.\n\nAlong with early access to tax forms, you can start editing tax forms right\naway, as opposed to waiting to make edits in January. You can do so for\nindividual tax forms or in bulk by importing a CSV file.\n\n## Improved state ID collection\n\nIn our platform onboarding flow for tax year 2023, we clarified the strict ID\nrequirements for filing in two states: Delaware and Pennsylvania. If you intend\nto file in either of these states, include your state IDs during this step to\nprevent possible rejection of your filings.\n\n## Create and update tax forms\n\nStripe provides several features to help you [create and update tax\nforms](https://docs.stripe.com/connect/modify-tax-forms).\n\n### Deltas\n\nImporting tax forms using **Delta** allows you to add to (or subtract from) the\nvalues on the initial tax form totals from Stripe. This lets you report just the\ntotals of transactions that happened outside of Stripe. You don’t need to sum\nthe values from Stripe with external values—instead, you only need to provide\nthe delta amounts and Stripe does the rest. This is particularly useful if you\nhave multiple payout mechanisms or reimbursements on Stripe connected accounts\nfor activity that happened outside of Stripe.\n\n![Add deltas to a tax form through CSV\nimports](https://b.stripecdn.com/docs-statics-srv/assets/deltas-tax-form-2023.1955229634d237c2dded771a26dede66.png)\n\n### Zero dollar tax forms\n\nPlatforms can generate tax forms for a Stripe account ID, even when it hasn’t\nreceived any payouts in 2023. If your connected account doesn’t already have a\ntax form, performing **Update** imports (to override form values supplied by\nStripe) or **Delta** imports (to make incremental changes to form values\nsupplied by Stripe) automatically creates the form.\n\n![Update a tax form through CSV\nimports](https://b.stripecdn.com/docs-statics-srv/assets/update-tax-form-2023.3ee26a28748bfa00607ba5db863ec3dc.png)\n\n### Standalone tax forms\n\nYou can create standalone tax forms for accounts that might not be a connected\naccount (for example, accounts from a different provider). You can create them\nseamlessly by using a **Create** import with a CSV file containing the data of\nthe form you want to generate. You must include all columns except for `form_id`\nand `stripe_account_id`. E-delivery isn’t available for standalone forms (only\npostal mailing is allowed for delivery).\n\n![Create a tax form through CSV\nimports](https://b.stripecdn.com/docs-statics-srv/assets/create-tax-form-2023.57be1986e99960197e157a73bb2a89aa.png)\n\n### Increased CSV import and export speed\n\nIf you’re using CSV imports to create or modify tax forms, we’ve increased the\nspeed of CSV imports and exports by up to *10 times* the speed of previous\nyears.\n\n## Improved splitting and grouping of forms\n\nYou can use pre-filing splits and improved TIN aggregation to reduce the amount\nof overhead for filing taxes.\n\n### Pre-filing splits\n\nYou can now [split tax forms](https://docs.stripe.com/connect/split-tax-forms)\nto handle account ownership changes before filing the forms. Splitting a 1099\ntax form means that you distribute the amount initially reported on a single\n1099 form across two 1099 forms. Previously, you could only split tax forms\npost-filing, meaning you might have needed to file the wrong tax forms and then\ncorrect them. Now, after January 1, you can do so before filing from the 1099\nDashboard.\n\n![Pre-filing\nsplits](https://b.stripecdn.com/docs-statics-srv/assets/pre-file-spits-2023.c93202c5520f7be4de8a00cfff2cc264.png)\n\n### Improved TIN aggregation of tax forms\n\nForms that share the same TIN get their totals aggregated to determine filing\neligibility at all times, even when the platform updates the tax form totals or\nidentity data. When there are multiple forms with the same TIN, we aggregate the\ntotals from each form with a maximum of 100 other forms. However, if forms of\ndifferent types share the same TIN, we might not aggregate them. In these cases,\ncheck your filing eligibility and apply an override if necessary. To simplify\nfinding other forms grouped with a particular form, use the **Forms grouped\nwith** filter.\n\n![Form aggregation\nfilter](https://b.stripecdn.com/docs-statics-srv/assets/form-agg-filter-2023.a13264f451ac25e0b6ebee27a6915306.png)\n\n## Form Delivery Improvements\n\nYou can use the Dashboard to track delivery status and Stripe outreach emails,\nand to address missing emails.\n\n### Delivery status visibility\n\nYou can now view both postal delivery and e-delivery statuses directly in the\n1099 Dashboard. You can also\n[filter](https://docs.stripe.com/connect/get-started-tax-reporting#view-and-filter-tax-forms)\nfor both statuses. Previously, we only showed a combined delivery status, which\nreported the best result between the e-delivery and postal delivery status. With\nthe combined status, if one of the forms was successfully delivered (but not the\nother) it showed a status of `delivered`. In other words, if e-delivery was\nsuccessful and postal delivery was unsuccessful, the combined status was\n`delivered`. Going forward, you can track the individual status for each of the\nforms you deliver.\n\n![New dashboard statuses and filters for delivery and\noutreach](https://b.stripecdn.com/docs-statics-srv/assets/new-statuses-2023.25eb0f5aecc794bef2ac9ada37c0b05d.png)\n\n### Tracking Stripe outreach\n\nIf your platform opts for e-delivery through Stripe Express and enables the\ncollection of tax information in advance using 1099 tax form settings, Stripe\nsends emails to the connected accounts on behalf of platforms. We do this to\nconfirm their tax information and provide e-delivery consent through Stripe\nExpress. You can now track the status of that outreach directly in the 1099\nDashboard, and use the `Pre-filing confirmation status` filter. The status is\neither `ineligible`, `queued`, `sent`, or `not sent`.\n\n### Addressing missing emails\n\n[For e-delivery with Stripe\nExpress](https://docs.stripe.com/connect/deliver-tax-forms#e-delivery-with-stripe-express),\nthe connected account owner must be able to receive the email from Stripe\ninviting them to create their account. Stripe can’t electronically deliver the\nforms without the email address for the account. If you’ve opted in to paper\ndelivery, we send paper forms (assuming we have a valid delivery address). You\ncan now filter for any accounts with missing emails and add them to allow\ne-delivery. Any emails added by the following methods will result in updating\nthe email on the connected account, which will carry over each year.\n\n- Use the\n[Update](https://docs.stripe.com/api/accounts/update#update_account-email) API.\n- Use the CSV import functionality on the [Emails\npage](https://dashboard.stripe.com/settings/connect/emails) in the Dashboard.\nNew\n- Edit the email addresses in the *Payee Details* section in the 1099 dashboard.\nNew\n\nYou can no longer update email addresses using the email_address field in a CSV\nimport directly into the 1099 product. Changes made using this method don’t\ncarry over each year.\n\n### Send Stripe pre-filing confirmation invites\n\nPlatforms who enable e-delivery can choose to have Stripe collect identity\ninformation and paperless delivery consent directly from their connected\naccounts through pre-filing confirmation. This email invites your user to Stripe\nExpress. If you need to send a one-off pre-filing confirmation email (for\nexample, your user didn’t receive one since they had the wrong email on file),\nyou can now do it from the 1099 dashboard. [Learn\nmore](https://docs.stripe.com/connect/express-dashboard-taxes#my-connected-account-did-not-receive-a-pre-filing-confirmation-email)\nabout how to resolve issues related to your user not receiving a pre-filing\nconfirmation email.\n\n### Reset account claim attempts\n\nConnected accounts must claim their Stripe accounts to view the Tax Center in\nthe Express dashboard. To authorize the claim, Stripe asks the user a series of\nquestions to verify their identity. For security reasons, if the user fails to\ncorrectly answer the verification questions too many times, Stripe locks their\naccount. You can now see the status in the 1099 dashboard, and you can reset\nyour user’s claim attempts directly in the 1099 Dashboard. [Learn\nmore](https://docs.stripe.com/connect/express-dashboard-taxes#my-connected-account-was-locked-out-of-their-stripe-express-account-for-failing-the-verification-process.-how-can-i-resolve-this-issue)\nabout how you can use these new features to self-resolve account claim issues.\n\n## Links\n\n- [Custom](https://docs.stripe.com/connect/custom-accounts)\n- [Express](https://docs.stripe.com/connect/express-accounts)\n- [user permissions](https://docs.stripe.com/get-started/account/teams)\n- [create and update tax\nforms](https://docs.stripe.com/connect/modify-tax-forms)\n- [split tax forms](https://docs.stripe.com/connect/split-tax-forms)\n-\n[filter](https://docs.stripe.com/connect/get-started-tax-reporting#view-and-filter-tax-forms)\n- [For e-delivery with Stripe\nExpress](https://docs.stripe.com/connect/deliver-tax-forms#e-delivery-with-stripe-express)\n- [Update](https://docs.stripe.com/api/accounts/update#update_account-email)\n- [Emails page](https://dashboard.stripe.com/settings/connect/emails)\n- [Learn\nmore](https://docs.stripe.com/connect/express-dashboard-taxes#my-connected-account-did-not-receive-a-pre-filing-confirmation-email)\n- [Learn\nmore](https://docs.stripe.com/connect/express-dashboard-taxes#my-connected-account-was-locked-out-of-their-stripe-express-account-for-failing-the-verification-process.-how-can-i-resolve-this-issue)",
  "metadata": {
    "title": "What's new for tax year 2023 | Stripe Documentation",
    "description": "Learn about new features available for Connect platforms and marketplaces filing 1099s with Stripe.",
    "sourceURL": "https://docs.stripe.com/connect/tax/whats-new-2023"
  }
}