{
  "content": "# Strong Customer Authentication (SCA) exemptions\n\n## Use SCA exemptions and Data Only to reduce cardholder friction on eligible transactions.\n\n**Applicability:** EEA, Switzerland, and UK\n\nStripe’s Authentication Engine requests applicable [SCA\nexemptions](https://stripe.com/guides/strong-customer-authentication#exemptions-to-strong-customer-authentication)\non your behalf to reduce cardholder friction, while meeting [SCA\nrequirements](https://docs.stripe.com/strong-customer-authentication). Users of\n[Adaptive Acceptance](https://stripe.com/in/payments/authorization) get access\nto a premium Authentication Engine that further enhances performance using\nmachine learning, which includes Transaction Risk Analysis (TRA) exemptions up\nto 250 EUR (220 GBP) and Data Only flows.\n\n#### Note\n\nWhen the customer’s bank approves an exemption request, liability shift for\nfraudulent transactions doesn’t apply.\n\nStripe’s Authentication Engine currently supports the following SCA exemptions:\n\nSCA ExemptionDescriptionLow ValueApplies to transaction amounts less than 30 EUR\n(25 GBP). However, SCA might still be required by the issuer for low value\ntransactions when either of the following scenarios are met:- The cumulative\namount for transactions initiated by the cardholder since SCA was last performed\nexceeds 100 EUR (85 GBP).\n- The cardholder has initiated five transactions since SCA was last performed.\n\nTransaction Risk Analysis (TRA) or Low Risk Exemption\n\nA payment provider (such as Stripe) can perform real-time risk analysis to\ndetermine whether a transaction warrants SCA. This permission is subject to the\npayment provider’s overall fraud rates for card payments in relevant markets\nstaying below the following thresholds:\n\n- 0.13% to exempt transactions up to 100 EUR (85 GBP)\n- 0.06% to exempt transactions up to 250 EUR (220 GBP)\n- 0.01% to exempt transactions up to 500 EUR (440 GBP)\n\nLocal equivalent amounts for these thresholds apply where relevant. See\n[Stripe’s current threshold limits for\nTRA](https://docs.stripe.com/payments/3d-secure/strong-customer-authentication-exemptions#stripe-tra-limits)\nfor more on Stripe’s current TRA exemption availability.\n\nMerchant-initiated transactions (including variable subscriptions)Payments made\nwith saved cards when the customer isn’t present in the checkout flow (sometimes\ncalled “off-session”) might qualify as merchant-initiated transactions (MITs).\nThese payments technically fall outside the scope of SCA. In practice, marking a\npayment as MIT is similar to requesting an exemption; neither a customer\nchallenge nor a liability shift occurs. To use merchant-initiated transactions,\nyou authenticate the card when it’s being saved. You must also secure agreement\nfrom the customer (through a mandate) to charge their card at a later point. The\n[Stripe API](https://docs.stripe.com/payments/more-payment-scenarios) lets you\nauthenticate a card when it’s being saved for later use and mark subsequent\npayments as MITs.\n## Stripe’s Transaction Risk Analysis (TRA) limits\n\nStripe’s Authentication Engine uses comprehensive, real-time risk assessment\nthat allows us to support this exemption for our users. The exemption limit\navailable for you depends on Stripe’s overall fraud rates and your access to\nStripe’s authentication offerings, including [Adaptive\nAcceptance](https://stripe.com/in/payments/authorization). Currently:\n\n- UK and Swiss merchants have access to TRA exemptions for qualifying low risk\ntransactions up to 220 GBP.\n- EEA merchants have access to TRA exemptions for qualifying low risk\ntransactions up to 250 EUR.\n\n## Data Only\n\nData Only is a form of authentication supported by some card schemes that\nleverages 3D Secure (3DS) data. The Data Only flow sends the authentication\nrequest to the card network, who includes its own risk data in the authorization\nmessage, before sending it to the issuer. Successful Data Only requests offer a\nfrictionless experience that improves approval rates for payments that aren’t\nsubject to SCA.\n\n#### Note\n\nBecause we don’t send an authentication request to the issuer in a Data Only\nflow, no liability shift occurs for the business.\n\nThe standard Data Only flow requires 3DS version 2.2 or later. Mastercard has\nits own Data Only product, Mastercard Identity Check Insights, which Stripe\ncurrently offers to [Adaptive\nAcceptance](https://stripe.com/in/payments/authorization) users in EEA and UK\nonly. Instead of sending a transaction straight to authorization, Stripe’s\nML-based Authentication Engine uses the Data Only flow to improve conversion or\noptimize costs for certain transactions. Handling these requests requires no\nfurther action from businesses.\n\n## Links\n\n- [SCA\nexemptions](https://stripe.com/guides/strong-customer-authentication#exemptions-to-strong-customer-authentication)\n- [SCA requirements](https://docs.stripe.com/strong-customer-authentication)\n- [Adaptive Acceptance](https://stripe.com/in/payments/authorization)\n- [Stripe API](https://docs.stripe.com/payments/more-payment-scenarios)",
  "metadata": {
    "title": "Strong Customer Authentication (SCA) exemptions | Stripe Documentation",
    "description": "Use SCA exemptions and Data Only to reduce cardholder friction on eligible transactions.",
    "sourceURL": "https://docs.stripe.com/payments/3d-secure/strong-customer-authentication-exemptions"
  }
}