{
  "content": "# Single sign-on (SSO)Public preview\n\n## Configure authentication for access to the Stripe Dashboard with an Identity Provider.\n\nSingle Sign-On (SSO) allows your team to sign in through an Identity Provider\n(IdP) using one set of credentials and access multiple applications, such as\nStripe. Enabling SSO for your team increases security and makes it easier for\nthem to sign in to Stripe. Stripe specifically supports Security Assertion\nMarkup Language (SAML) 2.0, so your IdP can manage the creation of user accounts\n(team members) as well as authentication and authorization during sign-in. Any\nidentity provider that supports SAML 2.0 works with Stripe.\n\n#### Security incidents\n\nIf your Identity Provider (IdP) is compromised, unauthorized parties could\naccess your Stripe account. You’re responsible for mitigating your exposure to\nsecurity incidents by evaluating your security needs and implementing the\nnecessary security protocols and controls.\n\n## Setup SSO with an Identity Provider\n\n[Auth0Learn how to setup single sign-on in the Dashboard with\nAuth0.](https://docs.stripe.com/get-started/account/sso/v2/auth0)[Entra IDLearn\nhow to setup single sign-on in the Dashboard with Entra ID (formerly known as\nAzure AD).](https://docs.stripe.com/get-started/account/sso/entra-id)[Google\nWorkspaceLearn how to setup single sign-on in the Dashboard with Google\nWorkspace.](https://docs.stripe.com/get-started/account/sso/google-workspace)[OktaLearn\nhow to setup single sign-on in the Dashboard with\nOkta.](https://docs.stripe.com/get-started/account/sso/okta)[OneLoginLearn how\nto setup single sign-on in the Dashboard with\nOneLogin.](https://docs.stripe.com/get-started/account/sso/onelogin)[OtherLearn\nhow to setup single sign-on in the Dashboard with a different identity\nprovider.](https://docs.stripe.com/get-started/account/sso/other)\n## Additional resources\n\n[Consolidate SSOLearn how to consolidate single sign-on (SSO) settings across\nmultiple\naccounts.](https://docs.stripe.com/get-started/account/orgs/sso-consolidation)[Troubleshoot\nSSOLearn how to resolve failed configuration checks when setting up\nSSO.](https://docs.stripe.com/get-started/account/sso/troubleshooting)\n## Supported features\n\nStripe supports the following SSO features:\n\n- SSO configuration options: Configure Stripe accounts to either mandate SSO for\nall users or allow sign-in using SSO or email and password.\n- Just-In-Time account creation: Automatically create new Stripe accounts for\nusers without existing access upon their first SSO sign-in.\n- Granular Dashboard roles: Assign granular [user\nroles](https://docs.stripe.com/get-started/account/teams/roles) through your\nIdP.\n- IdP-initiated SSO: Authenticate directly from an IdP’s website or browser\nextension.\n- Service Provider-initiated SSO: Initiate SSO login directly from Stripe’s\n[login page](https://dashboard.stripe.com/login).\n\n### Limitations\n\nStripe doesn’t support the following SSO features:\n\n- **User Deletion in SAML**: Due to the limitations of SAML, Stripe doesn’t get\nnotified if user access is revoked in IdP. If users try to log in again through\nSSO after their current session expires, Stripe revokes their access. If you\nneed to remove access instantly, you can delete the users in your [Team\nsettings](https://dashboard.stripe.com/settings/team).\n- **System for Cross-domain Identity Management (SCIM)**: SCIM is a protocol\nthat an IdP can use to synchronize user identity lifecycle processes (for\nexample, provisioning and deprovisioning access, and populating user details)\nwith the service provider, such as Stripe.\n\n## Links\n\n- [Auth0Learn how to setup single sign-on in the Dashboard with\nAuth0.](https://docs.stripe.com/get-started/account/sso/v2/auth0)\n- [Entra IDLearn how to setup single sign-on in the Dashboard with Entra ID\n(formerly known as Azure\nAD).](https://docs.stripe.com/get-started/account/sso/entra-id)\n- [Google WorkspaceLearn how to setup single sign-on in the Dashboard with\nGoogle\nWorkspace.](https://docs.stripe.com/get-started/account/sso/google-workspace)\n- [OktaLearn how to setup single sign-on in the Dashboard with\nOkta.](https://docs.stripe.com/get-started/account/sso/okta)\n- [OneLoginLearn how to setup single sign-on in the Dashboard with\nOneLogin.](https://docs.stripe.com/get-started/account/sso/onelogin)\n- [OtherLearn how to setup single sign-on in the Dashboard with a different\nidentity provider.](https://docs.stripe.com/get-started/account/sso/other)\n- [Consolidate SSOLearn how to consolidate single sign-on (SSO) settings across\nmultiple\naccounts.](https://docs.stripe.com/get-started/account/orgs/sso-consolidation)\n- [Troubleshoot SSOLearn how to resolve failed configuration checks when setting\nup SSO.](https://docs.stripe.com/get-started/account/sso/troubleshooting)\n- [user roles](https://docs.stripe.com/get-started/account/teams/roles)\n- [login page](https://dashboard.stripe.com/login)\n- [Team settings](https://dashboard.stripe.com/settings/team)",
  "metadata": {
    "title": "Single sign-on (SSO) | Stripe Documentation",
    "description": "Configure authentication for access to the Stripe Dashboard with an Identity Provider.",
    "sourceURL": "https://docs.stripe.com/get-started/account/sso"
  }
}