{
  "content": "# Linked external accounts\n\n## Manage your linked external accounts.\n\nWhen you first set up your Stripe account, we ask you to connect your bank\naccount so that you can receive payouts. If you want Stripe to access additional\naccount information, you can link a financial account. This allows Stripe to\nbetter serve your business needs and provide necessary information for credit\nand risk reviews. Linking your account also reduces the need for us to collect\nadditional financial information in the future, potentially reducing the\nfrequency of credit and other risk reviews.\n\nStripe might use your financial account information to:\n\n- Link your financial account for [payouts](https://docs.stripe.com/payouts).\n- Evaluate eligibility for loans or other Stripe products.\n- Enable additional Stripe product features.\n- Re-evaluate reserve balances during risk reviews.\n\n#### Note\n\nWe handle data from your linked financial accounts according to the [Stripe\nServices Agreement](https://stripe.com/legal), [Stripe Privacy\nPolicy](https://stripe.com/privacy) and the [partner\nterms](https://connect.finicity.com/assets/html/connect-eula.html). Stripe’s\npartner can only obtain financial account information as authorized by you.\nStripe doesn’t sell your data to unaffiliated third parties.\n\n## Financial account data\n\nWith your consent, we can access your linked account to retrieve the following\ninformation:\n\n- **Account details**: Account type, account number, current balance, and\nhistorical balances.\n- **Contact information**: Your name, email address, phone number, physical\naddress, and other details held by your financial account.\n- **Account transactions**: Each transaction’s amount, date, and description.\n\nHere are a few Stripe products and services that rely on your financial account\ninformation:\n\n- **Payouts**: Stripe uses your financial account information (specifically, the\naccount number and routing number) to verify your account to enable\n[payouts](https://docs.stripe.com/payouts). You can link this account during\nonboarding, or at a later time by using your **Linked external accounts**\nsettings in the Stripe Dashboard.\n- **Risk**: We analyze your financial account information to ascertain if a\n[reserve](https://support.stripe.com/topics/reserves) is required, and decide\nthe appropriate amount for that reserve. Linking your financial account allows\nStripe to continually reassess your risk profile, which could help reduce or\neliminate the need for a reserve.\n- **Corporate Card**: We use your financial account information during the\nunderwriting process to determine your [Corporate\nCard](https://docs.stripe.com/issuing) credit limit. This limit can vary based\non changes in your financial account information. If you unlink a financial\naccount, it might affect your ability to use your Corporate Card.\n- **Capital**: [Stripe Capital](https://docs.stripe.com/capital/eligibility)\nuses your financial account information to evaluate your loan eligibility and\nthe details of your loan offer.\n\nThe type of data available to Stripe might vary based on your financial account\nor our technology partner. Go to your [Linked external accounts\nsettings](https://dashboard.stripe.com/settings/linked-accounts) to see the\naccounts you’ve linked to Stripe and what information you’ve shared with\ndifferent Stripe products.\n\n#### Note\n\nWe have organizational, technical, and administrative measures in place to\nprotect your financial account data from unauthorized access, destruction, loss,\nalteration, or misuse within our organization. Should you believe that your\ninteraction with us is no longer secure (for instance, if you feel that the\nsecurity of your account has been compromised), please [contact\nus](https://support.stripe.com/contact) immediately.\n\n## Link a financial account\n\nIf your Dashboard prompts you to **Link your bank account to Stripe**, follow\nthese steps:\n\n- Click **Link bank account** in the **Link your bank account to Stripe** banner\nin your Dashboard.\n- Click **Link your account**.\n- Choose your bank account provider and enter your bank account login details.\n- Select all accounts or specific accounts (such as checking or savings\naccounts) and click **Link accounts**.\n- To add multiple bank accounts, click **Link another account**. If not, click\n**Done**.\n- You can verify the successful linking of bank accounts on the [Linked external\naccounts settings](https://dashboard.stripe.com/settings/linked-accounts).\n\nYou can also link your financial accounts directly from the Dashboard by\nfollowing these steps:\n\n- Visit the [Linked external accounts\nsettings](https://dashboard.stripe.com/settings/linked-accounts) in your\nDashboard.\n- Click **+ Add account**.\n- Choose your bank account provider and enter your bank account login\ncredentials.\n- Select all or specific accounts (such as checking or savings accounts) and\nclick **Link Accounts**.\n- To add multiple bank accounts, click **Link another account**. If not, click\n**Done**.\n- Check the **Linked external accounts** page to verify that the bank accounts\nwere successfully linked.\n\n## Data management\n\nYou can control which Stripe products use your account data. By default, when\nyou link your financial accounts, this account data is shared with Stripe\nproducts as shown on the [Link external accounts\nsettings](https://dashboard.stripe.com/settings/linked-accounts). From this\npage, you can control which Stripe products receive and use your data. You also\nhave the option to opt out of sharing your financial account data, which might\naffect your ability to use certain products and features.\n\n### Data retrieval frequency\n\nHow often Stripe accesses your data depends on the products you use. For\ninstance, when assessing a risk reserve on your account, we might access your\nfinancial account information as often as daily because understanding your\nbusiness’s risk profile requires this information.\n\nFor the Corporate Card, we might monitor your financial account data daily to\nassess if a change in your credit limit is necessary. For other products, such\nas Capital, we might get your financial account data once a week or once a\nmonth.\n\n### Data retention duration\n\nWe retain your financial account information for as long as we’re providing\nservices to you. We also keep this information to comply with our tax,\naccounting, and financial reporting obligations, to meet our contractual\ncommitments to our financial partners, and where data retention is mandated by\nthe payment methods we support. Even if you close your Stripe account, we might\nstill need to retain your financial account information for a certain period\nfollowing any limitation periods and record-keeping requirements imposed by\napplicable law.\n\n### Data sharing\n\nWe use your financial account information as outlined in the [Stripe Privacy\nPolicy](https://stripe.com/privacy). We only use your data for internal\npurposes, such as offering additional products, services, or features. Stripe\ndoesn’t sell or rent your financial account information to marketers or\nunaffiliated third parties. We might share your data with trusted entities (like\nservice providers, business partners, third parties authorized by you to access\nthis information, and for compliance purposes) as stated in our privacy policy.\n\n### Revoke consent\n\nAt any time, you can revoke your consent by visiting your [Link external\naccounts settings](https://dashboard.stripe.com/settings/linked-accounts) and\nclicking **Remove account** on any account you want to unlink. After you revoke\nyour consent, we stop obtaining your account data. You can learn more about what\nhappens when you [disconnect an\naccount](https://support.stripe.com/questions/what-happens-when-i-disconnect-a-linked-financial-account).\n\nChoosing not to link a financial account, or unlinking one, might make you\nineligible to access or receive offers for additional products or services,\nenhancements to current products, or services. In some cases, we might request\nalternative information, such as financial statements.\n\n## Trusted entity identification\n\nWhen you link a financial account with Stripe, we become the primary recipient\nof your account data. Depending on the purpose for linking your account, we may\nalso share this data with certain financial institutions or service providers\ninvolved in offering Stripe Capital and other financial services. For example,\nif you obtain a loan through Stripe Capital, we might share your account data\nwith service providers that help manage your loan. Stripe only shares your data\nas set out in the [Stripe Privacy Policy](https://stripe.com/privacy).\n\n## Stripe’s technology partners\n\nWe work with third-party data aggregators, namely Finicity and MX, to obtain the\ndata you’ve agreed to share with us and other reliable entities. When you enter\nyour login credentials in the credential dialog, you might be sharing this\ninformation with Finicity and MX, or otherwise allowing these third-party data\naggregators access to your accounts. Finicity and MX use your login details or\nyour authorization to continually access your account data and provide this data\nto Stripe and other trusted entities authorized by you to receive it.\n\n## Links\n\n- [payouts](https://docs.stripe.com/payouts)\n- [Stripe Services Agreement](https://stripe.com/legal)\n- [Stripe Privacy Policy](https://stripe.com/privacy)\n- [partner terms](https://connect.finicity.com/assets/html/connect-eula.html)\n- [reserve](https://support.stripe.com/topics/reserves)\n- [Corporate Card](https://docs.stripe.com/issuing)\n- [Stripe Capital](https://docs.stripe.com/capital/eligibility)\n- [Linked external accounts\nsettings](https://dashboard.stripe.com/settings/linked-accounts)\n- [contact us](https://support.stripe.com/contact)\n- [disconnect an\naccount](https://support.stripe.com/questions/what-happens-when-i-disconnect-a-linked-financial-account)",
  "metadata": {
    "title": "Linked external accounts | Stripe Documentation",
    "description": "Manage your linked external accounts.",
    "sourceURL": "https://docs.stripe.com/get-started/account/linked-external-accounts"
  }
}