{
  "content": "# Set up BBPOS WisePOS E\n\n## Learn how to set up the BBPOS WisePOS E.\n\nAvailable in: \n\n!\n\nThe BBPOS WisePOS E is a countertop reader for Stripe Terminal apps.\n\nThe [Stripe Terminal SDK connects to the\nreader](https://docs.stripe.com/terminal/payments/connect-reader?reader-type=internet)\nover the internet or LAN.\n\nThis reader is compatible with the following integrations:\n\n- JavaScript SDK\n- iOS SDK\n- Android SDK\n- React Native SDK\n- Server-driven\n\nFor BBPOS WisePOS E, we recommend the [server-driven\nintegration](https://docs.stripe.com/terminal/payments/setup-integration?terminal-sdk-platform=server-driven),\nwhich uses the Stripe API instead of a Terminal SDK. To view the reader’s parts\nand features, see the [BBPOS WisePOS E product\nsheet](https://d37ugbyn3rpeym.cloudfront.net/terminal/product-sheets/wpe_product_sheet.pdf).\n\n#### Warning\n\nStripe readers aren’t liquid-proof and we recommend that users make appropriate\nefforts to make sure their devices remain dry. If your device has experienced\nliquid ingress, we recommend that you stop using the device and let it dry\nthoroughly before attempting to re-use or charge the device. If your device\ndoesn’t properly operate or charge properly after drying, you need to replace\nit.\n\n## Turn the reader on and off\n\nWhen you first receive the device, install the battery. With the back of the\ndevice facing you, lift up from the indentation at the bottom left corner to\ndetach the back cover. Insert the battery by sliding it into the exposed slot\nwith the gold connectors at the top aligned. After the battery is in place,\ncharge the reader by using an outlet or the optional ethernet dock. Connect the\nreader to power by plugging the provided cable into the port with the lightning\nbolt symbol.\n\n!\n\nAfter the reader is fully charged, hold down the power button on the right hand\nside until the screen turns on. After the device powers on, press the power\nbutton to sleep or wake the device. To fully power off the device, hold down the\npower button until the power off option is shown on the screen, then select it.\n\nIn a countertop deployment, leaving the device on for extended periods is\nexpected. With a full charge, you can expect the battery to last about eight\nhours.\n\n#### Note\n\nEven when it’s not in use, leave the BBPOS WisePOS E plugged in and powered on\nto receive automatic software updates.\n\n## Access settings\n\nTo open the settings menu, swipe right from the left edge of the reader screen\nto reveal a **Settings** button. Tap the **Settings** button and enter the admin\nPIN `07139`. From here, you can update your WiFi settings or generate a pairing\ncode for device registration. Battery status is displayed at the top right of\nthis screen. To close the settings menu, click the back arrow in the top left\ncorner.\n\n!\n\nSettings button\n\n!\n\nAdmin PIN screen\n\n!\n\nSettings menu\n\n## Screen timeout\n\nThe screen times out when the reader isn’t connected to a power source. The\ndefault timeout of 1 hour improves battery performance. To update this value, go\nto the\n[settings](https://docs.stripe.com/terminal/payments/setup-reader/bbpos-wisepos-e#settings),\nselect **Appearance**, then select a new screen timeout from the dropdown. The\ndevice screen turns on automatically after a device interaction occurs (such as\ntouching the screen), or when the device enters the payments flow and a payment\nis initiated.\n\n!\n\nSettings menu\n\n!\n\nAppearance menu\n\n!\n\nTimeout menu\n\n## Connect the reader to the internet\n\nBecause the BBPOS WisePOS E is a smart reader, its reader software communicates\ndirectly with Stripe. Your point of sale application communicates with the\nreader through either a LAN (using a Terminal SDK) or the internet (using the\n[server-driven\nintegration](https://docs.stripe.com/terminal/payments/setup-integration?terminal-sdk-platform=server-driven)).\nWhen communicating with the reader through the LAN, the reader must connect to\nthe same local network as your point of sale application. If you’re running into\nissues connecting your reader to the internet, follow the [troubleshooting\nsteps](https://docs.stripe.com/terminal/readers/bbpos-wisepos-e#troubleshooting)\nto diagnose the issue.\n\n### WiFi\n\nTo connect to WiFi or switch networks, go to\n[settings](https://docs.stripe.com/terminal/payments/setup-reader/bbpos-wisepos-e#settings),\nthen select **WiFi settings** to choose the network and connect. Attempting to\njoin a new network disconnects the reader from any existing wireless connection.\nLearn more about our [network\nrequirements](https://docs.stripe.com/terminal/network-requirements) and how to\n[configure advanced network\nsettings](https://support.stripe.com/questions/bbpos-wisepos-e-stripe-reader-s700-advanced-network-settings)\nfor supported WiFi networks.\n\n### Ethernet\n\nEthernet connectivity requires the use of an optional dock, which provides wired\nEthernet connectivity and keeps your smart reader fully charged using the\nincluded charging cable. You can purchase the dock separately through the Stripe\nDashboard. The Ethernet Dock features a 10/100 Ethernet port and rubber feet for\nstable countertop use.\n\nTo set up the dock:\n\n- Connect the Ethernet cable from your dock to your router.\n- Connect the dock to power. It has a minimum power requirement of 5V-2A (10W)\nand comes with a wall plug to USB-C charging cable.\n- When both cables are connected, insert the reader into the dock.\n\nTo confirm that the reader is properly docked, verify the reader is charging and\nthe Ethernet icon is visible in the status bar.\n\nCharging icon\n\nEthernet icon\n\n#### Note\n\nThe WisePOS E dock also ships with a USB-A to USB-C cable, which you can use to\ncharge the dock with your own USB-A power adapter if you prefer. We recommend\ncharging with the dock wall plug to USB-C charging cable.\n\nThe reader obtains an IP address using DHCP. As soon as the network cable is\nplugged in, the reader attempts to establish communication with Stripe.\n\n!\n\n## Network priority\n\nThe BBPOS WisePOS E prioritizes connecting through Ethernet if possible. Even if\npreviously configured for WiFi, the reader switches to using an Ethernet\nconnection when connected to the dock with a plugged-in Ethernet cable. If you\nremove the reader from the dock, it switches back to the WiFi connection.\n\nIf you dock the reader, but you don’t have an Ethernet cable plugged in, it uses\nWiFi. Regardless of connectivity while docked, you can still connect to WiFi and\nmanage networks on the device.\n\n## Change the UI appearance\n\nBy default, the user interface of your BBPOS WisePOS E reader uses a dark theme.\n\nWelcome screen\n\nPayment screen\n\nTipping selection screen*\n\nTotal screen\n\nApproved screen\n\n*The tipping selection screen appears if [on-reader\ntipping](https://docs.stripe.com/terminal/features/collecting-tips/on-reader) is\nconfigured.\n\nYou can change the appearance of the UI to use a different theme in the settings\nmenu. Go to\n[settings](https://docs.stripe.com/terminal/payments/setup-reader/bbpos-wisepos-e#settings),\nthen select **Appearance**, and select a new theme from the dropdown.\n\n!\n\nSettings menu\n\n!\n\nAppearance menu\n\n!\n\nTheme menu\n\n## Change the default reader language\n\nThe [BBPOS WisePOS E](https://docs.stripe.com/terminal/readers/bbpos-wisepos-e)\nsupports changing the reader language in the settings menu. Swipe right across\nthe screen to access the settings menu, and select your language.\n\n## Accessories for the reader\n\nYou can design your own accessories for the BBPOS WisePOS E. To download the\nBBPOS WisePOS E mechanical design files (.STP), you must first review and accept\nour [Terminal Design File License\nAgreement](https://stripe.com/legal/terminal-design). By downloading the file\nbelow, you agree to the terms outlined in the license.\n\n[Download Stripe design\nfiles](https://d37ugbyn3rpeym.cloudfront.net/terminal/bbpos_wpe_mechanical_design_files_and_guidelines.zip)\n\n## See also\n\n- [Set up your\nintegration](https://docs.stripe.com/terminal/payments/setup-integration)\n- [WisePOS E\nreference](https://docs.stripe.com/terminal/readers/bbpos-wisepos-e)\n\nThe BBPOS and Chipper™ name and logo are trademarks or registered trademarks of\nBBPOS Limited in the United States and/or other countries. The Verifone® name\nand logo are either trademarks or registered trademarks of Verifone in the\nUnited States and/or other countries. Use of the trademarks does not imply any\nendorsement by BBPOS or Verifone.\n\n## Links\n\n- [Stripe Terminal SDK connects to the\nreader](https://docs.stripe.com/terminal/payments/connect-reader?reader-type=internet)\n- [server-driven\nintegration](https://docs.stripe.com/terminal/payments/setup-integration?terminal-sdk-platform=server-driven)\n- [BBPOS WisePOS E product\nsheet](https://d37ugbyn3rpeym.cloudfront.net/terminal/product-sheets/wpe_product_sheet.pdf)\n- [troubleshooting\nsteps](https://docs.stripe.com/terminal/readers/bbpos-wisepos-e#troubleshooting)\n- [network requirements](https://docs.stripe.com/terminal/network-requirements)\n- [configure advanced network\nsettings](https://support.stripe.com/questions/bbpos-wisepos-e-stripe-reader-s700-advanced-network-settings)\n- [on-reader\ntipping](https://docs.stripe.com/terminal/features/collecting-tips/on-reader)\n- [BBPOS WisePOS E](https://docs.stripe.com/terminal/readers/bbpos-wisepos-e)\n- [Terminal Design File License\nAgreement](https://stripe.com/legal/terminal-design)\n- [Download Stripe design\nfiles](https://d37ugbyn3rpeym.cloudfront.net/terminal/bbpos_wpe_mechanical_design_files_and_guidelines.zip)\n- [Set up your\nintegration](https://docs.stripe.com/terminal/payments/setup-integration)",
  "metadata": {
    "title": "Set up BBPOS WisePOS E | Stripe Documentation",
    "description": "Learn how to set up the BBPOS WisePOS E.",
    "sourceURL": "https://docs.stripe.com/terminal/payments/setup-reader/bbpos-wisepos-e"
  }
}