{
  "content": "# Supported card brands\n\n## Learn about the card brands supported by Stripe Terminal.\n\nWhen you integrate Stripe Terminal, you can begin accepting a diversity of card\nbrands. Your reader will automatically configure itself to accept the brands\nrelevant for its region.\n\n## In-person brand capabilities\n\nThe following table describes some of the different features and restrictions of\neach card brand **in-person**, including limitations on countries where Stripe\nusers can accept the brand (Stripe Account Country), support for different\nreader types, and card presentment modes. Terminal is available in the following\ncountries.\n\nAustraliaAustriaBelgiumCanadaCzech\nRepublicDenmarkFinlandFranceGermanyIrelandItalyLuxembourgMalaysiaNetherlandsNew\nZealandNorwayPortugalSingaporeSpainSwedenSwitzerlandUnited KingdomUnited States\n### Available in Preview\n\nPoland\nWhen processing an in-person transaction, Terminal requires that you use local\ncurrency. Terminal supports NFC-based mobile wallets (Apple Pay, Google Pay, and\nSamsung Pay).\n\nCard brandTerminal location and Stripe account countryReader typesCard\npresentment modeVisaAll countries where Terminal is supportedAllAllMastercardAll\ncountries where Terminal is supportedAllAllAmerican ExpressAll countries where\nTerminal is supported, except MalaysiaAllAllDiscover & DinersUnited States,\nCanada, and EMEAUS: Verifone P400, Stripe M2, Chipper 2X BT, and Tap to Pay on\niPhoneUS, CA, EMEA: WisePOS E and Stripe Reader S700CA, EMEA: WisePad 3AllChina\nUnion Pay 1United States, CanadaStripe M2, WisePad 3, WisePOS E3, Stripe Reader\nS700AlleftposAustraliaWisePad 3, WisePOS E, Stripe Reader S700, and Tap to Pay\non iPhoneAllgirocardGermanyWisePad\n3All[Interac](https://docs.stripe.com/terminal/payments/regional?integration-country=CA#interac-payments)CanadaWisePad\n3, WisePOS E, Verifone P400, Stripe Reader S700, and Tap to Pay on iPhoneAllJCB\n2United States, Canada, Australia, and New ZealandStripe M2, WisePad 3, WisePOS\nE3, Stripe Reader S700AllMaestroAll non-US countries where Terminal is\nsupported. As of July 2023, new Maestro cards aren’t issued. Expired cards will\nbe replaced with Debit Mastercard.WisePad 3, WisePOS E, Verifone P400, Stripe\nReader S700, Tap to Pay on iPhone, and Tap to Pay on AndroidAll\n1China Union Pay is supported over the Discover network in the United States and\nCanada.\n\n2JCB is supported over the Discover network in the United States and the\nAmerican Express network in Canada, Australia and New Zealand.\n\n3The WisePOS E only supports China Union Pay and JCB for EMV chip transactions\nwhere the card is inserted into the reader. Contactless is not supported.\n\n## Links\n\n-\n[Interac](https://docs.stripe.com/terminal/payments/regional?integration-country=CA#interac-payments)",
  "metadata": {
    "title": "Supported card brands | Stripe Documentation",
    "description": "Learn about the card brands supported by Stripe Terminal.",
    "sourceURL": "https://docs.stripe.com/terminal/payments/collect-card-payment/supported-card-brands"
  }
}