{
  "content": "# Get started on dispute prevention with VerifiPublic preview\n\n## Learn about the benefits and requirements of Stripe's dispute prevention offering powered by Verifi.\n\n## Understanding Verifi\n\nStripe has built integrations with dispute prevention products offered by\nVerifi, a subsidiary of Visa. The products include Order Insight (OI) and Rapid\nDispute Resolution (RDR). Our integrations allow you to use both products\nwithout any manual integrations to help reduce your dispute rate and increase\nrevenue retention. Learn more about pricing on the [product overview\npage](https://docs.stripe.com/disputes/verifi-beta#pricing). Because the\noffering is currently in beta, the pricing and product behavior might be subject\nto change.\n\n## Rapid Dispute Resolution (RDR)\n\nRDR allows businesses to construct a ruleset to auto-refund incoming disputes on\nVisa transactions for a fee per dispute (for example, refund all potential fraud\ndisputes under 10 USD). Businesses pay the additional RDR fee for each incoming\ndispute reviewed by RDR regardless of whether the dispute is avoided with the\nauto-refund ruleset. The main benefit of RDR is that refunded disputes don’t\ncount towards dispute rates, helping you stay out of monitoring programs, and\nyou don’t pay a separate dispute fee on refunded disputes. This is helpful for\nbusinesses in the Visa Dispute Monitoring Program (VDMP) because it allows you\nto immediately reduce your dispute rates and lower dispute fees, while also\navoiding network fines and Stripe payment volume reserves.\n\n### RDR requirements\n\nAlthough there are no requirements for using RDR and no separate integration on\nyour end, the onboarding process requires you to set up rules to define which\ntransactions to refund with RDR. After you [request access to the\nbeta](https://docs.stripe.com/disputes/verifi-beta#request-an-invite), Stripe\nwill be in touch with next steps to set up your ruleset. Learn more about how to\nbest [set up\nrules](https://support.stripe.com/questions/how-to-creating-rule-sets-for-rdr-powered-by-verifi).\n\n## Order Insight (OI)\n\nIf a consumer checks their digital banking app or calls their issuer to say they\ndon’t recognize a Visa charge and you’re enrolled in OI, the issuer’s customer\nsupport agent can send a real-time lookup (API request to Stripe) to provide\ndetailed descriptions of the item the consumer purchased (such as product\ndescriptions, quantity, shipping address, or IP address). The additional data\nhelps the consumer recognize the charge and prevent follow-through on disputes.\nOI also uses new Visa rules such as Compelling Evidence 3.0 (CE 3.0), where if\nyou can send issuers data about prior successful transactions with the same\ncardholder as a response to a lookup, the issuer is required to block the\ncardholder from filing the dispute at all. See [Compelling Evidence 3.0 with\nOI](https://docs.stripe.com/disputes/get-started/verifi##compelling-evidence-3.0-with-oi)\nfor more information.\n\nCardholders are less likely to follow through on filing a dispute if they can\nrecognize the charge. The chances of successfully deflecting a dispute when a\nlookup is made depend on the quality of the data that Stripe can provide. Stripe\nautomatically pulls any available data on a charge on your behalf and sends it\nto the issuer. Stripe uses the data that you provide during charge time and\ndoesn’t require you to build any integrations or maintain a real-time service.\nSee the list of fields below that are eligible as part of the lookup response.\nBy using the OI service, you direct Stripe to share this data with issuers and\nultimately with cardholders. Verifi might occasionally update these fields, and\nyour continued use of the OI service depends on your adapting to any new\noperational requirements.\n\n#### Note\n\nFor a dispute to be eligible for a block using CE 3.0 rules, Stripe must have\nprior transaction data available. See [Compelling Evidence 3.0 with\nOI](https://docs.stripe.com/disputes/get-started/verifi#compelling-evidence-3.0-with-oi)\nfor which data is required for CE 3.0 blocks. If prior transaction data isn’t\navailable, Stripe still sends any other available data.\n\nObjectFieldDescriptionReceipt orderDateOrder dateorderNumberUnique identifier\nfor the order defined by the businessinvoiceNumberInvoice number (alternate to\norder number)subTotalAmountSubtotal amount of the purchase before tax and\nshipping fees are includedshippingAndHandlingAmountShipping and Handling amount\nrelated to the purchaseorderTotalAmountTotal amount of the orderPayment\ninformation paymentMethodMasked representation of the card and card number of\nthe original purchase as displayed on the physical or digital receipt. Limited\nto the last 4 digits of the card PAN.billingNameFirst and last name from the\ncardpaymentTotalAmountPayment amount of the purchasecvvCheckedCard security code\nvalidation at time of purchaseProduct purchased productDescriptionDetailed\ndescription of the product (merchandise or service)\npurchasedunitPriceAmountAmount of the individual itemquantityQuantity of the\nproduct purchasedCustomer information firstNameCustomer’s first\nnamelastNameCustomer’s last namelengthOfRelationshipLength of customer\nrelationship with the business in number of monthsaccountIdCardholder registered\nidentifier to uniquely identify their account with the business. This should be\nrecognizable to the Cardholder (not an internal system identifier) and something\nthey provided the business during account creation. Examples are a unique\nusername, email, phone number, or other similar value.emailAddressEmail address\nthat customer providedBilling address address1Street address plus additional\naddress lines such as suite number and apartmentaddress2Street address plus\nadditional address lines such as suite number and apartmentcityName of\ncityregionRegion or statepostalCodeZip or postal codecountryCountry codeMerchant\ninformation merchantNameCorporate or parent company name of the business, This\nmight or might not be recognizable to the consumer.merchantUrlBusiness’s\ncorporate URL. Might be different than the websiteUrl where the customer made\nthe purchase from.merchantContactPhoneBusiness’s customer service phone number.\nThis should be the number that you would want a consumer to contact you to\ndiscuss any questions they have about the purchase.merchantAddressBusiness’s\ncorporate addresstermsAndConditionsOverview of cancellation policies for\nbusinessesstoreDetailsA business might have multiple stores or locations that\npurchases are made from. The store details should indicate where the purchase\nwas processed or the online webstore details.Store details storeNameStore or\nwebstore name where the purchase was madestoreContactPhoneBusiness’s customer\nservice phone numberDelivery address address1Street address plus additional\naddress lines such as suite number and apartmentaddress2Street address plus\nadditional address lines such as suite number and apartmentcityName of\ncityregionRegion or statepostalCodeZip or postal codecountryCountry ISO 3166-1\ncode alpha-3Delivery details shippingCarrierShipping\ncarriertrackingNumberTracking number of the shipment or\ndeliveryDeviceipAddressIP Address associated with the device\n### Compelling Evidence 3.0 with OI\n\nCompelling Evidence 3.0 (CE 3.0) is a program aimed to benefit businesses by\nproviding more aggressive tools to deflect and remedy first-party misuse (aka\n“friendly fraud”) disputes on Visa transactions. CE 3.0 rules dictate which\nevidence can be provided post-dispute to improve your odds of winning a dispute\n([learn\nmore](https://support.stripe.com/questions/how-does-stripe-support-visa-compelling-evidence-3-0)).\nHowever, if you’re enrolled in OI, you can also use CE 3.0 pre-dispute to\ncompletely block the dispute from being filed. This works by providing the\nrequired prior transaction data to issuers during a lookup. If prior\ntransactions between you and the cardholder exist, Visa automatically selects\nthe 2-5 of most recent non-fraud prior transactions and requests data on all of\nthe transactions. Stripe then automatically provides all of the above available\ninformation. If at least 2 prior transactions exist with complete product\ndescriptions that have matching IP addresses and at least one of matching email\naddress or customer delivery address, the issuer is required to block the\ndispute. As a result, the dispute is never filed and you don’t incur any dispute\nfees or any increases to your dispute rate.\n\n### OI Requirements\n\nThe onboarding flow in the Stripe Dashboard collects all the data elements that\nStripe needs to begin servicing OI lookups on your behalf. These include\nBusiness name, Business URL, Business Phone Number, and Email. To achieve the\nbest possibility for deflected disputes, make sure your Stripe integration is\nset up to provide as many of the above fields as possible at transaction time.\nTo ensure that Stripe can effectively block disputes on your behalf with CE 3.0,\nmake sure that all your transactions include IP Address, Customer Email Address,\nProduct Descriptions, and if possible, Shipping or Customer Address.\n\n## Links\n\n- [product overview page](https://docs.stripe.com/disputes/verifi-beta#pricing)\n- [request access to the\nbeta](https://docs.stripe.com/disputes/verifi-beta#request-an-invite)\n- [set up\nrules](https://support.stripe.com/questions/how-to-creating-rule-sets-for-rdr-powered-by-verifi)\n- [learn\nmore](https://support.stripe.com/questions/how-does-stripe-support-visa-compelling-evidence-3-0)",
  "metadata": {
    "title": "Get started on dispute prevention with Verifi | Stripe Documentation",
    "description": "Learn about the benefits and requirements of Stripe's dispute prevention offering powered by Verifi.",
    "sourceURL": "https://docs.stripe.com/disputes/get-started/verifi"
  }
}