{
  "content": "# Alerts and thresholdsPublic preview\n\n## Learn how to alert when a customer exceeds a usage threshold or trigger an invoice when a customer hits a billing threshold.\n\nUse alerts to notify you when customers exceed meter usage thresholds, or to\ntrigger an invoice when customers reach a specific billing threshold. You can\ncreate alerts that apply to specific customers or all customers.\n\nCreate usage alerts in your business workflows, such as the following:\n\n- **Email users**: Allow customers to configure usage limits, and send an email\nwhen they hit their limit.\n- **De-provision access**: Grant customers a free number of usage units to your\nservice, and remove access when they exceed the limit.\n- **Notify the sales team of an upsell**: Alert your sales team of an enterprise\nopportunity when a self-serve user exceeds a usage threshold.\n\nStripe provides a usage alert type called `One-time per-customer usage alert`.\nThis alert triggers when a customer exceeds the specified usage level for the\nfirst time, and only triggers one time per customer, regardless of future usage.\n\n## Create usage alerts\n\nYou can configure [alerts](https://docs.stripe.com/api/billing/alert/create)\nusing the Stripe Dashboard or API.\n\nFor example, you can create a one-time alert for customers that triggers when\nthey reach 100 API calls. When a customer reaches 100 API calls, you receive a\nwebhook notifying you that the customer has exceeded the threshold.\n\nDashboardAPI- On the [Billing\nAlerts](https://dashboard.stripe.com/settings/billing/alerts) page, click\n**Create alert**.\n- On the **New alert** page, do the following:\n\n- For **Name**, enter the name for your alert. This isn’t visible to customers.\n- Under **Alert type**, select the meter that you want to set up alerts for.\n- For **Unit threshold**, set the usage amount to reach for an alert to trigger.\n- *(Optional)* Under **Application**, select **Specific customer** and the\ncustomer name, if you want the alert to apply only to that customer. Otherwise,\nleave the default of **Any customer** to configure the alert for all customers.\n- Click **Create alert**.\n\n## Create billing thresholds\n\nYou can create\n[billing_thresholds](https://docs.stripe.com/api/subscriptions/object#subscription_object-billing_thresholds)\nto issue an [invoice](https://docs.stripe.com/api/invoices) when a customer’s\naccrued usage in a subscription cycle reaches a specific monetary threshold. You\ncan also reset a subscription’s\n[billing_cycle_anchor](https://docs.stripe.com/api/subscriptions/create#create_subscription-billing_thresholds-reset_billing_cycle_anchor)\nwhen a customer reaches the monetary threshold.\n\nConsider using billing thresholds to limit the amount owed or the products\nconsumed between invoices or charges.\n\n### Monetary thresholds\n\nWhen you add a monetary threshold to a subscription, set the value as a multiple\nof the cost of one unit of the product being sold. Setting a lower amount for\nthe threshold results in your customers receiving an invoice for every unit of\nusage.\n\nThe value is a positive integer in the [smallest currency\nunit](https://docs.stripe.com/currencies#zero-decimal) (for example, 100 cents\nto charge 1 USD, or 100 to charge 100 JPY, a zero-decimal currency). Set the\nvalue to at least 50 currency units.\n\nYou can set monetary thresholds for a subscription using the Stripe\n[Dashboard](https://dashboard.stripe.com/test/subscriptions) or the API.\n\n```\ncurl https://api.stripe.com/v1/subscriptions/sub_49ty4767H20z6a \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d \"billing_thresholds[amount_gte]\"=10000 \\\n -d \"billing_thresholds[reset_billing_cycle_anchor]\"=false\n```\n\n### Usage thresholds\n\nWhen you add a usage threshold to a subscription item, set the value to exceed\none unit of usage to prevent frequent invoicing. Stripe doesn’t support setting\nusage thresholds in the Dashboard.\n\n```\ncurl https://api.stripe.com/v1/subscription_items/si_CFhSgkWb0MyTWg \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d \"billing_thresholds[usage_gte]\"=2000\n```\n\n### Thresholds and the billing cycle anchor\n\nBy default, the [billing cycle\nanchor](https://docs.stripe.com/billing/subscriptions/billing-cycle) of a\nsubscription remains unchanged after a customer reaches the usage threshold. If\na customer reaches the threshold mid-month of a monthly subscription, the\nsubscription resets at the end of the month, similar to a subscription without\nthresholds.\n\nYou can change the default behavior by configuring the subscription to reset the\nbilling cycle anchor after it reaches the threshold. Stripe treats this\nconfigured behavior as if the subscription naturally arrived at its rollover\npoint at the end of the month.\n\n```\ncurl https://api.stripe.com/v1/subscriptions/sub_49ty4767H20z6a \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d \"billing_thresholds[reset_billing_cycle_anchor]\"=true\n```\n\n### Thresholds and tiered pricing\n\nStripe maintains tiers across threshold invoices. By default, tiers reset at the\nend of each billing period. You can change the default behavior by configuring\nthe subscription to reset the billing cycle anchor after it reaches the\nthreshold, similar to a subscription without thresholds.\n\nFor example, you run an ad platform with the following graduated tier structure\nfor ad impressions:\n\nTierAmount (unit cost)1-10000 (`up_to=10000`)0.50 USD (`unit_amount=50`)10000+\n(`up_to=inf`)0.40 USD (`unit_amount=40`)\nBecause Stripe bills usage retrospectively, you can set a temporary threshold of\n100 USD for new customers. Under this plan, you bill your customer every 200\nimpressions for the first 10,000 impressions (200 × 0.50 USD = 100 USD). When\nthe customer exceeds 10,000 impressions, they’re billed every 250 impressions\n(250 × 0.40 USD = 100 USD). This continues until the end of the billing period,\nat which point you can invoice all usage that wasn’t previously invoiced, and\nthe subscription and tiers reset.\n\nTo reset tiers after reaching a threshold, you must configure the subscription\nto reset the billing cycle anchor after the usage reaches the thresholds that\nyou set.\n\n### Volume tiers\n\nVolume tiers define the pricing for all units of usage, as opposed to graduated\ntiers, which define pricing for a specific amount of usage. Some pricing models\nuse volume tiers that decrease the unit cost at each successive tier. You can\nuse these models to incentivize customers to use more of a product (for example,\nad impressions, or GB of storage).\n\nWhen combined with thresholds, these pricing models can lead to invoices with\nline items for negative amounts under the following conditions:\n\n- A threshold invoice has already been issued.\n- Subsequent usage gets billed to customers at a lower unit cost.\n\nFor example, consider the following tiered pricing structure:\n\nTierAmount (unit cost)1-10000 (`up_to=10000`)0.50 USD (`unit_amount=50`)10000+\n(`up_to=inf`)0.40 USD (`unit_amount=40`)\nIf a customer uses 10,000 units, the invoice total is 5,000 USD (10,000 x 0.50\nUSD = 5,000 USD). Any additional usage causes *all* usage to bill at the lower\nunit cost of 0.40 USD. If the customer uses one more unit, the invoice total\n*drops* to 4,000.40 USD (10,001 x 0.40 USD = 4,000.40 USD).\n\nWithout thresholds, Stripe would issue an invoice for 4,000.40 USD at the end of\nthe billing period.\n\nTo demonstrate how negative invoicing can occur, assume you set a monetary\nthreshold of 5,000 USD. In this scenario, Stripe issues an invoice when the\ncustomer reaches 10,000 units of usage.\n\nIf the customer uses one more unit, the invoice total drops to 4,000.40 USD\n(10,001 × 0.40 USD = 4,000.40 USD). However, if the customer doesn’t consume\nmore units, they’re *owed* 999.60 USD (5,000 USD − 4,000.40 USD = 999.60 USD).\nAt the end of the billing period, Stripe credits this amount to the customer’s\nbalance, which we use to pay future invoices.\n\nIf the customer continues to accrue usage, the cost of the usage reaches 5,000\nUSD again when the customer uses 12,500 units (5,000 USD / 0.40 USD = 12,500).\nHowever, the previous payment of 5,000 USD covers all of this usage. As a\nresult, we don’t issue an invoice.\n\nStripe won’t issue an invoice until either the total usage reaches 25,000 units\n(for a total cost of 10,000 USD), or the end of the billing period\narrives—whichever occurs first. The tables below show the line items you see for\nthe two invoices issued in the scenario where usage reaches 25,000 units.\n\nInvoice 1:\n\nLine itemQuantityAmountUsage (0.50 USD per unit)10,0005,000 USDTotal5,000 USD\nInvoice 2:\n\nLine itemQuantityAmountUsage (0.40 USD per unit)25,00010,000 USDAmount\npreviously billed (at 0.50 USD per unit)-5,000 USDTotal5,000 USD\n## Listen for webhooks\n\nAfter you configure an alert and start sending usage for that meter, you can\nlisten for [webhooks](https://docs.stripe.com/webhooks). These events trigger\nwhen there’s a status change in Stripe, such as creating a new subscription or\ninvoice.\n\nIn your application, set up an HTTP handler to accept a POST request containing\nthe webhook event, and verify the signature of the event.\n\n```\n# Set your secret key. Remember to switch to your live secret key in production.\n# See your keys here: https://dashboard.stripe.com/apikeys\nStripe.api_key = 'sk_test_BQokikJOvBiI2HlWgH4olfQ2'\n\npost '/webhook' do\n# You can use webhooks to receive information about asynchronous payment events.\n# For more information, see https://stripe.com/docs/webhooks.\nwebhook_secret = ENV['STRIPE_WEBHOOK_SECRET']\npayload = request.body.read\nif !webhook_secret.empty?\n```\n\nSee all 45 lines\nDuring development, use the Stripe CLI to [monitor webhooks and forward them to\nyour application](https://docs.stripe.com/webhooks#test-webhook). Run the\nfollowing in a new terminal while your development app is running:\n\n```\nstripe listen --forward-to localhost:4242/webhook\n```\n\nFor production, set up a webhook endpoint URL in the Dashboard, or use [Webhook\nEndpoints](https://docs.stripe.com/api/webhook_endpoints).\n\n## Limitations\n\nConsider the following limitations for usage alerts:\n\n- Alerts are only evaluated on usage data reported after alert creation.\n- You can create a maximum of 25 alerts for each combination of a specific meter\nand customer. However, you can create an alert for a specific meter for each of\nyour customers.\n- Alerts currently don’t work with test clocks.\n\nConsider the following limitations for billing thresholds:\n\n- Thresholds don’t apply to [trial\nsubscriptions](https://docs.stripe.com/billing/subscriptions/trials).\n- Billing thresholds aren’t evaluated in the 24 hours before a subscription\nends. This helps limit confusion for a customer who receives multiple invoices\non the same date.\n- Monetary thresholds must be greater than the sum of any flat fees on metered\nsubscription items.\n- When determining if a monetary threshold has been reached, the value used\nexcludes taxes but includes discounts and billing credits.\n- Subscriptions are only allowed a single monetary threshold.\n- Subscription items are only allowed a single usage threshold.\n- Invoiced amounts or usage might be slightly higher than the specified\nthresholds because invoices aren’t issued at the exact moment a specified\nthreshold is reached.\n- Per-package tiered pricing isn’t currently supported.\n\n## Links\n\n- [alerts](https://docs.stripe.com/api/billing/alert/create)\n- [Billing Alerts](https://dashboard.stripe.com/settings/billing/alerts)\n-\n[billing_thresholds](https://docs.stripe.com/api/subscriptions/object#subscription_object-billing_thresholds)\n- [invoice](https://docs.stripe.com/api/invoices)\n-\n[billing_cycle_anchor](https://docs.stripe.com/api/subscriptions/create#create_subscription-billing_thresholds-reset_billing_cycle_anchor)\n- [smallest currency unit](https://docs.stripe.com/currencies#zero-decimal)\n- [Dashboard](https://dashboard.stripe.com/test/subscriptions)\n- [billing cycle\nanchor](https://docs.stripe.com/billing/subscriptions/billing-cycle)\n- [webhooks](https://docs.stripe.com/webhooks)\n- [https://dashboard.stripe.com/apikeys](https://dashboard.stripe.com/apikeys)\n- [https://stripe.com/docs/webhooks.](https://stripe.com/docs/webhooks)\n- [monitor webhooks and forward them to your\napplication](https://docs.stripe.com/webhooks#test-webhook)\n- [Webhook Endpoints](https://docs.stripe.com/api/webhook_endpoints)\n- [trial subscriptions](https://docs.stripe.com/billing/subscriptions/trials)",
  "metadata": {
    "title": "Alerts and thresholds | Stripe Documentation",
    "description": "Create alerts for when customers exceed usage thresholds, or trigger an invoice when customers hit a billing threshold.",
    "sourceURL": "https://docs.stripe.com/billing/subscriptions/usage-based/alerts-and-thresholds"
  }
}