{
  "content": "# Treasury fraud guide\n\n## Learn best practices for managing fraud as a Treasury platform.\n\nStripe Treasury is a banking-as-a-service API that enables you to embed\nfinancial services into your platform’s product. With Stripe Treasury (through\nour partnerships with US domestic banks), you can offer your connected accounts\na simple stored-value account that’s directly integrated into your application.\nIt lets them perform financial actions such as sending and receiving funds\n(through ACH wires), earning yield, and spending money through a card.\n\nStripe Treasury uses the same workflows as Stripe Connect to get connected\naccounts up and running, including various\n[KYC](https://en.wikipedia.org/wiki/Know_your_customer) and compliance\nrequirements. You can use our API to customize how you manage fraud risk and\nreduce friction for your connected accounts.\n\nSee the following high-level guidance about how to monitor and minimize fraud\nwhen using Stripe Treasury, because you’re liable for fraud losses and disputes\nfrom your connected accounts. This guide breaks fraud down into three main\ncategories:\n\n- **Business fraud**: A person creates a fraudulent connected account (often\nwith a stolen identity) to commit fraud\n- **Transaction fraud**: A legitimate connected account has their card or\nfinancial account information stolen or compromised resulting in unauthorized\nactivity\n- **Account takeover fraud**: A legitimate connected account owner’s login is\ncompromised by a third party and unauthorized actions are taken on their account\n\n## Business fraud examples\n\nThe most well known types of business fraud in the financial services industry\nare first party fraud, third party fraud, and force capture or overcapture\nfraud.\n\n**First party fraud example (ACH debit)**\n\n- A bad actor uses a compromised or synthetic identity to open a financial\naccount (Financial Institution A).\n- The bad actor logs into the Financial Institution A and initiates a 10,000 USD\nACH debit to pull funds from another financial account they also have ownership\nover (Financial Institution B). In this case, Financial Institution A is the\noriginator of the debit (ODFI) and Financial Institution B is the receiver of\nthe debit (RDFI).\n- When the debited funds become available in Financial Institution A, the bad\nactor immediately spends or transfers the funds out.\n- The bad actor then goes to Financial Institution B and claims the ACH debit\ninitiated by Financial Institution A wasn’t authorized.\n- Financial Institution B initiates an ACH return, citing the debit wasn’t\nauthorized and pulls back the full amount of the debit.\n- Financial Institution A is left with a negative balance.\n\n**Third party fraud example (ACH debit)**\n\n- A bad actor uses a compromised or synthetic identity to open a financial\naccount (Financial Institution A).\n- The bad actor logs into Financial Institution A and initiates a 10,000 USD ACH\nto pull funds from another financial account they don’t have ownership over but\nhave account and routing number information for at Financial Institution B. In\nthis case, Financial Institution A is the originator of the debit (ODFI) and\nFinancial Institution B is the receiver of the debit (RDFI).\n- When the debited funds become available in Financial Institution A, the bad\nactor immediately spends or transfers the funds out.\n- The accountholder of Financial Institution B then notices the erroneous debit\nto their account and reports it to their financial institution that the debit\ninitiated by Financial Institution A wasn’t authorized.\n- Financial Institution B initiates an ACH return, citing that the debit wasn’t\nauthorized and pulls back the full amount of the debit.\n- Financial Institution A is left with a negative balance.\n\n**Third party fraud example (ACH or wire credit)**\n\n- A bad actor uses a compromised or synthetic identity to open a financial\naccount (Financial Institution A).\n- The bad actor uses either compromised financial account login credentials or\nother means to initiate an ACH or wire credit transfer from another financial\naccount into Financial Institution A.\n- When the credited funds become available in Financial Institution A, the bad\nactor immediately spends or transfers the funds out.\n- Financial Institution A might not be in a loss position here because only the\noriginating financial institution can recall the incoming credit transfer or\nwire under limited circumstances. That said, Financial Institution A has enabled\nfraudulent activity through their account, which has compliance and reputation\nimplications for Stripe and our financial partners.\n\n**Force capture or overcapture fraud example**\n\n- A bad actor uses a compromised or synthetic identity to open a financial\naccount with a card attached (Financial Institution A).\n- The bad actor creates a separate account, or compromises one in good standing\non another acquirer (using account takeover, or ATO).\n- The bad actor uses the account to create authorizations on the card issued by\nFinancial Institution A that don’t have issuer dispute rights—for example,\ncard-present transactions on a chip card or card not present transactions that\nattempt [3D Secure (3DS)](https://docs.stripe.com/payments/3d-secure) or Visa\nSecure.\n- The bad actor then force captures or overcaptures on previous authorizations.\n- The bad actor then gets paid out from the business account by the acquirer.\n- The bad actor then files fraud disputes on the card issued by Financial\nInstitution A, but Financial Institution A can’t file disputes against the\nacquirer due to lack of dispute rights and loses the disputes.\n- The financial account is left with a negative balance in the amount of the\novercaptured or force captured funds.\n\nThe best way to protect yourself from fraud on Treasury, including the previous\nscenarios, is to make sure the connected accounts signing up for access to the\nTreasury product are legitimate. It’s a good practice to assess a new account’s\nrisk profile holistically. Generally, the better you understand your customers\nand their business, the better you can assess and manage your risk exposure.\n\n### Fraud risk mitigation strategies\n\nUse the following risk mitigation strategies to protect yourself at the various\nstages of business.\n\n#### At onboarding\n\n- **Monitor signup volume:** Unexpected upticks in signup volume can indicate\nthat your platform is being discovered and exploited by bad actors. It’s also\ncommon to see an influx of fraud after making a marketing announcement. Pay\nspecial attention to signups in these cases.\n- **Limit access to faster payouts:** If your connected accounts are also using\nStripe for payments, we recommend limiting which ones have access to [faster\npayouts](https://docs.stripe.com/treasury/moving-money/payouts#payouts) to their\nTreasury accounts. Limit faster payouts to trusted connected accounts. You might\nalso consider implementing criteria through which your connected accounts can\ndemonstrate good intent and earn faster payouts (for example, a certain number\nof months of activity with no issues, or a set dollar amount of processed\nvolume).\n- **ACH debit controls:** ACH debits present an elevated risk of fraud due to\ntheir **pull** payment method nature. Given this elevated risk, it’s important\nto treat the funding method with the appropriate level of fraud protections and\ncontrols, including restricting this feature to trusted accounts.\n- **Additional identity verification:** Although the Treasury product includes\nstandard Connect KYC on your connected accounts, this process focuses on\nidentity validation (whether the information provided at signup is valid) rather\nthan identity verification (whether the person or business providing the\ninformation at signup is who they claim to be). You can optionally use [Stripe\nIdentity](https://docs.stripe.com/identity), an identity verification product\nthat programmatically confirms the identity of customers so you can greatly\nreduce attacks from bad actors while minimizing friction for legitimate\ncustomers.\n- **Collect industry relevant information at signup:**- If your connected\naccounts are small businesses, consider collecting URL and relevant social media\ninformation such as Linkedin, Facebook, and X (formerly Twitter).\n- If your connected accounts are contractors or creators, consider collecting\nrelevant social media information such as Facebook, X, TikTok, YouTube, or\nInstagram.\n- If your connected accounts are businesses in an industry that requires a\nlicense, consider collecting that license at signup.\n- **Domain verification:** Confirm a connected account owner’s email address if\nit’s linked to their business domain (for example, send an email to an address\nat that domain and require a response from it).\n- **Duplicate detection:** Conduct checks for duplicate account information\nassociated with previously fraudulent connected accounts, such as financial\naccount information, name with DOB, and tax information. You might also consider\nweak links between accounts such as multiple accounts spun up from the same IP,\ndevice, and so on.\n\n#### Throughout an Account’s lifecycle\n\n- **Holistic fraud review:** Perform a manual review for fraud at a certain\npoint in each new connected account’s lifecycle. Depending on the number of\nconnected accounts you have, your business model, and your risk appetite, it\nmight make sense to do that at signup, at a certain dollar amount in inflows, a\ncertain dollar amount in outflows, or similar conditions.\n- **Flag anomalous activity:** Flag businesses showing anomalous behavior for\nmanual review. That can include, but isn’t limited to, a business with more than\na certain number of transactions where there’s no authorization (force capture)\nor a capture greater than the authorization amount (overcapture), a large credit\ntransfer or wire into an account, a large international wire out of an account,\ncard transactions outside of the country, or a return for an ACH debit into the\naccount. It’s also critical to encourage your users to do the same, as they’re\noften in the best position to recognize anomalous activity and report it to you.\n\nIf you suspect the business might be fraudulent, set the `outbound_flows`\n[feature](https://docs.stripe.com/treasury/account-management/financial-account-features#restricted-features)\nto `restricted` until you’re able to review the account and make a\ndetermination. Examples of information you might want to request from your\nconnected account when performing this manual review depend on your industry,\nbut can include social media profiles, business documentation, photos of\ninventory, tracking numbers for shipments, business licenses, and so on.\n\nIf you’re confident a business is fraudulent, set the `outbound_flows` and\n`inbound_flows` features to `restricted`. If the account has a zero balance,\nclose the account. If the account balance isn’t zero, you can’t close the\naccount but you can disable the listed features.\n\n## Transaction fraud\n\nTransaction fraud is the unauthorized use of a credit card or financial account\nto fraudulently obtain money or property. On Stripe, transaction fraud manifests\nas unauthorized charges on a Stripe issued card or unauthorized debits to a\nStripe issued financial account. Cards can be compromised either through\nphysical theft or a lost card, or through credentials compromised through\nphishing, spyware, non-secure checkouts, external breaches, and so on. Financial\naccounts can be compromised if a bad actor gains knowledge of your financial\naccount’s account and routing numbers.\n\nUnlike the fraud outlined above, transaction fraud occurs for good customers and\ncan occur at any point in a customer’s lifecycle. A connected account on your\nplatform can operate on the Treasury product for months or years with no problem\nbefore having their card or financial account compromised.\n\nCurrently, Issuing has [fraud\nprotection](https://docs.stripe.com/issuing/manage-fraud) that extends to the\ncard attach products within Treasury, but you still need to monitor for\ntransaction fraud. The most effective ways to combat transaction fraud are to\nempower your connected accounts to be diligent about keeping their card and\nfinancial account information safe. Have them pay close attention to the\nactivity on their Treasury account. Text message or email notifications of\naccount activity can help increase visibility. Quick identification of\nfraudulent transactions gives your connected accounts the best chance of being\neligible to file disputes.\n\nFor card disputes, a transaction is only eligible for a dispute if fewer than\n110 days have passed since capture of the transaction. Disputes are handled\nthrough the Dashboard or the API. Read the [Issuing\ndisputes](https://docs.stripe.com/issuing/purchases/disputes) guide for more\ninformation on filing Issuing disputes.\n\nFor ACH debit disputes (returns), a transaction is only eligible for a dispute\nif you notify Stripe of any return request at least 24 hours before the\nsettlement date of the transaction. ACH Debit disputes are currently handled\nmanually through email. Read more about [filing ACH Debit\ndisputes](https://docs.stripe.com/treasury/moving-money/financial-accounts/out-of/debit-reversals).\n\nIf your connected account’s card or financial account number is compromised,\nresulting in unauthorized transactions, you can take multiple actions. In\naddition to disputing eligible transactions, consider closing and reissuing the\ncard and opening a [new connect and financial\naccount](https://docs.stripe.com/treasury/account-management/financial-accounts#close-a-financialaccount)\nto prevent future instances of fraud.\n\nYou can also take proactive measures to manage transaction fraud on your\nplatform. The following examples are some controls you can put in place:\n\n#### Card transaction fraud mitigation strategies\n\n- **Enroll in 3DS:** 3DS is an additional layer of authentication used by\nbusinesses to make sure a purchase is from a legitimate cardholder. The\nadditional 3DS step at checkout typically involves showing the cardholder an\nauthentication page on their financial institution’s website that has a prompt\nto enter a verification code sent to their phone or email. 3DS is used for\nonline transactions only, and works only if the business and the issuer support\nit. If a business has 3DS enabled, liability automatically shifts to the issuer\nfor fraudulent disputes, regardless of whether the issuer enables 3DS. We\nrecommend that you [enable 3DS](https://docs.stripe.com/issuing/3d-secure).\n- **Spending controls:** Set spending controls to block merchant categories (for\nexample, bakeries), or to set spending limits such as 100 USD per authorization\nor 3,000 USD per month. You can apply them to both cards and cardholders by\neither setting their `spending_controls` fields when you create them or by\nupdating them later. Setting spending controls is particularly effective when a\ncard or cardholder has an expected spending pattern and it’s likely that\nanomalous spending is unauthorized. Read more on [spending controls and how to\nconfigure them](https://docs.stripe.com/issuing/controls/spending-controls).\n- **VAA score:** Stripe has certain fraud protections on Issuing transactions,\nwhich includes automatically blocking authorizations that look suspicious using\nVisa’s Advanced Authorization (VAA) score in some cases. If you want us to\nexpose this score to you through the API, contact\n[treasury-support@stripe.com](mailto:treasury-support@stripe.com).\n- **Flag high risk transactions for cardholder review:** In some situations you\nmight want to flag card transactions that appear to be high risk to your\nconnected accounts and request that they confirm whether the transaction is\nauthorized. Some ideas of what to look out for include:- Transactions that are\nfor large or rounded amounts\n- Transactions that significantly exceed the average charge size for the\ncardholder\n- Transactions at retailers where gift cards are commonly sold (grocery stores,\nfor example)\n- [Force\ncaptures](https://docs.stripe.com/issuing/purchases/transactions#handling-other-transactions)\n-\n[Overcaptures](https://docs.stripe.com/issuing/purchases/transactions#handling-other-transactions)\n- Transactions on businesses based outside of the country where the cardholder\nresides\n\n#### ACH debit transaction fraud mitigation strategies\n\n- **Flag high risk transactions for accountholder review:** In some situations\nyou may want to flag ACH debit transactions that appear to be high risk to your\nconnected accounts and request that they confirm whether the transaction is\nauthorized. Some types of debits to monitor include:- Debits that are for large\namounts or for an amount close to enforced limits\n- Debits associated with a new originating party\n- Debits attempted when there aren’t sufficient funds in the account to cover\n\nThis step is particularly critical if you have reason to believe the account\ndetails of one of your accountholders may be compromised, as it can leave them\nsusceptible to ACH debit transaction fraud.\n\nIf a received ACH is suspected to be unauthorized activity, we recommend\nprocessing a\n[DebitReversal](https://docs.stripe.com/api/treasury/debit_reversals)\nimmediately, which can be done through the Stripe Dashboard or via API. Debit\nreversals allow you to reverse the transaction, but must be completed within two\nbusiness days of the transaction being received. This short time window\nunderscores the importance of vigilance of ACH debit activity. More on\nDebitReversals and how to use them effectively can be found in [Moving money\nwith Treasury using DebitReversal\nobjects](https://docs.stripe.com/treasury/moving-money/financial-accounts/out-of/debit-reversals).\n\nTo further mitigate this risk, you should encourage your users to leverage\n“push” funding methods like\n[OutboundTransfers](https://docs.stripe.com/treasury/moving-money/financial-accounts/out-of/outbound-transfers)\nand may consider automatically processing reversals in scenarios you consider\nhigh risk. If you would like to automate reversals on individual financial\naccounts, you may also request access to API-based disablement of\n[ReceivedDebits](https://docs.stripe.com/treasury/moving-money/financial-accounts/out-of/received-debits).\n\n## Interested in getting early access to ReceivedDebits disablement?\n\nDisablement of ReceivedDebits via API is currently in beta. To learn more and\nget access to the beta, enter your email address below. Once we confirm your\neligibility, we'll reach out with next steps.\n\nCollect EmailSign upRead our [privacy policy](https://stripe.com/privacy).\n## Account takeover (ATO) fraud\n\nAccount takeover fraud occurs when a third party gains access to your connected\naccount. Typically, the attacker takes unauthorized actions on the account\nmotivated by financial gain. The most common actions taken by the attacker on a\nTreasury account are wiring or transferring funds to an external financial\naccount and issuing a new card or viewing raw PAN data of an existing card and\nmaking unauthorized transactions on the card.\n\nProtecting against account takeovers depends on whether your platform or Stripe\nowns the login steps and verification for your connected accounts.\n\nThe following are some examples of controls that you can put in place to protect\nagainst account takeovers:\n\n- [Implement 2FA](https://support.stripe.com/topics/2fa) on all connected\naccounts.\n- Educate connected accounts on phishing and not sharing their 2FA codes.\n- Enforce unique password policies.\n- Collect device and IP address information to trace whether high risk actions\n(such as password updates, 2FA method updates, creating a new card, sending\nfunds to a new external financial account) are performed from aged devices or IP\naddresses.\n- Monitor IP activity for logins from previously unseen locations or hosting\nproviders.\n- Implement challenges for high-risk actions, for example, requiring a 2FA code\nto send a wire to a new account.\n- Monitor connected accounts for anomalous activity. Examples include a transfer\nor wire that zeros out the entire treasury balance or international card\nspending.\n\nIf you suspect an account has been taken over, set the `outbound_flows` and\n`inbound_flows`\n[features](https://docs.stripe.com/treasury/account-management/financial-account-features#restricted-features)\nto `restricted`, expire existing login sessions, and disable login. After you\nrestrict the account, work with the original account owner to verify their\nidentity and restore access to the account. Remediation is typically executed by\ncalling the phone number associated with the customer (pre takeover) and\nverifying various pieces of personally identifiable information (PII) with the\ncustomer. After you confirm the customer’s identity, you can assist them with\nresetting their password or 2FA device (if changed during the takeover),\nre-enabling login, and re-enabling treasury capabilities previously set to\nrestricted. Financial reimbursement for any funds lost during the takeover is\ndependent on your internal policies.\n\n## Other risk mitigation considerations\n\nIn addition to those already described, take the following risk mitigation\nconsiderations into account also.\n\n### Faster payout controls\n\nOffering [faster\npayouts](https://docs.stripe.com/treasury/moving-money/payouts#automatic-payouts)\nto new businesses presents a risk, so approach it cautiously. To mitigate that\nrisk, we recommend that you implement controls to turn off faster payouts\navailability if you see an influx of fraud.\n\nOffer faster payouts availability to connected accounts only after they meet a\ndefined trust level, for example:\n\n- More than 60 days of processing\n- Greater than 2,000 USD lifetime total volume\n- Less than 3% chargeback or return rate\n- Offer T+1 faster payouts to connected accounts before graduating them to T+0\nfaster payouts\n- While limiting faster payouts availability to trusted connected accounts helps\nmitigate fraud at signup, it doesn’t remove the possibility of fraud on account\ntakeovers (ATO) or good-merchant-gone-bad (GMGB) accounts. It’s important to\nhave alerts in place to trigger on businesses who display anomalous charge\npatterns usually indicative of ATO or GMGB (a spike in processing volume or a\nshift in average transaction size, sometimes affiliated with change in bank\naccount or login).\n\n### ACH debit controls\n\nOriginating ACH debits through Treasury\n[InboundTransfers](https://docs.stripe.com/treasury/moving-money/financial-accounts/into/inbound-transfers)\npresents an elevated risk of fraud because they’re *pull* payments. That means\nthat Treasury account holders input customer details and pull funds from the\ncustomer’s account, rather than the customer pushing funds from their own\naccount. Because of the elevated risk profile, we suggest a number of risk\nmitigation efforts for originated ACH debit:\n\n- Make sure that the business in question has permission to debit funds from a\nbank account and that the account is verified. Read more about [ACH Debit\nauthorization and\nverification](https://docs.stripe.com/payments/ach-direct-debit).\n- For ACH debit, funds can be returned for a number of reasons, ranging from\nfraud to insufficient funds. Most failures (for example, insufficient funds or\nan invalid account) occur within 4 business days of their post date, so it’s\nimportant to make sure that connected accounts that haven’t built trust yet\naren’t paid out funds prior to this initial settlement period passing.\n- Given the elevated risk profile of ACH debit, you need to either restrict\naccess to trusted connected accounts or place strict limits and monitor use to\nidentify fraudulent actors. For example, new accounts might have their ACH debit\nlimited to a transaction size of 2,000 USD and a weekly limit of 5,000 USD to\nstart out. As more trust builds with connected accounts, you can increase these\nlimits alongside their business growth.\n\n## Fraud remediation checklist\n\nWhen you suspect fraud, taking the appropriate actions to minimize financial\nloss and further fraudulent activity is extremely important. You can think of\nfraud remediation as two main steps:\n\n- Stop the immediate damage.\n- Build long term solutions to mitigate future abuse. Some important steps you\ncan take when you identify fraud include the following:- Make sure all funds\nflows and money movement are blocked for the account in question. For example,\nset the `outbound_flows` and `inbound_flows`\n[features](https://docs.stripe.com/treasury/account-management/financial-account-features#restricted-features)\nto `restricted`.\n- Determine why the account in question wasn’t identified by fraud and risk\ncontrols and make sure that additional controls are put in place. When\nfraudsters identify a gap in risk systems, they continue to try to exploit this\ngap until it’s successfully fixed.\n- Identify any other accounts attempting similar fraudulent behavior. As\nmentioned previously, fraudulent actors will continue to exploit gaps as long as\nthey exist, and will try to do so at scale to maximize their return. When you\nidentify one case of fraud, it’s important to make sure that the same type of\nfraud isn’t occurring on other accounts, and that the perpetrator doesn’t simply\ncreate a new account and repeat the same actions. Doing so allows you to\npotentially get ahead of lagging signals, such as disputes, and disincentivize\nfraudulent actors from returning by minimizing their gains.\n\n## Suggested metrics monitoring\n\nThe following are some metrics we recommend monitoring to help guide\nidentification and measurement of fraud on your Treasury-enabled customers. The\nfollowing metrics assume your connected accounts are using both our Treasury and\nPayments products. If this isn’t the case, you can modify them accordingly.\n\n### Lagging metrics\n\n- Rejection rate on Treasury-enabled accounts versus other accounts, over time\n- Absolute acquiring losses on Treasury-enabled accounts\n- Percentage of lossy accounts that are Treasury-enabled\n- Absolute loss per account on Treasury-enabled accounts versus other accounts\n- Time to acquiring loss on Treasury-enabled accounts versus other accounts\n\n### Leading metrics\n\n- Signup rate over time for Treasury-enabled accounts versus other accounts\n- Transfer amount anomalies: New connected accounts with high volume of\n`ReceivedTransfers` (not including acquiring payouts) in the first 30 days\n- Transfer amount anomalies: Low acquiring processing volume with high volume\n`ReceivedTransfers` (not including acquiring payouts)\n- List of accounts with material `ReceivedTransfers` followed by\n`OutboundTransfers` bringing the Treasury balance to zero\n- List of accounts who exceed certain total amounts in international card\nspending or `OutboundTransfers`\n\n## Links\n\n- [KYC](https://en.wikipedia.org/wiki/Know_your_customer)\n- [3D Secure (3DS)](https://docs.stripe.com/payments/3d-secure)\n- [faster\npayouts](https://docs.stripe.com/treasury/moving-money/payouts#payouts)\n- [Stripe Identity](https://docs.stripe.com/identity)\n-\n[feature](https://docs.stripe.com/treasury/account-management/financial-account-features#restricted-features)\n- [fraud protection](https://docs.stripe.com/issuing/manage-fraud)\n- [Issuing disputes](https://docs.stripe.com/issuing/purchases/disputes)\n- [filing ACH Debit\ndisputes](https://docs.stripe.com/treasury/moving-money/financial-accounts/out-of/debit-reversals)\n- [new connect and financial\naccount](https://docs.stripe.com/treasury/account-management/financial-accounts#close-a-financialaccount)\n- [enable 3DS](https://docs.stripe.com/issuing/3d-secure)\n- [spending controls and how to configure\nthem](https://docs.stripe.com/issuing/controls/spending-controls)\n- [Force\ncaptures](https://docs.stripe.com/issuing/purchases/transactions#handling-other-transactions)\n- [DebitReversal](https://docs.stripe.com/api/treasury/debit_reversals)\n-\n[OutboundTransfers](https://docs.stripe.com/treasury/moving-money/financial-accounts/out-of/outbound-transfers)\n-\n[ReceivedDebits](https://docs.stripe.com/treasury/moving-money/financial-accounts/out-of/received-debits)\n- [privacy policy](https://stripe.com/privacy)\n- [Implement 2FA](https://support.stripe.com/topics/2fa)\n- [faster\npayouts](https://docs.stripe.com/treasury/moving-money/payouts#automatic-payouts)\n-\n[InboundTransfers](https://docs.stripe.com/treasury/moving-money/financial-accounts/into/inbound-transfers)\n- [ACH Debit authorization and\nverification](https://docs.stripe.com/payments/ach-direct-debit)",
  "metadata": {
    "title": "Treasury fraud guide | Stripe Documentation",
    "description": "Learn best practices for managing fraud as a Treasury platform.",
    "sourceURL": "https://docs.stripe.com/treasury/examples/fraud-guide"
  }
}