{
  "content": "# Stripe Managed Risk\n\n## Let Stripe protect your platform from losses that result from negative balances on your connected accounts.\n\nStripe Managed Risk is an end-to-end business risk management solution for\nplatforms that includes ongoing monitoring and mitigation for credit and fraud\nrisk. In addition, Stripe assumes risk of loss in the event of unrecoverable\nnegative balances on connected accounts.\n\nWhen Stripe manages risk for connected accounts, we monitor risk signals, apply\nrisk interventions in response to observed signals, and seek to recover negative\nbalances. You aren’t liable for unrecoverable negative balances on your\nconnected accounts.\n\n## Components of Stripe Managed Risk\n\nStripe Managed Risk has three core components:\n\n- Screening and detection\n- Monitoring and mitigation\n- Stripe negative balance liability\n\n### Screening and detection\n\nWhen you onboard new connected accounts to your platform, Stripe conducts a\nnumber of up-front risk-based onboarding checks. These checks verify adherence\nto our compliance and regulatory standards and help identify fraud and credit\nrisk signals.\n\nYou can implement additional onboarding verifications to meet relevant\nregulations for products or services offered by your platform or connected\naccounts.\n\n### Monitoring and mitigation\n\nStripe performs ongoing monitoring of risk signals (KYC, transaction data, and\nso on) to identify connected accounts that might pose credit or fraud risks. We\nuse automated processes, such as machine learning models and Stripe risk team\nmanual reviews. Stripe automates interventions against risky businesses to\nreduce fraud and risk of loss. For example, Stripe processes might flag a risky\nconnected account in response to a number of signals such as elevated losses,\nspikes in chargeback rates, or refunds. In response, Stripe might take targeted\naction on that account using any of a large number of interventions to reduce\nrisk exposure. Some of the Stripe key risk interventions include:\n\n- **Changes to capabilities**: In response to risk signals, Stripe might slow or\npause payouts, or pause a connected account’s ability to process charges.\n- **Reserves**: In response to risk signals, Stripe might hold a reserve on the\nconnected account balance. It can be a fixed amount or a percentage of\ntransaction amounts.\n- **Offboarding**: In the extreme case that a business poses significant risk to\nStripe or your platform (ToS violations, fraud, and so on), Stripe might\ndeactivate the connected account.\n\n### Stripe negative balance liability\n\nWhen you use Stripe negative balance liability for connected accounts, Stripe\nassumes the risk of losses from unrecoverable negative balances on those\nconnected accounts. In particular, Stripe doesn’t deduct unrecoverable negative\nconnected account balances from your platform account.\n\n### Requirements to use Stripe Managed Risk\n\nStripe Managed Risk has these requirements:\n\n- **Radar**: You must use Radar on connected account transactions. (For users\nwho pay Stripe’s listed prices for payments processing, Radar is included at no\nadditional cost.)\n- **Connected account onboarding**: When onboarding connected accounts, you must\nuse either Stripe-hosted onboarding or the embedded onboarding component.\nConnected accounts where Stripe is liable for negative balances, including\nStandard accounts, can’t complete onboarding in any other way.\n- **Connected account dashboard**: Connected accounts where Stripe is liable for\nnegative balances must have access to a Stripe-hosted dashboard, or your\nplatform’s interface must include both the [Notifications\nBanner](https://docs.stripe.com/connect/supported-embedded-components/notification-banner)\nand [Account\nManagement](https://docs.stripe.com/connect/supported-embedded-components/account-management)\nembedded components. Some Stripe risk interventions require them to allow\nconnected accounts to update their business information.\n- **Connected account capability and service agreement**: When creating\nconnected accounts, you must request the\n[card_payment](https://docs.stripe.com/connect/account-capabilities#card-payments)\ncapability and the\n[full](https://docs.stripe.com/connect/service-agreement-types#full) Stripe\nService Agreement type.\n\n## Stripe Managed Risk for connected accounts\n\nYou define how your connected accounts interact with Stripe Managed Risk by\nconfiguring their onboarding flow and their dashboard or other platform\ninterface.\n\n### Connected account onboarding flow\n\nWhen Stripe is liable for negative balances, you can onboard connected accounts\nusing Stripe-hosted onboarding or the [embedded onboarding\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/account-onboarding).\nWith either option, Stripe collects the required information for risk management\nand prompts the connected account to accept the Stripe terms of service. You can\nprefill any information that you have previously collected in your onboarding\nflow using the Accounts API.\n\n### Connected account dashboard or platform interface\n\nMost connected accounts are likely to have few, if any, interactions with Stripe\nrisk management. However, in the event that Stripe requires additional\nrisk-related information from one of your connected accounts, Stripe notifies\nyour connected account and provides a pathway for them to respond to and resolve\nthe intervention.\n\nTo resolve an intervention, a connected account owner might provide additional\nKYC information, complete a form, or provide other documentation. Stripe reviews\ntheir response to assess whether to lift, revise, or continue the intervention.\n\n### Connected accounts with access to the full Stripe Dashboard\n\n### Connected accounts with access only to embedded components\n\n## Fees for Stripe Managed Risk\n\nThe fees for Stripe Managed Risk depend on the economic model:\n\n- **Revenue share**: For connected accounts where the platform uses a revenue\nshare economic model for payments processing, including Standard accounts, we\ninclude Stripe Managed Risk at no additional cost.\n- **Buy rate**: For connected accounts where the platform uses a buy-rate\neconomic model, Stripe Managed Risk fees depend on the pricing arrangements:-\n**Listed pricing**: For platforms that pay listed pricing for payments\nprocessing and Connect fees, we include Stripe Managed Risk at no additional\ncost.\n- **Negotiated pricing**: For platforms with negotiated pricing for either\npayments processing or Connect fees, Stripe Managed Risk incurs additional fees.\nFor more information, contact Stripe Sales.\n\n## Links\n\n- [Notifications\nBanner](https://docs.stripe.com/connect/supported-embedded-components/notification-banner)\n- [Account\nManagement](https://docs.stripe.com/connect/supported-embedded-components/account-management)\n-\n[card_payment](https://docs.stripe.com/connect/account-capabilities#card-payments)\n- [full](https://docs.stripe.com/connect/service-agreement-types#full)\n- [embedded onboarding\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/account-onboarding)",
  "metadata": {
    "title": "Stripe Managed Risk | Stripe Documentation",
    "description": "Let Stripe protect your platform from losses that result from negative balances on your connected accounts.",
    "sourceURL": "https://docs.stripe.com/connect/risk-management/managed-risk"
  }
}