{
  "content": "# Dispute response best practices\n\n## Learn how to format the most convincing evidence to challenge a dispute.\n\nWhen an account owner disputes a payment with their bank, they must provide\nevidence to support their claim. In many cases, the bank’s goal is to protect\ntheir customer from having to pay for something they didn’t authorize or feel\nwas misrepresented or damaged.\n\nAs the seller, you have the right to counter the account owner’s claim and\nprovide evidence that supports your case. While Stripe doesn’t influence the\nultimate outcome of the bank’s decision, our goal is to help you defend the\ndispute. We base the best practices that we provide here on our deep exposure to\ndispute resolution.\n\n## Likelihood of winning disputes\n\nYour chances of overturning a dispute vary significantly based on several\nfactors, including:\n\n- The type of dispute\n- The strength of the evidence you submit\n- The type of payment (debit, credit, digital wallet, and so on)\n- The type of purchase (online, in-person, physical product, service, and so on)\n\nStripe’s [Radar for Fraud Teams](https://stripe.com/radar/fraud-teams) uses\nRadar’s machine learning (ML) models to estimate your chances of winning a\ndispute. It gives you a prediction score in the dispute details page of your\nDashboard, so you can prioritize disputes.\n\nIf you’re enrolled in Radar, but don’t see a win likelihood prediction next to a\ndispute, it’s likely one of the following reasons:\n\n- The payment wasn’t made with a credit card\n- The payment has only received an\n[inquiry](https://docs.stripe.com/disputes/how-disputes-work#inquiries), not an\nactual dispute\n- An error prevented us from generating a prediction (this is rare)\n\nThe prediction score ranks your likelihood of winning a dispute that you’ve\nsubmitted relevant evidence for from lowest (one dot) to highest (five dots).\nThe following table shows the expected win percentage for each ranking. Even in\nthe most favorable cases, it’s very difficult to overturn a disputed payment.\n\nDispute Win Likelihood RankingChance of Winning the Dispute5 dots60%4 dots40%3\ndots25%2 dots15%1 dot5\n## Keep your evidence relevant to the dispute reason and to the point\n\nCard issuers review thousands of dispute responses every day. Writing a long\nexplanation to them isn’t going to make your responses more convincing.\nSimilarly, providing evidence about your clearly stated return policy isn’t\nrelevant for a dispute claiming that the customer never received the product.\nInstead, describe clearly and concisely why the claim is unreasonable and how\nyour evidence proves that, using a neutral and professional tone. For example:\n\nJenny Rosen purchased [product] from our company on [date] using a Visa credit\ncard. We shipped the product on [date] to the address provided by the customer,\nand it was delivered on [date], as shown in the tracking file provided, so the\nclaim that the product was not received isn’t true.\n\nYou can investigate the dispute while collecting evidence. For example, you can\nreview Google Maps and Street View to see where your delivery took place, or\ncheck social media to help establish the customer as the legitimate cardholder.\n\nMany businesses also include email correspondence or texts with their customer,\nbut be aware that these exchanges don’t verify identity. If you include them,\nonly include the relevant excerpts. For example, if you include a long email\nthread, redact any duplicated copy in the chain.\n\nKeep your evidence factual, professional, and concise. Providing too little\nevidence is a problem, but overwhelming the card issuer with unnecessary content\ncan obscure your argument.\n\n## Limit evidence file length\n\nCard issuers manually review thousands of dispute responses daily and won’t comb\nthrough lengthy files to find the relevant argument for the network reason code.\n\nFor example, if the dispute network reason code indicates “Canceled\nMerchandise”, but the customer didn’t comply with your cancellation policy,\ndon’t submit your entire Terms and Conditions agreement. Upload only the\nrelevant cancellation policy section and use a callout or arrow to emphasize the\ndetails your customer violated.\n\n![Comparison of good and bad evidence file\nexamples](https://b.stripecdn.com/docs-statics-srv/assets/best-practice-file-length.270360400d9d0c70979f5f5e916d043a.png)\n\n- Do:- Paste relevant excerpts from your terms into a single doc.\n- Outline or underline text specific to the dispute type.\n- Don’t:- Upload your entire terms of service.\n- Provide links to your terms of service or other relevant content on separate\ndrives or websites.\n\nYou can also decrease file size by:\n\n- Reducing font size\n- Single spacing documents\n- Shrinking images within PDFs\n\nThe following information is essential for file types:\n\nEvidence typeRelevant dataReceiptDate, currency, amount of disputed\nitemsShipping documentationDelivery date and full shipping addressCancellation\npolicy or other Terms of serviceRelevant subsections onlyCustomer\ncommunicationCustomer name and relevant message\n## Include proof of customer authorization\n\nFraudulent disputes account for over half of all disputes. It’s important to\nprove the legitimate cardholder was aware of and authorized the transaction in\nsuch cases. Any data that shows proof of this is a standard part of a compelling\nresponse, such as:\n\n- AVS (Address Verification System) matches\n- CVC (Card Verification Code) confirmations\n- Signed receipts or contracts\n- IP address that matches the cardholder’s verified billing address\n\nStripe always includes any AVS or CVC results along with the purchase IP address\n(if available from your Stripe integration). But if you have any other evidence\nof authorization (for example, 3DS authentication) include it too.\n\n## Include proof of service or delivery\n\nAfter fraudulent disputes, other high frequency dispute\n[reasons](https://docs.stripe.com/disputes/categories) include claims from\ncardholders that products or services:\n\n- Weren’t delivered\n- Were defective or unsatisfactory\n- Weren’t as described\n\nProvide proof of service or delivery to refute such claims.\n\nFor a merchandise purchase, provide proof of shipment and delivery that includes\nthe full delivery address, not just the city and postal code verification.\n\nIf your customer provides a “Ship to” name that differs from their own (for\nexample, a gift purchase), be prepared to provide documentation explaining why\nthey’re different. While it’s common practice to purchase and ship to an address\nthat doesn’t match the verified billing address for the card, this is an\nadditional dispute risk.\n\nIf your business provides digital goods, include evidence such as an IP address\nor system log proving the customer downloaded the content or used your software\nor service.\n\n## Include a copy of your terms of service and refund policy\n\nWhen it comes to disputes, fine print matters. For returns or refunds, it’s\ncritical to provide proof that your customer agreed to and understood your terms\nof service at checkout, or didn’t follow your policies. Include a clean\nscreenshot of how you present your terms of service during checkout, with the\nrelevant policy clearly emphasized.\n\nDon’t, however, include the text of your entire policy, because card issuers\nwon’t read through it all to find the relevant copy.\n\n## Combine files of the same evidence type\n\nYou must specify an evidence type for each file you upload, and you can only\nsubmit one piece of evidence per type. For example, you can combine several\nitems representing communication with your customer (email messages, text\nscreenshots, phone transcripts, and so on) into a single file for the `Customer\ncommunication` evidence. This also decreases your overall file length.\n\n## Formatting documents and images to upload\n\nInclude large, clear images for review. Whether you upload files through the\nDashboard or the API, both have limitations on the acceptable file types and the\ncombined file size.\n\n- Only PDF, JPEG, or PNG file types are accepted\n- The combined file size can’t be more than 4.5MB\n- The combined page count must be less than 50 pages\n- You can compress your files with tools such as\n[Smallpdf](https://smallpdf.com/)\n\nWhen submitting documents or images as evidence, use the following\nrecommendations to make sure they can remain legible:\n\n- Use a 12 point font or larger\n- Make sure that documents are US Letter or A4 size, in portrait orientation\n(you can still add screenshots to your documents in landscape orientation)\n- Use bold text, callouts, or arrows to draw attention to pertinent information\n- Avoid using color highlighting\n\nWhen uploading screenshots:\n\n- Crop the screenshot to the area of interest and circle any key components (for\nexample, delivery confirmation or signature)\n- Use the text fields in the dispute evidence form to describe what the image\ncontains and how it supports your response\n\nThe card issuer won’t review a response containing any illegible text or data.\n\n## Accepting disputes\n\nYou can accept a dispute, effectively agreeing that the cardholder’s reason for\nthe dispute is valid. Accepting a dispute isn’t considered an admission of\nwrongdoing and is sometimes the most appropriate response. The customer has\nalready received their refund through the dispute process—–if you agree with the\nrefund, it’s best to accept the dispute.\n\nTake this action if you don’t intend to respond and submit evidence. Although\naccepting disputes doesn’t negatively affect your business any further, it’s not\na viable alternative to an effective refund or returns policy. Dispute activity\nis calculated based on the disputes received, not won or lost, so dispute\nprevention is critical.\n\n#### Note\n\nDisputes incur a dispute fee that still applies if you accept the dispute.\n\n## Misunderstandings\n\nFor disputes that are the result of a misunderstanding, your customer can tell\ntheir card issuer that they [no longer dispute the\ntransaction](https://docs.stripe.com/disputes/withdrawing). We recommend you\nstill submit evidence to show that the payment was valid and to make sure the\ncard issuer knows you’re not accepting the dispute.\n\nIn cases where you agree that the customer should keep the disputed funds,\naccept the dispute rather than ask the cardholder to withdraw the dispute for a\nregular refund. Remember, the card networks don’t consider how many disputes you\nwin or lose, only how many you receive—a withdrawn dispute still counts as a\ndispute.\n\n## Disputes on partially refunded payments\n\nWhile uncommon, a customer can dispute a payment for the full amount even if\nthey’ve already received a partial refund (for example, a refund of a smaller\namount that has been agreed upon). We understand this is frustrating as it\namounts to an over-refund of more than the original purchase. Always respond in\nsuch cases because card issuers are very willing to rectify this situation.\n\n#### Note\n\nBecause merchants can’t contest Cartes Bancaires disputes, you can’t ask the\nissuer to consider an existing partial refund when the full amount of a Cartes\nBancaires payment is disputed.\n\nEven if you plan to accept the un-refunded portion of the dispute, it’s\nimportant to provide evidence of the partial refund in your response. Include\nthe amount and date of the refund, and even a screenshot of the refund\ninformation from your Dashboard (this is known as a “credit issued” response).\n\nIn most cases, the card issuer cancels the original dispute and then creates a\nseparate one for the corrected amount. On Stripe, we use the existing dispute to\ntrack the overall outcome. If the dispute is fully resolved in your favor, you\nreceive the entire amount back. If it’s not, you only receive the partially\nrefunded amount. In this case, the dispute’s `status` is set to `lost`.\n\n## Links\n\n- [Radar for Fraud Teams](https://stripe.com/radar/fraud-teams)\n- [inquiry](https://docs.stripe.com/disputes/how-disputes-work#inquiries)\n- [reasons](https://docs.stripe.com/disputes/categories)\n- [Smallpdf](https://smallpdf.com/)\n- [no longer dispute the\ntransaction](https://docs.stripe.com/disputes/withdrawing)",
  "metadata": {
    "title": "Dispute response best practices | Stripe Documentation",
    "description": "Let Stripe's history and experience with dispute outcomes help you compile the most convincing set of evidence to counter a dispute, or choose not to.",
    "sourceURL": "https://docs.stripe.com/disputes/best-practices"
  }
}