{
  "content": "# Consolidate your SSO integrationsPublic preview\n\n## Consolidate single sign-on (SSO) settings across multiple accounts.\n\nUse Stripe Organizations to create a centralized organization for managing and\noperating across multiple Stripe accounts. If you’ve configured single sign-on\n(SSO) for user authentication, make sure that all your Stripe accounts share the\nsame SSO integration before onboarding into an Organization. Whether you use\nOrganizations or not, we recommend consolidating SSO integrations.\n\nThis guide outlines the process of consolidating SSO integrations across\nmultiple accounts. You must consolidate multiple Okta apps (that each\nauthenticate users to a separate Stripe account) to a single Okta app that\nauthenticates users to multiple Stripe accounts. If you’ve already consolidated\nyour SSO integrations, or initially setup Okta as a single integration with\nmultiple accounts, you don’t need to take any additional steps.\n\nThis consolidation doesn’t require any changes to your group assignments or\ndowntime for users that log into Stripe.\n\n## Example SSO setup prior to consolidation\n\nFollow this guide to learn how to consolidate [SSO\nsettings](https://dashboard.stripe.com/org/settings/security/user_authentication)\nfor multiple Stripe accounts that belong to a fictitious company called Acme\nInc. Acme Inc has four Stripe accounts, each with a separate Okta app and SSO\nintegration:\n\n- Acme Financial\n- Acme Travel\n- Acme Insurance\n- Acme Consulting\n\nIn Okta, Acme set up a separate group for each role users require in each Stripe\naccount. For example:\n\n!\n\nIn the **Profile Editor** for each app, Acme created a mapping for the roles in\neach Stripe account:\n\n!\n\n!\n\nNext, Acme created a separate Okta app for each Stripe account.\n\n!\n\nEach account contains one **Attribute Statement**, which defines the roles users\nhave for that one Stripe account.\n\n!\n\nTo onboard your accounts to Organizations, you can’t have separate Okta apps and\nSSO integrations for each Stripe account. You must consolidate these Okta apps\ninto one Okta app for all accounts and preserve granular role assignments so\nthat users can access specific accounts in Stripe.\n\n[Designate a primary Okta\nApp](https://docs.stripe.com/get-started/account/orgs/sso-consolidation#designate-okta-app)\nChoose one of your existing Okta apps to be the new primary Okta app.\n\n!\n\n[Add a new profile mapping of roles for each Stripe\naccount](https://docs.stripe.com/get-started/account/orgs/sso-consolidation#add-profile-mapping)\nCreate a new attribute mapping for each of your Stripe accounts. This allows you\nto choose which Stripe account users have access to when assigning each group to\nthe app.\n\n!\n\nIn each profile mapping, you can configure which roles are allowed to be\nassigned. View the full list of roles and values in the [user\nroles](https://docs.stripe.com/get-started/account/teams/roles) page.\n\n!\n\n[Assign a role in the new primary\napp](https://docs.stripe.com/get-started/account/orgs/sso-consolidation#assign-role)\nFor each of your groups in Okta, assign the group to the primary app, then\nchoose roles and accounts that users in the group have access to.\n\n!\n\n!\n\n[Add an attribute statement for users’ roles in each Stripe\naccount](https://docs.stripe.com/get-started/account/orgs/sso-consolidation#add-attribute)\nIn the SAML settings of your primary Okta app, name each attribute statement\neither `Stripe-Role-acct_id` or `Stripe-Role-org_id`. Set the value as the\nprofile mapping that contains users’ roles for that Stripe account or\norganization.\n\n!\n\n[Configure SSO for all of your Stripe accounts to redirect users during\nauthentication](https://docs.stripe.com/get-started/account/orgs/sso-consolidation#configure-sso)\nNext, we need to make sure that the SSO settings in Stripe for each of your\naccounts directs to the same primary Okta app. To do this, you can update your\nSSO settings for each account.\n\nTo locate the three pieces of metadata associated with your primary app, which\nare required by Stripe in Okta, navigate to the **Sign On** tab of your primary\napp in Okta. In the bottom right corner of the page, click **View SAML Setup\nInstructions**, then copy the metadata.\n\n!\n\n!\n\nTo access your SSO settings in each Stripe account, click **Settings > Team and\nsecurity > User authentication**. Open the menu associated with the domain and\nclick **Manage SSO settings**. Paste the metadata from your primary app in Okta.\n\n!\n\nAfter you paste the metadata and confirm the changes, users can sign into Stripe\nby clicking your primary app in Okta. Use the account picker to switch accounts\nin Stripe.\n\n[OptionalSet up bookmarks in Okta to directs users to each Stripe\naccount](https://docs.stripe.com/get-started/account/orgs/sso-consolidation#bookmarks)\n\n## Links\n\n- [SSO\nsettings](https://dashboard.stripe.com/org/settings/security/user_authentication)\n- [user roles](https://docs.stripe.com/get-started/account/teams/roles)",
  "metadata": {
    "title": "Consolidate your SSO integrations | Stripe Documentation",
    "description": "Consolidate single sign-on (SSO) settings across multiple accounts.",
    "sourceURL": "https://docs.stripe.com/get-started/account/orgs/sso-consolidation"
  }
}