{
  "content": "# Connect W-8 and W-9\n\n## Use Stripe's W-8 and W-9 Connect product to collect the necessary tax forms from your users.\n\n## What’s the Stripe W-8 and W-9 Connect product?\n\nStripe’s W-8 and W-9 Connect product provides a seamless way to collect\ncertified tax information from connected accounts through the Express Dashboard\nor Stripe-hosted onboarding. This includes the name, address, and TIN (Tax ID)\nof a taxpayer. A [W-9 tax form](https://www.irs.gov/pub/irs-pdf/fw9.pdf) is for\n[US residents or\ncitizens](https://www.irs.gov/individuals/international-taxpayers/classification-of-taxpayers-for-us-tax-purposes)\nand is used to confirm their TIN (SSN/ITIN/EIN). A [W-8 tax\nform](https://www.irs.gov/pub/irs-pdf/fw8ben.pdf) is for non-US tax residents\nand is used to certify their name, address, and foreign TIN (if applicable), to\nconfirm that they’re not a US taxpayer. A non-US resident can also specify the\nappropriate treaty and/or withholding rates applicable to their business.\n\nPlatforms might be subject to IRS fines up to 290 USD per incorrect submission\nif they file 1099s with incorrect information. W-8 and W-9s provide a way for\nPlatforms to collect certified tax information throughout the year directly from\nyour Connected Accounts before issuing 1099s to make sure the correct\ninformation is used on the appropriate 1099 forms.\n\nWith the W-8 and W-9 Connect product, your connected accounts can complete the\nappropriate W8 or W9 form with a few simple clicks. Any information connected\naccounts have already provided is pre-populated onto the forms for the ease of\nyour users. They only need to confirm the information is accurate and make\nupdates where needed. No more PDFs, emails, or wet-ink signatures needed.\n\nPlatforms will have a fully customizable Dashboard which tracks the status of\nall W-8 or W-9 requests. You’ll be able to easily see which users have completed\nthe appropriate documentation and which users are still pending, and you can\ndownload PDFs of any submitted forms.\n\nConnected Accounts also have a unified tax experience where they can manage\ncompleting their tax forms and storage of their tax documents all within the\nStripe Express Dashboard.\n\n![Stripe W-8 and W-9 forms\ndashboard.](https://b.stripecdn.com/docs-statics-srv/assets/w8-w9-dashboard.fca7e6602823d2420c3c1828b4bad753.svg)\n\nStripe W-8 and W-9 forms dashboard\n\n## How does it work?\n\nPlatforms determine appropriate collection timing for when to request a W-8 or\nW-9. If choosing to collect at onboarding, all new users are asked to verify and\nattest to their tax information. If choosing to collect at a later date,\nPlatforms request W-8 or W-9 collection with the [Accounts\nAPI](https://docs.stripe.com/api/connected_accounts) and then route their user\nto verify and attest to their tax information. Platforms can also request W-8 or\nW-9 collection from all accounts—existing accounts will be notified at that\ntime.\n\n![Customize the W-8, W-9 collection\nconfiguration.](https://b.stripecdn.com/docs-statics-srv/assets/w8-w9-platform-settings.470e604d117bbd4bac5cd400d59b0eb7.png)\n\nCustomize the W-8 and W-9 collection configuration\n\nPlatforms have full customization in setting enforcement thresholds to determine\nwhen Connected Accounts will be required to submit a W-8/W-9 tax form:\n\n- **Volume**: Block payouts if a W-8 or W-9 isn’t submitted after processing *x*\nUSD.\n- **Time**: Block payouts if a W-8 or W-9 isn’t submitted after *x* days.\n- **Combo**: Block payouts if a W-8 or W-9 isn’t submitted after *x* days or\nafter processing *x* USD.\n\n## How do I get started?\n\nCurrently, access to Stripe’s W-8/W-9 Connect product is limited to US preview\nusers. To request access to the preview and to learn more about pricing, reach\nout to your account team or [contact Stripe](https://stripe.com/contact/sales)\nfor more information.\n\n## Links\n\n- [W-9 tax form](https://www.irs.gov/pub/irs-pdf/fw9.pdf)\n- [US residents or\ncitizens](https://www.irs.gov/individuals/international-taxpayers/classification-of-taxpayers-for-us-tax-purposes)\n- [W-8 tax form](https://www.irs.gov/pub/irs-pdf/fw8ben.pdf)\n- [Accounts API](https://docs.stripe.com/api/connected_accounts)\n- [contact Stripe](https://stripe.com/contact/sales)",
  "metadata": {
    "title": "Connect W-8 and W-9 | Stripe Documentation",
    "description": "Use Stripe's W-8 and W-9 Connect product to collect the necessary tax forms from your users.",
    "sourceURL": "https://docs.stripe.com/connect/connect-w8-w9-onboarding"
  }
}