{
  "content": "# Support recommendations and FAQ templates\n\n## FAQ templates for platforms using Stripe Express for pre-filing confirmation and e-delivery of 1099 tax forms.\n\nWe know that supporting your connected accounts during tax season can be tricky.\nWe’ve created this guide to address the top reasons platforms contact Stripe\nsupport for help with connected accounts. We’ve assembled a set of questions and\nresponses based on the questions connected accounts most frequently ask\nplatforms during 1099 tax season. You can use these questions and responses as\npart of your own tax support strategy.\n\n## Platform support recommendations\n\nThe following sections represent the questions platforms often contact Stripe\nsupport about during 1099 tax season, along with our recommendations for how you\ncan proactively support your connected accounts.\n\n### A connected account wants to know if they’ve already been sent a pre-filing confirmation email from Stripe\n\nIf your platform opts for e-delivery through Stripe Express and enables the\ncollection of tax information in advance using 1099 tax form settings, Stripe\nsends emails to the connected accounts on behalf of platforms. We do this to\nconfirm their tax information and provide e-delivery consent through Stripe\nExpress. To check whether we sent a pre-filing confirmation email to your\nconnected account:\n\n- Head to the [1099 tab](https://dashboard.stripe.com/connect/taxes/forms) of\nthe Tax Forms dashboard.\n- Use the filter **Stripe merchant ID** to locate the connected account’s 1099\ntax form.\n- Check the Pre-filing confirmation email status and share with the payee.\n\n![Tax form with pre-filing confirmation\nstatus](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-pre-filing-confirmation-status.15e4a385e3360ece2cd743f4285e93b3.png)\n\nThe Pre-filing confirmation property has the following statuses:\n\n- **Queued**: This connected account is in the queue and we’ll send their\npre-filing confirmation email soon.\n- **Sent**: We sent this connected account their pre-filing confirmation email.\n- **Not eligible**: This connected account isn’t eligible for inclusion in\npre-filing confirmation. Possible reasons for ineligibility include:- The\naccount is missing an email address.\n- The account is under the 1099 reporting threshold\n- The account’s configuration excludes it from eligibility. See [Edge\nCases](https://docs.stripe.com/connect/platform-express-dashboard-taxes-faqs#edge-cases-for-pre-filing-confirmation-and-e-delivery-via-stripe-express)\nfor more information.\n- **Not Sent**: This connected account is eligible but wasn’t sent an invite\nprior to the cutoff date for pre-filing confirmation. See [Tax season 2024\nchecklist](https://docs.stripe.com/connect/get-started-tax-reporting#tax-season-checklist)\nfor more details.\n\n### A connected account hasn’t received or can’t find their pre-filing confirmation email from Stripe\n\nTo assist a connected account with getting their pre-filing confirmation email:\nBefore taking any steps in the [1099\ntab](https://dashboard.stripe.com/connect/taxes/forms) of the Tax Forms\ndashboard, advise your connected account to:\n\n- Check their inbox and spam folders for email with this subject line, **Get\nyour [Platform_Name] 2024 tax forms faster by enabling e-delivery**.\n- Use the [self-serve\ntool](https://support.stripe.com/express/how-do-i-get-a-new-invite-link) to\nresend an invite email to themselves.\n\n#### Note\n\nThe email address must match the one associated with their Stripe account.\n\nIf those options don’t work, head to the [1099\ntab](https://dashboard.stripe.com/connect/taxes/forms) of the Tax Forms\ndashboard to troubleshoot:\n\n**Check if the payee is 1099 eligible**:\n\n- Use the filters in the [1099\ntab](https://dashboard.stripe.com/connect/taxes/forms) of the Tax Forms\ndashboard to locate the connected account’s 1099 tax form.\n- Review the Pre-filing confirmation status in the Tax Form details. If the\nstatus is **Not eligible** use the information in the tooltip to understand why.\n\n**Check if the payee has the correct email address or is missing an email\naddress**:\n\n- Select the Edit option next to the email address field and add the correct\nemail address. This updates the email address associated with the connected\naccount itself, to avoid issues in future tax seasons.\n- Learn more about other ways to [update emails for your\naccounts](https://docs.stripe.com/connect/express-dashboard-taxes#how-do-i-update-the-email-address).\n\n![Account email\naddress](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-account-email.d60fd2c08eb5fedad766f98b0e5b9502.png)\n\n![Edit account email address\nmodal](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-edit-account-email-modal.834f62cb61d6a4f2574e40b0e4146347.png)\n\n### Send your connected account a pre-filing confirmation email invite from Stripe\n\nGo to the overflow menu () and select the option to **Request pre-filing\nconfirmation** to send an invite email to the payee’s email address.\n\n![Request pre-filing confirmation\nlink](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-request-pre-filing-confirmation-link-2.26ced496f37559a3de51b65ae1913216.png)\n\n![Request pre-filing confirmation\nmodal](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-request-pre-filing-confirmation-modal.04e45b1768e12dbd2a3db1bdd09bc85c.png)\n\n### A connected account is blocked from accessing the Stripe Express dashboard\n\nIf a connected account owner fails to verify their identity, we tell them to\ncontact their platform.\n\n![The page shown when a connected account fails to verify their\nidentity](https://b.stripecdn.com/docs-statics-srv/assets/custom-hosted-form-failure.e25c0e547e804a1a3851be7b2155f5e1.png)\n\nIdentity verification failure\n\nWhen a connected account reaches out to you for failed verification, confirm\nthat the connected account owner is entering the information and that name, date\nof birth and ID number are all saved on the Stripe account. Then, reset the\naccount claim attempts for the connected account.\n\nTo reset the account claim attempts for a connected account:\n\n- Head to the [1099 tab](https://dashboard.stripe.com/connect/taxes/forms) of\nthe Tax Forms dashboard.\n- Locate the connect account’s **Account claim status**.- If the status is **Not\nclaimed, no attempts left**, go to the overflow menu () and select the option to\n**Reset account claim attempts**.\n- If the status is **Not claimed** and the payee is still doesn’t have access,\nverify that you have the most up-to-date information on file for the account,\nand send a new pre-filing confirmation invite to the connected account.\n\n![No account claims left\ntooltip](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-no-account-claims-left.528ff6502a4f88a849ecb4be24210d6b.png)\n\n![No account claims left\ntooltip](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-reset-account-claim-attempts.8589aff6f49c89a30fa85545e89a31b1.png)\n\n**Account claim status** has the following values:\n\n- **Claimed**: the connected account has completed account claim and has access\nto the Stripe Express dashboard.\n- **Not claimed, no attempts left**: the connected account has exhausted their\nattempts to complete account claim and the platform must reset them.\n- **Not claimed**: the connected account has either not attempted yet or still\nhas account claim attempts remaining.\n\n### A connected account wants to use their business tax details instead of their personal details (or vice versa) on their 1099 tax form\n\nThe tax details that appear on the 1099 tax form are determined by a connected\naccount’s [business\ntype](https://docs.stripe.com/connect/required-verification-information-taxes#required-information).\nThe IRS expects to see an SSN provided on 1099 forms for Single Person Entities\n(SPEs). To change the tax details that appear on the form, you can update the\nconnected account’s business type by:\n\n- Collect the following details from the connected account:- Desired legal\nentity type\n- Desired legal entity name and TIN\n- Locate the connected account, navigate to **Business details**, and select\n**Edit**.\n- Select **Change business type** and choose the desired **Type of business**\nand **Business structure**.\n- Follow the prompts to enter the new legal entity details for the connected\naccount’s business.\n- Return to the [1099 tab](https://dashboard.stripe.com/connect/taxes/forms) of\nthe Tax Forms dashboard and verify that the name and TIN on the 1099 tax form\nmatch what was shared with you from the connected account.\n- If necessary, edit the 1099 tax form with the newly supplied information.\n\n#### Note\n\nOnly certain user roles can update this information in the Dashboard, such as\nthe Connect Onboarding Analyst or an Admin. Tax Analysts can’t edit connected\naccount information. See [Team\nroles](https://docs.stripe.com/get-started/account/teams) documentation for more\ninformation. You can also update this information using the [accounts_update\nAPI](https://docs.stripe.com/api/accounts/update).\n\n### A connected account no longer has access to the phone number they used for their Stripe Express account\n\nTo help your connected account update their phone number:\n\n- Direct your connected account to the options at the bottom of the [Stripe\nExpress login page](http://express.stripe.com/).\n- Once there, they should select [I no longer have access to this\nphone](https://support.stripe.com/express/questions/i-lost-my-phone-or-changed-my-number-how-do-i-login-to-my-account)\nand follow the prompts to update their phone number.\n\n#### Note\n\nThe payee must have access to the email address that is listed for the connected\naccount to complete the required verification steps.\n\n### A connected account agreed to paperless delivery but also wants a postal mailed copy sent to them\n\nAfter setting up their account during pre-filing confirmation, your connected\naccount can change their delivery preferences in the Tax Forms page of Stripe\nExpress. To request a mailed copy of their 1099, they can:\n\n- Navigate to the Tax Forms page of Stripe Express.\n- Select the overflow menu () next to their most recent 1099 tax form.\n- Select **Edit information**.\n- Switch the toggle for **Postal mail delivery** from **Off** to **On**.\n\n#### Note\n\nPaperless delivery is only available if you, as the platform, have opted into\n**Optional Post Delivery** in your [Delivery\nSettings](https://docs.stripe.com/connect/tax-form-settings#delivery-method-settings)\nbefore you file your 1099 tax forms. Selecting **Optional Post Delivery** only\nallows connected accounts to change their delivery preferences; it does not\nprovide one-off postal mailings of 1099 tax forms.\n\n### A connect account has requested a transaction log of all the transactions included in their 1099 tax form\n\nSee [Export transaction\nlogs](https://docs.stripe.com/connect/calculation-methods#export-transaction-logs)\nfor instructions on exporting the logs for each 1099 form.\n\n## 1099 Tax Support FAQ template for connected accounts\n\nWe recommend creating public-facing support articles about the Stripe Express\ntax experience for your connected accounts. View a [great example from\nDoorDash](https://help.doordash.com/dashers/s/article/Common-Dasher-Tax-Questions?language=en_US).\n\n### What are 1099s?\n\n1099 forms are federal income tax information forms used to report earnings and\nproceeds other than wages, salaries, and tips (which are reported on the federal\nW-2 form). The forms are filed with the US Internal Revenue Service (IRS) and,\nif required, state tax departments. Forms must be delivered to recipients by\nJanuary 31 and can be postal mailed or sent via paperless delivery.\n\n### What is Stripe Express, and how do I access it?\n\nStripe Express allows you to update your tax information, opt into paperless\ndelivery, manage tax forms, and track your earnings. If you’re working with\n[Platform_Name] and earned $600 or more (within the calendar year in the US),\nStripe will send an email inviting you to create an account and log in to Stripe\nExpress.\n\n### How do I download the app?\n\nIf you’d like to download the Stripe Express app, you can do so here from:\n\n- **iOS:**\n[https://apps.apple.com/us/app/stripe-express/id1560214813](https://apps.apple.com/us/app/stripe-express/id1560214813)\n- **Android:** Not available\n\n### Do I have to download an app?\n\nYou don’t need to download an app. You can use either the web-based portal or\nthe Stripe Express app to access your account and tax information.\n\n### Which email address does Stripe use to send Stripe Express invitations?\n\nStripe uses the email information associated with your [insert platform name]\naccount to send you an invitation to sign up for Stripe Express.\n\nIf you’re unable to find that email, head to this [Support site\npage](https://support.stripe.com/express/how-do-i-get-a-new-invite-link) where\nyou can request a new link to be sent to your email. If you still are not able\nto locate your invite email, please reach out to [Platform_Name] support for\nhelp updating your email address and getting a new invite email.\n\n### I no longer have access to the phone number I signed up with. How do I log in to my Stripe Express account?\n\nIf you’ve lost or updated your phone number, you can select the “[I no longer\nhave access to this phone\nnumber](https://support.stripe.com/express/questions/how-do-i-login-to-my-stripe-express-account#:~:text=If%20you%27ve%20lost%20or,and%20change%20your%20phone%20number)”\noption during login or account creation to authenticate via email and change\nyour phone number.\n\n### I earned enough to need a 1099 form in 2024. Why haven’t I received an email from Stripe?\n\nIf you earned enough to need a 1099 form in 2024, you should have received an\nemail from Stripe by mid-January 2025. Emails for pre-filing confirmation will\nbe sent out starting November 4, 2024. This is separate from the email you’ll\nreceive when your form is filed in January.\n\nIf you can’t find an email from Stripe, it’s possible that:\n\n- The may be in your spam/junk mail folder. Please search your inbox for an\nemail titled: “Get your [Platform_Name] 2024 tax forms faster by enabling\ne-delivery”.\n- [Platform_Name] does not have your most current email address on file. Please\ncheck any other email addresses you may have used to sign up for\n[Platform_Name], or reach out to [Platform_Name] to update your email and have\nan invite email sent to you.\n- The email address associated with your [Platform_Name] account is incorrect,\nmissing, or unable to receive mail.\n- [Platform_Name] has chosen to postal deliver forms to you. If you haven’t\nreceived an email from Stripe or a 1099 in the mail, please reach out to\n[Platform_Name] to get a copy of your tax forms.\n\nYou may not have received an invitation for other reasons, such as:\n\n- You earned less than the threshold for your form type.\n- Your email address on file is incorrect, missing, or unable to receive email.\n- Your specific account is unsupported on Stripe Express (in uncommon situations\nwhere multiple users are sharing the same account, or the same email address is\nbeing used on more than 20 accounts)\n\n### Will I receive a 1099 form?\n\nIf you earned less than $600 over the course of the year, you may not receive a\n1099 form and one won’t be generated for you unless you meet a threshold in your\nstate. If your state has a filing threshold lower than $600, you might receive a\n1099 form.\n\nYou can check your state’s requirements here: [View 1099 state\nrequirements](https://docs.stripe.com/connect/tax-forms-state-requirements#check-1099-form-requirements-by-state).\n\n### When will I receive my 1099?\n\nYour 1099 tax form will be sent to you by January 31, 2025 (note: paper forms\ndelivered by postal delivery might take up to 10 additional business days).\n\n- Starting November 4, 2024: Stripe will email you instructions on how to set up\ne-delivery and access a Stripe Express account. If you haven’t already, you’ll\nneed to complete these steps to access your 1099 tax form electronically.\n- Before mid January: Confirm your tax information (e.g., name, address, and SSN\nor EIN) is correct and opt into paperless delivery via Stripe Express.\n- By January 31, 2025:- Your 1099 tax form will be available to download through\nStripe Express.\n- Your 1099 tax form will be mailed to you if you don’t receive an email from\nStripe or don’t consent to e-delivery. Please allow up to 10 business days for\npostal delivery.\n- [Platform_Name] will file your 1099 tax form with the IRS and relevant state\ntax authorities.\n- April 15, 2025: IRS deadline to file taxes. You’ll need your 1099 tax form to\nfile your taxes.\n\nIn January, we strongly suggest that you make sure all of your tax filing\ndetails and delivery preferences are up to date in Stripe Express. Your name,\naddress, and Taxpayer Identification Number (Social Security Number /Employer\nIdentification Number) are of primary importance.\n\n### How do I update my tax information?\n\nOpen the email from Stripe and click on the “Get started” button, which will\nprompt you to create a Stripe Express account. After you create an account,\nyou’ll be able to review your tax information (e.g., name, address, and SSN or\nEIN) and make any necessary changes via Stripe Express. Please update your\ninformation no later than mid January 2025.\n\nPlease note: If you don’t agree to paperless delivery by mid January 2025, we’ll\nautomatically mail your 1099 tax form to the address on file, so it’s critical\nthat your information is current, correct, and complete.\n\nYou may find that your 1099 tax form reports your SSN and you want to use your\nEIN (or vice-versa). If that’s the case, you’ll want to reach out to your\nplatform to update your legal entity information.\n\nPlease note: If you’re operating as an individual, Sole Proprietorship, or\nSingle Member LLC, the IRS will expect to see the individual owner’s Name and\nSSN (as opposed to Business Name and EIN) reported on your 1099 tax form.\n\n### When answering the account claim security questions, it states that my answers are incorrect, what should I do?\n\nPlease reach out to [Platform_Name] support to confirm the information that they\nhave on file against the information you are providing.\n\n### Why is Stripe requesting personal information like my Social Security Number?\n\nYour SSN, EIN, or ITIN is required to file your 1099 tax form with the IRS and\nrelevant state tax authorities.\n\n### Is my tax information secure?\n\nStripe’s security tools and best practices ensure that your sensitive\ninformation is safely stored and encrypted. [Learn\nmore](https://stripe.com/legal/privacy-center) about the safeguards we’ve put in\nplace to protect your information. Please make sure to keep your login\ncredentials for Stripe Express secure.\n\n### How can I download my 1099 tax form?\n\nIf you create a Stripe Express account and agree to paperless delivery, Stripe\nwill email you to let you know when your 1099 tax form is available for download\nvia Stripe Express. If you don’t agree to paperless delivery, Stripe will mail\nyou a paper copy of your 1099 tax form instead.\n\n### My information has changed since I signed up for [Platform_Name]. How can I edit information?\n\nUpdate your account information in the **Account** tab:\n\n- Under **Stripe Express Account**, you can update the email address and phone\nnumber used to log in to Stripe Express. You can only update one contact method\nat a time.\n- Under **Language preference**, you can choose your preferred language for\nStripe Express.\n- Under **Payout and Professional Details**, you can update personal and legal\nentity information and view your bank account or debit card information for\npayouts. To update your payout details, please reach out to your platform.\n\n### How do I get a corrected 1099 tax form?\n\nIf you feel you need corrections made to a 1099 tax form that has already been\n‘Filed’, use the edit option in the Tax Forms page of Stripe Express.\nInformation you edit will not appear in the 1099 tax form in the Stripe Express\ndashboard but it is shared with [Platform_Name]. You should reach out to\n[Platform_Name] after you’ve made the edits you want and they can assist you\nwith a correction. Once [Platform_Name] ‘files’ your correction, you will be\nnotified via email and you will see a new 1099 tax form appear in the Stripe\nExpress dashboard.\n\nIt can take up to 72 hours after the platform files the correction for you to be\nnotified.\n\n### How do I get in touch with Stripe for more help?\n\nIf you have a question that isn’t answered here, we recommend looking through\nthe [1099 tax forms](https://support.stripe.com/express/topics/1099-tax-forms)\nor [Stripe Express](https://support.stripe.com/express) resource pages. If you\nstill need help, please [contact Stripe\nsupport](https://support.stripe.com/express/contact/email).\n\n### How do I get into my account?\n\nYou can log in to your account by visiting\n[connect.stripe.com/express_login](https://connect.stripe.com/express_login),\nwhere you’ll be prompted for your email address and 6-digit phone verification\ncode to log in. If you don’t remember the email address that you signed up with,\ncheck your inbox for past emails that we sent about confirming your tax\ninformation for paperless delivery. Otherwise, I’ll need to confirm the email\naddress that is associated with your Stripe account. If you have historically\naccessed your Stripe Express account via your [insert platform portal name], you\ncan continue to log in this way - however, you will now have to enter a 6-digit\nverification code that will be sent via SMS to the phone number associated with\nyour account to log in. If you’ve lost or updated your phone number, you can\nselect the “[I no longer have access to this phone\nnumber](https://support.stripe.com/express/questions/i-lost-my-phone-or-changed-my-number-how-do-i-login-to-my-account)”\noption to authenticate via email and change your phone number.\n\n### How do I update my phone number? My phone number changed and I’m locked out.\n\nIf you’ve lost your phone or changed your number, you can update the number used\nfor SMS authentication when you log in to Stripe Express.\n\n- Go to [express.stripe.com](https://express.stripe.com/) and enter the email\naddress for your account\n- On the next screen where a 6-digit verification code is requested, select the\n“[I no longer have access to this phone\nnumber](https://support.stripe.com/express/questions/i-lost-my-phone-or-changed-my-number-how-do-i-login-to-my-account)”\noption\n- Follow the subsequent steps to authenticate your request and add a new phone\nnumber to the account.\n\n### Can you resend the email?\n\nYou can use the tool on the [Stripe Express support\npage](https://support.stripe.com/express/how-do-i-get-a-new-invite-link) to\nrequest a new invite email. However, before doing so, it’s possible that:\n\n- It may be in your spam/junk mail folder. Please search your inbox for an email\nfrom Stripe.\n- Your platform does not have your most current email address on file. Please\ncheck any other email addresses you may have used with your platform, or reach\nout to your platform to update your email.\n- The email address associated with your account is incorrect, missing, or\nunable to receive mail.\n\n### I have multiple accounts with different emails. Do I have to sign up multiple times?\n\nIf all your accounts pass the 1099 reporting thresholds and your platform is\nusing Stripe Express for e-delivery you’ll be sent invite emails for each\naccount and you’ll need to create an account for each one. Follow the steps in\nthe invite emails.\n\n### Why do I need to provide my SSN/EIN?\n\nThe IRS requires this information to be reported correctly on your 1099 tax\nform. The IRS requires your Taxpayer Identification Number (TIN) on your 1099\ntax form. If you are an individual, your Social Security Number (SSN) or\nIndividual Taxpayer Identification Number (ITIN) is used as your TIN. If you are\na business, your Employer Identification Number (EIN) is used as your TIN. If\nyou have earned enough to qualify for a 1099 tax form, the IRS requires your\nfull details to be reported on your 1099 tax form filings. The tax authorities\nwhich receive copies of your 1099 tax form will expect to see the income on your\nindividual or business tax return. The EIN/SSN/ITIN is crucial in connecting\nthis information, which is why the IRS requires it.\n\n### I have claimed my account and I think the information is wrong. How do I change it?\n\nTo update your personal information on your web browser, first head to the\nAccounts tab at the top of the page:\n\n- Under Stripe Express Account, you can update the email address and phone\nnumber used to log in to Stripe Express. You can only update one contact method\nat a time.\n- Under Language preference, you can choose your preferred language for the\ndashboard.\n- Under Payout details, you’ll see the platforms tied to your account. After you\nselect a platform, you can update your bank details associated with that\nplatform. This is only available for some accounts using Stripe Express.\n- Under Platform settings, you’ll see the platforms tied to your account. After\nyou select a platform, you can update your Professional and Personal details\nassociated with that platform. You can also invite people to your account and\nremove them. Check the [article linked\nhere](https://support.stripe.com/express/questions/how-can-i-update-my-personal-information)\nto learn more.\n\n### How do I access tax forms from previous years?\n\nIf you were eligible for a 1099 tax form in previous years and your platform\nused Stripe Express to deliver tax forms in those years, you can use the\ndropdown menu in Stripe Express to change the year and view prior years’ tax\nforms. If you don’t see the form there, please reach out to [Platform_Name] for\nassistance.\n\n## Edge cases for pre-filing confirmation and e-delivery via Stripe Express\n\nConnected accounts with the below setups may be blocked from pre-filing\nconfirmation and e-delivery or may have trouble accessing their invite email:\n\n- Standalone and Split forms: If a form has been split or is a standalone form\n(that is, not tied to the active user of a connected account), it’s not eligible\nfor electronic delivery.\n- Multiple accounts sharing the same email: When multiple accounts for the same\nplatform have the same email, they receive one email per account for pre-filing\nconfirmation, up to five emails. They receive one email per account for\ne-delivery.\n- Rejected and deleted accounts: Accounts that you’ve rejected or deleted no\nlonger have a Stripe relationship and are ineligible to login to Stripe Express.\n- Disconnected accounts: Accounts where you have revoked access aren’t eligible\nfor pre-filing confirmation or electronic delivery.\n- Pre-filing confirmation outreach from Stripe: accounts that have missing email\naddresses or are below the filing threshold will be excluded from Stripe\noutreach.\n\n## Links\n\n- [our product\nwalkthrough](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough)\n- [1099 tab](https://dashboard.stripe.com/connect/taxes/forms)\n- [Edge\nCases](https://docs.stripe.com/connect/platform-express-dashboard-taxes-faqs#edge-cases-for-pre-filing-confirmation-and-e-delivery-via-stripe-express)\n- [Tax season 2024\nchecklist](https://docs.stripe.com/connect/get-started-tax-reporting#tax-season-checklist)\n- [self-serve\ntool](https://support.stripe.com/express/how-do-i-get-a-new-invite-link)\n- [update emails for your\naccounts](https://docs.stripe.com/connect/express-dashboard-taxes#how-do-i-update-the-email-address)\n- [business\ntype](https://docs.stripe.com/connect/required-verification-information-taxes#required-information)\n- [Team roles](https://docs.stripe.com/get-started/account/teams)\n- [accounts_update API](https://docs.stripe.com/api/accounts/update)\n- [Stripe Express login page](http://express.stripe.com/)\n- [I no longer have access to this\nphone](https://support.stripe.com/express/questions/i-lost-my-phone-or-changed-my-number-how-do-i-login-to-my-account)\n- [Delivery\nSettings](https://docs.stripe.com/connect/tax-form-settings#delivery-method-settings)\n- [Export transaction\nlogs](https://docs.stripe.com/connect/calculation-methods#export-transaction-logs)\n- [great example from\nDoorDash](https://help.doordash.com/dashers/s/article/Common-Dasher-Tax-Questions?language=en_US)\n-\n[https://apps.apple.com/us/app/stripe-express/id1560214813](https://apps.apple.com/us/app/stripe-express/id1560214813)\n- [I no longer have access to this phone\nnumber](https://support.stripe.com/express/questions/how-do-i-login-to-my-stripe-express-account#:~:text=If%20you%27ve%20lost%20or,and%20change%20your%20phone%20number)\n- [View 1099 state\nrequirements](https://docs.stripe.com/connect/tax-forms-state-requirements#check-1099-form-requirements-by-state)\n- [Learn more](https://stripe.com/legal/privacy-center)\n- [1099 tax forms](https://support.stripe.com/express/topics/1099-tax-forms)\n- [Stripe Express](https://support.stripe.com/express)\n- [contact Stripe support](https://support.stripe.com/express/contact/email)\n- [connect.stripe.com/express_login](https://connect.stripe.com/express_login)\n- [express.stripe.com](https://express.stripe.com)\n- [article linked\nhere](https://support.stripe.com/express/questions/how-can-i-update-my-personal-information)",
  "metadata": {
    "title": "Support recommendations and FAQ templates | Stripe Documentation",
    "description": "FAQ templates for platforms using Stripe Express for pre-filing confirmation and e-delivery of 1099 tax forms.",
    "sourceURL": "https://docs.stripe.com/connect/platform-express-dashboard-taxes-faqs"
  }
}