{
  "content": "# Card declines\n\n## Learn about card declines and how to lower your decline rate.\n\nCard payments can fail for a variety of reasons. Some of the most common are:\n\n- **Insufficient customer funds:** If a customer has insufficient customer funds\nor credit, the card issuer declines the transaction. To help minimize declines\ndue to insufficient funds, consider adding a [Buy Now, Pay Later\n(BNPL)](https://docs.stripe.com/payments/buy-now-pay-later) option.\n- **Incorrect card data:** If a customer enters an incorrect card number, CVV,\nor expiration date, the card issuer might decline the transaction. In these\ncases, request your customer to re-enter their card information.\n- **Fraudulent activity:** If a card issuer suspects fraudulent activity, which\ncan be triggered by large purchases or a large volume of transactions over a\nshort period of time, they might decline payments. Your customer must resolve\nthis issue by communicating with their issuing bank and confirming their\nidentity.\n\n#### Stripe Sigma\n\nUse [Stripe Sigma](https://docs.stripe.com/stripe-data) to analyze your decline\nrate. Our interactive SQL reporting environment offers prebuilt queries for this\npurpose. To investigate declines outside Sigma, consider the `Card` object\n[fingerprints](https://docs.stripe.com/api/cards/object#card_object-fingerprint)\ninstead of charge IDs to exclude repeat attempts.\n\n## Card declines\n\nWhen your customer’s card issuer receives a charge, their automated systems and\nmodels decide whether to authorize it. These tools analyze signals such as\nspending habits, account balance, and card data including expiration date,\naddress information, and CVC.\n\nIf the card issuer declines a payment, Stripe shares some of the decline\ninformation we receive. This information is available in the Dashboard and\nthrough the API. Sometimes, issuers provide specific explanations, such as an\nincorrect card number or low funds. We show these as [decline\ncodes](https://docs.stripe.com/declines/codes).\n\nCard issuer’s categorize most declines as generic\n([generic_decline](https://docs.stripe.com/declines/codes#generic_decline)),\nmaking the exact decline reason unclear. If the card information is correct,\nrequest your customer to contact their card issuer to understand why a\ntransaction was declined. For privacy and security reasons, card issuers discuss\nthe specifics of a decline only with their cardholders.\n\n### Network codes\n\nWhenever there’s a decline, the card issuer provides two types of network codes:\n\n- **Network decline code:** The card’s issuing bank provides this 2-4 digit\ncode. When Stripe doesn’t receive a response code from the card network for a\ndeclined charge, the `network_decline_code` field is null. The meaning of a code\ndiffers based on the card network. For this reason, take the card’s brand into\nconsideration when interpreting the code.\n- **Network advice code:** The card’s issuing bank provides this 2-4 digit code.\nThe code offers guidance on managing a decline. When Stripe doesn’t receive a\nresponse code from the card network for a declined charge, the\n`network_advice_code` field is null. The meaning of a code differs based on the\ncard network. For this reason, take the card’s brand into consideration when\ninterpreting the code. Mastercard refers to network advice codes as Merchant\nAdvice Codes (MAC).\n\n## Reduce card declines\n\nYou can typically resolve card issuer declines resulting from inaccurate card\ndetails (such as an incorrect card number or expiration date) by asking your\ncustomers to correct the error or use a different card or payment method. For\nexample, [Checkout](https://docs.stripe.com/payments/checkout) provides feedback\nto the customer when a card declines and allows them to try again.\n\nTo avoid declines that stem from suspected fraudulent activity, request your\ncustomers to provide their CVC and postal code during checkout. The impact of\nother data that you gather, such as the full billing address, might vary by card\nbrand and country. If you continue to see elevated decline rates, Stripe\nrecommends collecting extra customer information. You can also implement [3D\nSecure](https://docs.stripe.com/payments/3d-secure) to authenticate payment,\nwhich can lower decline rates in countries that support it.\n\nFor a clear insight into why the card issuer declined the card during generic or\n[do_not_honor](https://docs.stripe.com/declines/codes#do_not_honor) declines,\nexamine the associated data. For example, if CVC or Address Verification Service\n(AVS) checks fail when your customer adds a card, request your customer to\nverify both of these details before initiating another charge.\n\nIf you notice that a customer is using a card issued in one country while\noperating from an IP address in another, it might be a legitimate decline due to\npossible unauthorized card use. However, exceptions can occur, particularly when\ncustomers are traveling internationally and use their cards from various\nlocations.\n\n### Card type restrictions\n\nSome customers find that their card has restrictions on the types of purchasable\nitems. FSA or HSA cards are often limited to certain types of businesses (for\nexample, healthcare providers), so card issuer’s decline any other type of\npurchase. Additionally, some card issuers might not allow purchases from certain\ncountries or outside of their own. In either case, your customer must contact\ntheir card issuer to inquire about potential restrictions.\n\n### Geographic location impacts\n\nIf your customers use cards issued in a different country than where you\nregistered your Stripe account, they might see an increased rate of declines. To\nresolve this, your customer must contact their issuing bank to authorize the\ncharge. If you have a global customer base with concentrations in various\nlocations, you might want to set up Stripe accounts in larger markets, or in\nregions that encounter higher decline rates. This allows you to process charges\nlocally.\n\n## Declined card retries\n\nWhen a payment gets declined, Stripe offers a reason for the decline and briefly\nsuggests a resolution path.\n\n![Declined payment due to insufficient\nfunds](https://b.stripecdn.com/docs-statics-srv/assets/declined-payment-dashboard.5fb1d634ab6b87c89db2c0078e076393.png)\n\nDeclined payment due to insufficient funds\n\nIf you’re a [Stripe Billing](https://docs.stripe.com/billing) user, you can\ncreate a custom retry schedule for subscriptions. Use [Smart\nRetries](https://docs.stripe.com/invoicing/automatic-collection#smart-retries)\nto choose the best times to retry failed payment attempts. Be aware that card\nnetworks limit the number of times you can reattempt a single charge. We\nrecommend a maximum of eight retries for charges that permit retries. Card\nissuers might see creating additional retries as potential fraud, which can\nresult in increased declines for legitimate charges.\n\nIn the API, the\n[reason](https://docs.stripe.com/api#charge_object-outcome-reason) in the\n[outcome](https://docs.stripe.com/api#charge_object-outcome) uses [decline\ncodes](https://docs.stripe.com/declines/codes) to tell you why the card issuer\ndeclined the authorization. The\n[advice_code](https://docs.stripe.com/api#charge_object-outcome-advice-code) in\nthe `outcome` tells you what to do next.\n\nAdvice codeDescriptionNext steps`do_not_try_again` The card was declined and you\nshouldn’t use it again for the same transaction.See the [decline\ncode](https://docs.stripe.com/declines/codes) for the reason why the card issuer\ndeclined the authorization. Your customer might need to contact their card\nissuer for more information.`try_again_later` The card issuer declined the\ntransaction, but you can [retry\nit](https://docs.stripe.com/declines/card#retrying-issuer-declines).Ask the\ncustomer to attempt the payment again. If subsequent payments are declined, the\ncustomer needs to contact their card issuer for more\ninformation.`confirm_card_data` The card issuer declined the transaction because\nsome of the provided information is incorrect.See the [decline\ncode](https://docs.stripe.com/declines/codes) for the reason why the card issuer\ndeclined authorization. The customer needs to validate the information on their\ncard.\n## Manage declines programmatically\n\nThere are several ways to programmatically handle declines:\n\n- Retrieve the\n[last_payment_error.decline_code](https://docs.stripe.com/api/payment_intents/object#payment_intent_object-last_payment_error-decline_code)\nproperty from the\n[PaymentIntent](https://docs.stripe.com/api/payment_intents/object) object to\nsee why the card issuer declined the payment attempt.\n- Iterate over the PaymentIntent’s [attempted\ncharges](https://docs.stripe.com/payments/payment-intents/verifying-status#identifying-charges)\nand inspect the [failure\nmessage](https://docs.stripe.com/api/charges/object#charge_object-failure_message).\n- Use\n[webhooks](https://docs.stripe.com/payments/payment-intents/verifying-status#webhooks)\nto monitor PaymentIntent status updates. For example, the\n`payment_intent.payment_failed` event triggers when a payment attempt is\nunsuccessful.\n\nYou might also need to manage additional payment failure situations such as when\nyour customer is present (on-session) or absent (off-session) during your\ncheckout process. As you develop your integration, Stripe advises treating all\npossible API exceptions, including unexpected\n[errors](https://docs.stripe.com/error-codes).\n\n#### Note\n\n[Stripe Billing](https://docs.stripe.com/billing) handles many of these payment\nfailure scenarios with features like [Automatic\nCollection](https://docs.stripe.com/invoicing/automatic-collection) and [Hosted\nInvoices](https://docs.stripe.com/invoicing/hosted-invoice-page).\n\n### On-session declines\n\nIf your customer is present in your website or application’s checkout flow,\nprompt them to try their payment method again or ask for a new payment method.\n\n### Off-session declines\n\nIf your customer isn’t available to make a payment or update a payment method,\nnotify them (for example, send them an email or in-app notification) to visit\nyour website or application. If your business is affected by regulations like\n[Strong Customer\nAuthentication](https://docs.stripe.com/strong-customer-authentication), payment\nattempts might also require authentication and fail with an\n[authentication_required](https://docs.stripe.com/declines/codes) decline code.\nFor more information on handling these scenarios, see [off-session payments with\nsaved\ncards](https://docs.stripe.com/payments/save-during-payment?platform=web#charge-saved-payment-method).\n\n## See also\n\n- [Decline codes](https://docs.stripe.com/declines/codes)\n- [Disputes and fraud](https://docs.stripe.com/disputes)\n\n## Links\n\n- [Buy Now, Pay Later\n(BNPL)](https://docs.stripe.com/payments/buy-now-pay-later)\n- [Stripe Sigma](https://docs.stripe.com/stripe-data)\n-\n[fingerprints](https://docs.stripe.com/api/cards/object#card_object-fingerprint)\n- [decline codes](https://docs.stripe.com/declines/codes)\n- [generic_decline](https://docs.stripe.com/declines/codes#generic_decline)\n- [Checkout](https://docs.stripe.com/payments/checkout)\n- [3D Secure](https://docs.stripe.com/payments/3d-secure)\n- [do_not_honor](https://docs.stripe.com/declines/codes#do_not_honor)\n- [Stripe Billing](https://docs.stripe.com/billing)\n- [Smart\nRetries](https://docs.stripe.com/invoicing/automatic-collection#smart-retries)\n- [reason](https://docs.stripe.com/api#charge_object-outcome-reason)\n- [outcome](https://docs.stripe.com/api#charge_object-outcome)\n- [advice_code](https://docs.stripe.com/api#charge_object-outcome-advice-code)\n-\n[last_payment_error.decline_code](https://docs.stripe.com/api/payment_intents/object#payment_intent_object-last_payment_error-decline_code)\n- [PaymentIntent](https://docs.stripe.com/api/payment_intents/object)\n- [attempted\ncharges](https://docs.stripe.com/payments/payment-intents/verifying-status#identifying-charges)\n- [failure\nmessage](https://docs.stripe.com/api/charges/object#charge_object-failure_message)\n-\n[webhooks](https://docs.stripe.com/payments/payment-intents/verifying-status#webhooks)\n- [errors](https://docs.stripe.com/error-codes)\n- [Automatic Collection](https://docs.stripe.com/invoicing/automatic-collection)\n- [Hosted Invoices](https://docs.stripe.com/invoicing/hosted-invoice-page)\n- [Strong Customer\nAuthentication](https://docs.stripe.com/strong-customer-authentication)\n- [off-session payments with saved\ncards](https://docs.stripe.com/payments/save-during-payment?platform=web#charge-saved-payment-method)\n- [Disputes and fraud](https://docs.stripe.com/disputes)",
  "metadata": {
    "title": "Card declines | Stripe Documentation",
    "description": "Learn about card declines and how to lower your decline rate.",
    "sourceURL": "https://docs.stripe.com/declines/card"
  }
}