{
  "content": "# Stripe's risk scoreDeprecated\n\n## Evaluate the level of fraud risk associated with an authorization.\n\nIncorporate Stripe’s risk assessment into your business needs when deciding\nwhether to approve or reject an authorization. The following statistics provide\ndirectional guidance on the performance of our tools, and depend on what you’re\ngoals are: approval rate or fraud prevention. While these settings might not be\ncustomized to your business model, geography, or cardholder behavior, you can\nuse them as a source of directional guidance when using Stripe’s tools. Contact\nus for support in adjusting these thresholds.\n\nNetwork toolsStripe Issuing fraud toolsOptimizing for fraud preventionBalancing\nfraud prevention and approval rateOptimizing for approval ratePrecision: How\nlikely the flagged charge is true fraud2%10-15%15-20%25-30%Recall: % of all\nfraud caught by tooling by transaction volume2%25-30%20-25%10-15%% Volume\nImpact: Estimated authorization volume impacted by fraud tooling0.10%0.06% -\n0.07%0.02% - 0.04%0.01% - 0.02\nStripe provides a composite score and risk categorization to help you assess the\nrisk level of an authorization. The values exist on a 0-99 scale, with higher\nvalues representing higher risk. In addition to the risk score, Stripe provides\nan assessment of the authorization’s riskiness in an enum value. We label every\nauthorization as ‘normal’ or ’high’.\n\nWe recommend backtesting your data against the score to assess opportunities to\nuse the score to drive down fraud rates. For example, you might find that\n`fraud_score > 20` and `risk_level = normal` equates to particularly risky\nauthorizations for your portfolio and opt to block authorizations that satisfy\nthose conditions.\n\nPrecision and recall are inversely related. When you block more transactions,\nthe false positive rate increases while the likelihood of allowing fraud\ndecreases. When you block fewer transactions, the false positive rate decreases.\nSet your blocking thresholds accordingly based on rigorous backtesting of your\ndata and your own risk tolerance.\n\nLearn more about the [Stripe’s risk\nscore](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-fraud_risk).\n\n## Fraud classification\n\nWhile our model is reliable, it inevitably flags:\n\n- False positives: Non-fraudulent transactions as high risk\n- False negatives: Fraudulent transactions as non-high risk\n\nAs Stripe refines the performance of its risk models, you can actively\ncontribute to our refinement process by flagging both fraudulent transactions\nthat we might not accurately identify and non-fraudulent transactions. You’ll\nalso be strengthening the fraud prevention capabilities of the industry as a\nwhole: when you flag a false negative, we send a fraud report to card networks,\ntelling them about the fraudulent activity.\n\n### Use the API to report false positives and negatives\n\nYou can report false positives and false negatives while validating correct\nassessments (true positives and true negatives) through the [Fraud\nClassification\nAPI](https://docs.stripe.com/api/issuing/fraud_classification/create). Using\nthis API is optional for accessing Stripe’s risk score. However, your\ncontributions improve the model over time. Due to this, we recommend automating\nreporting with this API in the early stages of your implementation\n\nLearn more about the [Fraud Classification\nAPI](https://docs.stripe.com/api/issuing/fraud_classification/create).\n\nStripe’s risk score is currently limited to beta users. You must be an Issuing\ncustomer to join the beta. To request access to the beta, log in to your Stripe\naccount and refresh the page. [Contact Stripe](https://stripe.com/contact/sales)\nfor more information.\n\n## Links\n\n- [Stripe’s risk\nscore](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-fraud_risk)\n- [Fraud Classification\nAPI](https://docs.stripe.com/api/issuing/fraud_classification/create)\n- [Contact Stripe](https://stripe.com/contact/sales)",
  "metadata": {
    "title": "Stripe's risk score | Stripe Documentation",
    "description": "Evaluate the level of fraud risk associated with an authorization.",
    "sourceURL": "https://docs.stripe.com/issuing/controls/advanced-fraud-tools/stripes-risk-score"
  }
}