{
  "content": "# Prepare for app review\n\n## Learn how to prepare your app for Stripe's review process.\n\nStripe reviews all apps built for Terminal devices before approving them for\ndeployment. The review process helps prevent putting payment information at risk\nor violating industry-standard best practices for payment devices.\n\n## App review at a glance\n\nStripe reviews the [device asset\nversion](https://docs.stripe.com/terminal/features/apps-on-devices/submit#create-device-asset-version)\nof your app. This process doesn’t require any action from you.\n\n- A reviewer downloads your app and installs it on a Terminal smart reader.\n- Using the instructions you provided, the reviewer interacts with your app and\nidentifies potential problems, focusing on your app’s payment collection user\ninterface.\n- After the reviewer determines there are no present issues, they approve your\napp for deployment. Stripe [notifies you of app\napproval](https://docs.stripe.com/terminal/features/apps-on-devices/submit#monitor-status).\nThe reviewer might reject your app if they’re unable to follow instructions, or\nif the app contains features that might put payment information at risk.\n\nThe exact amount of time and effort required to review each app varies because\nno two apps are alike.\n\n## App review guidelines\n\nUse the guidelines below to help with a timely and successful app review.\n\n### Build multi-tenant apps\n\nIf you’re a platform building apps for Terminal devices on behalf of individual\nbusinesses, we encourage you to build a multi-tenant app that serves all of your\nusers. You can build business-specific workflows, such as different image or\ngraphics assets per business, into your app’s configuration and settings. This\napproach also removes the need for you to submit individual apps per business.\n\n### Prevent collecting keyed payment card numbers or PINs\n\nUse the Terminal reader running the app to request payment from a customer and\ncollect sensitive card and PIN information. The [Terminal\nSDK](https://docs.stripe.com/terminal/features/apps-on-devices/build#discover-and-connect-a-reader)\nallows you to display an appropriate prompt on the device screen.\n\nMake sure that your app doesn’t display user interface elements (for example, an\ninput field) that allow the manual entry of PINs, authentication values, or\npayment information.\n\n### Support test mode payments\n\nDuring development and testing, use a DevKit device to [accept test mode\npayments](https://docs.stripe.com/terminal/features/apps-on-devices/build). This\nallows Stripe to use a [physical Terminal test\ncard](https://docs.stripe.com/terminal/references/testing#physical-test-cards)\nwhen we review your app.\n\nIf you must accept live payments, make sure the app accepts a minimal charge\namount, such as 1 USD (or equivalent in another currency).\n\n### Address technical defects\n\n[Use your\nDevKit](https://docs.stripe.com/terminal/features/apps-on-devices/build) to\nidentify defects before submitting your app for review.\n\nExamples of common defects include:\n\n- The app fails to install because of an error during its build process.\n- The app crashes before we can interact with the app’s payment UI.\n- The app can’t detect or connect to the reader.\n\nMake sure to address the technical defects that can prevent us from successfully\ninteracting with or using your app. We reject apps that can’t be fully reviewed\ndue to technical defects.\n\n### Write clear and complete instructions\n\nWhen you submit your app for review, assume that Stripe hasn’t seen it before.\nMake sure your instructions are self-contained and don’t assume any special\nknowledge to complete the review. We must be able to follow your instructions\nexactly as submitted.\n\nInclude the following with your app’s instructions:\n\n- Login information, such as a username or password (if applicable)\n- Fixed authentication code that remains valid indefinitely (if applicable)\n- How to reach your payment collection UI\n- How to exercise the app fully to highlight any problems\n\nDon’t provide credentials that permit access to sensitive information or to\nfunctionality that can cause any side effects. For example, an app that accepts\norders for food must not cause any actual food preparation to occur as a result\nof orders placed during app review.\n\n## Submit your app for review\n\nFollow the steps to [submit your app for\nreview](https://docs.stripe.com/terminal/features/apps-on-devices/submit).\n\n## Skip app review\n\nYou can skip app review and move directly to deployment in these cases:\n\n- To use the API or test your app, you can limit the\n[compatible_device_types](https://docs.stripe.com/api/terminal/device_asset_versions/object#terminal_device_asset_version_object-compatible_device_types)\nto only DevKit device types (`stripe_s700_devkit`).\n- If you previously uploaded a device asset version in test mode and Stripe\nreviewed and approved that version’s APK, you can upload it again for live mode.\n\n## Next steps\n\n- [Submit your app for\nreview](https://docs.stripe.com/terminal/features/apps-on-devices/submit)\n- [Deploy your\napp](https://docs.stripe.com/terminal/features/apps-on-devices/deploy-with-API)\n\n## Links\n\n- [device asset\nversion](https://docs.stripe.com/terminal/features/apps-on-devices/submit#create-device-asset-version)\n- [notifies you of app\napproval](https://docs.stripe.com/terminal/features/apps-on-devices/submit#monitor-status)\n- [Terminal\nSDK](https://docs.stripe.com/terminal/features/apps-on-devices/build#discover-and-connect-a-reader)\n- [accept test mode\npayments](https://docs.stripe.com/terminal/features/apps-on-devices/build)\n- [physical Terminal test\ncard](https://docs.stripe.com/terminal/references/testing#physical-test-cards)\n- [submit your app for\nreview](https://docs.stripe.com/terminal/features/apps-on-devices/submit)\n-\n[compatible_device_types](https://docs.stripe.com/api/terminal/device_asset_versions/object#terminal_device_asset_version_object-compatible_device_types)\n- [Deploy your\napp](https://docs.stripe.com/terminal/features/apps-on-devices/deploy-with-API)",
  "metadata": {
    "title": "Prepare for app review | Stripe Documentation",
    "description": "Learn how to prepare your app for Stripe's review process.",
    "sourceURL": "https://docs.stripe.com/terminal/features/apps-on-devices/app-review"
  }
}