{
  "content": "# Configure the customer portal\n\n## Configure settings for the self-serve customer portal in the Dashboard.\n\nAfter setting up your customer portal, configure its settings [in your\nDashboard](https://dashboard.stripe.com/test/settings/billing/portal). If you\nhaven’t set up your customer portal, see the [customer portal\nguide](https://docs.stripe.com/customer-management).\n\n## Configure subscription management\n\nConfigure how to manage subscriptions in your customer portal integration.\n\nOptionDescriptionDefaultSwitch plan Let your customer switch between\nsubscription plans. This option is best when you have a good-better-best pricing\nmodel.OffUpdate quantities Let your customer increase or decrease the quantity\nof a subscription. This functionality is best when you have a seat-based pricing\nmodel.OffProrate subscription updates If customers can change their plan or\nquantity, optionally credit back customers for time remaining in the billing\ncycle. You can apply a\n[proration](https://docs.stripe.com/billing/subscriptions/prorations)\nimmediately or at the end of the billing period.OffManage downgrades PreviewIf\ncustomers can change their plan or quantity, optionally schedule the change to\noccur at the end of the billing period. If enabled, the customer portal\nautomatically creates and attaches a subscription schedule to the subscription.\nWhen using this feature, be sure to follow [best\npractices](https://docs.stripe.com/billing/subscriptions/subscription-schedules#subscription-schedule-sub-updates)\nto prevent unexpected subscription overwrites.Update immediatelyUse promotion\ncodes If customers can change their plan or quantity, optionally allow customers\nto apply [promotion\ncodes](https://docs.stripe.com/billing/subscriptions/coupons) when updating\nsubscriptions.Off\n## Cancellation management\n\nConfigure your portal to allow cancellations, collect cancellation reasons, and\noffer retention coupons.\n\nOptionDescriptionDefaultCancel subscription Let your customer cancel their\nsubscription. After canceling, customers can still renew subscriptions until the\nbilling period ends.OnCancellation reason Enable the Cancel subscription option\nto capture a cancellation reason when your customer cancels their subscription\non the customer portal.OnRetention coupons Offer coupons to customers before\nthey cancel their subscriptions. You can use coupons as part of your churn\nreduction strategy.Off\n## Customer billing configurations\n\nDictate what information your customers can manage.\n\nOptionDescriptionDefault\n**Billing information**\n\nCapture critical customer, shipping, and tax information from your customer for\npayment methods and to display on an invoice.\n\nNameDescriptionDefault statusNameLet the customer change their name.OnEmail\naddressLet the customer change their email address. Note: This functionality\nisn’t available in the no-code customer portalOnBilling addressLet the customer\nupdate their billing address.OnPhone numberLet the customer update their phone\nnumberOnShipping addressLet the customer update their shipping addressOffTax\nIDLet the customer update their tax IDOff\nOn\n\nPayment methodsLet your customer update their payment method\ninformation.OnPromotion codesLet your customer enter promotion codes on your\ncustomer portal instance when upgrading their plan. Go to the\n[Coupons](https://docs.stripe.com/billing/subscriptions/coupons) documentation\nto learn more about coupons, promotion codes, and discounts.Off\n## Customize the portal\n\nUse these configuration settings to customize your customer portal instance.\n\nNameDescriptionRequired?HeadlineEnter an introductory text that the customer\nportal displays to your customers. You can only add one headline for each\ncustomer portal configuration. If you don’t enter anything, the customer portal\ndisplays this default text: “{{YOUR_BUSINESS_NAME}} partners with Stripe for\nsimplified billing.”YesTerms of service linkEnter a link to your terms of\nservice. The customer portal shows this to your customers whenever they change a\nsubscription or add a payment method. If you don’t enter anything, the customer\nportal uses the terms of service set in [public account\ndetails](https://dashboard.stripe.com/settings/public) instead.NoDefault\nRedirect linkEnter a link to redirect customers when they exit the customer\nportal. If you don’t enter anything, the customer portal doesn’t display “Return\nto {{YOUR_BUSINESS_NAME}}”.NoCustom domainSet a custom domain from which to\nserve the customer portal. To learn more, read the [Checkout\nguide](https://docs.stripe.com/payments/checkout/custom-domains) about custom\ndomains. You can only set one custom domain per account.NoBusiness nameSet the\nname of your business in the [Public business\ninformation](https://dashboard.stripe.com/settings/public) section of the Stripe\nDashboard. The customer portal displays this name to your customer.Yes\n## Invoice history configurations\n\nNameDescriptionDefault statusInvoice history visibleDetermine whether invoice\nhistory is visible to customers using your customer portal.On\n## Email settings configurations\n\n#### Caution\n\nEmail settings are applied to all emails sent from Stripe to your customers.\nMake sure that any changes you make are appropriate for all your Stripe use\ncases.\n\nConfigure which emails Stripe sends to your customers. You can also configure a\ncustom domain to use for the emails. You can configure all of this in the [email\nsettings](https://dashboard.stripe.com/settings/emails) of the Dashboard.\n\n## Customize branding\n\nTo customize the look and feel of the customer portal, go to the [branding\nsettings](https://dashboard.stripe.com/account/branding) of the Dashboard. You\ncan customize the following items:\n\n- Your logo and icon\n- Background color\n- Button color\n- Font\n- Shapes\n\n### Branding with Connect\n\nIf you maintain a platform with Connect, the customer portal uses the brand\nsettings of the connected account under these circumstances:\n\n- The platform uses direct charges\n- The platform uses destination charges with `on_behalf_of`\n\nFor all other connected accounts, you can configure the brand settings with the\n[Accounts](https://docs.stripe.com/api/accounts/object#account_object-settings-branding)\nAPI.\n\n## Links\n\n- [in your Dashboard](https://dashboard.stripe.com/test/settings/billing/portal)\n- [customer portal guide](https://docs.stripe.com/customer-management)\n- [proration](https://docs.stripe.com/billing/subscriptions/prorations)\n- [best\npractices](https://docs.stripe.com/billing/subscriptions/subscription-schedules#subscription-schedule-sub-updates)\n- [promotion codes](https://docs.stripe.com/billing/subscriptions/coupons)\n- [public account details](https://dashboard.stripe.com/settings/public)\n- [Checkout guide](https://docs.stripe.com/payments/checkout/custom-domains)\n- [email settings](https://dashboard.stripe.com/settings/emails)\n- [branding settings](https://dashboard.stripe.com/account/branding)\n-\n[Accounts](https://docs.stripe.com/api/accounts/object#account_object-settings-branding)",
  "metadata": {
    "title": "Configure the customer portal | Stripe Documentation",
    "description": "Configure settings for the self-serve customer portal in the Dashboard.",
    "sourceURL": "https://docs.stripe.com/customer-management/configure-portal"
  }
}