{
  "content": "# Multi-currency settlement for Connect platforms and marketplaces\n\n## Offer your connected accounts the ability to accept, settle and pay out funds in multiple currencies.\n\nAvailable in: \nMulti-currency settlement allows your connected accounts to maintain balances\nand make payouts in currencies other than their primary currency. Connected\naccounts can hold and payout funds in up to 18 supported currencies needed to\npay suppliers, process refunds, and so on, without having to convert funds.\n\n## Enable multi-currency settlement\n\nEnable multi-currency settlement for your conneted accounts in the [Connect\npayouts settings page](https://dashboard.stripe.com/settings/connect/payouts) of\nthe Dashboard. Your account must be in a supported region to access these\nsettings.\n\nAfter you enable multi-currency settlement, your users can access all\n[currencies that are supported in their\nregion](https://docs.stripe.com/payouts/multicurrency-settlement#multicurrency-settlement-fees).\n\n#### Note\n\nConnected accounts must be in the same region as your platform to use\nmulti-currency settlement. For example, both you and your connected account\ncould be in Australia, or, if you’re in Europe, your connected account could be\nin any European country.\n\nIf you no longer want your connected accounts to use multi-currency settlement:\n\n- Disable it with the same settings in the Dashboard to prevent connected\naccounts from beginning to use it. This doesn’t disable it for connected\naccounts that are already using multi-currency settlement.\n- Remove any multi-currency external accounts using the [Delete external bank\naccounts API](https://docs.stripe.com/api/external_account_bank_accounts/delete)\nto disable multi-currency settlement for connected accounts already using it.\n\n## Add external accounts\n\nAfter you enable multi-currency settlement, your connected accounts can start\nusing it by adding a new settlement currency external account.\n\nDashboardAPI\nYour connected account can add an external account anywhere they can update\ntheir payout methods, including Dashboard and Onboarding interfaces. See\n[Connect account types](https://docs.stripe.com/connect/accounts) to learn which\ninterfaces are available for your connected account. For instance, if your\nconnected account has access to the Express Dashboard, you can send them a\n[Login Link](https://docs.stripe.com/api/account/create_login_link) to update\ntheir payout methods.\n\nAfter your connected account has an external account in a non-primary currency,\ncharges presented in that currency accrue towards that currency’s balance. Your\nconnected accounts can pay out their multi-currency balances in the same way as\na primary currency balance. However, some supported currencies are subject to a\npayout minimum and fee, as described in the following section.\n\nTo learn more about processing charges in multiple currencies with Connect, see\n[Working with multiple currencies](https://docs.stripe.com/connect/currencies).\n\n## Pricing\n\nWhen funds settle to your connected account in a currency other than the primary\ncurrency of your Stripe account country, Stripe applies [processing\nfees](https://docs.stripe.com/currencies/settlement-fees) in that currency.\n\nStripe charges platforms a 1% payout fee for multi-currency settlement depending\non the combination of currency and bank account country, with a minimum fee. In\nyour Dashboard and reporting, this fee might appear as an *alternative currency\npayout* fee. See our [full list of\nfees](https://docs.stripe.com/payouts/multicurrency-settlement#multicurrency-settlement-fees).\n\nStripe deducts your connected accounts’ multi-currency settlement fees from your\nplatform balance in the non-primary currency. For example, if your connected\naccount pays out funds in USD, we charge the fee to your platform balance in USD\nwhen possible. If your platform account doesn’t support the currency, Stripe\nconverts the fee to your default currency and deducts it from your primary\ncurrency’s balance. See [conversion on Stripe\nfees](https://docs.stripe.com/currencies/conversions#conversion-stripe-fees) for\nmore details.\n\n## Request early access\n\nUse the following form to request updates on preview features as we expand\nmulti-currency settlement features and regional support.\n\n## Interested in getting early access to new multi-currency settlement features?\n\nEnter your email address below and our team will contact you when we're ready to\nprovide access.\n\nCollect EmailSign upRead our [privacy policy](https://stripe.com/privacy).\n\n## Links\n\n- [configure multi-currency\nsettlement](https://docs.stripe.com/payouts/multicurrency-settlement)\n- [configured with\nproperties](https://docs.stripe.com/connect/update-to-typeless-connect)\n- [Connect payouts settings\npage](https://dashboard.stripe.com/settings/connect/payouts)\n- [currencies that are supported in their\nregion](https://docs.stripe.com/payouts/multicurrency-settlement#multicurrency-settlement-fees)\n- [Delete external bank accounts\nAPI](https://docs.stripe.com/api/external_account_bank_accounts/delete)\n- [Connect account types](https://docs.stripe.com/connect/accounts)\n- [Login Link](https://docs.stripe.com/api/account/create_login_link)\n- [Working with multiple currencies](https://docs.stripe.com/connect/currencies)\n- [processing fees](https://docs.stripe.com/currencies/settlement-fees)\n- [conversion on Stripe\nfees](https://docs.stripe.com/currencies/conversions#conversion-stripe-fees)\n- [privacy policy](https://stripe.com/privacy)",
  "metadata": {
    "title": "Multi-currency settlement for Connect platforms and marketplaces | Stripe Documentation",
    "description": "Allow your connected accounts to set up multi-currency settlement to collect, accrue, and pay out in non-primary currencies.",
    "sourceURL": "https://docs.stripe.com/connect/multicurrency-settlement"
  }
}