{
  "content": "# Risk controls\n\n## Adjust how aggressively you block fraud for your business with Radar for Fraud Teams.\n\nTo adjust the default risk score for blocking payments, use Radar for fraud\nteams. Go to the [Radar risk\ncontrols](https://dashboard.stripe.com/settings/radar/risk-controls) page to\nmake your adjustments.\n\n![Screenshot of the drawer you see when adjusting your Radar risk\ncontrols](https://b.stripecdn.com/docs-statics-srv/assets/new-overview.34e6267dd144e7f58ab45f3b07a7e316.png)\n\nThe risk settings dialog shows your block threshold, your dispute rate, and\nother important statistics\n\n## How it works\n\nStripe Radar gives each charge a numerical [risk\nscore](https://docs.stripe.com/radar/risk-evaluation#risk-outcomes) between 0\nand 99, where 0 is the lowest risk and 99 highest.\n\n### Blocking payments\n\nThe default *blocking threshold* is 75, meaning Radar blocks charges with a\nscore of 75 or higher. If you decrease your threshold, you’ll block more\npayments.\n\nYou need to make sure [the default block\nrule](https://docs.stripe.com/radar/rules#built-in-rules) or an equivalent\ncustom rule is enabled for Radar to block transactions based on this threshold.\n\n### Manual reviews\n\nThe default *manual review threshold* is 65, meaning Radar sends charges with a\nscore of 65 or higher to manual review. Changing the blocking threshold\nautomatically changes the manual review threshold accordingly.\n\nFor Radar to send transactions to manual reviews based on this threshold, you\nneed to enable [the default review\nrule](https://docs.stripe.com/radar/rules#built-in-rules) or equivalent custom\nrules.\n\n### Adjusting your threshold\n\nWhen you change your blocking threshold, you see the following statistics:\n\nMetricDescriptionEstimated fraud volume that is blocked or allowedThe estimated\nvolume of fraudulent payments that will be blocked or allowed at the new\nblocking threshold.Estimated good volume that is blocked or allowedThe estimated\nvolume of good payments that will be blocked or allowed at the new blocking\nthreshold.Estimated previously blocked volume that is blocked or allowedThe\nestimated volume of previously blocked payments that will be blocked or allowed\nat the new blocking threshold. Because these payments were blocked and never\nprocessed, some of these payments might be fraudulent.Fraud rate by volumeThe\npercent of payments by volume that have received a dispute, an Early Fraud\nWarning (EFW), or were refunded as fraud.Block rate by volumeThe percent of\npayments by volume that were attempted but were blocked by Radar or by Stripe.\nPayments are blocked by Stripe to protect you from card testing and other risks\nthat affect all users, regardless of your usage of Radar.\n## When to use it\n\nYou can customize the default threshold to fit your own business needs. Setting\nthe risk score threshold requires you to consider a tradeoff between how much\nfraud Radar blocks and how many payments it allows.\n\n### Block more fraud\n\nIf your business is experiencing higher rates of fraud, you can decrease the\nscore for blocking payments. To determine what risk score is right for your\nbusiness, hover over the **Block additional payments by setting your acceptable\nrisk score** chart.\n\n![Screenshot that shows the chart with good and fraudulent payments by risk\nscore](https://b.stripecdn.com/docs-statics-srv/assets/new-blocked-volume-chart.a439ebbb6db56c1245bf744e516120c7.png)\n\nThis chart shows how many fraudulent and good payments you would’ve blocked if\nyou set your threshold at that risk score. Here, you can see:\n\nMetricDescriptionVolume blockedVolume of fraudulent and good payments would be\nblocked.% blockedThe percent of fraudulent and good payments that are blocked\nrespectively. For example, blocking at 65 would result in 55% of your fraud\ngetting blocked at the expense of only 1% of good payments.# of payments\nblockedNumber of fraudulent and good payments would be blocked.\nUltimately, it is up to your business to decide what tradeoff you’re willing to\naccept in terms of how much fraud versus good payments you block.\n\n### Allow more payments\n\nIf your business has low fraud rates and costs, you might want to increase the\ndefault blocking score so that you can allow more payments overall.\n\n![Screenshot that shows the chart with blocked payments by risk\nscore](https://b.stripecdn.com/docs-statics-srv/assets/new-allowed-volume-chart.520f969604f2c058be9330391eb05aaa.png)\n\nThis chart shows how many payments you would allow if you set your threshold at\nthat risk score. Here, you can see:\n\nMetricDescriptionVolume allowedVolume of payments would be allowed.# of payments\nallowedNumber of payments that would be allowed.\nIf you’re increasing the risk score for blocking charges, we can’t accurately\npredict the impact of this change on your fraud rate (as some charges that were\npreviously blocked will now be allowed). Be careful when adjusting the risk\nscore in this direction.\n\n## See also\n\n- [Risk Evaluation](https://docs.stripe.com/radar/risk-evaluation)\n- [Review](https://docs.stripe.com/radar/reviews)\n- [Integration Checklist](https://docs.stripe.com/radar/integration)\n\n## Links\n\n- [Radar risk\ncontrols](https://dashboard.stripe.com/settings/radar/risk-controls)\n- [risk score](https://docs.stripe.com/radar/risk-evaluation#risk-outcomes)\n- [the default block rule](https://docs.stripe.com/radar/rules#built-in-rules)\n- [contact us](https://support.stripe.com/contact)\n- [Risk Evaluation](https://docs.stripe.com/radar/risk-evaluation)\n- [Review](https://docs.stripe.com/radar/reviews)\n- [Integration Checklist](https://docs.stripe.com/radar/integration)",
  "metadata": {
    "title": "Risk controls | Stripe Documentation",
    "description": "Adjust how aggressively you block fraud for your business with Radar for Fraud Teams.",
    "sourceURL": "https://docs.stripe.com/radar/risk-settings"
  }
}