{
  "content": "# Use Stripe to register for sales tax\n\n## Learn more about how Stripe can register for you.\n\nStripe can register with the local tax authorities on behalf of remote sellers\nin the United States.\n\n## Eligibility\n\nStripe can register on your behalf in the US in every state.\n\nFor the supported jurisdictions, Stripe can register on your behalf to collect\nsales and use tax if your business meets the following additional eligibility\nrequirements:\n\n- A remote (out-of-state) seller with no physical presence in the state\n- A US-based business and US-based direct entity ownership\n- A US bank account in states that charge [state\nfees](https://docs.stripe.com/tax/use-stripe-to-register#pricing-and-state-fees)\nor collect bank account details as part of the registration process\n- The business hasn’t received a notice or set up an online account with the\njurisdiction\n- No prior acquisitions of an existing business\n\n## How to sign up\n\nUnder [Thresholds](https://dashboard.stripe.com/tax/thresholds) on the Tax page:\n\n- Hover over the jurisdiction where you want to sign up and click **Add\nregistration**.\n- Select **Register for me** to have Stripe complete your application.\n\nUnder [Registrations](https://dashboard.stripe.com/tax/registrations) on the Tax\npage:\n\n- Click **Add registration**.\n- Select the U.S. state you want to register in.\n- Select **Register for me**.\n\n## What to expect\n\n### Gather information needed to register\n\nGather key business information such as address, EIN, contact and ID information\n(for business owners and your business representative), and any state-specific\ninformation such as previous year sales and the date you want your registration\nto become effective.\n\n### After you submit your application\n\nOne of Stripe’s tax experts completes your registration with the state in 30\ndays or less. December, January, and February are high-volume months for\nregistration and tax filings. Within those months registration takes 60 days or\nless.\n\nAfter we complete it, you receive a detailed confirmation email from our team of\ntax experts containing a secure document link with relevant information about\nyour new tax registration. You can also view this in the\n[Documents](https://dashboard.stripe.com/settings/documents) section of your\nStripe Dashboard.\n\nYour new tax registration is automatically added to your Stripe Dashboard after\nStripe registers for you. If you are [set up to collect using Stripe\nTax](https://docs.stripe.com/tax/set-up), Stripe will then begin automatically\ncalculating tax in this jurisdiction according to your collection start date.\n\n## Pricing and state fees\n\nThe following states charge a fee to all remote sellers who register to collect\ntax. Because most states require ACH debit to process fees, your provided bank\naccount is debited for any state fees charged upon the initial registration\nsubmission. The exact fee can vary slightly depending on your unique business\ncharacteristics.\n\n- Arizona: 12 USD state fee charged with registration plus 1-50 USD per local\njurisdiction, charged after you file and remit in a new local jurisdiction\n- Colorado: 16 USD per location site plus a 50 USD deposit, refunded\nautomatically after you collect 50 USD in state sales tax\n- Connecticut: 100 USD\n- Hawaii: 20 USD\n- Indiana: 25 USD\n- Nevada: 15 USD plus a security deposit, which depends on your estimated sales\nvolume and is held by the state for a minimum of 3 years\n- South Carolina: 50 USD\n- Washington: 50 USD plus 5 USD per DBA (“doing business as,\" or trade name)\n- West Virginia: 30 USD\n- Wisconsin: 20 USD\n- Wyoming: 60 USD\n\n## When to register for tax collection\n\nWhen you need to register to collect tax in the US as a remote seller, it’s\ntypically based on two primary factors:\n\n### When you exceed an economic nexus threshold, based on sales or transaction count\n\nIn the US, you need to register as a remote seller after you meet the state’s\neconomic nexus threshold requirements. Check out the [US state tax\npages](https://docs.stripe.com/tax/supported-countries/united-states) or\n[Thresholds](https://dashboard.stripe.com/tax/thresholds) in your Stripe\nDashboard to see how your payment volume stacks up against each jurisdiction’s\nthresholds. Stripe also notifies you with email and Dashboard alerts after you\nappear to have crossed a threshold based on your Stripe payment volume.\n\n### Whether the jurisdiction provides a grace period to allow taxpayers more time to register after exceeding a threshold\n\nThe chart below shows the current state grace periods by state, if offered.\n\nStateGrace Period, if availableAlabamaJanuary 1 of the calendar year after the\nthreshold is exceededAlaska1st day of the month not more than 30 days after the\nthreshold is exceededArizona1st day of the following month, 2 months after the\nthreshold is exceededArkansasWhen the threshold is exceededCaliforniaWhen the\nthreshold is exceededColorado1st day of the following month, 90 days after the\nthreshold is exceededConnecticutJanuary 1 of the calendar year after the\nthreshold is exceeded over the 12 months ending September 30District of\nColumbiaWhen the threshold is exceededFloridaJanuary 1 of the next calendar year\nafter the threshold is exceededGeorgiaWhen the threshold is exceededHawaii1st\nday of the month not more than 30 days after the threshold is exceededIdahoWhen\nthe threshold is exceededIllinois1st day of the quarter after the threshold is\nexceededIndianaWhen the threshold is exceededIowa1st day of the month no more\nthan 30 days after the threshold is exceededKansas1st day of the month no more\nthan 30 days after the threshold is exceededKentucky1st day of the month no more\nthan 30 days after the threshold is exceededLouisiana30 days after the threshold\nis exceededMaine1st day of the following month, 2 months after the threshold is\nexceededMaryland1st day of the month and not more than 30 days after the\nthreshold is exceededMassachusetts1st day of the following month, 2 months after\nthe threshold is exceededMichiganJanuary 1 of the next calendar year after the\nthreshold is exceededMinnesota1st day of the following month, 2 months after the\nthreshold is exceededMississippiWhen the threshold is exceededMissouri1st day of\nthe following month, 90 days after the threshold is exceededNebraska1st day of\nthe following month, 2 months after the threshold is exceededNevada1st day of\nthe month and not more than 30 days after the threshold is exceededNew Jersey1st\nday of the month and not more than 30 days after the threshold is exceededNew\nMexicoJanuary 1 of the next calendar year after the threshold is exceededNew\nYork30 days after the threshold is exceededNorth Carolina60 days after the\nthreshold is exceededNorth Dakota60 days after the threshold is exceeded or the\nfollowing calendar year, whichever is earlierOhioWhen the threshold is\nexceededOklahoma1st day of the month and not more than 30 days after the\nthreshold is exceededPennsylvania1st day of the following month, 90 days after\nthe threshold is exceededPuerto RicoWhen the threshold is exceededRhode\nIslandJanuary 1 of the next calendar year after the threshold is exceededSouth\nCarolina1st day of the following month, 2 months after the threshold is\nexceededSouth DakotaWhen the threshold is exceededTennessee1st day of the\nfollowing month, 3 months after the threshold is exceededTexas1st day of the\nfollowing month, 4 months after the threshold is exceeded based on a rolling 12\nmonthsUtahWhen the threshold is exceededVermont1st day of the month and not more\nthan 30 days after the threshold is exceededVirginia1st day of the month and not\nmore than 30 days after the threshold is exceededWashington1st day of the\nfollowing month, 2 months after the threshold is exceededWest VirginiaWhen the\nthreshold is exceededWisconsinWhen the threshold is exceededWyomingWhen the\nthreshold is exceeded\n## Late registration\n\nIf you’re late in registering to collect tax, you have two main options.\n\nThe first option is to register as soon as possible with a registration\neffective date of when nexus was established in the jurisdiction, even if this\ndate is in the past, to reflect when you should have initially registered. Keep\nin mind that the state will often require you to file overdue returns for\nmissing tax periods and back-pay any taxes along with any penalties and\ninterest. If you’re subject to penalties, most states offer penalty waivers that\ncan be filed to as for a reduction or elimination of any penalties owed.\n\nThe second option is to work with your tax advisor to file a Voluntary\nDisclosure Agreement (VDA) in any jurisdictions where you’re late to register.\nVDAs allow taxpayers to become compliant with the state and ask for leniency on\nany overdue returns, taxes, and penalties. States might limit how far back you\nhave to pay previously owed taxes (for example, 3 years versus 5 years) or waive\nany associated penalties. You can often do this anonymously through a third\nparty. This can be costly, so it’s important to consult your tax advisor and\nweigh the pros and cons of both options.\n\n## Registration considerations\n\n### Your collection start date might be different from your registration date\n\n- The registration effective date is the date you provided in your application\nindicating when you need to register.\n- The collection start date is the date Stripe began automatically calculating\nand collecting tax for this jurisdiction.\n- On the day our tax experts complete your registration, if your registration\neffective date is:- In the future, your collection will be scheduled for that\nsame future date. This means both of these dates are the same.\n- The same day, collection will start immediately.\n- In the past, collection will start immediately. This means that your earlier\nregistration effective date and later collection start date in Stripe will\ndiffer.\n\n### Contact information for both states and Stripe\n\nIn your application, you provided contact information including an email\naddress. We recommended that this is an email that someone frequently checks and\nthat isn’t tied to any single individual. Stripe uses this contact information\nin the event we need to contact you about your registration, and the states use\nit on a long-term basis. In some states, this email address also becomes your\nusername.\n\n### The Dashboard shows an “issue” status for a registration in progress\n\nIf you see an issue status next to your registration in process, check the email\naddress you provided as your contact information. One of our tax experts will\nhave reached out to you explaining what additional information is needed to\nprocess your request.\n\n### In-state registrations aren’t supported yet\n\nWe can only support remote (out-of-state) sellers with no physical presence in\nthe state at this time. Physical presence laws vary by state, but generally\ninclude factors such as an office, storefront, employees, salespeople,\ncontractors, warehouses, inventory, or trade show attendance. Consult your tax\nadvisor if you’re unsure about whether you have physical presence in the state.\n\n### Register with the taxing authorities before you can add this registration to your Stripe Dashboard\n\nAdding a registration to the Stripe Dashboard doesn’t automatically register you\nin that jurisdiction.\n\nIf Stripe registers on your behalf, one of our tax experts automatically adds\nthis new tax registration to your Stripe Dashboard with the correct effective\ndate, so you don’t need to take any further action to begin automatically\ncalculating tax.\n\n### Viewing the signup option or reviewing an in-progress application\n\nRegistration applications are only accessible to users with `Owner` or `Admin`,\n`Analyst`, or `Tax Analyst` account access to ensure the security of your data.\nOther types of users won’t see the option to sign up or review an in-progress\napplication\n\nThe [sign-up\noption](https://docs.stripe.com/tax/use-stripe-to-register#how-to-sign-up) is\nlimited to users who meet the [eligibility\ncriteria](https://docs.stripe.com/tax/use-stripe-to-register#eligibility) based\non data available in Stripe. This information includes:\n\n- US-based business information including a Federal Employer Identification\nNumber (FEIN)\n- A US address,\n- A US (+1) phone number\n- A Social Security Number (SSN) for your business representative and direct\nindividual business owners with 10% or more ownership.\n\n### Filing assistance post-registration\n\nStripe doesn’t currently provide an in-house filing solution. See [tax\nfiling](https://docs.stripe.com/tax/filing) to learn more about our trusted\nfiling partners.\n\n### Determining NAICS and SIC codes\n\nThe North American Industry Classification System (NAICS) and Standard\nIndustrial Classification (SIC) are two federal standardized code systems used\nin the US to classify your primary business activity and industry. Certain state\njurisdictions use NAICS while others use SIC. If you don’t yet know the NAICS or\nSIC code for your business, here’s how you can determine it:\n\n- You can start by searching for an [NAICS code\nhere](https://www.naics.com/search/). We recommend doing this first, as NAICS\ncodes typically offer a bit more granularity. After you identify the proper\nNAICS code, you can enter it in the [NAICS\ncolumn](https://www.naics.com/naics-to-sic-crosswalk-2/) to see the possible\ncorresponding SIC codes.\n- Alternatively, you can search for a [SIC\ncode](https://www.naics.com/everything-sic/) here and then enter it in the [SIC\ncolumn](https://www.naics.com/naics-to-sic-crosswalk-2/) to see the possible\ncorresponding NAICS codes.\n\n### Editing or canceling your registration application\n\nIf your registration application is incomplete (you haven’t submitted it yet),\nyou can edit or cancel it in the Dashboard by clicking the overflow menu () next\nto your incomplete registration on the\n[Thresholds](https://dashboard.stripe.com/tax/thresholds) tab or on the relevant\njurisdiction page in the Dashboard.\n\nIf you’ve already submitted your registration, you can request to edit or cancel\nyour application by contacting support.\n\n## Links\n\n- [Thresholds](https://dashboard.stripe.com/tax/thresholds)\n- [Registrations](https://dashboard.stripe.com/tax/registrations)\n- [Documents](https://dashboard.stripe.com/settings/documents)\n- [set up to collect using Stripe Tax](https://docs.stripe.com/tax/set-up)\n- [US state tax\npages](https://docs.stripe.com/tax/supported-countries/united-states)\n- [tax filing](https://docs.stripe.com/tax/filing)\n- [NAICS code here](https://www.naics.com/search/)\n- [NAICS column](https://www.naics.com/naics-to-sic-crosswalk-2/)\n- [SIC code](https://www.naics.com/everything-sic/)",
  "metadata": {
    "title": "Use Stripe to register for sales tax | Stripe Documentation",
    "description": "Stripe can manage sales tax registration on behalf of remote sellers in the US. Eligible businesses can register in any state and begin automatic tax collection using Stripe Tax based on their registration status. Learn about eligibility, sign-up steps, pricing, and key considerations for using this service to ensure compliance with state tax laws.",
    "sourceURL": "https://docs.stripe.com/tax/use-stripe-to-register"
  }
}