{
  "content": "# Merchant risk toolingPrivate preview\n\n## Use Stripe tools to prevent and manage merchant risk.\n\nIf you decide to manage merchant risk yourself, Stripe offers tools to help you:\n\n- Identify a potentially fraudulent connected account using a fraud risk score.\n- Investigate a connected account by reviewing risk metrics and fraud\nindicators.\n- Gather additional information about a connected account through document\nverification and a selfie check.\n- Take action against a connected account by pausing payouts, pausing payments,\nrejecting the account, or blocking its external payout account.\n\n## Identify potentially fraudulent connected accounts\n\nStripe provides a fraud risk score for each connected account based on the\nrisk-related signals that we collect. In your Dashboard, you can filter the\n[accounts\noverview](https://docs.stripe.com/connect/dashboard/viewing-all-accounts) based\non the fraud risk score. The Home page also alerts you to potentially fraudulent\nconnected accounts.\n\n## Investigate a connected account\n\nIn your Dashboard, you can view the following information in the connected\naccount details page:\n\n- The fraud risk score of the connected account\n- Potential fraud indicators, which provide you with suggestions for potential\nareas to investigate further\n- Risk-related metrics, such as declines, disputes, and refunds, specific to\nthat connected account\n\n## Gather additional information\n\nTo gather more information on the connected account, you can ask to verify a\ngovernment-issued ID document and, optionally, a selfie. When you do so, you\nalso set an enforcement that automatically occurs if the connected account\ndoesn’t successfully complete the verification. This enforcement can either be\nto pause payouts only, or to pause both payouts and payments. This enforcement\ncan occur either after a certain period of time or after a certain total\nlifetime volume.\n\n## Take action\n\nYou can pause payments, pause payouts, or reject a connected account using the\nAPI or the Dashboard.\n\n## Request early access\n\n## Interested in getting early access to merchant risk tooling?\n\nMerchant risk tooling is currently in private preview. To learn more or get\nearly access, please enter your email address below.\n\nCollect EmailSign upRead our [privacy policy](https://stripe.com/privacy).\n\n## Links\n\n- [accounts\noverview](https://docs.stripe.com/connect/dashboard/viewing-all-accounts)\n- [privacy policy](https://stripe.com/privacy)",
  "metadata": {
    "title": "Merchant risk tooling | Stripe Documentation",
    "description": "Use Stripe tools to prevent and manage merchant risk.",
    "sourceURL": "https://docs.stripe.com/connect/risk-management/risk-tooling"
  }
}