{
  "content": "# Monitor your obligations\n\n## Use our tool to see where you might need to register to collect tax based on past transactions.\n\nStripe Tax provides insights about your potential tax registration obligations\n(called economic nexus in the US). We help you understand where you might have\nto register, collect, and remit tax based on your sales into a state or country,\neven if you don’t have physical presence there. You can also use [Stripe to\nregister](https://docs.stripe.com/tax/use-stripe-to-register) on your behalf.\n\n#### Note\n\nTax provides threshold monitoring primarily for payments processed by Stripe.\nThe only out of band payments we currently include are invoices processed off of\nStripe and transactions created using the Stripe Tax APIs.\n\n## How it works\n\nTax uses your preset tax code and [location\nattribution](https://docs.stripe.com/tax/monitoring#location-attribution) for\neach Stripe-processed sale minus refunds to see how your total sales within a\ngiven [time window](https://docs.stripe.com/tax/monitoring#time-window) compare\nto tax thresholds in different jurisdictions. Tax uses time windows defined by\nlocal tax rules and assumes all sales are B2C unless you have included a VAT ID\nfor your customer. Your obligations might differ if you only sell nontaxable\nitems or make B2B sales. Learn more about [when you need to register to collect\ntax in each location](https://docs.stripe.com/tax/supported-countries).\n\n### Refunds and threshold calculations\n\nWhen a transaction is refunded, Stripe Tax automatically adjusts your threshold\ncalculations to account for the refund. The refunded amount is subtracted from\nyour total sales calculations, which might lower your overall sales volume for a\nparticular jurisdiction. If the refund brings you below a previously exceeded\nthreshold, this updates your obligation status. These adjustments typically\nprocess within 24–48 hours of the refund.\n\nAfter a refund processes, your threshold status includes the refunded amount.\nYour Dashboard still shows any threshold notifications you received before\nprocessing the refund.\n\n### Connect\n\nBy default, transactions linked to your platform’s connected accounts don’t\ncount toward your platform’s tax registration thresholds. They only count toward\nthe connected accounts’ tax thresholds. To change this:\n\n- Go to the [Connect\nsettings](https://dashboard.stripe.com/settings/connect/tax-threshold-monitoring)\nfor Sales tax collection.\n- Choose to be held liable for sales made by your connected accounts.\n\nConnected accounts’ transactions with the following charge types are then\nincluded in your platform’s threshold monitoring:\n\nCharge typeWithout `on_behalf_of`With `on_behalf_of`[Destination\nCharges](https://docs.stripe.com/connect/destination-charges)Included.Included.[Separate\nCharges and\ntransfers](https://docs.stripe.com/connect/separate-charges-and-transfers)Not\nincluded.Included.\nSeparate charges and transfers without `on_behalf_of` aren’t included. This is\nbecause Stripe can’t know who the liable party for the transfer is. Stripe\nassumes the [settlement\nparty](https://docs.stripe.com/connect/separate-charges-and-transfers#settlement-merchant)\nto be the liable entity, which is the Connect Platform.\n\n### Exceptions\n\n- We provide insight into the places where you don’t have a physical presence so\nobligations aren’t monitored for your home US state or country.\n- Obligations are only monitored in live mode.\n- Application fees that Connect platforms charge don’t count toward the\nplatform’s tax registration thresholds.\n- We monitor locations that Stripe Tax supports. [Learn\nmore](https://docs.stripe.com/tax/supported-countries) about those locations.\n- We don’t monitor transactions that might contribute to exceeding a threshold\nto collect retail delivery fees.\n- We treat obligations for tangible product sales and services the same.\n- We can’t differentiate between retail and wholesale sales.\n- For Connect platforms liable for sales made by their connected accounts, a\nlocation might be marked as Undetermined. This means that Stripe lacks the\ninformation needed to support you on tax obligations for this location. This can\noccur if the customer’s location is outside the United States and not in the\nUnited Kingdom or European Union with a default PTC of Digital Goods.\n\n### Location attribution\n\nLocation attribution is an important part of monitoring tax thresholds. To\ncorrectly determine your tax obligations, Stripe Tax attributes a location to\neach processed transaction once per day, adding new resulting transactions to\nyour monitoring threshold in a 24-hour cycle. Location attribution happens even\nif tax isn’t calculated for the transactions, and it’s a different process from\nthe [address validation](https://docs.stripe.com/tax/customer-locations) that we\nperform to calculate tax. You might not need specific tax rates and precise\naddress information for threshold monitoring purposes, unlike when Stripe\ncalculates and collects tax for transactions.\n\nTo attribute a location, Stripe Tax uses available information for that\ntransaction and prefers some information sources to others—some examples are the\ncurrent customer address, country of the card issuer, and the customer’s IP\naddress.\n\nStripe Tax uses information in the following order:\n\n- **Stripe Tax validated address:** if we calculated tax for the transaction,\nStripe Tax already validated the address. We use the same address when\ncalculating the tax threshold.\n- **Customer address:** property in the\n[Customer](https://docs.stripe.com/api/customers/object) object responsible for\nthe transaction. Stripe Tax uses the country, state, and postal code fields to\ndetermine a jurisdiction.\n- **Address Verification (AVS) postal code:**\n[AVS](https://docs.stripe.com/disputes/prevention/verification#avs-check) is a\nservice that verifies the authenticity of a transaction by checking if the\nprovided address matches the cardholder’s billing address. If the transaction is\nsuccessful, Stripe Tax converts a US or Canadian postal code into a state and\ndetermines the jurisdiction.\n- **Country of the card issuer:** Stripe Tax uses the credit card issuer’s bank\ncountry to determine a jurisdiction for the transaction. For transactions in the\nUS and Canada, we might also need state information.\n- **Payment method:** Stripe Tax uses country-specific payment methods to\ndetermine the location of a payment. We assume that a transaction through\n[iDeal](https://docs.stripe.com/payments/ideal) is from the Netherlands and that\na transaction through Giropay is from Germany, for example.\n- **Customer’s IP address:** as a last resort, we use the customers IP address\nto determine a jurisdiction.\n\nWhen Stripe Tax can’t determine the location for a transaction, we group its\ninformation into an **Unattributed revenue** category. Where possible, we break\nout globally unattributed revenue and US unattributed revenue. For example, if\nwe’re able to determine the customer is in the US (perhaps by using an IP\naddress) but don’t have enough information to make a granular determination, we\ncategorize that as US unattributed revenue.\n\n![Unattributed revenue in the Stripe\nDashboard](https://b.stripecdn.com/docs-statics-srv/assets/unattributed-revenue.dfbed304297c0e568b633542130bbd39.png)\n\n#### Handling unattributed revenue\n\nThe table below explains what information is needed for different countries.\n\nUnited StatesCanadaEverywhere elseExample addresses ExplanationAttributed -\n`country`: US\n- `state`: NY\n\n**Country and state**\n\nYou need to provide country and state information to calculate tax thresholds in\nthe US.\n\n- `country`: US\n- `postal_code`: 10038\n\n**Country and postal code**\n\nWe match the 5 or 9-digit postal code with its corresponding state.\n\n- `country`: US\n\n**Country**\n\nIn the US, each state defines it’s rules for when to establish economic nexus.\nTherefore, country-only information isn’t enough to attribute locations to\ntransactions. Transactions without state information appear under US\nunattributed revenue.\n\n## Using the Dashboard\n\nSee [Thresholds](https://dashboard.stripe.com/tax/thresholds) to get insights\nabout your potential tax registration obligations.\n\nWe group your registration obligations into the following categories:\n\n- Exceeded: Your estimated sales or transactions exceed the location’s\nregistration threshold, and your business likely needs to register for tax. You\ncan [use Stripe to\nregister](https://docs.stripe.com/tax/use-stripe-to-register).\n- Upcoming: Your estimated sales or transactions exceed 85% of the location’s\nthreshold. We expect you to exceed the threshold soon.\n- Monitoring: We’re actively monitoring your obligations for the location and\nwill let you know when you’re approaching its threshold.\n- Not monitoring: We aren’t monitoring your obligations in the location. This is\nbecause either:- Your [preset product tax\ncode](https://docs.stripe.com/tax/products-prices-tax-codes-tax-behavior#product-tax-code)\nis non-taxable in the location.\n- We only support monitoring [digital\nproducts](https://docs.stripe.com/tax/tax-codes?type=digital) there, and your\n[preset product tax\ncode](https://docs.stripe.com/tax/products-prices-tax-codes-tax-behavior#product-tax-code)\nis non-digital. For more details, see the [countries supported by Stripe\nTax](https://docs.stripe.com/tax/supported-countries).\n- Undetermined: For [marketplace\nfacilitators](https://docs.stripe.com/tax/tax-for-marketplaces), we support\nmonitoring only in the UK, US, and EU. In the UK and EU, we support monitoring\nonly for [digital products](https://docs.stripe.com/tax/tax-codes?type=digital).\n\nTo learn more about an individual state or country comparison, click the\noverflow menu (), then **View details**. This page contains information about\nthe threshold itself and your latest sales.\n\nWhen downloading your transaction data, the `is_customer_business` and\n`is_customer_taxable` fields are included for completeness, but might not be\nrelevant or applicable in all jurisdictions. Learn more about the tax\nrequirements in each of our [supported\njurisdictions](https://docs.stripe.com/tax/supported-countries).\n\nIf you have questions about your latest sales in a location, send an email to:\n[stripe-tax@stripe.com](mailto:stripe-tax@stripe.com).\n\n### Time windows\n\nAs noted above, each jurisdiction might have a different time window for\ncalculating nexus obligations. For example, some only look at the past calendar\nmonth or quarter whereas others use a rolling basis. You can see how each\nindividual jurisdiction calculates economic nexus as part of the Review flow,\nbut in general, Stripe Tax supports the following calculation windows and\nmethodology:\n\n- **Previous or current year:** Stripe Tax uses the previous or current calendar\nyear to calculate the count and amount of transactions.\n- **Previous year:** Stripe Tax uses the previous calendar year to calculate the\ncount and amount of transactions.\n- **Rolling year by quarter:** Stripe Tax uses the last four full quarters to\ncalculate the count and amount of transactions.\n- **Rolling 12 months:** Stripe Tax uses the last 12 months to calculate the\ncount and amount of transactions.\n\n### Stripe Tax API transactions\n\nBy default, Stripe Tax monitors all [Stripe Tax\nAPI](https://docs.stripe.com/tax/custom) transactions. You can choose to exclude\nyour Stripe Tax API transactions by adjusting the **API transactions** setting\nin your [Tax Settings](https://dashboard.stripe.com/settings/tax).\n\n## Tax threshold notifications\n\nStripe Tax alerts you to potential tax obligations (known as economic nexus in\nthe US) when your business reaches 10,000 USD in yearly revenue. We send\nnotifications after you hit a threshold in any location. Stripe sends tax\nthreshold notifications by email, and displays them in the Dashboard to the\naccount owner.\n\n### Email notification\n\nWe send email notifications from `support+updates@stripe.com` to the account\nowner’s email. The email notification includes:\n\n- A list of locations generating over 5% of your revenue where you’re not\nregistered.\n- The count of locations generating less than 5% of your revenue where you’ve\nrecently exceeded a threshold and aren’t registered.\n\n![Preview of tax threshold\nnotification](https://b.stripecdn.com/docs-statics-srv/assets/tax-threshold-email-preview.e685687dcb47a209a7aef60cc2402d36.png)\n\nIf you’re registered in one of these locations, add your registration in the\n[Dashboard](https://dashboard.stripe.com/tax/registrations).\n\n### Dashboard notification\n\nIf you log into the Dashboard as the account owner, you can see notifications.\nClick the bell icon in the navigation bar to show all of your Dashboard\nnotifications.\n\n#### Note\n\nClick **Review tax thresholds** inside of the notification to go to the tax\nmonitoring tool.\n\nCrossing a tax threshold in a single locationCrossing tax thresholds in multiple\nlocations\nYou can exceed a tax threshold in a single location.\n\n!\n\n### Tax threshold notification preconditions\n\nStripe only notifies you when you have exceeded a tax threshold based on\nStripe’s calculations. To receive tax threshold notifications, you must meet the\nfollowing requirements:\n\n- You’ve opted into [Stripe Tax](https://dashboard.stripe.com/tax).\n- You haven’t disabled [Stripe Tax\nnotifications](https://dashboard.stripe.com/settings/communication-preferences).\n- You’ve had 10,000 USD in revenue in the previous year.\n- You don’t have an active live mode tax registration for the location.\n- You haven’t received any tax threshold notification within the past 7 days.\n\n### Tax threshold notification frequency\n\nAfter you cross a threshold, Stripe sends you a notification within 1 or 2 days.\nIf Stripe sent you a notification in the past 7 days, you receive batched\nnotifications for new threshold status changes a week after the last\nnotification.\n\nNo grouping of notificationsGrouping of notifications- **March 15**: You exceed\na threshold in Germany.\n- **March 16**: Stripe notifies you about exceeding a tax threshold in Germany.\n- **March 25**: You exceed a threshold in the Netherlands.\n- **March 26**: Stripe notifies you about exceeding a tax threshold in the\nNetherlands.\n\n### Disable tax threshold notifications\n\nIf you’re the account owner, you can disable tax threshold notifications by\ngoing to the **Product updates** tab in your [communication\npreferences](https://dashboard.stripe.com/settings/communication-preferences).\n\n## See also\n\n- [Checkout and Tax](https://docs.stripe.com/tax/checkout)\n- [Billing and Tax](https://docs.stripe.com/billing/taxes/collect-taxes)\n- [Products, prices, tax codes, and tax\nbehavior](https://docs.stripe.com/tax/products-prices-tax-codes-tax-behavior)\n\n## Links\n\n- [Stripe to register](https://docs.stripe.com/tax/use-stripe-to-register)\n- [location\nattribution](https://docs.stripe.com/tax/monitoring#location-attribution)\n- [time window](https://docs.stripe.com/tax/monitoring#time-window)\n- [when you need to register to collect tax in each\nlocation](https://docs.stripe.com/tax/supported-countries)\n- [Connect\nsettings](https://dashboard.stripe.com/settings/connect/tax-threshold-monitoring)\n- [Destination Charges](https://docs.stripe.com/connect/destination-charges)\n- [Separate Charges and\ntransfers](https://docs.stripe.com/connect/separate-charges-and-transfers)\n- [settlement\nparty](https://docs.stripe.com/connect/separate-charges-and-transfers#settlement-merchant)\n- [address validation](https://docs.stripe.com/tax/customer-locations)\n- [Customer](https://docs.stripe.com/api/customers/object)\n- [AVS](https://docs.stripe.com/disputes/prevention/verification#avs-check)\n- [iDeal](https://docs.stripe.com/payments/ideal)\n- [Thresholds](https://dashboard.stripe.com/tax/thresholds)\n- [preset product tax\ncode](https://docs.stripe.com/tax/products-prices-tax-codes-tax-behavior#product-tax-code)\n- [digital products](https://docs.stripe.com/tax/tax-codes?type=digital)\n- [marketplace facilitators](https://docs.stripe.com/tax/tax-for-marketplaces)\n- [Stripe Tax API](https://docs.stripe.com/tax/custom)\n- [Tax Settings](https://dashboard.stripe.com/settings/tax)\n- [Dashboard](https://dashboard.stripe.com/tax/registrations)\n- [Stripe Tax](https://dashboard.stripe.com/tax)\n- [Stripe Tax\nnotifications](https://dashboard.stripe.com/settings/communication-preferences)\n- [Checkout and Tax](https://docs.stripe.com/tax/checkout)\n- [Billing and Tax](https://docs.stripe.com/billing/taxes/collect-taxes)\n- [Products, prices, tax codes, and tax\nbehavior](https://docs.stripe.com/tax/products-prices-tax-codes-tax-behavior)",
  "metadata": {
    "title": "Monitor your obligations | Stripe Documentation",
    "description": "Monitor your potential tax obligations with Stripe Tax, which analyzes your sales to determine where you need to register, collect, and remit taxes. Stripe Tax considers factors like economic nexus and location attribution.",
    "sourceURL": "https://docs.stripe.com/tax/monitoring"
  }
}