{
  "content": "# Add GUID values to NetSuite invoices\n\n## Learn how to add GUID values to NetSuite invoices that you created before setting up the payment link.\n\nWhen you [install the\nconnector](https://docs.stripe.com/connectors/netsuite/invoice-payment-link/installation)\nwith the payment page link, the installation includes a Stripe GUID field. The\nGUID is a unique number that’s added to the URL link structure for each unique\npayment link. Only invoices created after installation receive a GUID value.\n\nThe payment link won’t contain a GUID in the URL link structure in the following\ncases:\n\n- If you send an invoice created before installing the connector. In this case,\nthe payment page results in a “Page not found” error visible to your customer.\n- If you create an invoice from a sales order created before installing the\nconnector. The sales order might be a subscription record for the NetSuite\nbilling engine, and resulting invoices won’t contain a GUID.\n\n#### Note\n\nIf you need to update the GUID for invoices created from previously created\nsales orders, ask your implementation partner to alter the workflow installed by\nthe bundle.\n\n## Add a GUID value to NetSuite invoices in bulk\n\nYou can update invoices created before installing the connector to add a GUID\nvalue to the existing GUID field, which makes the payment link available on\nthose invoices.\n\n- In your NetSuite dashboard, use the global search tool to find `Search &\nInstall bundles`.\n- Install the `[MHI] Invoice GUID Update` bundle (ID 494647). Myers-Holum Inc.\n(MHI) is an approved Stripe partner and created this free bundle.\n- After the installation completes, go to **Lists** > **Mass Update** > **Mass\nUpdates** in the NetSuite Center.\n- Select **Workflows**, and use **Command+F** to search for `GUID`.\n- Select **Initiate Update Invoice GUIDs**.\n- On the Mass Update configuration page, do the following:\n\n- Edit the **Title of Action** field to use a title that’s recognizable, for\nexample, `Stripe GUID update for invoice payment links`.\n- Add the following criteria:\n\n- **Main Line**: `is true`\n- **Status**: `is Invoice:Open`\n- **Subsidiary**: Select the desired subsidiary for the invoice payment page.\nYou can select multiple subsidiaries. For international accounts, you can add\ncriteria for the **Entity**.\n\nYou can add more criteria as needed. For example, if you have 50,000 open\ninvoices from previous years, you can add a criteria for the date, based on how\nfar back to collect payment for invoices.\n- Click **Preview** to see the number of invoices selected.\n\nVerify that you’re capturing the desired invoices to update. The update might\ntake a few hours, depending on the number of invoices.\n- Click **Save** to start the bulk update.\n\nTo check on the progress of the update, click **Refresh**. The update continues\neven if you navigate away from the progress page.\n- After the update completes, you can use the invoice payment page link for each\ninvoice.\n\n#### Note\n\nIf there are any errors, the progress page updates to display an error report\npage. You can view the report for each invoice to learn more about the error.\n\n## See also\n\n- [NetSuite invoice payment\nlink](https://docs.stripe.com/connectors/netsuite/invoice-payment-link/overview)\n- [Set up payment method\nrules](https://docs.stripe.com/connectors/netsuite/invoice-payment-link/payment-method-rules)\n\n## Links\n\n- [install the\nconnector](https://docs.stripe.com/connectors/netsuite/invoice-payment-link/installation)\n- [NetSuite invoice payment\nlink](https://docs.stripe.com/connectors/netsuite/invoice-payment-link/overview)\n- [Set up payment method\nrules](https://docs.stripe.com/connectors/netsuite/invoice-payment-link/payment-method-rules)",
  "metadata": {
    "title": "Add GUID values to NetSuite invoices | Stripe Documentation",
    "description": "Learn how to add GUID values to NetSuite invoices that you created before setting up the payment link.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/invoice-payment-link/guid-values"
  }
}