{
  "content": "# Instant Payouts with advance funding\n\n## Let Instant Payouts access pending balances with trackable balance activities.\n\nInstant payout users benefit from quick access to their pending balances. To use\nthese funds safely, explicit actions like advance funding are necessary for\naccurate bookkeeping when fund availability changes.\n\n## How Instant Payouts with advance funding works\n\nStripe enables Instant Payouts users to access pending balances through the\n`advance` and `advance_funding`\n[type](https://docs.stripe.com/reports/balance-transaction-types) balance\ntransactions. When you create an instant payout that exceeds your available\nbalance, funds are added to your available balance and subtracted from your\npending balance to cover the difference.\n\n### Granular advance funding\n\nTo align advance funding with the original availability of payments, Stripe\ncreates multiple `advance_funding`\n[type](https://docs.stripe.com/reports/balance-transaction-types) balance\ntransactions when it pulls funds from multiple days’ worth of payments balances.\n\nFor example, if you have the following:\n\n- 0 USD in your available balance today\n- 25 USD available on tomorrow (T+1)\n- 15 USD available on the day after (T+2)\n\nWhen you request a 40 USD instant payout, you’ll see two separate\n`advance_funding`\n[type](https://docs.stripe.com/reports/balance-transaction-types) balance\ntransactions:\n\n- One that deducts 25 USD from your T+1 balance\n- One that deducts 15 USD from your T+2 balance\n- And one `advance`\n[type](https://docs.stripe.com/reports/balance-transaction-types) balance\ntransaction that credits 40 USD to your available balance\n\n### Reversal of failed or canceled Instant Payouts\n\nWhen an instant payout fails or gets canceled, the corresponding `advance` and\n`advance_funding`\n[type](https://docs.stripe.com/reports/balance-transaction-types) balance\ntransactions are reversed by offsetting balance transactions. In the example\nabove, if the 40 USD instant payout fails, we:\n\n- Credits 25 USD to your T+1 balance\n- Credits 15 USD to your T+2 balance\n- Deducts 40 USD from your available balance\n\n### Negative available balance recovery\n\nWhen your available balance is negative, advance funding does not restore it.\nInstead, it only provides funding for the requested instant payout amount,\nleaving your negative available balance unchanged. We’ll choose the right bucket\nof pending balances to allow your negative available balance to phase out\ngradually. This funding is drawn from future days where the cumulative balance\nis positive. For example:\n\n- -25 USD in your available balance today (available balance)\n- 20 USD available tomorrow (T+1)\n- 30 USD available the day after (T+2)\n\nIn this scenario, the cumulative balance on T+1 is -5 USD, while T+2 shows a\ncumulative balance of 25 USD. If you request a 10 USD instant payout, we:\n\n- Deduct 10 USD from your T+2 balance\n- Credit 10 USD to your available balances for the Instant Payouts\n\nThis method retains more recent pending balances, aiding recovery from a\nnegative balance. The cumulative balance recovers on T+2.\n\n## Filter balance transactions by source\n\nUse the `source` field to find the `advance` and `advance_funding`\n[type](https://docs.stripe.com/reports/balance-transaction-types) balance\ntransactions for the Instant Payout. You can access the `source` field in the\nDashboard when you filter transactions or through the [Balance Transactions\nAPI](https://docs.stripe.com/api/balance_transactions).\n\nDashboardAPI- Go to the **Balances > All activity** page.\n- Click the **Export** button and select a time range.\n- Open the downloaded balance history CSV file.\n- Locate the **source** column in the export file.\n- The related `advance` and `advance_funding` balance transactions will have a\n`source` field that matches the instant payout token.\n\n## Links\n\n- [type](https://docs.stripe.com/reports/balance-transaction-types)\n- [Balance Transactions API](https://docs.stripe.com/api/balance_transactions)",
  "metadata": {
    "title": "Instant Payouts with advance funding | Stripe Documentation",
    "description": "Use Stripe Instant Payouts to let Instant Payouts users access their pending balances and improve their balance activity tracking.",
    "sourceURL": "https://docs.stripe.com/payouts/instant-payouts-with-advance-funding"
  }
}