{
  "content": "# Stripe payouts in NetSuite\n\n## Use the connector to automatically reconcile Stripe payouts to NetSuite bank deposits.\n\nThe Stripe Connector for NetSuite automates the cash reconciliation process for\nany payments, refunds, or disputes processed by Stripe. In addition to creating\nbank deposits in NetSuite for all of your [Stripe\npayouts](https://support.stripe.com/topics/payouts), the connector records fees\nand automates currency conversion. The connector records all fees and\ntransactions associated with a payout into a single deposit record.\n\n## How it works\n\nWhen you use the connector, the automated cash reconciliation process occurs as\nfollows:\n\n- Each Stripe transaction results in a bank deposit that’s posted to the\n`Undeposited Funds` account in NetSuite.\n- The connector moves the bank deposit from the `Undeposited Funds` account to\nthe bank account specified on the deposit.\n- The connector records fees and reversals as line items on the NetSuite\ndeposit:- Stripe fees or fee refunds: `Cash Back` and `Other Deposit`\n- Dispute fees or dispute reversals: `Cash Back`\n- The deposit posts to the NetSuite bank account connected to your Stripe\naccount.\n- The connector verifies that the total amount on the deposit record and\ntransaction date match your bank statement.\n\n#### Note\n\nIf the deposit doesn’t match the payout, the connector adds a note to the memo\nfield to notify you of the mismatch. This can happen if the connector isn’t set\nup for certain Stripe or NetSuite configurations, or if you have transactions\nfrom before the record sync start date.\n\nStripe\n\nConnector\n\nNetSuite\n\nCash reconciliation\n\nStripe creates payment\n\nThe connector creates NetSuite payment and posts to the Undeposited Funds\naccount\n\nThe connector adds the payment to the bank deposit and moves the payment to the\nbank account specified on the deposit\n\nStripe issues a refund or chargeback\n\nThe connector creates a NetSuite refund and posts it to the Undeposited Funds\naccount\n\nThe connector adds the refund to the bank deposit and moves it to the bank\naccount specified on the deposit\n\nStripe sends the payout to your bank\n\nThe Stripe payout arrives in your bank account\n\nThe connector creates a bank deposit that includes all transactions and\nprocessing fees\n\nA high level overview of the deposit automation flow\n## Payout validation process\n\nEvery Stripe transaction in a payout goes through a validation process that\ncompares the payments, refunds, and disputes against their corresponding\nNetSuite records.\n\nThe connector validates that the records:\n\n- Aren’t already deposited\n- Are posted to the `Undeposited Funds` account\n- Have matching amounts between NetSuite and Stripe\n\n### Successful validation\n\nIf all transactions in a payout pass the validation process, the connector\ncreates a deposit that’s linked to the associated transactions. This action\nchanges the status of any payments refunds from `Not Deposited` to `Deposited`.\n\n### Unsuccessful validation\n\nIf a payment, refund, or dispute fails the validation process, the connector\ndoesn’t sync the payout to NetSuite. Your administrators receive a notification\nemail that provides information about which records failed validation and the\nreasons why. Learn about the potential [errors you might\nreceive](https://docs.stripe.com/connectors/netsuite/error-resolution) and how\nto fix them.\n\nThe connector automatically retries syncing if payout validation fails, or if\nyou update a payout in Stripe (for example, by adding metadata). You can also\nmanually retry a payout through the synced records drawer.\n\n## Types of fees\n\nDifferent actions in Stripe can result in fees. Most fees post to the `Payment\nfees` category, by default. If applicable, you can customize the accounts used\nfor these fees in the Stripe app under **Settings** > **Accounts mapping**. To\ndo so, disable `Only show accounts used` and optionally set a specific expense\naccount for each fee type.\n\nFee typeDescriptionPayment processing feesThese fees appear in the `Payment\nfees` category and are distinct from fees charged by Stripe for other services\noutside of payment processing.Stripe feesThese fees are for Stripe software and\nservices such as premium support, fraud protection, connectors, and so on. These\nfees post to the same account as payment processing fees; however, you can\ncustomize the accounts you use for these fees.Application feesApplications\ncharge these fees for taking actions in your Stripe account on your behalf. For\nexample, an event ticketing system might charge you a fee for each ticket you\nsell. The fees charged by third-party applications appear aggregated on each\npayout and post to a unique expense account.Interchange Plus pricing and fees\n(IC+)IC+ is a special type of pricing provided by Stripe and changes how your\naccount represents fees. Because Stripe receives the fee amount later and\ndirectly from the card networks, you won’t see any fees when you look at a\ncharge in the Stripe Dashboard. You also won’t see IC+ fees in your Stripe test\nenvironment payouts. When you receive a bank payout, fees record under two\ncategories: `network fees` and `Stripe fees`. These fee categories are\ncontrolled by the `Processing fees` and `Stripe fees` categories in the Stripe\nDashboard. You can post these fee categories to unique income accounts in\nNetSuite.\n## Multiple currencies and currency conversion\n\nStripe supports charges and payouts to bank accounts in multiple currencies. If\nyour Stripe account has multiple bank accounts with different currencies, you\nneed to provide the NetSuite bank account that you want the connector to use for\neach bank account. You can customize the accounts used in the Stripe app under\n**Settings** > **Accounts mapping**.\n\n## Subsidiaries\n\nIf you use [NetSuite\nOneWorld](https://docs.oracle.com/en/cloud/saas/netsuite/ns-online-help/section_N266701.html)\nand have multiple subsidiaries, the subsidiaries must match across the different\nrecord types.\n\nFor example, the fee account subsidiary must match the bank account subsidiary.\nOr you must assign the subsidiary to a parent subsidiary with the `Include\nChildren` setting enabled in NetSuite. The subsidiary associated with all\npayments customers must match the bank account subsidiary. If you use the\nconnector to create customers and payments, the connector handles this\nautomatically.\n\n## Automatic payouts\n\nThe connector requires you to set up automatic payouts in your Stripe account.\nThis allows the connector to monitor payouts sent automatically and reconcile\nthe transactions in the payouts with the created records in NetSuite.\n\nTo set up automatic payouts, go to the [External payout accounts and\nscheduling](https://dashboard.stripe.com/settings/payouts) page in the Stripe\nDashboard. Set the payout schedule to `Automatic every day`.\n\nNetSuite can create and send up to 10,000 transactions. Setting the payout\nschedule to daily maintains a lower volume per payout and prevents backups and\nerrors. If you have a low transaction volume, you can also set the payout\nschedule to weekly.\n\nIf you use manual payouts:\n\n- Deposit automation won’t work. This includes recording fees and disputes, or\nhandling currency conversion.\n- NetSuite payments aren’t mapped to any specific charges, refunds, or disputes.\n- All payments, refunds, and disputes post to, and remain in, the `Undeposited\nFunds` account. You must manually manage these transactions.\n- The connector can’t include specific payments in a deposit or move them out of\nthe `Undeposited Funds` account to your bank account.\n- Invoices, cash application, and refunds reconcile and sync as expected.\n\n#### Note\n\nIf your NetSuite deposit doesn’t appear as a deposit of funds to your bank\naccount, your bank might block [debit\npayouts](https://support.stripe.com/questions/handling-negative-balances-in-your-stripe-account).\nIn this case, the payout still syncs to NetSuite as if it succeeded. However, if\nyour bank blocked the debit payout, it won’t appear on your bank register. To\nresolve this, you must group the blocked debit payout with the successful payout\nfrom Stripe.\n\n## Test payouts with the connector\n\nSimilar to the Stripe production environment, payouts are created automatically\nin your test environment.\n\nTo test syncing payouts with the connector, you need to wait for a payout to\nbundle your test charges and refunds. Use a [test\ncard](https://docs.stripe.com/testing#available-balance) to move funds directly\nto the available balance instead of the pending balance.\n\n## See also\n\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation)\n- [Invoice payment\npage](https://docs.stripe.com/connectors/netsuite/invoice-payment-page)\n- [Customer payment\npage](https://docs.stripe.com/connectors/netsuite/customer-payment-page)\n\n## Links\n\n- [Stripe payouts](https://support.stripe.com/topics/payouts)\n- [errors you might\nreceive](https://docs.stripe.com/connectors/netsuite/error-resolution)\n- [NetSuite\nOneWorld](https://docs.oracle.com/en/cloud/saas/netsuite/ns-online-help/section_N266701.html)\n- [External payout accounts and\nscheduling](https://dashboard.stripe.com/settings/payouts)\n- [debit\npayouts](https://support.stripe.com/questions/handling-negative-balances-in-your-stripe-account)\n- [test card](https://docs.stripe.com/testing#available-balance)\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation)\n- [Invoice payment\npage](https://docs.stripe.com/connectors/netsuite/invoice-payment-page)\n- [Customer payment\npage](https://docs.stripe.com/connectors/netsuite/customer-payment-page)",
  "metadata": {
    "title": "Stripe payouts in NetSuite | Stripe Documentation",
    "description": "Use the connector to automatically reconcile Stripe payouts to NetSuite bank deposits.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/stripe-payouts-netsuite"
  }
}