{
  "content": "# Dispute withdrawals\n\n## Learn what to do when a cardholder withdraws their dispute.\n\nThe most effective dispute strategy is to [reduce the number of\ndisputes](https://docs.stripe.com/disputes/prevention) you receive in the first\nplace. For the best results, work directly with your customer to resolve the\nissue if you do receive a dispute.\n\nEvery card network has some provision in its dispute system for the cardholder\nto retract a dispute after filing it. Settling the dispute amicably with your\ncustomer and convincing them to withdraw it is the best way to win it.\n\n## Withdrawn disputes\n\nA withdrawn dispute is one that your customer has asked their card issuer to\ncancel. It isn’t *necessarily* a won dispute, because the dispute might still\nresolve as a loss if you haven’t submitted evidence.\n\nA withdrawn dispute is otherwise no different from any other dispute:\n\n- It doesn’t resolve as a win or loss more quickly than other disputes.\n- It doesn’t show up differently from any other dispute in the Dashboard or API.\n- It still counts against your [dispute\nrate](https://docs.stripe.com/disputes/measuring) with the card network.\n\nCardholders can only fully withdraw financial disputes—that is, a chargeback,\nwhere your account balance has been debited. They can’t withdraw an [early fraud\nwarning](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\nor an [inquiry](https://docs.stripe.com/disputes/how-disputes-work#inquiries),\nwhich don’t have any financial impact. The cardholder might decline to escalate\nthese, but can’t undo them.\n\n## Pursue a dispute withdrawal\n\nAlthough a dispute withdrawal is a good way to turn a dispute into a win and\nresolve a negative experience for your customer, it also requires some effort.\nYou need to weigh the amount of effort against how much it helps your dispute\nwin rate.\n\nFor disputes with a [high likelihood of\nwinning](https://docs.stripe.com/disputes/best-practices#likelihood-of-winning-disputes),\nyou can generally submit evidence to fight it, without reaching out to your\ncustomer. For low value disputes, you can go ahead and [accept the\ndispute](https://docs.stripe.com/disputes/responding#decide) if you don’t want\nto invest time and resources to fight it.\n\n## Talk to your customer\n\nContact your customer to try to work through the problem with them. If you can\nreach a resolution, ask them to contact their card issuer and withdraw the\ndispute. The process for this varies by issuer.\n\nIf your customer agrees to withdraw the dispute, you can ask them to provide\nconfirmation of the withdrawal, such as a confirmation email from their bank or\na screenshot of their mobile banking statement that shows they were re-billed\nfor the charge. This evidence isn’t required for your response to the issuer,\nbut provide it if you can.\n\n#### Warning\n\nIf resolving the issue with your customer involves agreeing to issue a refund,\nbe aware that it might take weeks or even months before you can do so. Your\ncustomer withdrawing the dispute doesn’t necessarily accelerate their issuer’s\ndispute timeline. You [can’t issue a\nrefund](https://docs.stripe.com/disputes/how-disputes-work#receive-dispute) on a\ndisputed charge until your customer’s card issuer decides in your favor.\n\n## Submit evidence\n\nRegardless of what happens between you and your customer, you still need to\n[submit evidence](https://docs.stripe.com/disputes/responding#respond) if you\nwant to win the dispute.\n\nAlways provide evidence for every dispute you hope to have resolved in your\nfavor, even if your customer told you they’re withdrawing the dispute. Many card\nissuers treat failure to submit evidence as an acceptance of liability on your\npart. This means you can still lose the dispute if you don’t submit evidence,\neven if the customer withdrew the dispute with their issuer.\n\nYou can submit evidence for a dispute just one time, so you want to wait long\nenough for your conversation with the customer to play out, but not so long that\nyou miss the deadline. The card network rules don’t allow you to submit evidence\nafter the deadline.\n\nIf you can’t convince the customer to withdraw the dispute before the evidence\ndeadline, that’s okay. You still need to file [appropriate\nevidence](https://docs.stripe.com/disputes/categories) to challenge the dispute\nreason.\n\n## Dispute resolution\n\nGenerally, a withdrawn dispute doesn’t resolve any faster than other types of\ndisputes. After your customer withdraws it and you submit evidence, expect the\ndispute to follow the [normal dispute\ntimeline](https://docs.stripe.com/disputes/how-disputes-work#timing).\n\n## Late dispute withdrawal\n\nEvery card network allows cardholders to withdraw a dispute after the response\ndeadline, even long after a dispute is lost. However, some card issuers within\nthe network might not support late withdrawal in every case. As with any\ndispute, the cardholder must contact their issuer to request a late withdrawal\nand determine if it’s allowed.\n\nLate withdrawals often occur outside the networks’ dispute systems. Unlike the\nregular dispute lifecycle, they aren’t governed by network rules or regulations.\nAs a result, when a customer withdraws an old, lost dispute, it’s difficult to\nset a realistic expectation for when you’ll see it reflected in your Stripe\naccount. The cardholder’s issuer might take weeks or months to process this type\nof adjustment.\n\n## Links\n\n- [reduce the number of disputes](https://docs.stripe.com/disputes/prevention)\n- [dispute rate](https://docs.stripe.com/disputes/measuring)\n- [early fraud\nwarning](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\n- [inquiry](https://docs.stripe.com/disputes/how-disputes-work#inquiries)\n- [high likelihood of\nwinning](https://docs.stripe.com/disputes/best-practices#likelihood-of-winning-disputes)\n- [accept the dispute](https://docs.stripe.com/disputes/responding#decide)\n- [can’t issue a\nrefund](https://docs.stripe.com/disputes/how-disputes-work#receive-dispute)\n- [submit evidence](https://docs.stripe.com/disputes/responding#respond)\n- [appropriate evidence](https://docs.stripe.com/disputes/categories)\n- [normal dispute\ntimeline](https://docs.stripe.com/disputes/how-disputes-work#timing)",
  "metadata": {
    "title": "Dispute withdrawals | Stripe Documentation",
    "description": "Learn what to do when a cardholder withdraws their dispute.",
    "sourceURL": "https://docs.stripe.com/disputes/withdrawing"
  }
}