{
  "content": "# Multiple currencies with Stripe and NetSuite\n\n## Learn how the Stripe Connector for NetSuite reconciles payments in multiple currencies.\n\nThe Stripe Connector for NetSuite supports payments in multiple currencies, and\ncan automatically reconcile payments that require [currency\nconversion](https://docs.stripe.com/currencies/conversions).\n\nYou have two options to use Stripe with multiple currencies:\n\n- Use a single Stripe account to accept payments in multiple currencies, and\nallow Stripe to convert the payments to the currency of your settlement bank.\n- Use multiple Stripe accounts attached to various subsidiaries of your\ncompanies. In this case, you connect a settlement account to these Stripe\naccounts, one for each currency you support. Stripe creates a bank deposit for\neach settlement currency in each Stripe account to avoid currency conversion\nfees.\n\n## Customers\n\nNetSuite requires that you add supported currencies to a NetSuite customer. If a\ncustomer attempts payment with a currency that isn’t specified for that\ncustomer, it results in a failed sync.\n\nTo prevent a failed sync, the connector can do the following:\n\n- Add all available currencies to the NetSuite customers *created by* the\nconnector.\n- Add all available currencies to the NetSuite customers *used by* the\nconnector.\n\n### Add currencies to customers created by the connector\n\nYou can set up the connector to add all available currencies in NetSuite to\ncustomers created by the connector. Set this up if you use [Stripe\nBilling](https://docs.stripe.com/billing) or\n[Invoicing](https://docs.stripe.com/invoicing), configured the connector to\ncreate customers, and your customers make payments in multiple currencies.\n\n### Add currencies to customers used by the connector\n\nYou can set up the connector to add all available currencies in NetSuite to\ncustomers that weren’t created by the connector but that the connector uses. Set\nthis up if you haven’t added a currency to a NetSuite customer, but you need to\nprocess a payment for that customer.\n\nFor example, your business creates a customer and adds only USD as a supported\ncurrency. That customer attempts to make a payment in EUR, which results in\nNetSuite returning an error indicating that EUR isn’t available for that\ncustomer. The connector detects this and automatically adds all available\ncurrencies to the NetSuite customer.\n\n## Charges and refunds\n\nThe connector chooses the currency for a NetSuite payment or refund to match the\ncurrency of the Stripe payment. If the currencies aren’t the same, the deposit\ndisplays the amount of the converted currency.\n\nFor example, your customer sees a payment amount of 2,460.22 EUR. This amount is\nthe NetSuite payment or refund. Your payout amount is 2,902.03 USD, less\nprocessing and currency conversion fees. This amount is the converted currency\namount specified in the bank deposit in NetSuite.\n\nIf the currency of the Stripe payment doesn’t exist in the NetSuite account, the\nconnector won’t sync the payment until you create the currency in NetSuite.\nStripe doesn’t create currencies in NetSuite; you must make sure the appropriate\ncurrencies exist in your NetSuite account.\n\n## Transaction exchange rate\n\nWhen creating a payment or refund, Stripe provides the exchange rate used on the\ntransaction and for settlement. Instead of using the exchange rate generated by\nNetSuite, the connector uses the exchange rate from Stripe. This helps to\neliminate the foreign exchange gain or loss that typically posts to your general\nledger when transactions reconcile to a bank deposit.\n\nRefunds and disputes create both a `Credit Memo` and `Customer Refund` in\nNetSuite. Both NetSuite records use the exchange rate from Stripe.\n\n### Invoices\n\nIf you use [invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation), the\nconnector creates invoices each billing period. Stripe doesn’t generate an\nexchange rate for these invoices, so the connector uses the exchange rate\ngenerated by NetSuite.\n\n### Exchange rate and subsidiary currencies\n\nThe exchange rate in NetSuite is relative to the currency of the subsidiary. For\nexample, you have a NetSuite transaction in USD and the subsidiary currency is\nEUR. The exchange rate for the transaction is USD to EUR.\n\nTo prevent issues when there’s a mismatch between the currencies for\ntransactions, settlements, and subsidiaries, you can set the subsidiary currency\nto the settlement currency of the integrated Stripe account.\n\nBecause NetSuite only supports an exchange rate that’s the subsidiary currency,\nit doesn’t use the Stripe exchange rate.\n\n## Payouts\n\nWhen Stripe payouts sync to NetSuite, the connector creates a deposit. The\nconnector chooses a bank account for the NetSuite deposit based on the currency\nof the payout.\n\nIf your NetSuite account has multiple bank accounts for a currency, you can set\nthe default account for the currency. To do so, navigate to **Settings** >\n**Account mapping** > **Bank deposit accounts** in the connector app.\n\nFor example, Stripe deposits 75 EUR as 100 USD. In Netsuite, you see the\nfollowing records:\n\n- NetSuite `Customer Payment` with a payment amount of 75 and EUR currency\n- NetSuite `Deposit` associated with a EUR bank account, a `Customer Payment`\namount of 100, and the EUR amount set to 75\n\nIf the currency differs from the bank account currency, you can enter the\ndeposit amount for the payment or refund. The connector automatically enters the\nconverted currency amount from Stripe.\n\n## Multiple settlement accounts\n\nBy default, Stripe converts all multi-currency charges to a base currency on\nyour account. If you want settlements in additional currencies, you can add bank\naccounts in various [supported\ncurrencies](https://docs.stripe.com/payouts#supported-accounts-and-settlement-currencies).\nThis allows you to manage foreign exchange risk and [currency\nconversion](https://docs.stripe.com/currencies/conversions) on your own.\n\n## Charges in previously unused currencies\n\nYou can charge customers in a previously unused currency by adding a bank\naccount with that currency and setting up the account to post automated bank\ndeposits. To do so, navigate to **Settings** > **Account mapping** > **Bank\ndeposit accounts** in the connector app.\n\n## Currency conversion fees\n\nStripe bundles currency conversion fees with processing fees, by default. If\nneeded, you can configure the connector to separate the currency conversion fees\nonto its own line item on the deposit. You can then post this line item to a\nunique account, so you can track currency conversion fees separately from\nprocessing fees.\n\nThis feature modifies the\n[fee_details](https://docs.stripe.com/api/balance_transactions/object#balance_transaction_object-fee_details)\nAPI response for your account’s `Balance Transaction`. Make sure this change\nwon’t affect any of your other integrations.\n\n## Links\n\n- [currency conversion](https://docs.stripe.com/currencies/conversions)\n- [Stripe Billing](https://docs.stripe.com/billing)\n- [Invoicing](https://docs.stripe.com/invoicing)\n- [invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation)\n- [supported\ncurrencies](https://docs.stripe.com/payouts#supported-accounts-and-settlement-currencies)\n-\n[fee_details](https://docs.stripe.com/api/balance_transactions/object#balance_transaction_object-fee_details)",
  "metadata": {
    "title": "Multiple currencies with Stripe and NetSuite | Stripe Documentation",
    "description": "Learn how the Stripe Connector for NetSuite reconciles payments in multiple currencies.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/multiple-currencies"
  }
}