{
  "content": "# India network tokenization\n\n## Learn how the Reserve Bank of India (RBI) card on file tokenization guidelines affect you and how to use Stripe Managed Customer Consent collection.\n\nThe Reserve Bank of India (RBI) issued a\n[directive](https://rbi.org.in/Scripts/NotificationUser.aspx?Id=11822&Mode=0) to\nthe issuing banks and card networks for the non-storage of card credentials by\nPayment Aggregators, Payment Gateways, and Merchants in the India payments\necosystem. The RBI mandates card on file (CoF) tokenization through the card\nnetworks. This means:\n\n- To store an India-issued customer card for future use for domestic India\nmerchants, Stripe must tokenize the card with the card network\n(Visa/Mastercard).\n- Customers must provide explicit consent to allow the tokenization and storage\nof the card on Stripe’s system.\n- For users who don’t want to build their own custom checkout flow for\ncollecting customer consent, Stripe provides a Stripe-managed customer consent\nflow by default.\n\nMerchants, Payment Aggregators (PAs), Payment Gateways (PGs), and acquiring\nbanks can no longer store customer card information. Network tokenization and\nissuer tokenization is the only applicable way forward for the industry and the\nRBI.\n\n## Regulatory requirements\n\nYou must adhere to these requirements to implement tokenization:\n\n- Scope a Token to a Merchant, Customer Card, and Token Requestor.\n- Take explicit user consent and Additional Factor of Authentication before\ngenerating a Token.\n- As the Merchant, you’re required to give the customer an option to de-register\ntheir Token from the Merchant platform.\n- During transactions, make available to a Merchant only the last 4 digits of\nthe customer card, Issuer Bank name, and card network (visible on the Stripe\nDashboard for payments).\n\n#### Note\n\nThis applies only to India domestic merchants for domestic transactions.\nInternational merchants on Stripe aren’t contracted with Stripe India or bound\nby these requirements. Cards won’t be automatically tokenized.\n\n## Tokenize customer cards\n\nTokenization minimally impacts the end customer. To convert their cards into a\ntoken, a customer must give you consent during payment for a transaction. This\napplies to new and saved card consent flows.\n\nYou can use Stripe Managed Customer Consent to collect customer consent on your\nbehalf. Stripe will automatically prompt the customer for consent before\nproceeding to 3D Secure authentication.\n\nIf you want to create a custom consent flow, you can opt out of Stripe Managed\nCustomer Consent. To do so, navigate to [Card Storage\nConsent](https://dashboard.stripe.com/settings/card_storage_consent) under\nCompliance in the Dashboard.\n\nIf you opt out, you must collect customer consent and only save card details for\nfuture use on the `Customer` object if the cardholder gives consent in your\ncheckout consent flow.\n\n!\n\nStripe Managed Consent Collection Experience\n\n!\n\nOpting out of Stripe Managed Consent Collection\n\nCustomers who have tokenized their cards will see only the last 4 digits of\ntheir saved cards.\n\n## Collect card information for customers that opt out of tokenization\n\nCustomers who choose not to tokenize their cards must enter their 16 digit card\nnumber, expiry, and CVC for all card transactions.\n\nIf you have a direct API integration and don’t currently collect CVC in your\ncheckout flow, you must add it to your integration to continue accepting\npayments. When you’re collecting payment method details, populate the [CVC\nfield](https://docs.stripe.com/api/payment_methods/create#create_payment_method-card-cvc).\n\n## More information\n\nFor more details on the updated requirements to have a compliant integration\nwith Stripe, see [Saving cards in\nIndia](https://support.stripe.com/questions/guide-for-saving-cards-in-india).\n\nContact us at [support.stripe.com](https://support.stripe.com/) if you have any\nquestions or need help with understanding how to comply with the regulations.\n\n## Links\n\n- [directive](https://rbi.org.in/Scripts/NotificationUser.aspx?Id=11822&Mode=0)\n- [Card Storage\nConsent](https://dashboard.stripe.com/settings/card_storage_consent)\n- [CVC\nfield](https://docs.stripe.com/api/payment_methods/create#create_payment_method-card-cvc)\n- [Saving cards in\nIndia](https://support.stripe.com/questions/guide-for-saving-cards-in-india)\n- [support.stripe.com](https://support.stripe.com/)",
  "metadata": {
    "title": "India network tokenization | Stripe Documentation",
    "description": "Learn how the Reserve Bank of India (RBI) card on file tokenization guidelines affect you and how to use Stripe Managed Customer Consent collection.",
    "sourceURL": "https://docs.stripe.com/india-network-tokenization"
  }
}