{
  "content": "# Collect tax in Canada\n\n## Learn how to use Stripe Tax to calculate, collect, and report tax in Canada.\n\nThe Canadian tax system consists of a combination of federal and provincial\ntaxes. The goods and services tax (GST) applies nationally. The different\nprovinces handle taxes in a variety of ways. Learn more in our [guide to tax in\nCanada](https://stripe.com/guides/tax-registration-process-canada).\n\nProvincial sales taxes in New Brunswick, Newfoundland and Labrador, Nova Scotia,\nOntario, and Prince Edward Island are combined with the GST to implement the\nharmonized sales tax (HST), which operates in the same way as the GST.\n\nSeparate taxes are collected in:\n\n- British Columbia—provincial sales tax (PST)\n- Manitoba—retail sales tax (RST)\n- Quebec—Quebec sales tax (QST)\n- Saskatchewan—provincial sales tax (PST)\n\nAlberta, Northwest Territories, Nunavut, and Yukon don’t apply any provincial\nsales tax.\n\n## When to register for tax collection\n\nThe Canadian federal government and the four provinces that levy a separate\nprovincial sales tax define their own tax registration thresholds and\nprocedures.\n\n- If your business is based outside of Canada, Stripe monitors whether you must\ncollect tax at the federal level and for every province with its own tax. You\ncan register to collect federal tax using either a simplified or a normal\nGST/HST registration.\n- If your business is based in Canada, Stripe monitors whether you must collect\nprovincial taxes, but not for the province where your business is established.\nTo collect federal tax, you must register with the Canadian government using a\nnormal GST/HST registration.\n\nSee [Thresholds](https://dashboard.stripe.com/tax/thresholds) to get insights\nabout your potential tax registration obligations in Canada. Stripe also\nnotifies you with email and Dashboard alerts when you need to register to\ncollect tax. Learn more about how the [monitoring tool\nworks](https://docs.stripe.com/tax/monitoring).\n\nAfter you’ve registered to collect tax in a province or with the government, go\nto [Registrations](https://dashboard.stripe.com/tax/registrations?location=ca)\nto add your registrations to Stripe in the Dashboard and start collecting tax on\nyour transactions in that location.\n\n### Federal tax threshold\n\nCanada applies different regulations to businesses outside of Canada that sell\nto Canadian customers. The regulations depend on the product type, the location\nthe product is shipped from, and the type of business activity.\n\n- Foreign businesses that carry on business in Canada must apply for the normal\nGST/HST registration if their total taxable revenues are over 30,000 CAD in a\nsingle calendar quarter or over the last four consecutive calendar quarters.\nFind more information on what “carry on business in Canada” means on the [Canada\nRevenue Agency\nwebsite](https://www.canada.ca/en/revenue-agency/services/forms-publications/publications/p-051r2/p-051r2-carrying-on-business-canada.html).\n- Foreign remote businesses that sell digital products or services to Canadian\nindividuals qualify for simplified GST/HST registration when sales exceed 30,000\nCAD over any 12-month period.\n- Business based outside of Canada that sell goods shipped from a warehouse in\nCanada to Canadian individuals require normal GST/HST registration when sales\nexceed 30,000 CAD over any 12-month period.\n\nStripe only monitors the threshold applicable to sellers based outside of Canada\nwho do not carry on business in Canada. If you [carry on business in\nCanada](https://www.canada.ca/en/revenue-agency/services/forms-publications/publications/p-051r2/p-051r2-carrying-on-business-canada.html),\nthe threshold doesn’t reflect your tax obligations.\n\n**Threshold**: 30,000 CAD\n\n**Time frame**: 12 months\n\n**Included transactions**: Sales of digital products and services to Canadian\nindividuals, and sales of goods shipped from a warehouse in Canada to Canadian\nindividuals.\n\nFind more information on how to register for GST/HST on the Canada Revenue\nAgency websites:\n\n- [Normal GST/HST\nregsitration](https://www.canada.ca/en/revenue-agency/services/tax/businesses/topics/registering-your-business/register.html#NR-BN_AccRegistrtn_Webform)\n- [Simplified GST/HST\nregsitration](https://www.canada.ca/en/revenue-agency/services/tax/businesses/topics/gst-hst-businesses/digital-economy-gsthst/register-gst-hst.html)\n\nIf a remote business sells digital services or goods into Canada exclusively\nthrough online marketplaces that are responsible for collecting tax on these\nsales, the seller isn’t required to register for GST/HST. These sales don’t\ncount toward the seller’s registration threshold.\n\n### British Columbia\n\nBusinesses based outside British Columbia (BC) must register to collect PST if\ntheir taxable sales in BC exceed 10,000 CAD in the past 12 months or are\nexpected to exceed that amount in the next 12 months.\n\n**Threshold**: 10,000 CAD\n\n**Time frame**: 12 months\n\n**Included transactions**: Any taxable transaction.\n\nFind more information on how to register for PST on the [British Columbia\ngovernment website](https://www2.gov.bc.ca/gov/content/taxes/sales-taxes/pst).\n\nIf a remote business sells digital services or goods exclusively through online\nmarketplaces that are responsible for collecting tax on these sales, the seller\nisn’t required to register for PST. These sales don’t count toward the seller’s\nregistration threshold.\n\n### Manitoba\n\nBusinesses located outside Manitoba that perform taxable sales of goods and\nservices in Manitoba must register to collect RST. Manitoba doesn’t apply any\nmonetary registration thresholds to remote sellers.\n\n**Threshold**: 1 transaction\n\n**Time frame**: 12 months\n\n**Included transactions**: Any taxable transaction.\n\nFind more information on how to register for RST on the [Manitoba government\nwebsite](https://www.gov.mb.ca/finance/taxation/forms.html#retail).\n\nIf a remote business sells digital services or goods exclusively through online\nmarketplaces that are responsible for collecting tax on these sales, the seller\nisn’t required to register for RST. These sales don’t count towards the seller’s\nregistration threshold.\n\n### Quebec\n\nRemote businesses selling digital products or services to individuals in Quebec\nmust register under the specified QST regime if their sales exceed 30,000 CAD in\nany 12-month period. Remote businesses selling goods to individuals in Quebec\nmust register under the general QST regime if their sales exceed 30,000 CAD in\nany 12-month period—this applies to goods shipped from a warehouse in Quebec or\nfrom outside Quebec by means other than mail or courier. The specified QST\nregime doesn’t apply in this situation.\n\n**Threshold**: 30,000 CAD\n\n**Time frame**: 12 months\n\n**Included transactions**: Sales of digital products and services and certain\nsales of goods to individuals in Quebec.\n\nFind more information on how to register for QST on the [Quebec government\nwebsite](https://www.revenuquebec.ca/en/businesses/consumption-taxes/gsthst-and-qst/).\n\nIf a remote business sells digital services or goods exclusively through online\nmarketplaces that are responsible for collecting tax on these sales, the seller\nisn’t required to register for QST. These sales don’t count toward the seller’s\nregistration threshold.\n\n### Saskatchewan\n\nBusinesses located outside Saskatchewan that sell taxable goods and services in\nSaskatchewan must register to collect PST. Saskatchewan doesn’t apply any\nmonetary registration thresholds to remote sellers.\n\n**Threshold**: 1 transaction\n\n**Time frame**: 12 months\n\n**Included transactions**: Any taxable transaction.\n\nFind more information on how to register for PST on the [Saskatchewan government\nwebsite](https://www.saskatchewan.ca/business/taxes-licensing-and-reporting/provincial-taxes-policies-and-bulletins/provincial-sales-tax).\n\nIf a remote business sells digital services or goods exclusively through online\nmarketplaces that are responsible for collecting tax on these sales, the seller\nisn’t required to register for PST. These sales don’t count toward the seller’s\nregistration threshold.\n\n## How we calculate taxes\n\nStripe determines whether federal tax (GST or HST), provincial tax (PST, QST, or\nRST) or a combination of both types of taxes apply to the specific transaction.\n\nSales of goods and services within Canada are generally taxed based on the\ncustomer’s location. Goods shipped from Canada to customers abroad are\nzero-rated exports for Canadian tax purposes. While these transactions might\nincur taxes and customs duties in the destination country, Stripe doesn’t\ncalculate them.\n\nStripe calculates GST/HST on sales of goods from abroad to Canadian customers if\nthe seller is registered under the normal GST/HST regime. If the seller is\nregistered under the simplified GST/HST regime, we don’t calculate GST/HST on\nsales of goods from abroad to Canadian customers.\n\nSales of services provided from Canada to customers in other countries are\ngenerally not taxable in Canada, but the tax of the customer’s country might\napply. Sales of services provided to Canadian customers by sellers established\nin other countries are generally taxable in Canada, with the following\nexceptions:\n\n- Remote sellers registered under the simplified GST/HST regime must collect\nGST/HST for sales to individuals, but not for sales to business customers who\nprovide their GST/HST registration number.\n- Remote sellers must collect QST on sales to individuals in Quebec, but not on\nsales to business customers who provide their QST registration number.\n- Remote sellers must collect provincial sales taxes for sales in Manitoba,\nSaskatchewan, and British Columbia regardless of individual or business\ncustomers. To treat sales to customers in these provinces as exempt from\nprovincial sales taxes, set the [customer tax\nstatus](https://docs.stripe.com/tax/zero-tax) to `exempt`.\n\n## Report and file your taxes\n\nStripe Tax has filing partners—Taxually, Marosa, and Hands-off Sales Tax—to help\nautomate your tax filing. These partners automatically sync your tax transaction\ndata in real time, eliminating the need for manual data entry or file transfers.\nLearn more about [tax filing](https://docs.stripe.com/tax/filing).\n\nStripe also provides reports of your completed tax transactions. Go to\n[Registrations](https://dashboard.stripe.com/tax/registrations) to access these\nreports. Learn more about [the different types of\nreports](https://docs.stripe.com/tax/reports).\n\n## Marketplace tax liability\n\nCanada defines “digital platform operators” as marketplace operators that might\nhave tax collection obligations because they control a transaction between a\nseller and a buyer (for example, by handling payments and passing them to the\nseller). This definition excludes businesses solely listing goods or processing\npayments. Digital platform operators must collect GST/HST on:\n\n- Sales of digital products and services to Canadian individuals by remote\nsellers not registered under the normal GST/HST regime.\n- Sales of goods by non-registered sellers to Canadian customers if the goods\nare in Canada at the time of sale.\n- Provision of short-term accommodation if the property owner isn’t GST/HST\nregistered. This typically includes renting residential units for less than one\nmonth. Stripe Tax doesn’t support accommodation services.\n\nCanadian provinces with separate provincial taxes have similar rules on platform\ntax collection obligations.\n\n## Links\n\n- [guide to tax in\nCanada](https://stripe.com/guides/tax-registration-process-canada)\n- [Thresholds](https://dashboard.stripe.com/tax/thresholds)\n- [monitoring tool works](https://docs.stripe.com/tax/monitoring)\n- [Registrations](https://dashboard.stripe.com/tax/registrations?location=ca)\n- [Canada Revenue Agency\nwebsite](https://www.canada.ca/en/revenue-agency/services/forms-publications/publications/p-051r2/p-051r2-carrying-on-business-canada.html)\n- [Normal GST/HST\nregsitration](https://www.canada.ca/en/revenue-agency/services/tax/businesses/topics/registering-your-business/register.html#NR-BN_AccRegistrtn_Webform)\n- [Simplified GST/HST\nregsitration](https://www.canada.ca/en/revenue-agency/services/tax/businesses/topics/gst-hst-businesses/digital-economy-gsthst/register-gst-hst.html)\n- [British Columbia government\nwebsite](https://www2.gov.bc.ca/gov/content/taxes/sales-taxes/pst)\n- [Manitoba government\nwebsite](https://www.gov.mb.ca/finance/taxation/forms.html#retail)\n- [Quebec government\nwebsite](https://www.revenuquebec.ca/en/businesses/consumption-taxes/gsthst-and-qst/)\n- [Saskatchewan government\nwebsite](https://www.saskatchewan.ca/business/taxes-licensing-and-reporting/provincial-taxes-policies-and-bulletins/provincial-sales-tax)\n- [customer tax status](https://docs.stripe.com/tax/zero-tax)\n- [tax filing](https://docs.stripe.com/tax/filing)\n- [Registrations](https://dashboard.stripe.com/tax/registrations)\n- [the different types of reports](https://docs.stripe.com/tax/reports)",
  "metadata": {
    "title": "Collect tax in Canada | Stripe Documentation",
    "description": "Learn how to use Stripe Tax to calculate, collect, and report tax in Canada.",
    "sourceURL": "https://docs.stripe.com/tax/supported-countries/canada"
  }
}