{
  "content": "# Platform tax reporting for Connect platformsPrivate preview\n\n## Prepare reports for DAC7 and other OECD regulations for sellers in the EU, Canada, United Kingdom, Australia, and New Zealand.\n\nUnder the\n[MRDP](https://www.oecd.org/en/topics/sub-issues/international-tax-compliance-policies-and-best-practices/model-reporting-rules-for-digital-platforms.html),\ncertain Connect platforms are required to report income information regarding\ntheir connected accounts to tax authorities. These requirements are for economic\nactivities facilitated by digital platforms. Several countries have now rolled\nout binding regulations based on MRDP–including DAC-7, SERR, ITA Part XX.\n\nBroadly, these regulations require that platforms collect and submit information\nto both regulators and each of their users (except in Australia, where end users\ndon’t need to receive a copy). Stripe offers tools to help platforms through\nthis process.\n\nPlatform tax reporting provides the following:\n\n- A way to collect verified tax information from Connected Accounts. Your\nconnected accounts can submit their tax information on the same interface that\nthey onboard to Stripe with. They won’t be asked to provide any information\nthey’ve already provided, but they can make necessary updates.\n- A dashboard to import and edit information and generate reports for the\nappropriate authorities and generate seller statements for your users.\n\n#### Limitation of liability\n\nPlatform tax reporting services isn’t a comprehensive tax solution or tax\nadvising service. Stripe accepts no liability for the use of information\ncollected or reports generated and strongly recommends consulting with a\nprofessional tax advisor for any tax-related concerns. Users remain fully\nresponsible for the accuracy of the information and obligation to pay any fine,\npenalty, or other sanction imposed by a governmental authority.\n\n## Product features\n\n- Support for CA, UK, certain EU countries (FR, DE, IT, SE, ES, NL), NZ, and AU\n- Collect, validate, and verify (where applicable) information from sellers\nthrough Connect interfaces- Connect interfaces include the Stripe Dashboard,\nExpress Dashboard, and hosted onboarding\n- A Dashboard to view and manage tax information\n- Form editing with CSVs\n- Report generation to AU, CA, NL (for EU), and UK XML schemas\n- Role-based access control and two-step authentication (2FA)\n- E-delivery of tax information statements using the API\n\n## Collect identity information\n\nApply the `tax_reporting` additional verification to your connected accounts to\ncollect, validate, and verify the necessary information from your sellers. You\ncan use the same integration type for every region where your platform has tax\nreporting obligations (outside of the US), and your platform doesn’t need to\nchange their existing Connect integration.\n\n- Platforms can enable or disable for whatever subset of connected accounts they\nchoose.\n- Stripe handles the tax information collection, which varies by country. Stripe\nautomatically determines which requirements to apply based on the account’s\ncountry and business type.\n- Any added countries follow the same integration type.\n\nAs with other requirements, those added by the `tax_reporting` additional\nverification are presented to connected accounts in any Connect onboarding\ninterface. The verification requirements disable an account’s capabilities if\nnot completed before reaching the threshold you set. You can set the following\nenforcement limits to impose the disabling of payouts or payments:\n\n- **Up front**: Block payouts or payments if a verified TIN isn’t on file\nimmediately.\n- **Volume**: Block payouts or payments if a verified TIN isn’t on file after\nprocessing *x* USD.\n- **Time**: Block payouts or payments if a verified TIN isn’t on file after *x*\ndays.\n- **Combination**: Block payouts or payments if a verified TIN isn’t on file\nafter *x* days or after processing *x* USD.\n\nYou can also disable these additional requirements at your own discretion.\n\n## Preparing and generating your reports\n\nStripe auto-populates the Dashboard view and CSVs with identity data that’s\nalready been collected from connected accounts.\n\nReview your connected accounts’ information in the Dashboard. Import transaction\ntotals, identity overrides, and standalone sellers (sellers not attached to a\nConnected Account) by uploading CSV files.\n\n![Seller list\nview](https://b.stripecdn.com/docs-statics-srv/assets/global-tax-reporting-seller-view.9874379a85397e9a41f0910dd0235b8e.png)\n\nSeller list view in the Dashboard\n\n![Seller\ndetails](https://b.stripecdn.com/docs-statics-srv/assets/global-tax-reporting-seller-details-full.47bd6156fb3dcfc8f5f7de5412ddd5c6.png)\n\nSeller information details\n\nWhen you’re ready, generate XML reports for your sellers.\n\n## Deliver tax statements to your users\n\nYou might be required to provide a copy of the information submitted to tax\nauthorities to your sellers. Stripe generates a PDF translated into the user’s\npreferred language to display this information. You can download it separately\nfor each individual seller in the Dashboard, or you can access it with the API.\nWe support this for sellers, regardless of whether they have a connected\naccount.\n\n## Request early access\n\n## Interested in getting access to Platform Tax Reporting private preview?\n\nPlatform tax reporting is currently limited to Connect platforms. To join the\nwaitlist for the private preview, enter your email address below. If you have an\naccount representative, reach out to them. Access to this feature isn't\nguaranteed.\n\nCollect EmailSign upRead our [privacy policy](https://stripe.com/privacy).\n\n## Links\n\n-\n[MRDP](https://www.oecd.org/en/topics/sub-issues/international-tax-compliance-policies-and-best-practices/model-reporting-rules-for-digital-platforms.html)\n- [privacy policy](https://stripe.com/privacy)",
  "metadata": {
    "title": "Platform tax reporting for Connect platforms | Stripe Documentation",
    "description": "Prepare reports for DAC7 and other OECD regulations for sellers in the EU, Canada, United Kingdom, Australia, and New Zealand.",
    "sourceURL": "https://docs.stripe.com/connect/platform-tax-reporting"
  }
}