{
  "content": "# Link in the Payment Element\n\n## Link in the Payment Element lets your customers check out faster.\n\nLet your customer check out faster by using\n[Link](https://docs.stripe.com/payments/link) in the [Payment\nElement](https://docs.stripe.com/payments/payment-element). You can autofill\ninformation for any logged-in customer already using Link, regardless of whether\nthey initially saved their information in Link with another business. The\ndefault Payment Element integration includes a Link prompt in the card form. To\nmanage Link in the Payment Element, go to your [payment method\nsettings](https://dashboard.stripe.com/settings/payment_methods).\n\n![Authenticate or enroll with Link directly in the Payment Element during\ncheckout](https://b.stripecdn.com/docs-statics-srv/assets/link-in-pe.2efb5138a4708b781b8a913ebddd9aba.png)\n\nCollect a customer email address for Link authentication or enrollment\n\n## Integration options\n\nThere are two ways you can integrate Link with the Payment Element. Of these,\nStripe recommends passing a customer email address to the Payment Element if\navailable. Remember to consider how your checkout flow works when deciding\nbetween these options:\n\nIntegration optionCheckout flowDescription[Pass a customer email\naddress](https://docs.stripe.com/payments/link/add-link-elements-integration?link-integration-type=before-payment)\nto the Payment Element Recommended- Your customer enters their email address\nbefore landing on the checkout page (in a previous account creation step, for\nexample).\n- You prefer to use your own email input field.\nProgrammatically pass a customer email address to the Payment Element. In this\nscenario, a customer authenticates to Link directly in the payment form instead\nof a separate UI component.[Collect a customer email\naddress](https://docs.stripe.com/payments/link/add-link-elements-integration?link-integration-type=collect-email)\nin the Payment ElementYour customers enter their email and authenticate or\nenroll with Link directly in the Payment Element during checkout.If a customer\nhasn’t enrolled with Link and they choose a supported payment method in the\nPayment Element, they’re prompted to save their details using Link. For those\nwho have already enrolled, Link automatically populates their payment\ninformation.\n## The defaultValues parameter\n\nIf you’re planning on passing customer email addresses to the Payment Element,\nuse the\n[defaultValues](https://docs.stripe.com/js/elements_object/create_payment_element#payment_element_create-options-defaultValues)\nobject to specify a customer’s\n[billingDetails](https://docs.stripe.com/js/elements_object/create_payment_element#payment_element_create-options-defaultValues-billingDetails).\nPrefilling as much information as possible streamlines the checkout process:\n\n```\n// Pass in defaultValues to prefill consumer information\nconst paymentElement = elements.create('payment', {\n defaultValues: {\n billingDetails: {\n name: 'John Doe',\n email: 'john.doe@example.com',\n address: {\n city: 'New York',\n country: 'US',\n line1: '123 Main St',\n postal_code: '10001',\n state: 'NY'\n }\n },\n}});\n```\n\n## Automatically prefill Link for your customers\n\nSave your customers from re-entering details to sign up for or log into Link\nwhen they’ve already provided them elsewhere on your checkout page. Link\nincludes a prefill tool that detects customer information such as email or phone\nnumber in your checkout, then automatically populates corresponding Link fields.\nThis convenience encourages your customers to use Link, which has been shown to\nincrease the likelihood that a customer successfully completes checkout.\nPrefilled values are never stored unless the customer completes a Link sign-up.\n\nWhen a customer enters information such as their email, phone number, or name on\nthe same checkout page as the Element where Link is enabled, Link’s prefill tool\ncan:\n\n- Populate the Link sign-up form with the customer email/phone/name. The\ncustomer must proceed with Link sign-up to create an account.\n- Populate the Link login with the customer’s email when they already have a\nLink account, so they can just enter the one time password.\n\n### Enable accelerated sign-up\n\nIf you opt your customers into saving their payment details to Link by default,\nit can increase the rate of Link signups. Customers with payment information\nsaved to Link can checkout without having to re-enter their payment details when\nthey pay at your business.\n\nThis configuration automatically expands the Link sign-up fields, and can\npre-fill information such as email address and phone number to help customers\nsign up.\n\nThis feature is enabled by default, and you can configure it from your settings\npage at **Settings** > **Payment Methods** > **Link**, or in the Connected\nAccounts settings. The availability of this feature is dependent on the\ncustomer’s country. Data privacy laws vary by jurisdiction; Link disables or\nlimits this feature when local regulations prohibit it. Customers can opt out at\nany time.\n\n### Enable the prefill tool\n\nThe Link prefill tool requires no changes to your existing integration. The\nprefill tool is on by default when you enable Link. You can disable the prefill\ntool in the [Link settings](https://dashboard.stripe.com/settings/link#features)\nin your Dashboard at any time.\n\n#### How it works\n\nWhen a customer loads a page containing the Element with Link enabled and the\n`defaultValue` parameter hasn’t already provided Stripe customer data, our\nsystem analyzes the surrounding checkout page to locate input fields containing\ndetails that match Link sign-up or login fields. Link only looks for information\napplicable to creating or reusing a Link account.\n\nIf Stripe detects such data fields, we use the values to prefill the Link login\nwith email, or prefill sign-up fields with customer information required to\ncreate a Link account. We don’t store the prefilled values on the browser using\ncookies or local storage or any other service. We only hold the values\ntemporarily in local memory for use in the context of the session.\n\nFor current Link users, we use the prefilled information to trigger a login to\nLink, and don’t store any information from the page.\n\nCustomers who haven’t previously created a Link account can choose whether to\nuse the prefilled information to sign up for Link. We only store the prefilled\ninformation if the customer takes action and provides consent to create a Link\naccount.\n\n## Test the integration\n\n#### Caution\n\nDon’t store real user data in [sandbox](https://docs.stripe.com/sandboxes) Link\naccounts. Treat them as if they’re publicly available, because these test\naccounts are associated with your publishable key.\n\nCurrently, Link only works with credit cards, debit cards, and qualified US bank\naccount purchases. Link requires [domain\nregistration](https://docs.stripe.com/payments/payment-methods/pmd-registration).\n\nYou can create sandbox accounts for Link using any valid email address. The\nfollowing table shows the fixed one-time passcode values that Stripe accepts for\nauthenticating sandbox accounts:\n\nValueOutcomeAny other 6 digits not listed belowSuccess000001Error, code\ninvalid000002Error, code expired000003Error, max attempts exceeded\n### Multiple funding sources\n\nAs Stripe adds additional funding source support, you don’t need to update your\nintegration. Stripe automatically supports them with the same transaction\nsettlement time and guarantees as card and bank account payments.\n\n## See also\n\n- [Stripe Web Elements](https://docs.stripe.com/payments/elements)\n- [Payment Element](https://docs.stripe.com/payments/payment-element)\n- [Address Element](https://docs.stripe.com/elements/address-element)\n\n## Links\n\n- [Link](https://docs.stripe.com/payments/link)\n- [Payment Element](https://docs.stripe.com/payments/payment-element)\n- [payment method\nsettings](https://dashboard.stripe.com/settings/payment_methods)\n- [Pass a customer email\naddress](https://docs.stripe.com/payments/link/add-link-elements-integration?link-integration-type=before-payment)\n- [Collect a customer email\naddress](https://docs.stripe.com/payments/link/add-link-elements-integration?link-integration-type=collect-email)\n-\n[defaultValues](https://docs.stripe.com/js/elements_object/create_payment_element#payment_element_create-options-defaultValues)\n-\n[billingDetails](https://docs.stripe.com/js/elements_object/create_payment_element#payment_element_create-options-defaultValues-billingDetails)\n- [Link settings](https://dashboard.stripe.com/settings/link#features)\n- [sandbox](https://docs.stripe.com/sandboxes)\n- [domain\nregistration](https://docs.stripe.com/payments/payment-methods/pmd-registration)\n- [Stripe Web Elements](https://docs.stripe.com/payments/elements)\n- [Address Element](https://docs.stripe.com/elements/address-element)",
  "metadata": {
    "title": "Link in the Payment Element | Stripe Documentation",
    "description": "Link in the Payment Element lets your customers check out faster.",
    "sourceURL": "https://docs.stripe.com/payments/link/payment-element-link"
  }
}