{
  "content": "# Customer-Initiated Transactions (CIT) and Merchant-Initiated Transactions (MIT)\n\n## Learn about card network rules based on who initiates a transaction.\n\nThe card networks divide card payments into two types, depending on whether the\ncustomer is participating in the payment flow: Customer-Initiated Transactions\n(CIT) and Merchant-Initiated Transactions (MIT).\n\n#### Note\n\nCard networks assign different characteristics and requirements to transactions,\ndepending on whether they’re customer-initiated or merchant-initiated. For\nexample, a Visa transaction’s authorization validity period varies depending on\nits type. If you’re using the API, the\n[payment_method_details.card.capture_before](https://docs.stripe.com/api/charges/object#charge_object-payment_method_details-card-capture_before)\nattribute on the charge is the most reliable and accurate way to determine your\ncharge’s authorization window.\n\n## Merchant-Initiated Transactions (MIT)\n\nAn MIT is a transaction that you initiate without direct participation of your\ncustomer, based on a prior agreement with that customer authorizing you to store\nand use their credentials. For example, you operate a subscription-based\nbusiness and your customer has consented to you collecting their future monthly\npayments using their credit card that you have on file.\n\n### Compliance\n\nWhen you save a customer’s payment information, regardless of the reason, you’re\nresponsible for compliance with all applicable laws, regulations, and network\nrules. Include terms on your website or app that state how you save payment\nmethod details, and require customers to opt in before you save their payment\ninformation.\n\nWhen you save a payment method, you can only use it for the specific purposes\nincluded in your terms. For example, if you want to automatically charge a saved\npayment method for future subscription renewals, you must first get explicit\nconsent for that from the customer. You can collect that consent by including a\n“Save my payment method for automatic renewals” checkbox on the initial payment\npage.\n\nTo charge customers when they’re offline, include the following in your terms:\n\n- The customer’s agreement to your initiating a payment or a series of payments\non their behalf for specified transactions\n- The anticipated timing and frequency of payments; for example, whether the\ncharges are for scheduled installments, subscription payments, or unscheduled\ntop-ups\n- How you determine the payment amount\n- Your cancellation policy for any subscription services\n\nKeep a record of each customer’s agreement to your terms.\n\n## Customer-Initiated Transactions (CIT)\n\nCITs normally include all other transaction types, including any transaction\nwhere the cardholder is available to participate in the payment flow. For\nexample, a customer manually places an order on your website.\n\n## Links\n\n-\n[payment_method_details.card.capture_before](https://docs.stripe.com/api/charges/object#charge_object-payment_method_details-card-capture_before)",
  "metadata": {
    "title": "Customer-Initiated Transactions (CIT) and Merchant-Initiated Transactions (MIT) | Stripe Documentation",
    "description": "Learn about card network rules based on who initiates a transaction.",
    "sourceURL": "https://docs.stripe.com/payments/cits-and-mits"
  }
}