{
  "content": "# Marketing your Capital programPrivate preview\n\n## Build marketing assets for Capital.\n\nThis guide shows how to build marketing assets for Capital that educate your\nusers and promote the Capital program. Learn how to co-brand your product with\nStripe and develop content that adheres to [bank and regulatory\nrequirements](https://docs.stripe.com/capital/regulatory-compliance) applicable\nto Capital.\n\nLending is a highly regulated space, and all customer-facing material\nreferencing Stripe Capital must be approved by Stripe and its bank partners\nbefore publication. Submit material for review and approval using the [Change\nRequest\nForm](https://form.asana.com/?k=8K51UWmWhttehNFD5qBLdg&d=974470123217835).\n\n## Marketing requirements\n\nDepending on your Capital integration type, additional platform marketing might\nbe optional.\n\n- **No-Code integration**: For No-Code integrations, Stripe sends offer emails\non your behalf. While this isn’t required, we recommend that you [send an\nannouncement\nemail](https://docs.stripe.com/capital/marketing#announcement-email) and develop\na marketing landing page using our [messaging\nguidelines](https://docs.stripe.com/capital/marketing#messaging).\n- **API integration**: For API integrations where you’re responsible for\nnotifying users about their Capital offers, you must review the section on\n[sending offer\nnotifications](https://docs.stripe.com/capital/marketing#financing-notifications)\nto build an email campaign or in-Dashboard notifications with the [Capital\nAPI](https://docs.stripe.com/capital/api-integration#retrieve-financing-offers).\n\n#### Warning\n\nYou must submit any customer-facing materials related to Capital to Stripe for\nreview prior to being published using the [Change Request\nForm](https://form.asana.com/?k=8K51UWmWhttehNFD5qBLdg&d=974470123217835).\n\n## Marketing approval process\n\nTo make sure Stripe meets its marketing oversight requirements for platforms\noffering Stripe Capital, you must maintain records of all marketing materials\nyou use to promote your Capital program. All marketing material must be\nreviewed, approved, and retained by Stripe and its banking partner to ensure\ncompliance with regulatory requirements.\n\nItems that must be submitted to Stripe for approval include:\n\n- Email marketing including proposed targeting populations\n- Website or UX material referencing the Stripe Capital product\n- Blog posts or social media referencing the Stripe Capital product\n- In-app or push notifications\n- Customer testimonials\n\nYou must submit any marketing materials that you create to Stripe’s compliance\nteam for review prior to being published using the [Change Request\nForm](https://form.asana.com/?k=8K51UWmWhttehNFD5qBLdg&d=974470123217835). Our\nteam of compliance specialists reviews these assets and will respond via email\nwith edits or an approval in a timely manner. The standard turnaround time is\n5-7 business days.\n\nTo receive approval, the material must align with the requirements and\nguidelines detailed in this guide. You may not use any marketing assets that\ndon’t pass Stripe review.\n\nWhen submitting your materials, you must do the following:\n\n- Read and adhere to the guidelines on this page. Marketing assets aren’t usable\nuntil they have been approved by Stripe.\n- Provide your platform name.\n- Provide full screen shots or products that include headings and footers in a\nlegible or high resolution format.\n- The preferable format for materials is PDF, however any format where all text\nis legible is acceptable.\n- Describe the type of marketing material you’re submitting (for example,\nlanding pages, web banners, emails, search engine marketing, and whether the\nasset is text only or includes images and text). If submitting web pages,\ninclude the associated URLs.\n- Describe where all CTA links direct to (for example, a landing page URL or\nlog-in screens).\n\n## Sending offer notifications\n\nAs part of your Capital marketing program, you can set up offer notifications so\nyour connected accounts know when they’re eligible for financing. You must\nnotify all eligible connected accounts about available offers.\n\nYou can use either a No-Code or API integration to notify eligible connected\naccounts about their offer. With the No-Code option, Stripe sends co-branded\noffer emails on your behalf. If you’re using the API integration, you must build\nand deploy your own email campaign, or build out other methods of notifying your\ncustomers when they’re eligible for an offer (for example, in-product\nnotifications or direct mail).\n\nTo get started select your integration type below.\n\nNo-CodeAPI\n### No-Code email overview\n\nEmails are a primary channel for notifying customers about their financing\noffers. Stripe Capital handles this with our No-Code email service. Check the\n[Launch\nChecklist](https://docs.stripe.com/capital/no-code-integration#send-offers) for\nmore information on how to enable offer emails through Stripe.\n\nAll emails are co-branded with your logo and brand colors. To see the end-to-end\nuser experience, including the offer email, check out the [Capital demo\nexperience](https://dashboard.stripe.com/capital/demo). You can customize the\ncolors and logo in the email by adjusting your [Connect\nsettings](https://dashboard.stripe.com/settings/connect/onboarding-interface).\n\n#### Note\n\nAdjusting Connect settings changes your branding for all of Connect, not just\nCapital.\n\nStripe sends a series of emails to notify customers of their offer and keep them\ninformed about their repayment progress.\n\nThe following is a list of the emails Stripe sends:\n\n- First offer email: This email notifies the customers about their first offer.\nWe send it as soon as a customer becomes eligible.\n- Weekly update emails: If a customer has an active financing, we send them a\nweekly email updating them on the current amount repaid, and linking to a\nStripe-hosted active loan page.\n- Repeat offer email: After a customer has paid down their loan, we send them an\nadditional offer email as soon as they’re eligible.\n- Offer email: If a customer doesn’t accept an offer, they’ll receive an\nadditional offer email every 30 days if they’re eligible.\n- Additional transactional emails: In addition, Stripe will send other relevant\ntransactional emails to users, such as those relevant for application questions\nor loan repayment.\n\nLearn more about our [No-Code email\nservice](https://docs.stripe.com/capital/no-code-integration) or contact your\nStripe account team member.\n\n## Messaging\n\nRefer to the following copy guidelines when you write marketing copy for Stripe\nCapital on any marketing assets. You can modify the wording to suit your\nplatform’s voice, as long as it conveys the same message and uses the correct\nterminology as detailed below. Refer to\n[stripe.com/capital](https://stripe.com/capital) to see how we employ these\nmessages for our direct Capital offering.\n\n#### Warning\n\nYou must submit any customer-facing materials related to Capital to Stripe for\nreview prior to being published using the [Change Request\nForm](https://form.asana.com/?k=8K51UWmWhttehNFD5qBLdg&d=974470123217835).\n\n### Name your Capital program\n\nKeep the name of your Capital program simple. If you already have a payments\nprogram such as “Rocket Rides Payments,\" you can call it “Rocket Rides Capital”\nor “Rocket Rides Business Financing.\" If you want to include Stripe in the name,\nwe recommend something like “Rocket Rides + Stripe Capital.\"\n\n### Logos\n\nFollow this format for partnership logos:\n\nTemplate for partnership logos\n| Stripe\n\n- Place your logo on the left with the Stripe logo on the right.\n- Join the two logos with a `|` symbol or `+` symbol.\n- Make both logos the same size. Don’t make one larger or smaller than the\nother.\n- Use the [downloadable Stripe logo\nkit](https://brandfolder.com/s/h3jbwkqfhbv9s9k4b9qpt3x). Don’t use the badge or\nConnect button.\n\n### Main message\n\nIn one sentence:\n\nMain message in one sentence\nCapital provides access to fast, flexible financing so you can and invest in\ngrowth.\n\nIn 100 words:\n\nMain message in 100 words\nAccess to capital can be one of the most limiting growth factors. With Capital,\nyou can help jump start your business with flexible, on-demand financing. No\nlengthy application or personal credit check required—eligible businesses are\nautomatically pre-qualified and can receive funds in as soon as 2 business days\nafter you’re approved. Get the financing you need today with Capital.\n\n### Benefits and features\n\nHere’s how you could describe the benefits and features of the program:\n\nBenefits and features marketing template- No lengthy application: There’s no\npersonal credit check and no complicated application process. Eligibility is\nbased on factors like your payment volume and history on payment solution.\n- Get funds quickly: Funds typically arrive in as soon as 2 business days,\ndirectly into your account.\n- One flat fee: Pay one flat fee that never changes. There are no compounding\ninterest charges or late fees.\n- Pay when you get paid: Repayment is fully automated and adjusts to your daily\nsales. Stripe deducts a fixed percentage of your sales until the total owed is\nrepaid. Every loan has a minimum payment amount (usually due every 60 days). If\nthe total amount repaid through sales doesn’t cover the minimum, you need to pay\nthe remaining balance at the end of the period. Automated repayments count\ntowards this minimum.\n\n### How it works\n\nHere is a template for explaining how the program works. Modify it as needed for\nyour situation. For example, if your customers may see their eligibility offer\nin places other than email, like in-app notifications or banner ads, mention\nthem in the description of step one.\n\nHow it works marketing template- Check your eligibility: Check your email to see\nif you’re eligible for an offer based on factors that include your payment\nvolume and history on payment solution.\n- Select your offer: Select the amount that’s right for your business needs. The\nloan fee and repayment rate are set based on the loan amount.\n- Receive your funds: After our team reviews your application, the funds are\ndeposited into your account, typically as soon as 2 business days after\napproval.\n- Pay down as you earn: You’ll automatically repay the loan with a fixed\npercentage of your daily sales, until the total amount is repaid. Every loan has\na minimum payment amount (usually due every 60 days). If the total amount repaid\nthrough sales doesn’t cover the minimum, you need to pay the remaining balance\nat the end of the period. Automated repayments count towards this minimum.\n\n### Marketing to ineligible users\n\nNot all customers are eligible for a Capital loan. Any marketing material that\nis available to an audience of both eligible and ineligible users should clearly\nexplain how eligibility is determined, and how customers can learn if they have\nan offer available. Direct marketing which only targets recipients ineligible\nfor financing isn’t currently supported. Here’s an example of the type of\nlanguage you can use on marketing content available to a broader audience of\nboth eligible and ineligible users:\n\nMarketing to ineligible users template\nEligibility is based on a combination of factors, such as your payment history\non payments. If you’re eligible for an offer, we’ll send you an email. If you\nhaven’t received any notification from us, that means you’re not eligible for an\noffer at this time.\n\nIf you’d like to receive a financing offer, but aren’t eligible at this time, we\nrecommend migrating more of your business’ payments to payment solution. While\nnot guaranteed, increased payment volume and your history with payment solution\nmight increase your likelihood of getting a financing offer.\n\n### Terminology reference\n\nThe list of approved and prohibited language isn’t exhaustive. For any\nquestions, contact the Capital team at\n[capital-review@stripe.com](mailto:capital-review@stripe.com).\n\nApproved messagingProhibited messaging- Repayment rate\n- Repay as a fixed percentage of sales/invoices\n- Interest rates\n- High interest rates/high-rate\n- APR\n- Repayment\n- Repaid\n- Only pay when you get paid\n- Use the paycheck to cover your loan\n- Automatic and flexible repayment\n- Pay it back when you get paid\n\nYou must pair these two phrases in close proximity with the phrase, “repay your\nloan through a portion of your daily sales.”\n\n- Pay back the loan at any time\n- Repayment on your schedule\n- Pay it off in pieces\n- Pay it back whenever\n- Flat fee\n- Loan fee\n- Interest rates\n- High interest rates\n- Financing\n- Business financing\n- Low risk financial solution\n- Offer through Stripe Capital\n- Financing through our partner, Stripe Capital\n- Offer from Stripe Capital\n- Stripe Capital offer\n- Powered by Stripe Capital\n- Offer from Stripe\n- Offer from [Platform]\n- Typically in 2 business days\n- As soon as 2 business day\n- Get funds fast\n- In 2 business days\n- Get funds the next business day\n- Get funds instantly\n- Simple and fast for you to get the financing for your business\n- Get instant financing\n- ACcess to loans/financing right away\n- Financing for any business needs\n- Financing for any of your needs\n- No personal credit check\n- Will not affect your personal credit\n- No credit check\n- Will not affect your credit\nUse business financing for:- Creating/publishing/purchasing advertisements\n- Costs of hiring new team members/recruitment costs\n- Buying new equipment\n- Keeping extra cash on hand\n- Funding to grow your business\nUse business financing for:- Offsetting personal expenses such as groceries and\nhome expenses\n- Using funds for personal, family, or household purposes\n- Paying personal bills\n- No downsides\n- [when processing payments through Stripe you] “…can begin the eligibility\nprocess”\n- [the eligibility process] “…takes into account transaction amounts that you’ve\ndemonstrated you can repay”\n- [when processing payments through Stripe you] “…are automatically eligible to\nqualify”\n- [when processing payments through Stripe you] “…will not offer you more than\nyou can afford/show you can repay”\n- [when discussing eligibility] “…additional steps you can take to streamline\nyour evalution”\n- [when discussing eligibility] “…increase the amount of money you’ll be\neligible to borrow”\n- Stripe’s/their easy/straightforward/integrated process\n- Stripe’s/their responsible lending practices\n- “ensures responsible loan practices”\n- [any language implying that underwriting practices ensure no chance of\ndefault]\n- Pre-qualified\n- Pre-approved\n\n### Required default disclaimer\n\nAll marketing collateral must mention our bank partner Celtic. You *must* add\nthe following disclaimer on any landing pages wherever you market Stripe\nCapital:\n\nRequired default disclaimer\nLoans are issued by Celtic Bank and powered by Stripe. All loans subject to\ncredit approval.\n\nThe disclaimer doesn’t need to be the same font size as the marketing message,\nbut it must be clear, conspicuous, and in a font color or drop shadow that’s in\ncontrast to its background.\n\n## Promote your Capital program\n\nWhen your Capital program goes live, you’ll want to share information about it.\nBecause not all of your customers will be eligible for Capital, it’s important\nto make sure any broader marketing such as a landing page doesn’t promise\neligibility. Instead, you can use marketing to explain how the program works,\nwhy it’s important, and where customers can check if they’re eligible. Review\nour messaging guide for help crafting your marketing materials. We also\nrecommend referencing your broader vision for embedded finance if you’re also\nusing Stripe Treasury or Issuing.\n\n#### Warning\n\nYou must submit any customer-facing materials related to Capital to Stripe for\nreview prior to being published using the [Change Request\nForm](https://form.asana.com/?k=8K51UWmWhttehNFD5qBLdg&d=974470123217835).\n\n### Announcement email\n\nWhether you’re building a stand alone email or adding copy to an existing\nnewsletter, emails are a great way to introduce Capital to your customer base.\nTry to keep your email short and to the point, but make sure to include these\nkey points:\n\n- A brief introduction to the program\n- Where customers will learn about their offer (Make sure to touch on\neligibility as not all visitors to your page will be eligible)\n- Link to a blog post, landing page, or place where they can check their\neligibility\n- Compliance disclosure (CAN-SPAM and Default disclaimer)\n\nRefer to our messaging guide for help crafting your email copy.\n\n### Landing pages and blog posts\n\nEvergreen content like landing pages and blog posts can be a great way to excite\nprospective customers about your financing program, and educate existing\ncustomers about how it works. The following sections provide tips for developing\nyour content. We also recommend reviewing the messaging guide.\n\n**Suggested page structure**\n\n- Brief introduction to the program\n- Why financing can help their business\n- How the program works\n- Where customers will learn about their offer (Make sure to touch on\neligibility as not all visitors to your page will be eligible)\n- Links to FAQs, docs or any other pages you’d created\n- Compliance disclosure (default disclaimer)\n\n#### Landing page URL and site navigation\n\nHere are a few templates for landing page URL options and site navigation\ncategories. You can also use the name of your program such as “[Platform name]\nCapital” as the navigation category.\n\n- `/capital`\n- `/financing`\n- `/business-financing`\n\n![Lightspeed's website featuring the Capital category name in the product\nnavigation](https://b.stripecdn.com/docs-statics-srv/assets/capital-marketing-mockup.d208c97734e52710ffabc629962980eb.png)\n\nAn example Lightspeed’s website that features the Capital category name in the\nproduct navigation\n\n### Blog-post content\n\nWe understand that blog posts are a common tool to increase your own company’s\norganic growth, so you might decide to promote Stripe Capital through such\ncontent. Because blog posts are not space constrained, you have some additional\nthings to consider when creating this type of marketing content:\n\n- Comparisons: Due to the additional regulatory complexity of comparing Stripe\nCapital against other competitors or different loan products, you may not\ndirectly compare Stripe Capital against any competitors’ offerings.\n- Testimonials: Writing about your customers experiences in a blog post related\nto Stripe Capital falls under “testimonials” rules. These requirements are found\n[here](https://docs.stripe.com/capital/regulatory-compliance#testimonials).\n- Substantiating Claims: Blog posts sometimes make large claims about overall\nsuccesses, such as “Stripe Capital helps our users double their output.” Make\nsure that you have accurate and verifiable data for any quantifiable claims. You\nmust validate these claims and provide supporting evidence upon request. Every\nclaim must be substantiated and readily available for the duration the content\nis active, and for up to five years following its last use.\n\n### Social posts\n\nSocial posts such as organic and paid ads can help drive awareness of your\nprogram and tell a broader story about your investment in embedded finance.\nBecause much of this audience might not be eligible for a loan, refer to the\nsection [How to market to ineligible\nusers](https://docs.stripe.com/capital/marketing#market-ineligible).\n\nSocial media is often space constrained. When you create content for this\nchannel, don’t use approved marketing phrases out of context or reduced down to\nbe misleading. Don’t use language that references eligible loan amounts,\nspecific dollar amounts for loan fees, nor specific percentages of sales that go\ntowards repayment, because those are dynamically generated fields for formal\nloan offers.\n\n### LinkedIn organic templates\n\n### X (formerly Twitter) organic template\n\n### Press releases\n\nYou can use press releases as a way to attract new customers or develop a larger\nstory about your company’s investment in embedded finance. We’re happy to help\nyou develop the right story and support its release. If you’re interested in\ndoing a press release, reach out to\n[capital-review@stripe.com](mailto:capital-review@stripe.com).\n\n## See also\n\n- [Customer support](https://docs.stripe.com/capital/servicing)\n- [Metrics reports](https://docs.stripe.com/capital/reporting)\n\n## Links\n\n- [bank and regulatory\nrequirements](https://docs.stripe.com/capital/regulatory-compliance)\n- [Change Request\nForm](https://form.asana.com/?k=8K51UWmWhttehNFD5qBLdg&d=974470123217835)\n- [Capital\nAPI](https://docs.stripe.com/capital/api-integration#retrieve-financing-offers)\n- [Launch\nChecklist](https://docs.stripe.com/capital/no-code-integration#send-offers)\n- [Capital demo experience](https://dashboard.stripe.com/capital/demo)\n- [Connect\nsettings](https://dashboard.stripe.com/settings/connect/onboarding-interface)\n- [No-Code email service](https://docs.stripe.com/capital/no-code-integration)\n- [stripe.com/capital](https://stripe.com/capital)\n- [downloadable Stripe logo\nkit](https://brandfolder.com/s/h3jbwkqfhbv9s9k4b9qpt3x)\n- [here](https://docs.stripe.com/capital/regulatory-compliance#testimonials)\n- [Customer support](https://docs.stripe.com/capital/servicing)\n- [Metrics reports](https://docs.stripe.com/capital/reporting)",
  "metadata": {
    "title": "Marketing your Capital program | Stripe Documentation",
    "description": "Build marketing assets for Capital.",
    "sourceURL": "https://docs.stripe.com/capital/marketing"
  }
}