{
  "content": "# Klarna payments\n\n## Offer flexible payment options and get paid up front with Klarna.\n\nKlarna is a global payment method that gives customers a range of payment\noptions during checkout. These payment options enable customers to pay for\npurchases over time.\n\nTo pay with Klarna, customers are redirected to Klarna’s site, where they select\ntheir preferred payment option, then return to your website to complete the\norder. Klarna presents payment options based on the customer’s billing address\nand transaction amount. After payment acceptance, the full amount of the order\n(minus fees) is made available to your Stripe account up front, and Klarna\ncollects the purchase amount from your customer, including any future\ninstallment payments, if applicable.\n\nIf you’re based in the UK, Switzerland or a supported\n[EEA](https://en.wikipedia.org/wiki/European_Economic_Area) country, you can\ntransact with consumers in the UK, Switzerland, and all EEA countries where\nKlarna has a consumer offering, provided if the presentment currency matches the\ncurrency of the customer’s country. For example, a Swedish business can present\nin EUR to accept Klarna from a buyer in Germany.\n\nIf you’re based outside of the EEA, UK, or Switzerland, you can only transact\nwith customers within your country, and the presentment currency must be the\ncurrency of your country. For example, an Australian business must present in\nAUD, and can only transact with buyers in Australia.\n\nPayment method propertiesBusiness locationsProduct support- **Customer\nlocations**\n\nAustralia, Austria, Belgium, Canada, Czechia, Denmark, Finland, France, Greece,\nGermany, Ireland, Italy, Netherlands, New Zealand, Norway, Poland, Portugal,\nRomania, Spain, Sweden, Switzerland, United Kingdom, and the United States\n- **Presentment currency**\n\nAUD, CAD, CHF, CZK, DKK, EUR, GBP, NOK, NZD, PLN, RON, SEK, or USD\n- **Payment confirmation**\n\nCustomer-initiated\n- **Payment method family**\n\nBuy now, pay later\n- **Recurring payments**\n\nPrivate PreviewSign up\n- **Payout timing**\n\nStandard payout timing applies\n- **Connect support**\n\n[Yes](https://docs.stripe.com/payments/klarna#connect)\n- **Dispute support**\n\n[Yes](https://docs.stripe.com/payments/klarna#disputed-payments)\n- **Manual capture support**\n\nYes\n- **Refunds / Partial refunds**\n\n[Yes / Yes](https://docs.stripe.com/payments/klarna#refunds)\n\n## Payment flow\n\nBelow is a demonstration of the Klarna payment flow from your checkout page:\n\n## Get started\n\nYou don’t have to integrate Klarna and other payment methods individually. If\nyou use our front-end products, Stripe automatically determines the most\nrelevant payment methods to display. Go to the [Stripe\nDashboard](https://dashboard.stripe.com/settings/payment_methods) and enable\nKlarna. To get started with one of our hosted UIs, follow a quickstart:\n\n- [Checkout](https://docs.stripe.com/checkout/quickstart): Our prebuilt, hosted\ncheckout page.\n- [Elements](https://docs.stripe.com/payments/quickstart): Our drop-in UI\ncomponents.\n\n#### Unified line items with Klarna\n\nTo maximize approval rates when you integrate with Klarna, we recommend that you\ninclude Line Items data to represent what’s in a shopper’s cart. Reach out here\nto request access.\n\n#### Klarna on the Express Checkout Element\n\nKlarna on the Express Checkout Element is currently in private preview with\nlimited availability. Reach out here to request access.\n\nYou can also [manually\nlist](https://docs.stripe.com/payments/klarna/accept-a-payment) Klarna as a\npayment method and use it with [Payment\nLinks](https://docs.stripe.com/payment-links) or the [Payment Method Messaging\nElement](https://docs.stripe.com/payments/payment-method-messaging).\n\n## Payment options\n\nDepending on the customer’s billing country and the transaction amount, Klarna\ncan present customers with various payment options. Cart ranges and geographic\navailability for payment options are determined by Klarna and might change at\ntheir discretion. Regardless of the underlying payment option selected, Stripe\nmakes the full amount of the funds (minus fees) available to you upfront and\nKlarna collects the purchase amount from your customer, who repays Klarna\ndirectly. These options include:\n\n- **Pay now**: Customers pay for the purchase immediately using a linked card,\nbank debit, or bank transfer.\n- **Pay later**: Customers pay for the purchase in a single payment in 30 days.\n- **Pay in 3 or 4** (also known as installments): Customers pay for the purchase\nin three or four interest-free payments. The total transaction amount is\ntypically spread equally across the installments, but Klarna might occasionally\ncharge your customer more in the first installment based on the customer’s\npurchase power and other credit factors.\n- **Financing** (also known as monthly installments): Customers pay for the\npurchase over a longer term of up to 36 months, which might include interest.\nNot all customers are approved for the maximum amount, and approval is subject\nto credit worthiness.\n\nThe following tables list the supported payment options for the countries in\neach region. If a payment option isn’t listed for a country, it isn’t currently\nsupported.\n\nNorth AmericaDACH and Northern EuropeNordicsRest of EuropeAPAC\n### Canada\n\n### United States\n\n## Prohibited business categories\n\nIn addition to the industry and business categories listed in [Prohibited and\nrestricted business](https://stripe.com/restricted-businesses), the following\ncategories aren’t allowed to use Klarna:\n\n- Charities\n- Political organizations, parties, or initiatives\n- B2B\n\nFor more information about Klarna eligibility for your account, navigate to your\n[Payment methods\nsettings](https://dashboard.stripe.com/settings/payment_methods).\n\n## Klarna branding\n\nLet your customers know you accept payments with Klarna by including the\n[Payment Method Messaging\nElement](https://docs.stripe.com/payments/payment-method-messaging) on your\nproduct and cart pages. You must comply with Klarna’s [marketing compliance\nguides](https://docs.klarna.com/marketing/solutions/grab-and-go).\n\nIf you’re in the UK, there are [FCA](https://www.fca.org.uk/) regulatory\nrequirements in the UK regarding advertising Klarna’s BNPL payment methods.\nFailure to comply can result in criminal charges. Per these requirements, you\nmust only advertise Klarna with messaging approved by Klarna. You can find\nKlarna approved messaging in Klarna’s [UK Financial Promotion\nRules](https://docs.klarna.com/marketing/solutions/grab-and-go/gb/Klarna-Financial-Promotion-Rules/).\n\n## Disputes\n\nKlarna covers disputes driven by customer fraud or inability to repay\ninstallments provided you follow [Klarna’s shipping\npolicy](https://www.klarna.com/international/shipping-policies/). Merchants\naren’t involved in these disputes.\n\nWhen a dispute arises, communicate directly with your customer to try and solve\nthe issue together. If you can’t reach a solution, Klarna intervenes to help\nsolve the dispute. You can manage disputes in the Stripe Dashboard and using the\nAPI.\n\nNormally, customers can open a dispute within 180 days of the original\ntransaction. However, the 180-day limit doesn’t apply to the following\nsituations:\n\n- The customer reports that they never authorized the transaction\n- The customer raises a legal claim with an external authority, such as the\nCentral Arbitration Committee\n- Local consumer protection rules extend the limit, for example, the right to\nobject in Sweden\n- The customer is contesting the transfer of the debt to an external collection\nagency\n\n### Dashboard or API disputes\n\nPrior to November 15, 2023, you could only manage Klarna disputes through\nemails. Now, all new Klarna disputes are managed in the Stripe Dashboard and\nwith APIs. As you transition from managing disputes through email to handling\nthem in the Dashboard or with the API, you must continue to respond to existing\nemail disputes by email.\n\nTo learn how to use the Dashboard or API to manage disputes, see [Respond to\ndisputes](https://docs.stripe.com/payments/klarna/disputes).\n\n### Email disputes\n\nKlarna reaches out to both you and the customer, requesting convincing evidence\nthat you fulfilled the purchase order. Klarna emails the support email address\nthat you list in your [Dashboard\nsettings](https://dashboard.stripe.com/settings/public) when you activate\nKlarna. If you haven’t provided a support email address, Klarna defaults to your\nprimary Stripe account email address. [Contact\nus](https://support.stripe.com/contact) to modify the email address Klarna uses.\n\nKlarna might request evidence such as:\n\n- Received return confirmation (for shipped goods returned from the customer to\nyou).\n- Tracking ID.\n- Shipping date.\n- Record of purchase for intangible goods, such as IP address or email receipt.\n- Record of purchase for services or physical goods, such as phone number or\nproof of receipt.\n\nThis information helps Klarna determine if a dispute is valid or if they’ll\nreject it. Make sure the evidence you provide contains as much detail as\npossible from what the customer provided at checkout. You must submit the\nrequested information within 7 days. If Klarna rules in favor of the customer,\nthey might initiate a dispute, with funds withdrawn from your Stripe account.\nKlarna dispute decisions are final, and they have no appeal process.\n\n## Refunds\n\nYou can refund Klarna charges up to 180 days after the payment completes. Klarna\ncancels any remaining payments on a refunded charge and returns the already-paid\namount to the customer. Refunds usually take 5-7 business days to complete, but\nmight take longer depending on the customer’s financial institution and the type\nof purchase. Klarna supports full and partial refunds. You can also issue\nmultiple partial refunds up to the amount of the original charge. Partial\nrefunds update the Klarna order to reflect the new total amount.\n\n- If the partial refund is greater than the remaining balance of the order,\nKlarna deducts the refund amount from the outstanding balance and returns the\ndifference.\n- If the partial refund is less than the remaining balance of the order, Klarna\ndeducts the amount from the outstanding balance and spreads refunds evenly\nacross the remaining payments.\n\n## Connect\n\nA Connect platform can use [Stripe\nConnect](https://docs.stripe.com/connect/how-connect-works) with Klarna to\nprocess connected account payments of all [charge\ntypes](https://docs.stripe.com/connect/charges).\n\n### Connected accounts with full Stripe Dashboard access\n\nConnected accounts with access to the full Stripe Dashboard, including Standard\naccounts, can enable Klarna through their Dashboard. To check which accounts\nhave enabled Klarna, use the `capabilities` hash in the [accounts webhooks or\nAPIs](https://docs.stripe.com/api/accounts/object#account_object-capabilities-klarna_payments)\nto see if the `klarna_payments` capability is set to `active`.\n\n### Connected accounts without full Stripe Dashboard access\n\nTo enable Klarna for connected accounts without full access to the Stripe\nDashboard, including Express and Custom accounts, request the `klarna_payments`\n[capability](https://docs.stripe.com/connect/account-capabilities). Customers\nsee the name of your connected account during checkout and in the Klarna app.\n\n## Termination rights\n\nIn addition to the termination and suspension rights included in the [Stripe\nServices Agreement](https://stripe.com/klarna/legal), Klarna has certain\nadditional rights to suspend or terminate your use of Klarna, such as for breach\nof the prohibited business categories listed above or for high dispute rates\nthat aren’t promptly remedied.\n\n## Additional requirements\n\nYou acknowledge that:\n\n- Klarna decides if customers can use Klarna for purchases and has the sole\nright to receive payment from Klarna customers. Stripe acquires those purchases\nfor you and settles the funds to you.\n- You must provide customers with any required or requested payment instructions\nor documents (such as VAT). These documents must refer to Klarna as the payee\nand not contain any of your bank details.\n- You can’t impose fees or higher prices for Klarna purchases or act unfairly\ntowards Klarna.\n- You must promptly follow Stripe’s instructions to stop an order process or\nshipping to help reduce the risk of fraudulent transactions.\n- You can’t use any design that’s confusingly similar to Klarna’s trademarks\n(see [Klarna’s branding guidelines](https://docs.klarna.com/marketing/)).\n- You must not permit use of Klarna for purchases by a person who might\nreasonably be considered to share a financial interest with you, including\nowners, directors, and employees of your business or any affiliated company.\n\nIf you’re in Australia, Klarna provides guidance on how to comply with the\n[Design and Distribution Obligations\n(DDO)](https://docs.klarna.com/marketing/au/advertising-legal-guidelines/design-and-distribution-obligations-ddo/)\nwhen accepting Klarna in Australia. Most Stripe users don’t need to do anything\nto comply. If you actively promote or recommend Klarna’s Pay in 4 product in\nAustralia, you may be considered a “distributor” under the DDO and may have to:\n\n- Help Klarna as needed to comply with the DDO, including only promoting Pay in\n4 consistent with Klarna’s [Target Market Determination\n(TMD)](https://www.klarna.com/au/legal/target-market-determinations/)\n- Promptly advise Klarna of any “significant adverse dealing” such as:- A major\ncomplaint or large number of complaints that Pay in 4 causes a customer harm or\n- A customer under 18 makes a purchase using Pay in 4\n- If requested, provide Klarna with reports about any Pay in 4 complaints you\nreceive\n- If requested, provide Klarna with information related to any reported\nsignificant adverse dealings\n\n## Links\n\n- [pricing details](https://stripe.com/pricing/local-payment-methods)\n- [EEA](https://en.wikipedia.org/wiki/European_Economic_Area)\n- [Yes](https://docs.stripe.com/payments/klarna#connect)\n- [Yes](https://docs.stripe.com/payments/klarna#disputed-payments)\n- [Yes / Yes](https://docs.stripe.com/payments/klarna#refunds)\n- [Stripe Dashboard](https://dashboard.stripe.com/settings/payment_methods)\n- [Checkout](https://docs.stripe.com/checkout/quickstart)\n- [Elements](https://docs.stripe.com/payments/quickstart)\n- [manually list](https://docs.stripe.com/payments/klarna/accept-a-payment)\n- [Payment Links](https://docs.stripe.com/payment-links)\n- [Payment Method Messaging\nElement](https://docs.stripe.com/payments/payment-method-messaging)\n- [Prohibited and restricted business](https://stripe.com/restricted-businesses)\n- [marketing compliance\nguides](https://docs.klarna.com/marketing/solutions/grab-and-go)\n- [FCA](https://www.fca.org.uk/)\n- [UK Financial Promotion\nRules](https://docs.klarna.com/marketing/solutions/grab-and-go/gb/Klarna-Financial-Promotion-Rules/)\n- [Klarna’s shipping\npolicy](https://www.klarna.com/international/shipping-policies/)\n- [Respond to disputes](https://docs.stripe.com/payments/klarna/disputes)\n- [Dashboard settings](https://dashboard.stripe.com/settings/public)\n- [Contact us](https://support.stripe.com/contact)\n- [Stripe Connect](https://docs.stripe.com/connect/how-connect-works)\n- [charge types](https://docs.stripe.com/connect/charges)\n- [accounts webhooks or\nAPIs](https://docs.stripe.com/api/accounts/object#account_object-capabilities-klarna_payments)\n- [capability](https://docs.stripe.com/connect/account-capabilities)\n- [Stripe Services Agreement](https://stripe.com/klarna/legal)\n- [Klarna’s branding guidelines](https://docs.klarna.com/marketing/)\n- [Design and Distribution Obligations\n(DDO)](https://docs.klarna.com/marketing/au/advertising-legal-guidelines/design-and-distribution-obligations-ddo/)\n- [Target Market Determination\n(TMD)](https://www.klarna.com/au/legal/target-market-determinations/)",
  "metadata": {
    "title": "Klarna payments | Stripe Documentation",
    "description": "Offer flexible payment options and get paid up front with Klarna.",
    "sourceURL": "https://docs.stripe.com/payments/klarna"
  }
}