{
  "content": "# Deposit automation\n\n## Use the connector to automate the bank reconciliation process.\n\nThe Stripe Connector for NetSuite automates the bank reconciliation process by\ncreating bank deposits in NetSuite for all of your [Stripe\npayouts](https://docs.stripe.com/connectors/netsuite/stripe-payouts-netsuite).\nThe connector also automates fee calculation, the refund life cycle, the dispute\nlife cycle, and handling of multiple currencies and subsidiaries. This means you\nonly need to match the bank deposit record to the Stripe deposits on your bank\nstatement, reducing the amount of manual work required each month. Every\nautomated payment workflow that the connector supports includes deposit\nautomation.\n\n## How it works\n\nWhen you use the connector, the automated bank reconciliation process occurs\ndaily as follows:\n\n- The connector creates payments and refunds for each Stripe transaction, and\nposts these transactions in the Undeposited Funds account in NetSuite.\n- Stripe notifies the connector that a bank transfer (Stripe payout) has\nsuccessfully arrived at your bank.\n- The connector creates a bank deposit record in NetSuite that contains all of\nthe payments, refunds, and disputes from that day’s bank deposit.\n- The connector calculates any fees for processing, currency conversion,\ndisputes, and refunds, and includes these as separate line items that post to\nyour specified expense accounts.\n- The connector ensures that the deposit total and deposit date match your bank\nstatement.\n\nStripe\n\nConnector\n\nNetSuite\n\nCash reconciliation\n\nStripe creates payment\n\nConnector creates NetSuite payment and posts to Undeposited Funds account\n\nConnector adds payment to bank deposit and moves payment to bank account\nspecified on the deposit\n\nStripe issues refund or chargeback\n\nConnector creates NetSuite refund and posts to Undeposited Funds account\n\nConnector adds refund to bank deposit and moves refund to bank account specified\non the deposit\n\nStripe sends payout to your bank\n\nStripe payout arrives in your bank account\n\nConnector creates bank deposit that includes all transactions and processing\nfees\n\nA diagram providing a high level overview of the deposit automation flow\noutlined in this doc\n## See also\n\n- [Charges in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-charges-netsuite)\n- [Payouts in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-payouts-netsuite)\n- [Disputes in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-disputes-netsuite)\n- [Refunds in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-refunds-netsuite)\n\n## Links\n\n- [Stripe App\nMarketplace](https://marketplace.stripe.com/apps/netsuite-connector)\n- [Stripe\npayouts](https://docs.stripe.com/connectors/netsuite/stripe-payouts-netsuite)\n- [Charges in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-charges-netsuite)\n- [Disputes in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-disputes-netsuite)\n- [Refunds in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-refunds-netsuite)",
  "metadata": {
    "title": "Deposit automation | Stripe Documentation",
    "description": "Use the connector to automate the bank reconciliation process.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/deposit-automation"
  }
}