{
  "content": "# Add funds to your card program\n\n## Learn about your options to fund card spend.\n\nTo enable card spend, Stripe Issuing users must fund an Issuing balance. Your\ndefault funding option is to use an external bank account. Depending on your\nintegration and region, you have the option to pull or push funds from an\nexternal bank account to your Issuing balance. If you use Stripe Payments, you\ncan fund your Issuing balance from your Stripe acquiring balance or from your\nexternal bank account. This page provides information to help you decide which\nmechanism works better for your integration.\n\n## Funding your card program\n\nDetermining how to fund your card program is a core part of your Stripe Issuing\nintegration. In order to avoid insufficient funds declines when making purchases\non issued cards, your account needs to have sufficient funds in the Issuing\nBalance. As a best practice you should:\n\n- Add funds to cover planned spending.\n- Create alerts that tell you when your Issuing balance is low.\n- Review funding options to efficiently move money into your Issuing balance.\n\nFor businesses on Stripe Issuing, the default way to fund your card spend is a\ntop-up from an external bank account. Specifically, in the US, the default is a\npull-funded top-up, and in the UK and Euro zone the default is a push-funded\ntop-up.\n\n### Funding option\n\n**Pull-funded top-ups**\n\n*Default method in the US. Sufficient as sole funding method.*\n\n**Push-funded top-ups**\n\n*Default method in the UK and Euro area; optional in the US. Sufficient as sole\nfunding method.*\n\n**Stripe balance transfers**\n\n*Requires Stripe Payments. Optional in the US, UK and Euro area.*\n\n**Connect balance transfers**\n\n*Requires Stripe Connect. Optional in the US, UK and Euro area.*\n\n### How it works\n\nPull-funded top-ups fund your Issuing balance from an external bank account.\n\nUsers with a direct or Connect integration can initiate pull-funded top-ups via\nthe [create top-up](https://docs.stripe.com/api/topups/create) endpoint or in\nthe Dashboard. A platform’s connected accounts can initiate pull-funded top-ups\nvia the API only.\n\nPush-funded top-ups also fund your Issuing balance from an external bank\naccount. However, unlike pull-funded top-ups, you don’t need to add your\nexternal bank account to Stripe.\n\nInstead, push-funded top-ups use an account or routing number to push funds to\nyour Issuing balance via: Same-day wire or ACH credit transfer (US) BACS / FPS\n(UK) Sepa Credit Transfer (Euro area)\n\nRouting information can be found via the\n[Dashboard](https://docs.stripe.com/issuing/funding/balance?issuing-currency=usd#access-account-information-for-push-funding-in-the-dashboard)\nor by making a `create` or `list` call to the [Funding\nInstruction](https://docs.stripe.com/api/issuing/funding_instructions) endpoint.\nHowever, connected accounts can only view routing information by calling [List\nFunding\nInstructions](https://docs.stripe.com/api/issuing/funding_instructions/list).\n\nBalance transfers move funds to your Issuing balance from your Stripe balance,\nwhich contains your payments proceeds.\n\nUsers with a direct or Connect integration can initiate Stripe balance transfers\nvia the balance transfer API endpoint or in the Dashboard. A platform’s\nconnected accounts can only initiate Stripe balance transfers to Issuing balance\nvia the API.\n\nIf you need to pay out excess funds in the Issuing balance, you can initiate a\n[Payout](https://docs.stripe.com/api/payouts/create).\n\nTransfers funds to or from the Issuing balance of a connected account from the\nplatform’s Issuing balance.\n\n### Fund origination\n\nExternal bank accountExternal bank accountStripe balance (Payments)Platform\nIssuing balance (Connect)\n### Settlement time\n\nFunds can take up to 5 business days to become available. Expedited top-ups may\nbe available.Funding speed depends on the rails that the funds are pushed over.\nThere may be additional delays for your first few top-ups.Funds settle instantly\nin the US and within 1 business day in the UK and Euro area.Funds settle\ninstantly in all available regions.\n### Availability\n\nAvailable in the US on Direct and Connect integrations.\n\nSee documentation for pull-funded top-ups for\n[Connect](https://docs.stripe.com/issuing/connect/funding?issuing-funding-type=us-pull-funding)\nand\n[Direct](https://docs.stripe.com/issuing/funding/balance?push-pull-preference=pull)\nintegrations.\n\nNot currently available in the UK or Euro area.\n\nAvailable in the US in the APIbeta and Dashboard. See documentation for\npush-funded top-ups for\n[Connect](https://docs.stripe.com/issuing/connect/funding?issuing-funding-type=us-push-funding)\nor\n[Direct](https://docs.stripe.com/issuing/funding/balance?push-pull-preference=push)\nintegrations.\n\nAvailable in the UK and Euro area. See the documentation for push-funded top-ups\nfor Connect\n([UK](https://docs.stripe.com/issuing/connect/funding?issuing-funding-type=uk-push-funding),\n[Euro\narea](https://docs.stripe.com/issuing/connect/funding?issuing-funding-type=euro-push-funding))\nand\n[Direct](https://docs.stripe.com/issuing/funding/balance?push-pull-preference=push)\nintegrations.\n\nAvailable in the USbeta, UKbeta, and Euro areabeta. See documentation for\n[Connect](https://docs.stripe.com/issuing/connect/funding?issuing-funding-type=us-pull-funding)\nand\n[Direct](https://docs.stripe.com/issuing/funding/balance?push-pull-preference)\nintegrations.\n\nAvailable in the USbeta, UKbeta, and Euro areabeta. See documentation for\n[Connect](https://docs.stripe.com/issuing/connect/funding?issuing-funding-type=us-pull-funding)\nintegrations.\n\n### Best for\n\nPull-funded top-ups are best for users who want to build their own logic around\nwhen they want to top up. For example, you can build a flow to use the Balances\nAPI to view your current balances and automatically trigger a pull-funded top-up\nif your Issuing balance goes below a certain threshold.\n\nFor US users, this is the easiest funding method to start with, especially when\nusing the Dashboard.\n\nPush-funded top-ups are best for users focused on capital efficiency, since this\nfunding method allows platforms to fund their Issuing balance on the same day.\nPlatforms can then hold more funds in an interest-bearing account outside of\nStripe and quickly move those funds into their Issuing balance as needed.\n\nPush-funded top-ups are also good for users who have originating banks with APIs\nthat support automated integrations. Some users also prefer not to connect an\nexternal bank account to their Issuing balance.\n\nBalance transfers are best for users that also use Stripe to process their\npayments since it allows the user to use their acquiring balance to fund their\nIssuing balance.\n\nPlatform Issuing balance transfers are best for users that have a Connect\nintegration and plan to programmatically fund connected accounts, since this\nfunding mechanism allows the platform to instantly pre-fund any connected\naccount’s Issuing balance to the right level to avoid transaction declines.\n\n## Using funding methods in practice\n\nBusinesses on Stripe Issuing can operate a card program with the default funding\nmethod and nothing more. But if your business is integrated with additional\nStripe products such as Connect or Payments, you can benefit by using multiple\nmethods.\n\nFor example, suppose you are an e-commerce platform providing an expense\nmanagement card to each of the online shops on your platform. In this case,\nbuild a [Connect integration](https://docs.stripe.com/issuing/connect) where\neach shop on your platform represents a connected account. Shops on your\nplatform can accept payments and fund cards by transferring balances, all on\nStripe. If your merchants also collect funds from users outside of Stripe, they\ncan use push-funded top-ups from an external bank account. When you’re ready,\nallocate collected funds by transferring funds from your platform Issuing\nbalance to the Issuing balance of specific connected accounts.\n\nTaking a US platform as an example, your funding setup could look like this:\n\nPlatform Account Stripe Balance\n\nPlatform Account Issuing Balance\n\nConnected Account Stripe Balance\n\nConnected Account Issuing Balance\n\nBankWires / ACH credit (same business day)Balance Transfers (instant)Connect\nAccount Transfers (instant)Connect Account Transfers (instant)Diagram of fund\nset up with bank to platform Issuing balance\nYou could also enable your shops, represented as connected accounts, to directly\naccept payments and move funds into their account to pay for their expenses.\n\nPlatform Account Stripe Balance\n\nPlatform Account Issuing Balance\n\nConnected Account Stripe Balance\n\nConnected Account Issuing Balance\n\nBankBalance Transfers (instant)Wires / ACH credit (same business day)Diagram of\nfund set up with bank to connect account Issuing balance\n\n## Links\n\n- [create top-up](https://docs.stripe.com/api/topups/create)\n-\n[Dashboard](https://docs.stripe.com/issuing/funding/balance?issuing-currency=usd#access-account-information-for-push-funding-in-the-dashboard)\n- [Funding\nInstruction](https://docs.stripe.com/api/issuing/funding_instructions)\n- [List Funding\nInstructions](https://docs.stripe.com/api/issuing/funding_instructions/list)\n- [Payout](https://docs.stripe.com/api/payouts/create)\n-\n[Connect](https://docs.stripe.com/issuing/connect/funding?issuing-funding-type=us-pull-funding)\n-\n[Direct](https://docs.stripe.com/issuing/funding/balance?push-pull-preference=pull)\n-\n[Connect](https://docs.stripe.com/issuing/connect/funding?issuing-funding-type=us-push-funding)\n-\n[Direct](https://docs.stripe.com/issuing/funding/balance?push-pull-preference=push)\n-\n[UK](https://docs.stripe.com/issuing/connect/funding?issuing-funding-type=uk-push-funding)\n- [Euro\narea](https://docs.stripe.com/issuing/connect/funding?issuing-funding-type=euro-push-funding)\n- [Direct](https://docs.stripe.com/issuing/funding/balance?push-pull-preference)\n- [Connect integration](https://docs.stripe.com/issuing/connect)",
  "metadata": {
    "title": "Add funds to your card program | Stripe Documentation",
    "description": "Learn about your options to fund card spend.",
    "sourceURL": "https://docs.stripe.com/issuing/adding-funds-to-your-card-program"
  }
}