{
  "content": "# NetSuite invoice payment page\n\n## Allow customers to use a Stripe payment flow to pay NetSuite invoices.\n\nThe Stripe Connector for NetSuite creates a payment page for each of your\nNetSuite invoices. Customers can pay invoices using a Stripe payment flow, and\npay with any of the [payment\nmethods](https://dashboard.stripe.com/test/settings/payment_methods) that you\nenable. Every accepted payment includes automated payment processing, cash\napplication, deposit automation, and fee calculation.\n\n#### Note\n\nYou can also install the [free, self-serve\nversion](https://docs.stripe.com/connectors/netsuite/invoice-payment-link/overview)\nof the connector. This version allows you to accept payments with a Stripe\npayment link, without syncing payments or other data to NetSuite.\n\n## How it works\n\n- When you create a NetSuite invoice, the payment page link is created and added\nimmediately. The payment page includes the following information:\n\n- NetSuite invoice number\n- NetSuite total amount due\n- Payment methods based on the customer region\n- Currency of the NetSuite invoice (if [supported by\nStripe](https://docs.stripe.com/currencies))\n- Provide the invoice payment page link to your customer in a NetSuite invoice\nemail, invoice PDF template, a portal on your website, or another communication\nmethod. The customer pays the full amount due on the NetSuite invoice.\n- The connector syncs the payment into NetSuite and applies it against the\ninvoice.\n- After the Stripe payout syncs as a bank deposit to NetSuite, the connector\nreconciles the payment against the corresponding bank deposit, recording\nprocessing fees and any currency conversion. This workflow is called [deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation).\n[Disputes](https://docs.stripe.com/connectors/netsuite/stripe-disputes-netsuite)\nand\n[refunds](https://docs.stripe.com/connectors/netsuite/stripe-refunds-netsuite)\nsync to NetSuite automatically.\n\nNetSuite\n\nBusiness\n\nCustomer\n\nStripe\n\nNetSuite creates an invoice and automatically generates a payment page link\n\nYou send the payment link to your customer (automatically or manually)\n\nThe customer submits payment through Stripe Checkout\n\nStripe creates a payment\n\nNetSuite syncs the customer payment and applies it to the original invoice\n\n2 business days later, Stripe sends a payout to your bank account\n\nNetSuite creates a deposit and moves the payment from the `Undeposited Funds`\naccount to a general ledger account\n\nA high level overview of the invoice payment page flow\n## Payment page details\n\nCreating an invoice immediately creates a [Checkout payment\npage](https://docs.stripe.com/payments/checkout) with a unique, secure URL\nthat’s single-use to prevent duplicate payments on the same invoice. You can\naccess this URL in the custom transaction body field.\n\nThe payment page only works for new invoices. If you want to use the payment\npage with past invoices, contact your implementation partner for a script that\nenables access to past invoices.\n\nYou can view payment information in the Stripe Dashboard, and a link to the\nNetSuite customer payment in the metadata.\n\nThe customer’s payment method is only saved for future use if you select **Save\npayment method to Stripe customers** on the connector’s **Control** tab, under\n**NetSuite payment pages**. Saved payment methods are created under a new or\nexisting Stripe customer and linked to the NetSuite customer.\n\nYou can find the record sync and related record links in the [Stripe\nDashboard](https://dashboard.stripe.com/test/dashboard).\n\n## Automate bank reconciliation\n\nThe payment page includes [deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation),\nwhich automates the bank reconciliation process for all payments, refunds, and\ndisputes from a Stripe payout to a NetSuite bank deposit.\n\n## Support multiple subsidiaries\n\nThe payment page is compatible with either single subsidiary (entity) or\nmulti-subsidiary (OneWorld) NetSuite accounts. You can enable the payment page\non any subsidiaries that have an individual Stripe Connector for NetSuite\nconnection within a multi-subsidiary account. The custom transaction body field\nfor the payment link applies to the NetSuite invoice forms.\n\n## Support multiple currencies and payment methods\n\nAccept payments in the [supported presentment\ncurrencies](https://docs.stripe.com/currencies#presentment-currencies) in your\nregion. The payment page displays the currency that’s specified on the NetSuite\ninvoice. Stripe then creates a payment based on that currency.\n\nYou can enable the payment methods you want to accept on the [Payment\nmethods](https://dashboard.stripe.com/settings/payment_methods) page. Stripe\nsupports many categories of [payment\nmethods](https://docs.stripe.com/payments/payment-methods/overview) based on\nyour region and business needs.\n\n## Save payment methods for future use\n\nYou can use the payment page to save payment methods for future use. For\nexample, a connector add-on (such as Auto-Pay) might use the saved payment\nmethod to charge a customer for future invoices. Stripe saves the payment method\nto a new or existing [Customer](https://docs.stripe.com/api/customers) object.\n\n#### Compliance\n\nYou’re responsible for your compliance with all applicable laws, regulations,\nand network rules when saving a customer’s payment details. For example, if you\nwant to save a customer’s payment method for future use, you need their\nagreement to be billed outside of the connector’s payment flow. Getting that\nagreement up front allows you to save the payment details, and to charge the\ncustomer for future invoices if needed.\n\nIf you plan to charge the customer while they’re offline, make sure that your\nterms also cover the following, at minimum:\n\n- The customer’s agreement to your initiating a payment or a series of payments\non their behalf for specified transactions.\n- The anticipated timing and frequency of payments (for example, whether charges\nare for scheduled installment or subscription payments, or for unscheduled\ntop-ups).\n- How the payment amount is determined.\n- Your cancellation policy, if you’re setting up the payment method for a\nsubscription service.\n\nMake sure you keep a record of your customer’s written agreement to these terms.\n\n## Customize the payment page\n\nYou can customize the look and feel of the payment page to match the design of\nyour site. Modify the payment page color and design on the [Branding\nsettings](https://dashboard.stripe.com/settings/branding) page in the Stripe\nDashboard. Modify your name and statement descriptor on the [Public\ndetails](https://dashboard.stripe.com/settings/public) page.\n\n## Add the payment page to your communications\n\nYou can integrate the payment page into your customer communications in\nNetSuite. For example, you might choose to map the payment page’s unique link to\na [Pay Now\nbutton](https://support.stripe.com/questions/stripe-connector-for-netsuite-pay-now-button)\nin your NetSuite email templates, invoice PDF templates, or manual outreach.\n\n## Send email receipts for payments\n\nYou have two options for sending email receipts to your customers:\n\n- Use Stripe to automatically send email receipts. To use this option, enable\n**Successful payments** on the [Customer emails\nsettings](https://dashboard.stripe.com/settings/emails) page in the Stripe\nDashboard. By default, the payment page attaches the NetSuite customer email to\nthe payment created in the Checkout session. If no email exists, the Checkout\nsession prompts the customer to provide one during payment.\n- Use NetSuite to send email receipts for payments. You must disable email\nreceipts in the Stripe Dashboard. Then, create a script or workflow to send\ncustomized email receipts when the connector creates a customer payment in\nNetSuite.\n\nYou can also [customize your\nreceipts](https://docs.stripe.com/receipts?payment-ui=payment-links#customizing-receipts).\nTo test email receipts, you need to manually trigger the receipts in the Stripe\nDashboard.\n\n## Test the invoice payment page\n\nYou can test the NetSuite invoice payment page in Stripe test mode or the\nNetSuite sandbox.\n\n#### Note\n\nIf you’re experiencing issues despite a correct configuration, you can contact\nyour implementation partner during the post-live support period.\n\n- In NetSuite, create an invoice for your use case. For example, an invoice with\nthe same types of line items and taxes that you use in production mode. The\ninvoice must have a balance greater than 0.50 for the payment page to populate.\n- On the newly created invoice, verify that the invoice payment page field\nappears. If it’s missing, go to the invoice form and make sure the field is\nconfigured and applied to the appropriate forms.\n- Click the customer payment page link to confirm it populates correctly. If it\ndoesn’t, verify that the default value is configured correctly in the custom\ntransaction body field for the page. For example,\n`https://netsuite-connector.stripe.com/payment/[Stripe Account ID]/[“test” or\n“live”]/invoice/[guid code_Internal ID]`.\n- Make payments with various [test payment\nmethods](https://docs.stripe.com/testing) and payment scenarios.\n- Click **Pay** and verify that the payment record is created in Stripe and\nNetSuite. This typically occurs within 30 seconds. Look for the synced records\nin the Stripe Connector for NetSuite app in the Stripe Dashboard.\n- Accessing the customer payment page creates a Stripe customer object and\nattaches it to the NetSuite customer. Verify this customer exists in the Stripe\nDashboard. If you chose to save payment methods, the connector saves the payment\nmethod to the Stripe `Customer` object when the payment completes.\n- Verify that the NetSuite customer payment was created and applied correctly by\nchecking the original invoice:\n\n- The invoice status changes from `Open` to `Paid in Full`.\n- The payment shows as `Undeposited`.\n- The general ledger account shows as `Undeposited Funds`.\n\n## See also\n\n- [Customer payment\npage](https://docs.stripe.com/connectors/netsuite/customer-payment-page)\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Refunds](https://docs.stripe.com/connectors/netsuite/stripe-refunds-netsuite)\n-\n[Disputes](https://docs.stripe.com/connectors/netsuite/stripe-disputes-netsuite)\n\n## Links\n\n- [Stripe App\nMarketplace](https://marketplace.stripe.com/apps/netsuite-connector)\n- [payment methods](https://dashboard.stripe.com/test/settings/payment_methods)\n- [free, self-serve\nversion](https://docs.stripe.com/connectors/netsuite/invoice-payment-link/overview)\n- [supported by Stripe](https://docs.stripe.com/currencies)\n- [deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n-\n[Disputes](https://docs.stripe.com/connectors/netsuite/stripe-disputes-netsuite)\n- [refunds](https://docs.stripe.com/connectors/netsuite/stripe-refunds-netsuite)\n- [Checkout payment page](https://docs.stripe.com/payments/checkout)\n- [Stripe Dashboard](https://dashboard.stripe.com/test/dashboard)\n- [supported presentment\ncurrencies](https://docs.stripe.com/currencies#presentment-currencies)\n- [Payment methods](https://dashboard.stripe.com/settings/payment_methods)\n- [payment methods](https://docs.stripe.com/payments/payment-methods/overview)\n- [Customer](https://docs.stripe.com/api/customers)\n- [Branding settings](https://dashboard.stripe.com/settings/branding)\n- [Public details](https://dashboard.stripe.com/settings/public)\n- [Pay Now\nbutton](https://support.stripe.com/questions/stripe-connector-for-netsuite-pay-now-button)\n- [Customer emails settings](https://dashboard.stripe.com/settings/emails)\n- [customize your\nreceipts](https://docs.stripe.com/receipts?payment-ui=payment-links#customizing-receipts)\n- [test payment methods](https://docs.stripe.com/testing)\n- [Customer payment\npage](https://docs.stripe.com/connectors/netsuite/customer-payment-page)",
  "metadata": {
    "title": "NetSuite invoice payment page | Stripe Documentation",
    "description": "Allow customers to use a Stripe payment flow to pay NetSuite invoices.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/invoice-payment-page"
  }
}