{
  "content": "# Identifying potential fraud\n\n## Learn about the most common fraud indicators.\n\nBecause Stripe users are responsible for fulfilling orders for customers and\npossess the most information about their customer at the time of purchase,\nthey’re best equipped to determine whether or not a payment is potentially\nfraudulent. There are external indicators that indicate a payment might be\nfraud, such as [Early Fraud\nWarnings](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings),\nbut fraud activity also has many implicit indicators that by themselves don’t\nunambiguously signal fraud. However, the existence of several of these\nindicators at the same time can more clearly suggest a payment is fraudulent.\n\nWith [Radar](https://docs.stripe.com/radar) for Fraud Teams, card payments that\nhave an elevated risk of fraud are automatically placed into\n[review](https://docs.stripe.com/radar/reviews). However, you might want to\ncreate additional rules based on the following factors to place additional\npayments into review—or block them completely. Although our recommendations can\nhelp prevent disputes and fraud, they can’t eliminate them completely. We want\nour users to be as informed as possible, both so that they can accept or refund\nany payments they believe are fraudulent and so they’re equipped to accept the\n[financial responsibility](https://stripe.com/terms#chargebacks) of any\nsuspicious payments that enter their Stripe account.\n\n## Common types of fraud indicators\n\nThere are many types of fraud indicators, some of which are easy to identify\nsuch as false numbers or email addresses, other types may be more intuitive and\nnuanced, such as a conversation with a customer that seems off. Having an\nunderstanding of the various ways fraudsters use false information to make\nfraudulent transactions will better help you to protect against them. Some of\nthe most common types of fraud indicators are:\n\n- Use of likely false information (for example, fake phone numbers and email\naddresses like **asdkf12495@freemail.example.com**).\n- Inconsistencies in customer details across multiple purchases (for example,\nusing the same e-mail address but a different name for another payment).\n- Communication that doesn’t sounds quite right. Fraudsters often use a canned\nresponse that is sent to multiple sellers using common phrases. If any\ncommunication appears scripted, use a search engine (putting the short phrase in\nquotes) to see if it’s been used elsewhere (for example, [this particular\nphrase](https://www.google.com/search?sourceid=gmail&rls=gm&q=%22%20I%20%20would%20like%20to%20proceed%20with%20the%20payment.%20I%27m%20buying%20it%20for%20someone%20special%20as%20a%20gift.%20%22&gws_rd=ssl)\nhas been used many times).\n- Unusually large orders (for example, multiples of the same item, only your\nmost expensive merchandise, expensive items or total order amount that seems\ninconsistent with normal customer behavior).\n- Many payments (including those that have been declined) made with:- The same\ncard but different shipping addresses.\n- Many cards that use the same shipping address.\n- The same card from the same IP address.\n- The same customer name/email address.\n- If each failed attempt is associated with a different credit card, any\nsuccessful payment carries a much greater risk for fraud.\n- Similar or the same card numbers, especially over a short duration and for\nsmaller amount. This is especially true for crowdfunding/fundraising sites.\n- Any requests to:- Split a large order into multiple payments across different\ncards that don’t share the same verified billing address information.\n- Process a payment manually, either through the Dashboard or your store.\nFraudsters may make this request in order to have the charge run with your local\nIP address instead of their own.\n- Charge a card more than the required amount (known as an “overcharge”) and pay\nout a third-party (for example, driver, shipper or freight company) using a\ndifferent payment method (for example, cash, money order).\n- Charge a card and then provide a refund outside the card network (for example,\ncheck, wire transfer).\n\nDeclined payments can provide valuable information and should also be regularly\nreviewed.\n\n## Shipping physical goods\n\nFraudsters can take advantage of various shipping methods to steal physical\ngoods. When shipping products be sure to:\n\n- Check whether the shipping and billing addresses match. Although a difference\nin address by itself doesn’t indicate fraud (for example, the customer might\nhave purchased a gift), it indicates that the charge should be looked at more\ncarefully. If the addresses do match and the customer is using a credit card\nfrom the US, Canada, or UK, check to see if the postal code and street address\nverifications passed.\n- Watch for customers who ask to change the shipping address after the order is\nplaced. Fraudsters may use a legitimate address to obtain a successful charge\nbut later ask that products be shipped elsewhere.\n- Evaluate rush orders or requests for overnight delivery (which would allow\nfraudsters to take advantage of timing).\n- Review the credit card’s country of origin (the country in which it was\nissued) in a charge’s payment detail in the Stripe Dashboard. The billing\naddress provided should match this country. Where the shipping country that\ndoesn’t match the card’s origin or is a country typically not shipped to, it’s\nimportant to take extra steps to verify the legitimacy of the charge.\n- Ensure that shipping methods are appropriate, especially for overnight\nshipping at a high cost. People using stolen credit cards don’t usually worry\nabout how expensive the shipping is and want goods right away, before the card\nnumber is reported as stolen or compromised. Never agree to use a customer’s\n“preferred shipper” or agree to pay a third party shipping company on your\ncustomer’s behalf; these are usually a second front for fraud.\n- Consider instituting a 24-48 hour shipping delay for high-value orders or\nshipments to non-verified addresses or first-time customers.\n- If you have a verified billing postal code, make sure the shipping label\ngenerated by your shipper displays this postal code after you enter the address.\nSome fraudsters provide a valid billing postal code, but the rest of the address\n(street, city, and state) is fraudulent, and automated systems such as USPS\nself-service often autocorrect the postal code you enter—effectively changing it\nfrom the verified billing postal code to the fraudster’s.\n- Use of international cards or orders with international shipping addresses.\n- Be aware of high-risk shipping destinations.\n- Take extra care when shipping to a [freight\nforwarder](http://www.forwarders.com/home/directories.html).\n\nIf you’d like to familiarize yourself with the postal code prefixes in the US by\nregion, use this [reference\nmap](http://upload.wikimedia.org/wikipedia/commons/thumb/2/24/ZIP_Code_zones.svg/1024px-ZIP_Code_zones.svg.png).\n\nGenerally, Stripe can’t see the shipping address customers provide and shipping\ninformation isn’t necessary to successfully accept a payment. However, you can\nimprove Stripe’s fraud detection by sending the shipping address when [creating\na payment](https://docs.stripe.com/api/payment_intents/create).\n\n## Digital goods or services\n\n[Customers](https://docs.stripe.com/api/customers) that misuse digital goods or\nservices are more likely to be using stolen credit cards. It is very important\nto collect and verify as many card details as possible, including CVC, street\naddress, and postal code. Consider rejecting charges that fail the CVC and\npostal code checks. As a general rule when selling digital goods or services, be\nsure to:\n\n- Be aware of customers sending spam using a product for messaging or making\nmany purchases in a short period of time for downloadable content or “in-game”\nitems.\n- Watch for multiple accounts using similar email addresses or the same credit\ncard. You can include this in your review queue through a [review\nrule](https://dashboard.stripe.com/fraud/rules).\n- Watch for multiple charges to the same email address in rapid succession. You\ncan include this in your review queue through a [review\nrule](https://dashboard.stripe.com/fraud/rules).\n- Watch for unexpected or significant changes in account activity. If the\npurchase frequency or dollar amount of payments for an account increases\nsignificantly, it may be an indication of fraudulent activity.\n- View evidence about the payments, including IP address, email logs, usage logs\n(that is, did they log in and actually use the service?), and so on. Pass this\ninformation to us, so that you can view it as you review a charge.\n\n## Donations or crowdfunding\n\nMake sure the donation makes sense for your campaign. If you’re running a small,\npersonal campaign and you receive a very large donation from an unknown\nindividual, scrutinize it carefully. Consider refunding if you can’t verify the\nindividual making the donation.\n\nIf you receive a large donation and the donor reaches out to you to say they\nmade a mistake and only meant to donate part of the amount, be cautious.\nFraudsters sometimes make a large donation (such as 1,000 USD) and later tell\nyou they only meant to donate a smaller amount (like 100 USD) and ask you to\nrefund the rest. This is done to test a stolen card’s credit limit. If this\nscenario appears, it may be prudent to refund the entire donation.\n\nMonitor your declined payments. Many of them that used different cards in rapid\nsuccession indicate a fraudster is testing stolen card numbers. If it does look\nlike someone is testing cards on your website, consider adding a delay or\nimplementing a [CAPTCHA](http://captcha.net/) during checkout to slow them down.\nThis usually encourages a card tester to move on.\n\n## Mark a payment as fraudulent\n\nYou can mark a payment as fraudulent using either the Stripe API or the\nDashboard. For instructions, see the [Feedback on risk\nevaluations](https://docs.stripe.com/radar/risk-evaluation#feedback-on-risk-evaluations)\nsection in the Risk evaluation guide.\n\n## See also\n\n- [Common types of\nfraud](https://docs.stripe.com/disputes/prevention/fraud-types)\n- [Verification\nchecks](https://docs.stripe.com/disputes/prevention/verification)\n- [Best practices for preventing\nfraud](https://docs.stripe.com/disputes/prevention/best-practices)\n\n## Links\n\n- [Early Fraud\nWarnings](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\n- [Radar](https://docs.stripe.com/radar)\n- [review](https://docs.stripe.com/radar/reviews)\n- [financial responsibility](https://stripe.com/terms#chargebacks)\n- [this particular\nphrase](https://www.google.com/search?sourceid=gmail&rls=gm&q=%22%20I%20%20would%20like%20to%20proceed%20with%20the%20payment.%20I%27m%20buying%20it%20for%20someone%20special%20as%20a%20gift.%20%22&gws_rd=ssl)\n- [freight forwarder](http://www.forwarders.com/home/directories.html)\n- [reference\nmap](http://upload.wikimedia.org/wikipedia/commons/thumb/2/24/ZIP_Code_zones.svg/1024px-ZIP_Code_zones.svg.png)\n- [creating a payment](https://docs.stripe.com/api/payment_intents/create)\n- [Customers](https://docs.stripe.com/api/customers)\n- [review rule](https://dashboard.stripe.com/fraud/rules)\n- [CAPTCHA](http://captcha.net/)\n- [Feedback on risk\nevaluations](https://docs.stripe.com/radar/risk-evaluation#feedback-on-risk-evaluations)\n- [Common types of\nfraud](https://docs.stripe.com/disputes/prevention/fraud-types)\n- [Verification\nchecks](https://docs.stripe.com/disputes/prevention/verification)\n- [Best practices for preventing\nfraud](https://docs.stripe.com/disputes/prevention/best-practices)",
  "metadata": {
    "title": "Identifying potential fraud | Stripe Documentation",
    "description": "Learn about the most common fraud indicators.",
    "sourceURL": "https://docs.stripe.com/disputes/prevention/identifying-fraud"
  }
}