{
  "content": "# Deliver tax forms with an interface built by Stripe\n\n## Learn how to e-deliver tax forms to connected accounts with an interface built by Stripe.\n\n## How does e-delivery through an interface built by Stripe work for connected accounts?\n\n**Stripe Express Dashboard**\n\nStarting with tax season 2021, Stripe enabled e-delivery of tax forms through\nthe [Stripe Express\nDashboard](https://docs.stripe.com/connect/express-dashboard). Your connected\naccounts can use Stripe Express to manage their tax forms, update their tax\ninformation, and manage their tax form delivery preferences. Learn more about\nworking with your users to collect verified tax information for the upcoming tax\nseason in the [1099 Tax Support and Communication\nGuide](https://docs.stripe.com/connect/platform-express-dashboard-taxes).\n\n#### Note\n\nReview a detailed [product\nwalk-through](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough)\nof the Stripe Express dashboard and Stripe outreach to your eligible connected\naccounts.\n\n**Connect Embedded Components**\n\nStarting with tax season 2024, Stripe enabled e-delivery of tax forms through\n[Connect embedded\ncomponents](https://docs.stripe.com/connect/deliver-tax-forms#file-deliver-embedded).\nYour connected account owners can access the components to manage their tax\nforms, update their tax information, and manage their tax form delivery\npreferences.\n\n## Which connected accounts have access to e-delivery through an interface built by Stripe?\n\nAccess to e-delivery though Connect embedded components is only if you enabled\ndelivery through an interface built by Stripe and have set up the embedded\ncomponents, including having [component\nlinks](https://docs.stripe.com/connect/embedded-comms) configured.\n\nE-delivery through the Stripe Express Dashboard is available to connected\naccounts that already have access to the Express dashboard and accounts where\nyou have built and managed the full experience otherwise. If you set up Connect\nembedded components or didn’t enable delivery through an interface built by\nStripe, we won’t invite your Connected accounts to the Stripe Express Dashboard.\n\nThere are a few [notable\nexceptions](https://docs.stripe.com/connect/deliver-tax-forms#e-delivery-with-stripe-express)\nthat might affect eligibility for e-delivery. For most platforms, these\nexceptions include less than 2% of connected accounts. For the accounts that\naren’t eligible for e-delivery, Stripe can support postal deliveries to the\naddress on file.\n\n## How do I enable outreach using an interface built by Stripe to collect identity information and e-delivery consent ahead of tax season?\n\nCollection of tax identity information and e-delivery consent early in the tax\nseason is critical for enabling a smooth tax season. If your platform opts for\ne-delivery through the interface built by Stripe and enables collection of tax\ninformation in advance using 1099 tax form settings, Stripe emails platforms’\nconnected accounts starting the week of November 4, 2024 to confirm their tax\ninformation and provide e-delivery consent through that interface. We don’t send\noutreach emails to platforms’ connected accounts until *7 days* after you enable\nthe setting.\n\nThis outreach from Stripe gives connected account owners an opportunity to\nreview and update their tax information and confirm their delivery preferences\nbefore you file with the IRS, which maximizes e-delivery opt-in rates, speeds up\ntax form delivery, and minimizes errors on finalized 1099 forms.\n\nIf you don’t enable collection of tax information in advance and only configure\ne-delivery, postal delivery initiates at the time you file for any accounts that\nhave not provided e-delivery consent. If accounts provide consent after you\nfile, that consent is applicable only for the next tax year.\n\n## When can my connected account owners access the tax information on an interface built by Stripe?\n\n**Stripe Express Dashboard**\n\nConnected account owners that currently do not have access but are eligible for\nit can view the Stripe Express Dashboard and the tax forms page starting in\nNovember 2024 after receiving the email invitation from Stripe. This will be\ntriggered if you choose to turn on e-delivery of your tax forms through the\nExpress Dashboard and enable early collection of tax information and delivery\npreferences under your 1099 tax settings.\n\nCurrently, connected account owners with existing access to the Express\nDashboard can edit their tax information. When you opt your platform in to\ne-delivery, your connected owners see the tax forms page with a row for your\nplatform.\n\n**Connect Embedded Components**\n\nIt is up to you when you implement the [Account Management\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/account-management)\nto allow your users to edit their account information. Before pre-filing\nconfirmation begins on November 4, when you opt your platform in to e-delivery\nyour connected accounts will see the “Tax form details” section with the option\nto update their delivery method.\n\n## How does a connected account without current access gain access to the Stripe Express Dashboard?\n\nConnected account owners that are eligible for access to the Express Dashboard\nreceive an invite from Stripe to confirm their tax information starting in\nNovember 2024. These emails include a link to Stripe Express Dashboard Account\nclaims. For connected account owners who’ve never claimed their account and\naccessed the Stripe Express Dashboard, we first gather their email and phone\nnumber to set up their credentials. After that, we present them with a series of\nidentity verification questions (Name, TIN, and DOB) to validate that they do\nown the account. If they fail these challenges, we provide follow-up questions\nsuch as address, Bank Last 4, and last payout amount from the platform to verify\ntheir identity. If they fail these questions after multiple attempts, we\nkick-off a manual review through Stripe Express support.\n\n## Which email address does Stripe use for e-delivery?\n\nFor connected accounts that have access to the Express dashboard from\nonboarding: Stripe already has emails associated with these users that are\ncollected at onboarding. For these accounts, Stripe emails the primary user\nassociated with the account. Multi-user Express Dashboard accounts aren’t\nsupported.\n\nIf an eligible connected account without current access claimed their account on\nStripe Express with a valid email address and phone number, the email address\nthey used to sign up is what Stripe uses. Otherwise, Stripe uses the email\naddress on the account.\n\nStripe can’t deliver forms electronically if there is no email address on the\naccount. Instead, Stripe attempts to deliver paper forms if a valid address is\non the tax form and you opted in to paper delivery.\n\n## Why do emails need to be updated for connected accounts?\n\nWe need updated emails as part of pre-filing confirmation and e-delivery\noutreach.\n\nIf you are using e-delivery with the Stripe Express dashboard:\n\n- In order for a connected account to onboard, log in, or access their tax\nforms, they need to be able to receive the email from Stripe inviting them to\ncreate their account.\n- If a user has updated their email, they must contact your platform for\nassistance updating their connected account email because Stripe can only resend\nthese emails to the address on file.\n- You only need to update emails on behalf of the connected account before\nthey’ve claimed their accounts. After they claim the account, then Stripe is\nable to assist your users with updating their emails.\n\n## How do I update the email address?\n\nYou can update the email addresses on your connected accounts in the following\nways. These updates carry year over year:\n\n- Use the\n[Update](https://docs.stripe.com/api/accounts/update#update_account-email) API.\n- Use the CSV import functionality on the [Emails\npage](https://dashboard.stripe.com/settings/connect/emails) in the Dashboard.\n- Edit the email addresses in the *Payee Details* section in the 1099 dashboard.\n\nYou can’t update email addresses using the `email_address` field in a CSV import\ndirectly into the 1099 product. Changes made using this method don’t carry over\neach year.\n\n## How do connected accounts edit their information?\n\nAs your connected accounts onboard to the Stripe Express Dashboard, account\nowners can edit their account details within the Tax reporting page. they’re\nable to edit their name, their TIN, and their address, but they aren’t able to\nchange their date of birth or their entity type. For date of birth and entity\nupdates, account owners need to contact Stripe Support.\n\nIf you are instead using embedded components, your users can edit their account\ndetails in the [Account Management\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/account-management).\n\n## What else can a connected account manage using an interface built by Stripe?\n\n**Stripe Express Dashboard**\n\nThe Stripe Express Dashboard also includes the Earnings page, which displays\nconnected accounts’ [upcoming payouts and\nearnings](https://docs.stripe.com/connect/customize-express-dashboard#set-custom-descriptions)\nhistory through the activity feed. The activity feed shows transactions from\nyour platform that affect connected accounts’ balances, such as payments,\nrefunds, transfers, and payouts.\n\nIn the Account settings, connected account owners can update account details\nincluding legal entity information and personal information such as name,\naddress, and taxpayer identification numbers, and view and update their bank\naccount information for payouts.\n\n**Connect Embedded Components**\n\nThe [Account Management\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/account-management)\nalso includes the ability to view and edit account information such as personal\nor business information, public information, and payout bank accounts.\n\nThe [Documents\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/documents)\nincludes documents such as 1099 tax forms and tax invoices.\n\n## How are tax forms kept in sync between the platform and the connected account?\n\nThe [Tax reporting](https://dashboard.stripe.com/connect/taxes/forms) view in\nthe platform dashboard is still the main place to generate, correct, split, and\nfile 1099s for your connected accounts. Edits made by connected account owners\n(Name, Social Security Number or Employer Identification Number, address) update\nyour connected accounts and thus the forms in the Tax reporting view in the\nDashboard (unless Tax form information was overriden) until they’re filed. For\nany updates made by a connected account after the filing date, you are given the\nchoice to either correct the tax form or leave the tax form as is. Updates might\ntake up to 24 hours to sync due to TIN aggregation done by Stripe. Note, we stop\nsyncing connected account information with the Tax reporting dashboard for the\ntax year on **February 14**.\n\nStripe doesn’t share the updated sensitive PII (such as SSN or EIN) from\naccounts with your platform through the API for security reasons.\n\n## Can I collect consent for e-delivery through a surface built by Stripe?\n\nYes, you can collect consent for e-delivery through the Stripe Express Dashboard\nand the [Account Management embedded\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/account-management).\nConnected accounts can only view their tax forms after providing e-delivery\nconsent. In the Express Dashboard, after providing e-delivery consent, connected\naccounts are provided with the option to request an optional paper copy. You can\nupdate the e-delivery consent for an individual form through either the Form\nEditor UI on the 1099 Dashboard or using a [CSV\nimport](https://docs.stripe.com/connect/modify-tax-forms?method=csv#import-tax-forms)\nusing the ‘e-delivery consent’ field from Jan 2023.\n\n#### Note\n\nConnected accounts are directed to your support team if they would like to\nrevoke e-delivery consent.\n\n## How do connected accounts get alerted when their 1099 forms are available?\n\nStripe sends an email notification to your connected accounts when their 1099\nforms are available. This email includes both Stripe’s logo and your platform’s\nlogo. The platform logo is taken from your [Connect branding\nsettings](https://dashboard.stripe.com/settings/connect/stripe-dashboard/branding),\nso please make sure this is up to date before the week of November 4, 2024.\n\nFor connected accounts where you own the full experience otherwise, make sure\nthat you also [update email\naddresses](https://docs.stripe.com/api/accounts/update#update_account-email) on\nthe accounts before the week of November 4, 2024 so Stripe can email them the\nfollowing week. You can update this information using the Accounts API. Express\nconnected accounts already have a user associated with them, and Stripe emails\ntax forms to the primary user associated with the account.\n\n## How should I prepare my connected accounts for e-delivery and the upcoming tax season?\n\nPrepare your connected accounts:\n\nCreate a support article with information for your connected account owners to\nlet them know that their 1099s will be delivered by Stripe and that they should\nexpect to receive an email from Stripe in January. [See an\nexample](https://help.doordash.com/dashers/s/article/Common-Dasher-Tax-Questions?language=en_US).\n\nCommunicate with all eligible connected account owners to let them know they\nshould expect to receive an email from Stripe. This helps with maximizing opt-in\nto e-delivery and minimizing concerns about phishing.\n\n### Sample language for communicating with your connected account users\n\nSubject: Our tax partner Stripe will be sending you an important email. Body:\n“In the next few days, you will receive an email from Stripe with a link to\ndownload your 1099 tax form. <Platform_Name> partners with Stripe to facilitate\npayments and tax reporting, including 1099 forms. We recommend adding <Email> to\nyour address book so the email isn’t marked as spam. When you receive the email,\nplease click into it and follow the instructions to confirm your tax details.”\n\n#### Note\n\nThe email communications are sent from can be found in your [communication\nsettings](https://dashboard.stripe.com/settings/connect/emails), where you can\nalso customize the domain.\n\n## How do I navigate to prior years tax forms?\n\nIn the Express dashboard, choose the year in the drop-down to look for past\nyears’ forms. In the embedded component, it is in the list of documents.\n\nForms for 2019 or earlier aren’t available through your Dashboard. These forms\nmight be filed through a different system called Payable. If you used Stripe\nduring that period of time, please reach out to support to get the tax forms you\nneed.\n\n## Why are my users being asked to enter the last four digits of their TIN to download their forms?\n\nConnected account owners who have consented to e-delivery must pass a TIN\nvalidation to download their tax forms as an added layer of security. The key\nhere is that they must enter the last four digits of the TIN exactly as it\nappears on their 1099 tax form. For Prior Years tax forms, we present a similar\nTIN challenge to enter the last four digits for the TIN as it appears on that\nparticular form. If your platform didn’t use Stripe in the past to file 1099s,\nthen those forms aren’t available in an interface built by Stripe.\n\n## Why are connected account owners having issues validating their TIN?\n\nYour users might run into issues downloading their 1099 tax forms if they have\nupdated the TIN on their connected account, if your platform has overwritten the\nTIN on the 1099 tax form, if they’ve simply forgotten the TIN that appears on\nthe tax form, or if they recently received a new TIN from the IRS and it isn’t\nin their system yet.\n\nIn these instances, users reach out to your platform so that you can work with\nyour users to confirm what TIN appears on the 1099 tax form or assist them with\ngetting a corrected version of their 1099 tax form. You can also download the\nuser’s tax form from the Tax reporting dashboard and email it to them directly.\nOnly team members with the Tax Analyst role are able to access this information.\n\n## Why are payouts blocked, restricted, or show as restricted soon for my account?\n\nYour connected account might get blocked after they update their information for\na few different reasons:\n\n- If you have applied a capability such as a 1099 capability, and they update\ntheir name or TIN to a value that doesn’t match against the IRS database then\nthey must update their information with a valid name and TIN combination.\n- If your connected account was verified previously and changes their name or\nTIN, they’re prompted to re-sign a Terms of Service agreement. Failure to do so\nmight result in payouts being blocked until your account re-signs their Terms of\nService agreement.\n- If your connected account updates their details with values that can’t be\nverified against standard government databases, they might be asked to upload\nproof of identity that helps Stripe identify them. Failure to do so results in\npayouts being blocked. Your accounts can go into an interface built by Stripe\nand submit proof of identity.\n\n## Are Taxpayer Identification Numbers (TINs) checked against the IRS database?\n\nTIN is verified against the IRS database if:\n\n- You have applied the 1099-K, 1099-MISC, or any other capabilities that require\na verified TIN, and\n- The connected account meets the threshold for the applied\n[capability](https://docs.stripe.com/connect/required-verification-information-taxes#required-information).\n\nConnected accounts that enter an incorrect Name-TIN combination might see their\npayouts paused until they [update their Name and\nTIN](https://support.stripe.com/express/questions/how-do-i-update-my-tax-information)\nwith verified information.\n\n## I made a correction to a 1099, how long does this take to sync?\n\nYou can correct only tax forms that the IRS has accepted. To start a correction,\nupdate the data in the tax forms. You can use either the Tax form editor or CSV\nexport to update the tax form. After you update the form, select the updated\nform on the **Tax reporting** page, then click **Correct** to create a\ncorrection. It can take up to 48 to 72 hours after the platform files the\ncorrection for the payee notification.\n\n## Are my connected accounts able to consolidate their view of taxes across platforms?\n\nIf you are choosing to deliver to the Express Dashboard, as they get paid from\ndifferent platforms, Stripe Express users can add each platform to the same\nStripe Express accounts to create a single view of their earnings and their tax\nforms.\n\n## Is there a Stripe support address we can direct users to in our help center or is this only available in the onboarding flow of the Express Dashboard?\n\nIf you are choosing to deliver to the Express Dashboard, direct users to\n[https://support.stripe.com/express](https://support.stripe.com/express). From\nhere they can contact Stripe which ensures their questions are routed to a\nspecialized support group best able to help them.\n\n## If a connected account owner consents to e-delivery, do they still get a mailed copy?\n\nIf the platform has paper delivery enabled, Stripe presents the connected\naccount owner with the option to request this method of delivery. If they select\nthis option, then Stripe mails the paper copy of their tax form to the address\nthe platform has on file. Note the option to also request a paper copy is\ncurrently only available in the Stripe Express Dashboard.\n\n## What tax details are prompted for during the pre-verification?\n\nFor merchants set up as US Companies, Stripe’s 1099 product uses the business\ntax details except when they’re set up as a single member LLC or sole\nproprietorship, in which case it uses the owner’s personal tax details because\nthose account types are disregarded entities for income tax purposes according\nto the IRS. For Individuals, Stripe uses personal tax details. For more\ninformation, refer to [Updating 1099 tax form details for connected\naccounts](https://support.stripe.com/questions/updating-1099-tax-form-details-for-connected-accounts).\n\nIf a connected account requests to use their business tax details on their 1099\ntax form, and you want to support that, you can make the changes by collecting\nthe business tax details from the user, and [updating the 1099 tax forms using\nCSV\nimport](https://docs.stripe.com/connect/modify-tax-forms?method=csv#1099-csv-schema)\nor the [Tax Form\nEditor](https://docs.stripe.com/connect/modify-tax-forms?method=dashboard#understanding-the-tax-form-editor-ui)\nonce tax form totals are finalized in January.\n\n## How can a connected account get their invitation email sent again?\n\nThe connected account owner can request a new invitation link that’s sent to\ntheir email. Direct them to [this support\npage](https://support.stripe.com/express/how-do-i-get-a-new-invite-link) to\nresend their own invitation email. Ineligible users (connected accounts that\ndidn’t meet the 2024 threshold of $600 for NEC/MISC or $5,000 and 0 transactions\nfor K) don’t receive an email from Stripe.\n\n## My connected account did not receive a pre-filing confirmation email\n\nTo check whether your connected account has received an email invite, go to the\n[1099 Dashboard page](https://dashboard.stripe.com/connect/taxes/forms). If the\npre-filing confirmation status is **Sent**, Stripe attempted outreach to your\nuser. If the status is **Queued** or **Not eligible**, like the example below,\nStripe hasn’t sent an invite yet.\n\n![Tax form with pre-filing confirmation\nstatus](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-pre-filing-confirmation-status.15e4a385e3360ece2cd743f4285e93b3.png)\n\nTo send your user the pre-filling confirmation email, first confirm that their\nemail address in Stripe is correct. Then, follow these steps:\n\n![Request pre-filing confirmation\nlink](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-request-pre-filing-confirmation-link.fb53ecb1d73b4bbacf9f92b5a7c055b4.png)\n\n![Request pre-filing confirmation\nmodal](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-request-pre-filing-confirmation-modal.04e45b1768e12dbd2a3db1bdd09bc85c.png)\n\nIf Stripe hasn’t sent the pre-filing confirmation email, confirm that your\nuser’s email in Stripe matches the email where they expect to receive the tax\nform.\n\nTo update your user’s email address, follow the steps below. Learn more about\nother ways to [update emails for your\naccounts](https://docs.stripe.com/connect/express-dashboard-taxes#how-do-i-update-the-email-address).\n\n![Account email\naddress](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-account-email.d60fd2c08eb5fedad766f98b0e5b9502.png)\n\n![Edit account email address\nmodal](https://b.stripecdn.com/docs-statics-srv/assets/tax-forms-edit-account-email-modal.834f62cb61d6a4f2574e40b0e4146347.png)\n\n## My connected account was locked out of their Stripe Express account for failing the verification process. How can I resolve this issue?\n\nConnected accounts must claim their Stripe Express accounts in order to view the\nTax Forms page in the Stripe Express Dashboard. To authorize the claim, Stripe\nasks the user a series of questions to verify their identity. For security\nreasons, if the user fails to correctly answer the verification questions too\nmany times, Stripe locks their account. You can see the status in the 1099\ndashboard. A status of “Not claimed, no attempts left” means the connected\naccount is locked. A “Claimed” status means the connected account claimed their\nStripe account.\n\n![Account status in manual review\nstate](https://b.stripecdn.com/docs-statics-srv/assets/account-in-manual-review.bbed96bd10b2a7a94fdb55fcb512e362.png)\n\nYou can reset your user’s claim attempts in the 1099 Dashboard. Before removing\nthem from manual review, we recommend reviewing and updating account claim\ninformation (such as representative name, address, SSN, EIN, and DOB) with your\nconnected account. Otherwise, the account might continue to fail to claim their\nExpress account.\n\n![Dropdown menu option to remove account from manual\nreview](https://b.stripecdn.com/docs-statics-srv/assets/remove-account-manual-review.95ba03fb935a58d7d31a968462efa9d1.png)\n\nIf there’s a mismatch between the information you have on file and what your\nuser expects, you can\n[update](https://docs.stripe.com/connect/updating-service-agreements) their\nconnected account directly. You can’t make updates in the 1099 Dashboard and you\nmust have the correct [user\nrole](https://docs.stripe.com/get-started/account/teams/roles).\n\n## Links\n\n- [Stripe Express Dashboard](https://docs.stripe.com/connect/express-dashboard)\n- [1099 Tax Support and Communication\nGuide](https://docs.stripe.com/connect/platform-express-dashboard-taxes)\n- [product\nwalk-through](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough)\n- [Connect embedded\ncomponents](https://docs.stripe.com/connect/deliver-tax-forms#file-deliver-embedded)\n- [component links](https://docs.stripe.com/connect/embedded-comms)\n- [notable\nexceptions](https://docs.stripe.com/connect/deliver-tax-forms#e-delivery-with-stripe-express)\n- [Account Management\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/account-management)\n- [Update](https://docs.stripe.com/api/accounts/update#update_account-email)\n- [Emails page](https://dashboard.stripe.com/settings/connect/emails)\n- [upcoming payouts and\nearnings](https://docs.stripe.com/connect/customize-express-dashboard#set-custom-descriptions)\n- [Documents\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/documents)\n- [Tax reporting](https://dashboard.stripe.com/connect/taxes/forms)\n- [CSV\nimport](https://docs.stripe.com/connect/modify-tax-forms?method=csv#import-tax-forms)\n- [Connect branding\nsettings](https://dashboard.stripe.com/settings/connect/stripe-dashboard/branding)\n- [See an\nexample](https://help.doordash.com/dashers/s/article/Common-Dasher-Tax-Questions?language=en_US)\n-\n[capability](https://docs.stripe.com/connect/required-verification-information-taxes#required-information)\n- [update their Name and\nTIN](https://support.stripe.com/express/questions/how-do-i-update-my-tax-information)\n- [https://support.stripe.com/express](https://support.stripe.com/express)\n- [Updating 1099 tax form details for connected\naccounts](https://support.stripe.com/questions/updating-1099-tax-form-details-for-connected-accounts)\n- [updating the 1099 tax forms using CSV\nimport](https://docs.stripe.com/connect/modify-tax-forms?method=csv#1099-csv-schema)\n- [Tax Form\nEditor](https://docs.stripe.com/connect/modify-tax-forms?method=dashboard#understanding-the-tax-form-editor-ui)\n- [this support\npage](https://support.stripe.com/express/how-do-i-get-a-new-invite-link)\n- [update](https://docs.stripe.com/connect/updating-service-agreements)\n- [user role](https://docs.stripe.com/get-started/account/teams/roles)",
  "metadata": {
    "title": "Deliver tax forms with an interface built by Stripe | Stripe Documentation",
    "description": "Learn how to e-deliver tax forms to connected accounts with an interface built by Stripe.",
    "sourceURL": "https://docs.stripe.com/connect/express-dashboard-taxes"
  }
}