{
  "content": "# Flexible coupons and promotion codes\n\n## Add discounts to subscriptions and subscription items using coupons and promotion codes.\n\nRedeem coupons to apply discounts to the subscriptions you offer. You can also\nuse coupons to create promotion codes to share with your customers. Customers\ncan redeem these promotion codes to apply discounts to their subscriptions.\n\nYou can use coupons and promotion codes to:\n\n- Apply one or more discounts to every\n[invoice](https://docs.stripe.com/api/invoices), a specific invoice, or for a\ncertain duration of time\n- Apply one or more discounts to every subscription a customer has or to\nspecific subscriptions\n- Apply one or more discounts to specific subscription items\n- Reduce invoice amounts by a percentage or a flat amount\n\nYou can also define a coupon that a customer must redeem by a certain date, or\nthat’s limited to a set number of redemptions across all of your customers.\n\nTo use discounts for one-time payments, see [Add discounts for one-time\npayments](https://docs.stripe.com/payments/checkout/discounts).\n\n## Coupons\n\nTo apply discounts to a customer or a customer’s charges, redeem coupons into\ndiscounts. Learn how to create and manage coupons in the following sections.\n\n### Create a coupon\n\nCreate coupons in the Dashboard or with the\n[API](https://docs.stripe.com/api/coupons/create):\n\nDashboardAPI- In the Dashboard, open the\n[Products](https://dashboard.stripe.com/test/products?active=true) page.\n- Click **Coupons**.\n- Click **+New**.\n- In the **Create a coupon** dialog, enter the coupon’s parameters.\n- Click **Create coupon**.\n\nHere are all the settings for coupons.\n\nSettingDescriptionNameThe name of the coupon that appears on receipts and\ninvoices.ID optionalA unique identifier for the coupon in the API. If you leave\nthis field blank, Stripe generates an ID for you.TypeDetermines whether a coupon\ndiscounts a subscription by a fixed amount or by a percentage.\n**Percentage off** or **Discount amount**\n\nIndicates how much the coupon actually discounts.\n\nIf you sell in multiple currencies, a single coupon can define different\ndiscount amounts for different currencies. Multi-currency coupons follow the\nsame rules as [multi-currency\nprices](https://docs.stripe.com/products-prices/pricing-models#multicurrency).\n\nApply to specific products optionalLimits the type of items that the coupon can\napply to.DurationIndicates how long the coupon is valid for.Redemption limits\noptionalAllows you to limit when a customer can redeem the coupon and the number\nof times a coupon can be redeemed.Codes optionalAllows you to create [promotion\ncodes](https://docs.stripe.com/billing/subscriptions/coupons#promotion-codes--promotion-codes)\nfor the coupon.\nYou can only edit the name of the coupon after creation.\n\n### Set eligible products\n\nDashboardAPI\nTo set the products that are eligible for discounts, add the relevant product in\nthe **Apply to specific product** field. Any promotion codes that are associated\nwith the coupon are also restricted to this list of eligible products.\n\nIf you configure a coupon to apply to specific products and a subscription\ndoesn’t have any applicable products, no discount is applied when you add the\ncoupon to the subscription.\n\nWhen you [make changes](https://docs.stripe.com/billing/subscriptions/change) to\na subscription, any existing discounts are applied when proration is calculated.\nYou can’t discount proration line items further on the invoice that’s generated.\n\n### Apply coupons to subscriptions\n\nAfter you’ve created coupons, create a discount by applying them to a\nsubscription. You can apply the coupon when you create the subscription or by\n[updating a customer’s existing\nsubscription](https://docs.stripe.com/api#update_subscription).\n\nDashboardAPI- In the Dashboard, open the **Billing** page and click\n**Subscriptions**.\n- Click the relevant subscription.\n- Click **Actions**.\n- Click **Update subscription**.\n- Click **Add coupon**.\n- Select one or more coupons from the dropdown menus and click **Submit**.\n\nYou can still create a subscription when a customer doesn’t have a stored\npayment method if no immediate payment is required after you apply coupons to\nit.\n\n### Apply coupons to customers\n\nIf you add a coupon to a customer, the coupon applies to all subscriptions for\nthat customer, including subscriptions added later. To prevent discounting all\nrecurring charges for a customer, add coupons to subscriptions instead of\ncustomers.\n\nA coupon attached to a subscription takes priority over a coupon attached to a\ncustomer. If you add coupons to a subscription, any coupons attached to the\ncustomer are not automatically applied. You must add the customer coupons to the\nsubscription if you want those to apply as well.\n\nDashboardAPI- In the Dashboard, open the\n[Customers](https://dashboard.stripe.com/test/customers) page and select the\ncustomer.\n- Click **Actions**\n- Click **Apply coupon**.\n- Select a coupon from the dropdown menu and click **Submit**.\n\n### Apply coupons to Checkout\n\nApply coupons to subscriptions in a Checkout Session by setting the `discounts`\nparameter in the\n[API](https://docs.stripe.com/api/checkout/sessions/create#create_checkout_session-discounts).\nTo create a session with an applied discount, pass the coupon ID in the `coupon`\nparameter of the `discounts` array. This coupon overrides any coupon on the\ncustomer.\n\nIf you’re creating a subscription with an existing customer, any coupon\nassociated with the customer is applied to the subscription’s invoices.\n\n```\ncurl https://api.stripe.com/v1/checkout/sessions \\\n -u sk_test_BQokikJOvBiI2HlWgH4olfQ2: \\\n -d \"payment_method_types[]\"=card \\\n -d \"line_items[][price]\"={{PRICE_ID}} \\\n -d \"line_items[][quantity]\"=1 \\\n -d mode=subscription \\\n -d \"discounts[][coupon]\"=\"{{COUPON_ID}}\" \\\n -d success_url=\"https://example.com/success\" \\\n -d cancel_url=\"https://example.com/cancel\"\n```\n\n### Delete coupons\n\nYou can delete coupons with the Dashboard or the\n[API](https://docs.stripe.com/api/coupons/delete).\n\nDeleting a coupon prevents it from being applied to future subscriptions or\ncustomers, but it doesn’t remove the discount from any subscription or customer\nthat already has it.\n\nDashboardAPI- In the Dashboard, open the\n[Products](https://dashboard.stripe.com/test/products?active=true) page.\n- Click **Coupons**\n- Click the relevant coupon.\n- Click the overflow menu ().\n- Click **Delete coupon**.\n\n### Coupon duration\n\nA coupon’s duration indicates how long the redeemed\n[discount](https://docs.stripe.com/api/#discounts) is valid for. For example, a\ncoupon for 50% off with a duration of 4 months applies to all invoices in the 4\nmonth period starting when the coupon is first applied. If a customer applies\nthis coupon to a yearly subscription during the coupon’s 4 month period, the 50%\ndiscount applies to the entire yearly subscription. In a monthly subscription,\nthe coupon applies to the first 4 months. For a weekly subscription, a 4 month\ncoupon applies to every invoice in the first 4 months.\n\nIf you’re configuring a coupon’s duration in the API, when you use the value\n`repeating` you must specify `duration_in_months` as the number of months that\nthe coupon repeatedly applies to. If you set the duration to `once`, the coupon\napplies only to the first invoice. If you set the duration to `forever`, the\ncoupon applies to all invoices indefinitely.\n\n### Redemption limits\n\nRedemption limits apply to the coupon across every customer. For example, if you\nlimit the number of times a coupon can be redeemed to 50, you can apply it to\nyour customers only 50 times. This can be one time each for 50 different\ncustomers, one customer 50 times, or multiple customers multiple times until the\nmax of 50 times.\n\nIf you set a coupon to last forever when a customer uses it but the coupon has\nan expiration date, any customer given that coupon will have that coupon’s\ndiscount forever. No new customers can apply the coupon after the expiration\ndate.\n\n## Promotion codes\n\nPromotion codes are customer-facing codes that you create for coupons. For\nexample, FALLPROMO and SPRINGPROMO can both point to a single 25% off coupon.\nYou can share promotion codes directly with your customers to use at checkout.\n\nIf you’ve implemented the [customer\nportal](https://docs.stripe.com/billing/subscriptions/customer-portal) and\nturned on promotion codes, customers can apply a discount when upgrading or\ndowngrading their existing subscriptions in the portal.\n\nCustomize controls and limits on promotion codes by specifying eligible\ncustomers, first time orders, minimum order values, expiration dates, and\nredemption limits.\n\n### Restrictions\n\nThere are some restrictions to promotion codes.\n\n- You can’t apply a promotion code with amount restrictions on:- [Customer\nobjects](https://docs.stripe.com/api/customers/object)\n- [Subscription Item\nobjects](https://docs.stripe.com/api/subscription_items/object)\n- [Invoice Item objects](https://docs.stripe.com/api/subscription_items/object)\n- [Subscriptions objects](https://docs.stripe.com/api/subscriptions/object) when\nyou make an update\n- Future phases on [Subscription Schedule\nobjects](https://docs.stripe.com/api/subscription_schedules/object)\n\n### Create promotion codes\n\nDashboardAPI\nYou can create a promotion code in the Dashboard when you [create a\ncoupon](https://docs.stripe.com/billing/subscriptions/coupons#create-coupons--create-coupons).\n\nThe **Code** is case-insensitive and unique across active promotion codes for\nany customer. For example:\n\n- You can create multiple customer-restricted promotion codes with the same\n**Code**, but you can’t reuse that **Code** for a promotion code that any\ncustomer can redeem.\n- If you create a promotion code that is redeemable by any customer, you can’t\ncreate another active promotion code with the same **code**.\n- You can create a promotion code with one **Code**,\n[inactivate](https://docs.stripe.com/billing/subscriptions/coupons#inactive-promotions--inactivate)\nit, and then create a new promotion code with the same **Code**.\n- In the Dashboard on the [Create a\ncoupon](https://dashboard.stripe.com/test/coupons/create) page, click the **Use\ncustomer-facing coupon codes** button.\n- Enter a code. This is the code that a customer enters at checkout to redeem\nthe discount. If you don’t set a code, Stripe generates one for you.\n- Select requirements for the promotion code. For example, you can restrict the\ncoupon to only being valid on first-time orders.\n\nWhen you create a promotion code, it inherits the configuration of the\nassociated coupon.\n\n### Promotion code configurations\n\nBy configuring the promotion code settings, you can customize the following:\n\n- Which customers are eligible to use a promotion code\n- How many times a customer can redeem a promotion code\n- When a promotion code expires\n- Set a minimum amount a promotion code can apply to\n\n### Limit by customer\n\nDashboardAPI\nTo limit a promotion code to a particular customer complete these steps:\n\n- On the [Create a coupon](https://dashboard.stripe.com/test/coupons/create)\npage, select **Limit to a specific customer**.\n- Select the relevant customer. If you don’t specify a customer, any customer\ncan redeem the promotion code.\n\n### Limit by first time order\n\nDashboardAPI\nTo limit a promotion code to a customer’s first order, on the [Create a\ncoupon](https://dashboard.stripe.com/test/coupons/create) page, select\n**Eligible for first-time order only**.\n\n### Set a minimum amount\n\nDashboardAPI\nTo set an minimum amount that is eligible for a promotion code, on the [Create a\ncoupon](https://dashboard.stripe.com/test/coupons/create) page, select **Require\nminimum order value** and enter the minimum value.\n\nBecause promotion code restrictions are checked at redemption time, the minimum\ntransaction amount only applies to the initial payment for a subscription.\n\nIf the coupon supports multiple currencies, the minimum amount can be different\nper-currency.\n\n### Customize expirations\n\nDashboardAPI\nTo set an expiration date for a promotion code, on the [Create a\ncoupon](https://dashboard.stripe.com/test/coupons/create) page, select **Add an\nexpiration date** and the date and time at which the promotion code expires.\n\nIf the underlying coupon already has an expiration date set, then the promotion\ncode’s expiration date can’t be later than the coupon’s.\n\nFor example, you might have plans to support a coupon for a year, but you only\nwant it to be redeemable for one week after a customer receives it. To do this,\nset the coupon’s expiration date to one year from now, and set each the\npromotion code’s expiration date to one week after it is created.\n\n### Limit redemptions\n\nDashboardAPI\nTo set the number of times a customer can redeem the promotion code, on the\n[Create a coupon](https://dashboard.stripe.com/test/coupons/create) page, select\n**Limit the number of times this code can be redeemed** and enter the number.\n\nIf the underlying coupon already has a maximum number of times set, then the\npromotion code’s maximum redemptions can’t be greater than the coupon’s.\n\n### Deactivate promotion codes\n\nDashboardAPI\nTo deactivate a promotion code, doing the following steps:\n\n- In the Dashboard, open the\n[Products](https://dashboard.stripe.com/test/products?active=true) page.\n- Click **Coupons**.\n- Click the coupon whose promotion code you want to deactivate.\n- In the relevant promotion code row, click the overflow menu ().\n- Click **Archive promotion code**.\n\nHowever, if the underlying coupon for a promotion code becomes invalid, all of\nits promotion codes become permanently inactive. Similarly, if a promotion code\nreaches its maximum redemption limit or its expiration date, it becomes\npermanently inactive. These promotion codes can’t be reactivated.\n\n### Apply promotion codes to subscriptions\n\nAfter you create a promotion code, redeem a discount by applying the promotion\ncode to a subscription. You can apply promotion codes two ways:\n\n- When you [create a\nsubscription](https://docs.stripe.com/api#create_subscription)\n- When you [update a customer’s existing\nsubscription](https://docs.stripe.com/api#update_subscription)\nDashboardAPI- In the Dashboard, go to **Billing** > **Subscriptions**.\n- Click the relevant subscription.\n- Click **Actions** > **Update subscription** > **Add coupon**.\n- Click a promotion code from the dropdown menu and click **Submit**.\n\n### Add promotion codes to Checkout\n\nEnable promotion codes with the API by setting the\n[allow_promotion_codes](https://docs.stripe.com/api/checkout/sessions/object#checkout_session_object-allow_promotion_codes)\nparameter in Checkout Sessions. When `allow_promotion_codes` is enabled on a\nCheckout Session, Checkout includes a promotion code redemption box for your\ncustomers to use.\n\n![Promotion code field at\ncheckout](https://b.stripecdn.com/docs-statics-srv/assets/promo_code_checkout.c07ef6d4f0b1b3f9a8a7e4bbba83d56f.png)\n\nPromotion code field at checkout\n\n## Stackable coupons and promotion codes\n\nYou can add multiple coupons, promotion codes, or redeemed\n[discounts](https://docs.stripe.com/api/#discounts) to a customer’s list of\ncharges. You can do this when [creating a\nsubscription](https://docs.stripe.com/api#create_subscription) or by [updating a\ncustomer’s existing\nsubscription](https://docs.stripe.com/api#update_subscription).\n\nWe support multiple discounts on both subscriptions and subscription items.\n\nWhen you create a subscription with stackable discounts, each discount applies\nin order to all items on the subscription. The order of the discounts is\nimportant if you use both `amount_off` and `percent_off`. For example, the\nfollowing stacked discounts apply differently:\n\n- 20% off *then* $5 off\n- $5 off *then* 20% off\nDashboardAPI- In the Dashboard, go to **Billing** > **Subscriptions**.\n- Click the relevant subscription.\n- Click **Actions** > **Update subscription** > **Add coupon**.\n- Click coupons from the dropdown menus and click **Submit**.\n- Click the relevant product.\n- Click **Add coupons**.\n- Click coupons from the dropdown menus and click **Submit**.\n\n#### Note\n\nYou can start using the new `discounts` parameter on any subscription. We\nautomatically clear out the singular `discount` field when `discounts` with more\nthan one entry is passed in an update.\n\n### Restrictions\n\nThere are some restrictions to using multiple discounts.\n\n- You can set up to 20 entries in the `discounts` parameter.\n- Each entry in `discounts` has to be unique.\n- You can not pass in a coupon and a promotion code created from the same\ncoupon.\n- You can not pass in a coupon and a discount that is generated from the same\ncoupon.\n- Redeemed discounts must already be attached to the customer or subscription\nthat you’re updating.\n\n### Update a subscription\n\nYou don’t need to set `discounts` if you don’t intend to make changes to\nexisting discounts.\n\nWhen updating `discounts`, you need to pass in any previously set `coupon`,\n`promotion_code` or `discount` you want to keep on the subscription.\n\nPass `discounts = \"\"` to clear all discounts from the subscription. When a\nsubscription has no discounts, the customer-level discount, if any, applies to\ninvoices.\n\nIf you have already set more than one discount on a subscription with the new\n`discounts` parameter, you can not update the subscription with the deprecated\n`coupon` or `promotion_code` parameter. Similarly, you can not update a\nschedule’s phases with the deprecated `coupon` or `promotion_code` parameter if\nyou have set more than one discount on a prior phase.\n\nUpdating `discounts` does not incur prorations or generate an invoice on its\nown. The new discounts are applied the next time the subscription creates an\ninvoice.\n\n## Alternative discount methods\n\nAlthough coupons are the most common way to discount a subscription, you can\nalso do the following:\n\n- Add a negative [customer\nbalance](https://docs.stripe.com/api#customer_object-balance) to the customer.\n- Add negative [invoice\nitems](https://docs.stripe.com/billing/invoices/subscription#adding-draft-invoice-items).\n- Add a [second\nprice](https://docs.stripe.com/products-prices/manage-prices#create-price) that\nis a cheaper version of a product’s usual price.\n\nOf these methods, negative invoice items provide more detailed information as to\nwhat discount was created, when, and why.\n\n## See also\n\n- [Changing subscriptions](https://docs.stripe.com/billing/subscriptions/change)\n- [Working with invoices](https://docs.stripe.com/billing/invoices/subscription)\n- [Coupons API](https://docs.stripe.com/api#coupons)\n- [Promotion codes API](https://docs.stripe.com/api#promotion_codes)\n\n## Links\n\n- [invoice](https://docs.stripe.com/api/invoices)\n- [Add discounts for one-time\npayments](https://docs.stripe.com/payments/checkout/discounts)\n- [API](https://docs.stripe.com/api/coupons/create)\n- [Products](https://dashboard.stripe.com/test/products?active=true)\n- [multi-currency\nprices](https://docs.stripe.com/products-prices/pricing-models#multicurrency)\n- [make changes](https://docs.stripe.com/billing/subscriptions/change)\n- [updating a customer’s existing\nsubscription](https://docs.stripe.com/api#update_subscription)\n- [Customers](https://dashboard.stripe.com/test/customers)\n-\n[API](https://docs.stripe.com/api/checkout/sessions/create#create_checkout_session-discounts)\n- [API](https://docs.stripe.com/api/coupons/delete)\n- [discount](https://docs.stripe.com/api/#discounts)\n- [customer\nportal](https://docs.stripe.com/billing/subscriptions/customer-portal)\n- [Customer objects](https://docs.stripe.com/api/customers/object)\n- [Subscription Item\nobjects](https://docs.stripe.com/api/subscription_items/object)\n- [Subscriptions objects](https://docs.stripe.com/api/subscriptions/object)\n- [Subscription Schedule\nobjects](https://docs.stripe.com/api/subscription_schedules/object)\n- [Create a coupon](https://dashboard.stripe.com/test/coupons/create)\n- [create a subscription](https://docs.stripe.com/api#create_subscription)\n-\n[allow_promotion_codes](https://docs.stripe.com/api/checkout/sessions/object#checkout_session_object-allow_promotion_codes)\n- [customer balance](https://docs.stripe.com/api#customer_object-balance)\n- [invoice\nitems](https://docs.stripe.com/billing/invoices/subscription#adding-draft-invoice-items)\n- [second\nprice](https://docs.stripe.com/products-prices/manage-prices#create-price)\n- [Working with invoices](https://docs.stripe.com/billing/invoices/subscription)\n- [Coupons API](https://docs.stripe.com/api#coupons)\n- [Promotion codes API](https://docs.stripe.com/api#promotion_codes)",
  "metadata": {
    "title": "Flexible coupons and promotion codes | Stripe Documentation",
    "description": "Add discounts to subscriptions and subscription items using coupons and promotion codes.",
    "sourceURL": "https://docs.stripe.com/billing/subscriptions/coupons"
  }
}