{
  "content": "# Subscription and cancellation policies\n\n## Learn about subscription fees and cancellation policies.\n\nStripe offers annual subscription plans for various products. These plans\ninclude a set product usage entitlement and require an annual commitment. Learn\nhow to manage your subscription, including cancellation, renewal, and billing\nprocesses using this guide.\n\n## Cancel a subscription\n\nAll of our subscription plans require a **one-year** commitment. Your annual\ncontract begins at midnight UTC of the day after you sign up, and runs for 1\nyear. After you enroll, you’re responsible for paying subscription fees and\npotential overage fees incurred for the full term, regardless if you schedule a\ncancellation before your contract ends.\n\nSubscription plans automatically renew for another one year term unless you\nschedule a cancellation before the renewal date.\n\nTo prevent automatic renewal, you must:\n\n- Cancel your subscription at least 24 hours in advance of your renewal date\n- Have [administrator\naccess](https://docs.stripe.com/get-started/account/teams/roles)\n\nTo schedule a cancellation of your subscription:\n\n- Navigate to your account’s [settings\npage](https://dashboard.stripe.com/settings).\n- Click **Your plans**.\n- Find the plan you want to cancel, and click **Manage plan**.\n- Click **Cancel**, and review and confirm your cancellation. Your plan’s detail\npage displays the scheduled cancellation date.\n\nAfter your current contract period ends, your account will automatically\ntransition to a [pay-as-you-go plan](https://stripe.com/pricing).\n\n#### Note\n\nStripe subscription plans require an annual commitment. When you subscribe, you\nagree to pay for the full annual term, including any incurred overage fees.\n**Payments are non-refundable**, and we don’t offer prorated refunds if you\ncancel before the end of your term.\n\n## Stripe subscription fees\n\nAll of our subscriptions require an annual commitment. A subscription fee covers\nproduct usage up to the entitlement limit for your selected plan during your\ncurrent term. If usage exceeds your entitlement, overage fees will apply.\n\nTo learn more about these fees, see our [pricing](https://stripe.com/pricing).\n\n## Product usage entitlements\n\nProduct usage entitlement is the amount of usage included in your subscription\nplan. This is the limit you selected when signing up, and it determines how much\nof the product you can use without incurring additional charges. If you exceed\nthis entitlement, overage fees apply.\n\n## Overage fees\n\nOverage fees are additional fees incurred when product usage entitlement is\nexceeded. These fees only apply to usage beyond your selected product\nentitlement and are billed at the end of your billing period monthly. For Stripe\nTax subscriptions, any fees for non-US tax filings will appear as overages.\n\nThe following examples illustrate typical overage fees:\n\nServicePlan LimitOverage ExampleOverage ChargeStripe Billing100,000 USD in\nmonthly processingProcess 150,000 USD0.67% on extra 50,000 USDStripe Tax1,000\ntransactions per monthProcess 1,200 transactions0.48 USD per extra transaction\n(200 transactions)Stripe Tax filing12 U.S. tax filings per yearComplete 14 U.S.\nfilings55 USD per additional filing (2 filings)\n## Charge schedule and bills\n\nYou’ll be charged your recurring subscription fee when your subscription starts,\nand again at the start of every subsequent billing period thereafter (this\naligns with whichever plan you selected). You’ll be charged for any overage fees\nat the end of the month that they were incurred.\n\n### Stripe Billing example:\n\n**Billing Schedule**:\n\n- Contract term: If you sign up on September 14, 2025, your contract runs from\nSeptember 15, 2025, at 00:00 UTC – September 14, 2026, at 23:59 UTC.\n- Subscription fee: $7,440 USD for the year, billed in monthly installments of\n$620 USD plus applicable taxes.\n- Billing cycle: The first $620 USD subscription charge occurs on September 15,\nfollowed by October 15, November 15, and so on.\n\n**Overage Fees**:\n\nOverage fees apply if you exceed your product usage entitlement. In this\nexample, the usage entitlement is 100,000 USD per month. These are charged at\nthe end of the billing period in which they occur.\n\n- Monthly usage (September 15 – October 14): $150,000 USD processed\n- Overage: $50,000 USD beyond entitlement\n- Overage charge: $335 USD (50,000 × 0.67%)\n- October 15 Bill:- $335 USD overage fee (for September 15 – October 14)\n- $620 USD monthly subscription fee (for October 15 – November 14)\n\n### Stripe Tax example:\n\n**Billing Schedule**:\n\n- Contract term: If you sign up on September 14, 2025, your contract runs from\nSeptember 15, 2025, at 00:00 UTC – September 14, 2026, at 23:59 UTC.\n- Subscription fee: $1,080 USD for the year, billed in monthly installments of\n$90 USD plus applicable taxes.\n- Billing cycle: The first $90 USD subscription charge occurs on September 15,\nfollowed by October 15, November 15, and so on.\n\n**Overage Fees**:\n\nOverage fees apply if your usage exceeds your product usage entitlement. These\nare charged at the end of the billing period in which they occur.\n\n- Monthly usage (September 15 – October 14):- 1,500 calculation API calls\n- 300 transactions\n- 3 U.S. tax registrations\n- 1 U.S. filing\n- Entitlement exceeded:- 100 additional transactions → $50 USD overage fee\n($0.50 × 100)\n- 1 additional U.S. tax registration → $150 USD overage fee\n- October 15 Bill:- $200 USD overage fee (for September 15 – October 14)\n- $90 USD monthly subscription fee (for October 15 – November 14)\n\nFor more details on subscription pricing and overage rates, see [Stripe\nPricing](https://stripe.com/pricing). If you have any questions about your bill,\n[contact Stripe](https://support.stripe.com/?contact=true).\n\n## How Stripe charges you\n\nYour subscription fee is deducted from your Stripe account balance. Standard\n[terms and conditions](https://stripe.com/legal/ssa) for payments made via your\nStripe Account balance apply.\n\n## Minimum contractual commitment for subscription-based plans\n\nAll of our subscription plans require an annual commitment. Your annual contract\nstarts at midnight UTC of the day after you sign up, and ends 1 year later.\nAfter you sign up for a subscription, *you’re responsible for paying for the\nentire year*, even if you schedule a cancellation during your current term.\n\nIf you’re looking for something more flexible, we have [pay-as-you-go pricing\nplans](https://stripe.com/pricing).\n\n## Automatic subscription renewals\n\nAll of our subscription plans automatically renew on the anniversary date for an\nadditional 1 year term. If you don’t want to automatically renew, you need to\nschedule a cancellation of your subscription before the auto-renew date, as\noutlined in our [cancellation\npolicy](https://docs.stripe.com/finance-automation/subscription-pricing/cancel#cancel-a-subscription).\n\n## Accidental cancellations\n\nIf you scheduled a subscription cancellation by mistake, you can undo this at\nany time before the contract renewal date:\n\n- Navigate to your account’s [settings\npage](https://dashboard.stripe.com/settings).\n- Click **Your plans**.\n- Find the plan you want to re-subscribe:\n- If your plan is scheduled to be canceled, click **Revert cancellation** below\nthe cancellation details and confirm.\n- If your cancellation has already occurred, you need to resubscribe by clicking\n**View plans** and following the steps to subscribe again.\n\nAfter reinstated, your subscription will automatically renew on the original\nauto-renew date (your 1 year contract anniversary).\n\n## Changing your plan\n\nYou can *upgrade* your plan at any time.\n\n### Stripe Billing\n\nYou can *upgrade* your plan at any time. The plan will be effective at the start\nof your next billing period. For example, if you’re charged on the 15th of every\nmonth, and you upgrade your plan on October 20, the new upgraded price and usage\nentitlement is applied effective November 15.\n\nYou can’t downgrade your plan below your initial subscription plan during the\ncontract period. For example, if you sign up for the plan with 250,000 USD in\nBilling volume, you can upgrade to the 500,000 USD Billing volume tier, but\ncan’t downgrade to the 100,000 USD Billing volume tier during the contract\nperiod. However, you can schedule a downgrade to the 100,000 USD tier to go into\neffect for the next annual contract period.\n\n### Stripe Tax\n\nYou can upgrade your plan at any time. When you upgrade, your existing plan is\ncanceled and a new subscription with an annual commitment begins. The new plan\ntakes effect at the start of your next billing period and any remaining\nentitlements from your previous subscription will no longer be available after\nthis date.\n\n**Example: Upgrading Your Subscription**\n\nIf you have an annual Stripe Tax plan at 430 USD per month that started on\nSeptember 15, 2024 at 00:00 UTC, and you choose to upgrade to a 1,000 USD per\nmonth plan on October 31 2024:\n\n- **Existing subscription**: Your current plan remains active until November 14,\n2024, at 23:59 UTC, at which point it will be cancelled. Any remaining\nentitlements from this plan will no longer be available after this date.\n- **New subscription**: Your new plan begins on November 15, 2024, at 00:00 UTC\nwith a new contract term running until November 14, 2025, at 23:59 UTC. Your\nupdated product usage entitlement starts at this time.\n\nYou can schedule a downgrade of your tax subscription and this will take effect\nat the end of your current contract period.\n\nTo upgrade or downgrade:\n\n- Navigate to your account’s [settings\npage](https://dashboard.stripe.com/settings).\n- Click on **Your plans**.\n- Find the plan you want to change and click **Manage plan**.\n- Click **View plans** to see the options available.\n- Choose a new plan and follow the prompts to finalize the change.\n\n## Monthly plans\n\nCurrently all Stripe subscriptions require an annual commitment and are billed\nmonthly. If you need more flexibility, we have [pay-as-you-go pricing\nplans](https://stripe.com/pricing).\n\n## Failed and missed payments\n\nStripe reserves the right to temporarily suspend your access to the Services if\nyou fail to pay or are in violation of our [standard\nterms](https://stripe.com/legal/ssa). If you pay using your Stripe Balance,\nstandard terms and conditions apply.\n\n## Refund policy for cancellation of pre-paid subscription\n\nWe don’t offer prorated refunds on pre-paid subscriptions. All Stripe\nsubscription plans require an annual commitment. You are responsible for the\nfull subscription fee, including applicable overage fees for the entire term. We\ndon’t offer refunds (prorated or otherwise) if you schedule a cancellation\nbefore the end of your current term.\n\n## Taxes on subscription purchases\n\nTaxes are estimated at checkout based on current tax rates. These rates may\nchange, and some jurisdictions may require self-assessment for tax reporting.\n\n## Taxually Services\n\nTaxually is a Stripe partner that handles tax filing submissions for various\njurisdictions. When you purchase a Stripe Tax subscription, you gain access to\nfiling services with Taxually aligned with your plan’s entitlements. You’ll need\nto set up an account with Taxually and accept their terms in order to use their\nservices. Stripe will process any applicable fees based on your Stripe Tax\nsubscription plan.\n\n## Links\n\n- [administrator\naccess](https://docs.stripe.com/get-started/account/teams/roles)\n- [settings page](https://dashboard.stripe.com/settings)\n- [pay-as-you-go plan](https://stripe.com/pricing)\n- [contact Stripe](https://support.stripe.com/?contact=true)\n- [terms and conditions](https://stripe.com/legal/ssa)\n- [cancellation\npolicy](https://docs.stripe.com/finance-automation/subscription-pricing/cancel#cancel-a-subscription)",
  "metadata": {
    "title": "Subscription and cancellation policies | Stripe Documentation",
    "description": "Learn about subscription fees and cancellation policies.",
    "sourceURL": "https://docs.stripe.com/finance-automation/subscription-pricing/cancel"
  }
}