{
  "content": "# Multi-dimensional quoting (MDQ) products\n\n## Learn about syncing MDQ products between Salesforce and Stripe.\n\nThe Stripe Billing Connector for Salesforce CPQ enables you to create, manage,\nand bill for deals with annual price or quantity adjustments. Ramp deals can\nspan a single year or multiple years, and are single subscriptions segmented\ninto blocks of time. This provides sales representatives with detailed control\nover pricing specific units of time within a subscription.\n\n## Create MDQ products\n\nCreate a multi-dimensional quoting (MDQ) product in Salesforce by adding a price\ndimension to the Price Dimensions related list for your product. The type\ndetermines how your segments appear: by year, quarter, or month. You can also\nallow users to edit a segment’s cost, quantity, or discounts. The connector\ndoesn’t support MDQ products with custom segments.\n\nUsing the connector to sync a Salesforce order with an MDQ product results in a\nStripe subscription schedule with a subscription schedule phase for each ramp.\nFor example, a 3-year contract segmented by year results in a Stripe\nsubscription schedule with three phases, one for each ramp year. Each phase has\nthe `salesforce_segment_index` and `salesforce_segment_label` metadata so that\nyou know which ramp the phase corresponds to.\n\n## Amend MDQ products\n\nMDQ ramps or segments produce multiple quote lines, one for each segment. When\namending an original Salesforce order with MDQ products, the connector supports\nthe following:\n\n- Terminating the entire Salesforce order\n- Adjusting the quantity of a Salesforce product in one or all of the ramps on\nthe Salesforce order\n- Adding a standard product to the Salesforce order\n- Removing a standard product from the Salesforce order\n\nWhen amending an original Salesforce order with an MDQ product, you must set the\n`SBQQ__AmendmentStartDate__c` field on the contract equal to the\n`SBQQ__StartDate__c` field on the amendment quote. Otherwise, you can create and\nsync an [order\namendment](https://docs.stripe.com/connectors/salesforce-cpq/subscription-order-amendments)\nas usual.\n\n## Limitations\n\nConsider the following MDQ limitations:\n\n- You can have one ramp schedule per Salesforce order.\n- You can sync products with the same billing frequencies across each ramp.\n- Ramps must be consecutive time periods.\n- You can only amend current and future segments of an MDQ subscription. Past\nsegments aren’t available.\n- Don’t amend the ramp period. For example, you can’t change the ramp deal from\nyearly to monthly.\n- Don’t shorten a ramp deal. To terminate an order, you must cancel the line\nitems across all segments.\n\n## See also\n\n- [Field defaults and custom\nmappings](https://docs.stripe.com/connectors/salesforce-cpq/field-mappings)\n- [Products and\nprices](https://docs.stripe.com/connectors/salesforce-cpq/products-prices)\n- [Subscription\norders](https://docs.stripe.com/connectors/salesforce-cpq/subscriptions)\n\n## Links\n\n- [order\namendment](https://docs.stripe.com/connectors/salesforce-cpq/subscription-order-amendments)\n- [Field defaults and custom\nmappings](https://docs.stripe.com/connectors/salesforce-cpq/field-mappings)\n- [Products and\nprices](https://docs.stripe.com/connectors/salesforce-cpq/products-prices)\n- [Subscription\norders](https://docs.stripe.com/connectors/salesforce-cpq/subscriptions)",
  "metadata": {
    "title": "Multi-dimensional quoting (MDQ) products | Stripe Documentation",
    "description": "Learn about syncing MDQ products between Salesforce and Stripe.",
    "sourceURL": "https://docs.stripe.com/connectors/salesforce-cpq/mdq-products"
  }
}