{
  "content": "# Troubleshoot apps on devices\n\n## Learn how to resolve known issues with apps on devices.\n\n- **Why won’t my app upload to Stripe?**\n\nIf your APK is too big or your upload internet speeds are too slow, you might\nreceive a timeout error when you upload your APK with the\n[Files](https://docs.stripe.com/api/files) API. Stripe enforces a 45 second\ntimeout on its servers, and produces an error if an app isn’t uploaded within\nthat time. To resolve this issue, upload your APK to a server with better\ninternet (for example, an AWS EC2 instance or another VPS), and then upload to\nStripe from there. The network connection between your server and Stripe servers\nis generally much faster than home or office connections to Stripe through an\nISP.\n- **Do I have to resubmit my test-mode-approved app for approval in live mode?**\n\nIf you obtained approval for your app in test mode and want to use the app in\nlive mode, you must submit it again for approval. The [app review\nprocess](https://docs.stripe.com/terminal/features/apps-on-devices/app-review)\nis the same for both test mode and live mode. Make sure to upload the exact same\nAPK for automatic approval.\n- **Why can’t I access the device admin settings screen from my app?**\n\nBy default, the device user can access admin settings by swiping from the left\nedge of the screen and tapping **Settings**. This method doesn’t work when a\nthird-party app is the default launch app. You can use the `stripe://settings/`\nURI to deep-link into admin settings and then launch the URI from your app using\nthe following code in your **Activity** or **Fragment**:\n\n```\nstartActivity(\n Intent(Intent.ACTION_VIEW)\n .setData(Uri.parse(\"stripe://settings/\"))\n)\n```\n- **Why can’t I update the device language on my DevKit?**\n\nThe reader app on the DevKit can’t currently update the device language. You can\nchange the device language through the Android Settings app. Use `adb` to launch\nthe Android Settings app:\n\n```\n$ adb shell am start -a android.settings.SETTINGS\n\n```\n- **Why can’t I launch or deep-link into Android Settings on Stripe devices?**\n\nFor security and reliability reasons, Stripe blocks the Android Settings app on\nproduction Stripe devices.\n- **Can I run multiple apps on my Stripe Reader S700?**\n\nThe Stripe Reader S700 supports running multiple apps, but we don’t provide an\napp launcher. You must build the functionality within your apps to allow\nswitching between apps. When you deploy your apps, you can specify the\n`default_kiosk_application`, which is the app that launches when the device\nchecks for updates and after payments. You can’t use the Dashboard to configure\nmultiple apps on a device.\n- **Can I deploy a web app on my Stripe devices?**\n\nYou can package your web app to run on your Stripe devices. Use a framework,\nsuch as [Cordova](https://cordova.apache.org/), to modify your web app for\ncompatibility with Android and generate an Android application package (APK).\nYou can then [upload the\nAPK](https://docs.stripe.com/terminal/features/apps-on-devices/submit) in your\nStripe Dashboard.\n\nFrameworks aren’t aware of Stripe or the [Android Terminal\nSDK](https://docs.stripe.com/terminal/references/api), so you must create a\nJavaScript bridge between your web app and the SDK to send commands from\nJavaScript.\n\nAlternatively, you can use the [server-driven\nintegration](https://docs.stripe.com/terminal/payments/setup-integration) to\ncollect payments, which doesn’t require using the Terminal handoff client\nlibrary or a JavaScript bridge. This allows Stripe to handle all payment\ncollection commands and communication with the device.\n- **Why is my app constantly restarting?**\n\nThe Stripe Terminal card readers restart the default app in the event of a\ncrash. This manifests differently for production and DevKit devices:\n\n- Production – If you configure your app as the default app on production\ndevices, the app automatically restarts when there’s a crash. If the app crashes\nduring initialization (for example, a missing or broken database migration), the\ndevice can enter a crash loop.\n- DevKit – If you configure the Stripe payment app as the default app on DevKit\ndevices, your app queues on the device and then becomes the primary app. If the\napp crashes, the Stripe payment app restarts instead.\n- **Why does my app crash when processing payments with a large amount of line\nitems?**\n\nIf your app crashes while attempting to process a payment with a large amount of\nline items, the issue might be memory. The Android OS limits data sent per\ninter-process (IPC) to 500 KB, when saving state for your activity. To help\nprevent your app from crashing, you can store your data out of memory, such as\nin a database.\n- **What if I find a bug in a deployed app?**\n\nIf you discover a bug in an app that’s already deployed, you can fix the issue\nin the app, upload a new version, and then [deploy your\napp](https://docs.stripe.com/terminal/features/apps-on-devices/deploy-with-API).\n- **How do I view the logs for my app on production readers?**\n\nStripe doesn’t expose logs on production readers. We rely on Sentry integrations\nfor observability.\n- **I sideloaded my point-of-sale app onto a DevKit and successfully completed a\npayment transaction. Why won’t my point-of-sale app start after the transaction\ncompletes?**\n\nOn Stripe readers configured for Apps on Devices, the [preferred kiosk\napp](https://docs.stripe.com/terminal/features/apps-on-devices/deploy-with-API)\nstarts after a transaction completes. On a DevKit, the device’s preferred kiosk\napp is only set when you include the device in a deploy group.\n\nTo set the preferred kiosk app on a DevKit device:\n\n- Submit your app to a DevKit-only deploy group. This allows you to [skip app\nreview](https://docs.stripe.com/terminal/features/apps-on-devices/app-review#skip-app-review).\n- [Deploy the app\nversion](https://docs.stripe.com/terminal/features/apps-on-devices/deploy-with-API)\nto a deploy group that targets your DevKit.\n\n## Links\n\n- [Files](https://docs.stripe.com/api/files)\n- [app review\nprocess](https://docs.stripe.com/terminal/features/apps-on-devices/app-review)\n- [Cordova](https://cordova.apache.org/)\n- [upload the\nAPK](https://docs.stripe.com/terminal/features/apps-on-devices/submit)\n- [Android Terminal SDK](https://docs.stripe.com/terminal/references/api)\n- [server-driven\nintegration](https://docs.stripe.com/terminal/payments/setup-integration)\n- [deploy your\napp](https://docs.stripe.com/terminal/features/apps-on-devices/deploy-with-API)\n- [skip app\nreview](https://docs.stripe.com/terminal/features/apps-on-devices/app-review#skip-app-review)",
  "metadata": {
    "title": "Troubleshoot apps on devices | Stripe Documentation",
    "description": "Learn how to resolve known issues with apps on devices.",
    "sourceURL": "https://docs.stripe.com/terminal/features/apps-on-devices/troubleshooting"
  }
}