{
  "content": "# Embedded Stripe Managed Risk\n\n## Embed Stripe risk management features into your own website.\n\nWith [Stripe Managed\nRisk](https://docs.stripe.com/connect/risk-management/managed-risk), we provide\nan end-to-end business risk management solution and your platform isn’t liable\nfor your connected accounts’ negative balances. For connected accounts without\naccess to a Stripe-hosted dashboard, Stripe Managed Risk requires that your\nwebsite includes the following embedded components:\n\n- Account onboarding\n- Account management\n- Notification banner\n\nThrough those embedded components, Stripe provides:\n\n- Ongoing monitoring and detection of connected accounts’ credit, fraud, and\nsupportability risk\n- Risk interventions to ensure business supportability and prevent losses\n- Co-branded emails and embedded notifications to inform businesses of\ninterventions\n- Embedded forms to respond to and remediate interventions\n- Stripe risk operations to review merchant information and make risk decisions\n- Stripe liability for connected account negative balances\n\n## Risk interventions\n\nWith Stripe Managed Risk, Stripe takes the following actions throughout a\nconnected account’s operations:\n\n- Verifies the information collected during onboarding\n- Evaluates ongoing fraud risk\n- Monitors compliance\n\nWhen Stripe detects elevated risk or non-compliance, we raise a risk review or\napply a risk intervention, which is an action taken to mitigate losses, such as:\n\n- Pausing payouts or charges\n- Holding reserves\n- Prohibiting the account from using payment processing services\n\nWhile some high-priority interventions have consequences that take effect\nimmediately, most interventions notify connected accounts with a deadline to\nrespond before their business is disrupted. Connected accounts are responsible\nfor promptly reviewing and responding to interventions.\n\n## Emails\n\nWhen Stripe raises a risk intervention, we email the connected account to notify\nthem of the issue. The email provides high-level guidance on:\n\n- What the business must do to resolve the issue\n- By when the business must address the issue\n- Consequences to the business if no action is taken\n\nRisk intervention emails might include links to more information about a\nparticular topic, such as restricted business lists or how card brand monitoring\nprograms work. Emails might also include links to details about activity on the\nconnected account, like disputed payments or reserve balances.\n\nEmails sent to fully embedded connected accounts include:\n\n- Co-branding\n- A primary button that takes users to the embedded notification banner (as\nconfigured in your Connect\n[Emails](https://dashboard.stripe.com/settings/connect/emails))\n- Links leading to the co-branded support site (see Support) and your embedded\ncomponents\n\nThe following example shows a fully embedded risk intervention email:\n\n![Sample risk intervention email from the Furever\ndemo.](https://b.stripecdn.com/docs-statics-srv/assets/embedded-managed-risk-email.0084c37ff7da0310d58aabebd565d2e5.png)\n\n## Notification banner\n\nIn addition to notifying connected accounts about risk interventions through\nemail, Stripe also renders alerts via the [notification banner\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/notification-banner).\nThe notification banner only appears when there are active notifications.\n\nThe notification banner provides high level guidance on:\n\n- What the business must do to resolve the issue\n- By when the business must address the issue\n- Consequences to the business if no action is taken\n\n![Sample embedded risk notification banner from the Furever\ndemo.](https://b.stripecdn.com/docs-statics-srv/assets/embedded-managed-risk-notif.c24e386e68a8a56ded5eefb122049842.png)\n\nIn the example above, the banner shows a single notification requiring action\nwithin 2 days to continue taking payments and receiving payouts. The banner’s\nheadline states whether the intervention affects payments, payouts, or both.\n\nThe banner can also have multiple notifications to help connected accounts\nquickly address all open issues.\n\n![Sample of multiple embedded risk notifications in the\nbanner.](https://b.stripecdn.com/docs-statics-srv/assets/embedded-managed-risk-notif-multiple.9c9218df9607342367840d9d35656cab.png)\n\nMultiple notifications in the embedded notification banner\n\nThe notification’s due date indicator shows how much time is remaining and\nbecomes red to indicate overdue requirements that the connected account must\naddress urgently to avoid consequences.\n\n![Sample past due embedded risk\nnotification.](https://b.stripecdn.com/docs-statics-srv/assets/embedded-managed-risk-notif-pastdue.98fa5f8c10d84861178fbbb51392d8be.png)\n\nNotification for a past due risk intervention\n\nAfter the connected account responds, the notification updates to indicate that\nno action is required.\n\n![Sample embedded risk in-review\nnotification.](https://b.stripecdn.com/docs-statics-srv/assets/embedded-managed-risk-notif-inreview.7d990f036474fc4d0a630867e202ee13.png)\n\nNotification for an in-review risk intervention\n\nWhen all notifications are in review the banner automatically collapses and can\nbe expanded to see more details.\n\n![embedded-managed-risk-notif-collapse](https://b.stripecdn.com/docs-statics-srv/assets/embedded-managed-risk-notif-collapse.99b06a09be12ecd64d30c8116b930f3c.png)\n\nCollapsed notification banner\n\nThe banner informs your connected account when Stripe suspends their operation\nand provides a means for contacting support to appeal.\n\n![embedded-managed-risk-notif-reject](https://b.stripecdn.com/docs-statics-srv/assets/embedded-managed-risk-notif-reject.94843e428028f640d3ea79f8bac8822c.png)\n\nNotification of unsupportable business\n\n## Responding to interventions\n\nNotifications in the [notification\nbanner](https://docs.stripe.com/connect/supported-embedded-components/notification-banner)\ninclude a button that the account user can click to respond directly in a modal\nwindow. In the following example, the notification prompts the user to complete\nan identity verification.\n\n![embedded-managed-risk-remediation-ID](https://b.stripecdn.com/docs-statics-srv/assets/embedded-managed-risk-remediation-ID.e518cff147ff3ef2d8c7fa3b6d7455f5.png)\n\nEmbedded identity verification\n\nConnected accounts must authenticate with Stripe to resolve risk interventions\nin the modal window.\n\nSome interventions might request additional information about the business or\nits operations, which the user can provide and submit directly from within the\nmodal, as shown in the following example.\n\n![embedded-managed-risk-remediation-form](https://b.stripecdn.com/docs-statics-srv/assets/embedded-managed-risk-remediation-form.121ec16bc88310db4db00d5ca5ef2dcb.png)\n\nEmbedded form to respond to risk intervention\n\nMost intervention emails include a button directing users to the notification\nbanner where they can respond directly. In rare cases, the email might direct\nthe user to respond by replying to the email.\n\n## Support for risk issues\n\nIf a connected account needs help with a risk issue, they can:\n\n- Contact Stripe’s risk specialist team using the **Contact support** link at\nthe bottom of the response modal.\n- Reply to any risk email to create a support request.\n\nThe forms provided through the intervention notifications are the fastest\nresolution for risk issues because they minimize the back-and-forth nature of\nemail communication.\n\n## Links\n\n- [Stripe Managed\nRisk](https://docs.stripe.com/connect/risk-management/managed-risk)\n- [Emails](https://dashboard.stripe.com/settings/connect/emails)\n- [notification banner\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/notification-banner)",
  "metadata": {
    "title": "Embedded Stripe Managed Risk | Stripe Documentation",
    "description": "Embed Stripe risk management features into your own website.",
    "sourceURL": "https://docs.stripe.com/connect/embedded-risk"
  }
}