{
  "content": "# Collect tax in the European Union\n\n## Learn how to use Stripe Tax to calculate, collect, and report tax in the EU.\n\nBusinesses selling goods and services to customers in the European Union (EU)\nmight need to collect value added tax (VAT), even if your business isn’t\nestablished (based) in the EU. Although the VAT laws are generally similar\nacross the EU, the tax rates and rules might vary per country.\n\n## Countries in the EU\n\nStripe can calculate tax in all of the countries in the European Union. Select\nthe country your business is based in if you need help finding the right links\nto register for tax.\n\n-\n[Austria](https://docs.stripe.com/tax/supported-countries/european-union/austria)\n-\n[Belgium](https://docs.stripe.com/tax/supported-countries/european-union/belgium)\n-\n[Bulgaria](https://docs.stripe.com/tax/supported-countries/european-union/bulgaria)\n-\n[Croatia](https://docs.stripe.com/tax/supported-countries/european-union/croatia)\n-\n[Cyprus](https://docs.stripe.com/tax/supported-countries/european-union/cyprus)\n-\n[Czechia](https://docs.stripe.com/tax/supported-countries/european-union/czechia)\n-\n[Denmark](https://docs.stripe.com/tax/supported-countries/european-union/denmark)\n-\n[Estonia](https://docs.stripe.com/tax/supported-countries/european-union/estonia)\n-\n[Finland](https://docs.stripe.com/tax/supported-countries/european-union/finland)\n-\n[France](https://docs.stripe.com/tax/supported-countries/european-union/france)\n-\n[Germany](https://docs.stripe.com/tax/supported-countries/european-union/germany)\n-\n[Greece](https://docs.stripe.com/tax/supported-countries/european-union/greece)\n-\n[Hungary](https://docs.stripe.com/tax/supported-countries/european-union/hungary)\n-\n[Ireland](https://docs.stripe.com/tax/supported-countries/european-union/ireland)\n- [Italy](https://docs.stripe.com/tax/supported-countries/european-union/italy)\n-\n[Latvia](https://docs.stripe.com/tax/supported-countries/european-union/latvia)\n-\n[Lithuania](https://docs.stripe.com/tax/supported-countries/european-union/lithuania)\n-\n[Luxembourg](https://docs.stripe.com/tax/supported-countries/european-union/luxembourg)\n- [Malta](https://docs.stripe.com/tax/supported-countries/european-union/malta)\n-\n[Netherlands](https://docs.stripe.com/tax/supported-countries/european-union/netherlands)\n-\n[Poland](https://docs.stripe.com/tax/supported-countries/european-union/poland)\n-\n[Portugal](https://docs.stripe.com/tax/supported-countries/european-union/portugal)\n-\n[Romania](https://docs.stripe.com/tax/supported-countries/european-union/romania)\n-\n[Slovakia](https://docs.stripe.com/tax/supported-countries/european-union/slovakia)\n-\n[Slovenia](https://docs.stripe.com/tax/supported-countries/european-union/slovenia)\n- [Spain](https://docs.stripe.com/tax/supported-countries/european-union/spain)\n-\n[Sweden](https://docs.stripe.com/tax/supported-countries/european-union/sweden)\n\n## When and how to register\n\nDifferent rules determine when and how you need to register for VAT, depending\non the country your business is located in. After you register with a country,\ngo to [Registrations](https://dashboard.stripe.com/tax/registrations) to add\nyour registrations to Stripe in the Dashboard to start collecting tax on your\ntransactions. Learn more about the different registration schemes [in our\nguide](https://stripe.com/guides/introduction-to-eu-vat-and-vat-oss).\n\nSee [Thresholds](https://dashboard.stripe.com/tax/thresholds) to get insights\nabout your potential tax registration obligations in each country in the\nEuropean Union. Stripe also notifies you with email and Dashboard alerts when\nyou need to register to collect tax. Learn more about how the [monitoring tool\nworks](https://docs.stripe.com/tax/monitoring).\n\n## Businesses based in the EU\n\n### Domestic registration\n\nDomestic registration is the standard VAT registration for businesses selling\ngoods and services within an EU country. Any business can register, regardless\nof their physical location.\n\nSome EU countries allow businesses to wait to register for VAT until their sales\nexceed a certain amount (tax registration threshold). However, other EU\ncountries require all businesses to register, regardless of sales volume. Those\ncountries use tax collection thresholds. Businesses below the threshold can\napply for special schemes that exempt them from VAT collection obligations. For\ndetailed information, visit the tax administration websites of each country.\n\nStripe monitors your registration obligations in the EU countries other than the\ncountry where your business is based. You can go to\n[Registrations](https://dashboard.stripe.com/tax/registrations) to add your\ndomestic registrations to Stripe in the Dashboard and start collecting tax.\n\nIf you sell digital services or imported low-value goods exclusively through\nonline marketplaces and the marketplace operator is responsible for collecting\ntax on these sales, you aren’t required to register for VAT in the countries\nwhere your customers are located.\n\n### Smaller sellers\n\nIf you sell to customers in other EU countries, you might need to register in\nthose countries too. You don’t need to register in other EU countries if:\n\n- your total sales are under 10,000 EUR in a calendar year *and*\n- you sell digital products or physical goods *and*\n- your sales are to individuals and not businesses in another EU country\n\nThe VAT rate of the EU country your business is based in applies instead. Stripe\nrefers to this simplification rule as the small seller option. We determine\nwhether you’re selling digital products or physical goods using the [product tax\ncode](https://docs.stripe.com/tax/tax-codes) you assigned to your product.\n\nWhen you select the **domestic registration** option, you’re asked to indicate\nif your business is a small seller with sales below the 10,000 EUR threshold.\nYou only see this option for the country that you have set as your [origin\naddress](https://docs.stripe.com/tax/set-up#origin-address). If you choose yes,\nwe monitor your cross-border transactions in the EU and notify you when you\nexceed that threshold.\n\nAfter you exceed the small seller threshold, you’re required to collect tax in\nthe country your customers are located in. You can do so in two ways:\n\n- Register domestically in the EU countries your customers are located in\n- Register for the [Union One Stop Shop (OSS)\nscheme](https://vat-one-stop-shop.ec.europa.eu/one-stop-shop_en) in your home EU\ncountry.\n\nThere are three steps to reflect this change in Stripe:\n\n- End your domestic small seller registration in Stripe on\n[Registrations](https://dashboard.stripe.com/tax/registrations).\n- Add a new domestic registration for the location where your business is based\nand select **no** when you’re asked if you’re a small seller.\n- Add any other new domestic or One Stop Shop registrations to start collecting\ntax in those locations.\n\n### Union One Stop Shop (OSS)\n\nIf you sell goods or services to individuals (and not to businesses), you can\nregister for the Union One Stop Shop (OSS) scheme in the EU country your\nbusiness is based in. You won’t have to register with each EU country you sell\ngoods or services to. Instead you can register for OSS through your home country\nVAT website and submit one return for your sales across the EU. You remit all\nVAT to your local tax authority, who distributes it to the countries where your\ncustomers are located.\n\nLearn more about [One-Stop\nShop](https://stripe.com/guides/introduction-to-eu-vat-and-vat-oss). Select the\ncountry your business is based in [from the\ntable](https://docs.stripe.com/tax/supported-countries/european-union#eu-countries)\nif you need help finding the right links.\n\n### Import One Stop Shop (IOSS)\n\nIf you sell physical goods to individuals in the EU and the goods are imported\nfrom outside of the EU in packages (consignments) that are valued at or below\n150 EUR, you can register for Import One Stop Shop in the EU country where\nyou’re based. This means your customer pays VAT when they buy the goods and not\nwhen the goods arrive at the border in the EU. After you register, you can\ncollect VAT on your sales of these goods to customers across the EU without\nhaving to register in every country. You also only submit one return to the\ncountry you’re based in for the sales of these goods. Stripe assumes that goods\npurchased together are shipped together. If a transaction is over 150 EUR, IOSS\nwon’t apply, which means your customers are charged by Customs when the goods\narrive at the border in the EU.\n\n## Businesses based outside the EU\n\nIf your business is based outside the EU, you may need to register to collect\nVAT from your first sale in an EU country. There are different VAT registration\noptions for businesses based outside the EU.\n\n### Domestic registration\n\nYou can register to collect VAT in each EU country your customers are based in.\nYou might be required to appoint a tax representative, depending on the country\nyou and your customer are located in.\n\nSelect the country your customer is based in from the list in the sidebar, if\nyou need help finding the right links.\n\nIf you sell digital services or goods exclusively through online marketplaces\nand the marketplace operator is responsible for collecting tax on these sales,\nyou’re not required to register for VAT.\n\n### Non-Union One Stop Shop (OSS)\n\nThis scheme is for businesses based outside the EU selling services to\nindividuals in the EU. You can choose which EU country you register in. After\nyou register, you can collect VAT on your sales to customers across the EU\nwithout having to register in every country. You also only need to submit one\nreturn for all your EU sales to the country you registered in. You don’t need to\nappoint a tax representative to use the OSS non-Union scheme.\n\n### Import One Stop Shop (IOSS)\n\nIf you sell physical goods to individuals in the EU and the goods are imported\nin packages (consignments) that are valued at or under 150 EUR, you can register\nin the EU country of your choice for Import One Stop Shop. This means your\ncustomer pays VAT when they buy the goods and not when the goods arrive at the\nborder in the EU. After you register, you can collect VAT on your sales of these\ngoods to customers across the EU without having to register in every country.\nYou also only need to submit one return for all your EU sales to the country you\nregistered in. Businesses based outside the EU normally need to appoint a local\nintermediary to register for IOSS. Stripe assumes that goods purchased together\nare shipped together. If a transaction is over 150 EUR, IOSS won’t apply, which\nmeans your customers might have to pay taxes and customs duties when the goods\narrive at the border in the EU.\n\n### Union One Stop Shop (OSS)\n\nBusinesses based outside of the EU can use this scheme if they sell physical\ngoods that are located in an EU country and shipped to individuals in other EU\ncountries.\n\n## How we calculate taxes\n\nStripe calculates VAT on a transaction using the following pieces of\ninformation:\n\n- the location of your business\n- the tax registrations you added to Stripe\n- the location of the customer\n- the type of the product sold (based on the [product tax\ncode](https://docs.stripe.com/tax/tax-codes) you assigned to your product)\n- the status of the customer (whether or not they’re a VAT-registered business).\n\n## Sales of services\n\nWhen your business is located in the same country as your customer, Stripe\ncalculates VAT by applying that country’s tax rates.\n\nWhen you and your customer are in different countries (cross-border sales),\nthere are more complicated rules that apply. These rules determine where the\nservices are considered to be delivered and which country is entitled to collect\nthe tax. Here’s a summary of how Stripe applies tax on sales of services:\n\n- **Digital goods or electronically supplied services**: Generally taxable in\nthe customer’s country. For cross-border sales of digital services within the\nEU, Stripe Tax prioritizes a [single\naddress](https://docs.stripe.com/tax/customer-locations#address-hierarchy) as\nthe customer’s location when calculating tax instead of comparing two pieces of\nnon-conflicting evidence. However, we store and retain all location evidence\nused in the transaction on the Customer object. If you indicated your business\nis a [small\nseller](https://docs.stripe.com/tax/supported-countries/european-union#eu-businesses-domestic-registration-small-sellers),\nthe VAT of the country your business is based in applies.\n- **Services related to immovable property**: Taxable in the country where the\nproperty is located. Stripe assumes that the property is located in the\ncustomer’s country.\n- **Services involving work on movable property**: Taxable in the customer’s\ncountry as Stripe assumes that the work is performed in the customer’s country.\n- **Services that can be delivered remotely**: Taxable in the customer’s country\nwhen they’re provided to individuals outside the European Union or other\nbusinesses. When they’re provided to individuals in other EU countries, they’re\ntaxable in the seller’s country.\n- **Other services**: Taxable in the country your business is based in when\nprovided to individuals. Taxable in the customer’s country when provided to\nother businesses. These rules apply if you select a [product tax\ncode](https://docs.stripe.com/tax/tax-codes) `txcd_20030000` General - Services.\n\n### Reverse charge\n\nIn some cases, when you sell services to a VAT-registered business in another EU\ncountry, the customer is responsible for calculating and remitting the VAT.\nThose transactions are called [reverse\ncharge](https://docs.stripe.com/tax/zero-tax#reverse-charges). Your business\nmust provide an invoice that specifies the reverse charge instead of including a\ntax amount.\n\nIf your customer is eligible for a reverse charge and provides their VAT ID in\nStripe, we treat their transactions as a reverse charge and don’t calculate tax\nfor them. If your customer provides a domestic tax identification number,\nreverse charge doesn’t apply. The transaction is treated as a\nbusiness-to-consumer (B2C) sale, and VAT rules for B2C transactions are\nfollowed.\n\nYou can also mark a customer as eligible for [reverse\ncharge](https://docs.stripe.com/tax/zero-tax#reverse-charges) in the Dashboard\nor using the API, even if you haven’t collected a tax ID for that customer. For\ninformation about which tax IDs Stripe validates, see [customer tax\nIDs](https://docs.stripe.com/invoicing/customer/tax-ids).\n\nStripe doesn’t support the following types of reverse charge:\n\n- **Domestic reverse charge**: In some EU countries, a reverse charge can apply\nto the sale of some goods and services between businesses in that country.\nStripe supports reverse charge only for cross-border sales, not for sales within\nthe same country.\n- **Cross-border conditions**: Some EU countries have conditions under which\ntypes of services are eligible for reverse charge. For example, a country can\nrequire you to have a domestic registration. Stripe assumes that all services\nsold to customers with a business tax ID are eligible for reverse charge.\n\n## Sales of physical goods\n\nWhen your business is located in the same country as your customer and the goods\nare shipped within that country, Stripe calculates tax by applying that\ncountry’s tax rates.\n\nWhen the goods are shipped to a customer in a different EU country to your\nbusiness, Stripe calculates the tax based on the type of customer. Different\nrules apply depending on if your customer is an individual or a VAT registered\nbusiness.\n\n- **Sales to an individual**: if the sales are to an individual and your\nbusiness arranges the delivery (transport), then the goods are taxed using the\nrules of the country your customer is based in. The exception is if you’re an\nEU-based business and have indicated your business is a [small\nseller](https://docs.stripe.com/tax/supported-countries/european-union#eu-businesses-domestic-registration-small-sellers)\nin Stripe. The tax of the country your business is based in applies instead.\n- **Sales to a VAT registered business**: the sales are taxable in the country\nyour business is based in. Stripe applies the zero rate if the customer provides\ntheir VAT ID number. If you sell to a business in another EU country and your\ncustomer doesn’t provide a valid VAT ID number, collect VAT from the country\nyour business is based in. However, Stripe processes these sales in the same way\nit processes a sale to an individual.\n\nWhen the goods are shipped to a customer outside of the EU, Stripe Tax treats\nthis sale as an export and [applies the zero\nrate](https://docs.stripe.com/tax/zero-tax). The transaction might still be\nsubject to taxes and customs duties in the country your customer is in. Stripe\ndoesn’t calculate these.\n\n## Report and file your taxes\n\nStripe provides reports of your completed tax transactions in the EU. Go to\n[Registrations](https://dashboard.stripe.com/tax/registrations) to access these\nreports. Learn more about [the different types of\nreports](https://docs.stripe.com/tax/reports).\n\nThe way you file tax returns and pay (remit) your taxes depend on which types of\nregistrations you have.\n\n- **Domestic registration**: you file your tax returns in each country you have\na registration. Some EU countries might require you to appoint a local tax\nrepresentative to do this if you’re not based in the EU.\n- **One Stop Shop**: you file your tax returns for all your eligible sales\nacross the EU with the country you have a One Stop Shop registration in. If you\nuse different OSS schemes, you need to submit a separate return for each scheme.\nLearn more about [One-Stop\nShop](https://stripe.com/guides/introduction-to-eu-vat-and-vat-oss#4-file-vat-returns).\n\nSelect the country you need to file in from the list in the sidebar if you need\nhelp finding the right links.\n\nStripe Tax has filing partners—Taxually, Marosa, and Hands-off Sales Tax\n(HOST)—to help automate your tax filing. These partners automatically sync your\ntax transaction data in real time, eliminating the need for manual data entry or\nfile transfers. Learn more about [tax\nfiling](https://docs.stripe.com/tax/filing).\n\n## Marketplace tax liability\n\nThe EU uses the term “deemed sellers” to refer to marketplace operators that\nmight have tax collection obligations. To qualify as a deemed seller, the\nbusiness must set terms or conditions for the sale, process or enable customer\npayments, or handle ordering or delivery of the product. A business isn’t\nconsidered a deemed seller if it only processes payments, lists or advertises\ngoods, or redirects customers to other websites or apps without further\ninvolvement in the sale.\n\nThe tax collection obligation for marketplace operators usually applies to:\n\n- Sales of digital services.\n- Sales of goods by non-EU sellers to EU individuals, if the goods are located\nin the EU at the point of sale.\n- Sales of goods to EU individuals, where the goods are imported into the EU in\npackages valued at 150 EUR or less.\n\nMarketplace operators facilitating other types of sales might be required to\ncollect VAT on these sales based on other indicators and contractual\narrangements.\n\nA marketplace operator that collects VAT on a sale is treated as if it were\nbuying the product from the merchant and selling it to the customer. This only\napplies for VAT purposes and doesn’t change the commercial position where the\ntitle to the product passes from the seller to the buyer.\n\n## Links\n\n-\n[Austria](https://docs.stripe.com/tax/supported-countries/european-union/austria)\n-\n[Belgium](https://docs.stripe.com/tax/supported-countries/european-union/belgium)\n-\n[Bulgaria](https://docs.stripe.com/tax/supported-countries/european-union/bulgaria)\n-\n[Croatia](https://docs.stripe.com/tax/supported-countries/european-union/croatia)\n-\n[Cyprus](https://docs.stripe.com/tax/supported-countries/european-union/cyprus)\n-\n[Czechia](https://docs.stripe.com/tax/supported-countries/european-union/czechia)\n-\n[Denmark](https://docs.stripe.com/tax/supported-countries/european-union/denmark)\n-\n[Estonia](https://docs.stripe.com/tax/supported-countries/european-union/estonia)\n-\n[Finland](https://docs.stripe.com/tax/supported-countries/european-union/finland)\n-\n[France](https://docs.stripe.com/tax/supported-countries/european-union/france)\n-\n[Germany](https://docs.stripe.com/tax/supported-countries/european-union/germany)\n-\n[Greece](https://docs.stripe.com/tax/supported-countries/european-union/greece)\n-\n[Hungary](https://docs.stripe.com/tax/supported-countries/european-union/hungary)\n-\n[Ireland](https://docs.stripe.com/tax/supported-countries/european-union/ireland)\n- [Italy](https://docs.stripe.com/tax/supported-countries/european-union/italy)\n-\n[Latvia](https://docs.stripe.com/tax/supported-countries/european-union/latvia)\n-\n[Lithuania](https://docs.stripe.com/tax/supported-countries/european-union/lithuania)\n-\n[Luxembourg](https://docs.stripe.com/tax/supported-countries/european-union/luxembourg)\n- [Malta](https://docs.stripe.com/tax/supported-countries/european-union/malta)\n-\n[Netherlands](https://docs.stripe.com/tax/supported-countries/european-union/netherlands)\n-\n[Poland](https://docs.stripe.com/tax/supported-countries/european-union/poland)\n-\n[Portugal](https://docs.stripe.com/tax/supported-countries/european-union/portugal)\n-\n[Romania](https://docs.stripe.com/tax/supported-countries/european-union/romania)\n-\n[Slovakia](https://docs.stripe.com/tax/supported-countries/european-union/slovakia)\n-\n[Slovenia](https://docs.stripe.com/tax/supported-countries/european-union/slovenia)\n- [Spain](https://docs.stripe.com/tax/supported-countries/european-union/spain)\n-\n[Sweden](https://docs.stripe.com/tax/supported-countries/european-union/sweden)\n- [Registrations](https://dashboard.stripe.com/tax/registrations)\n- [in our guide](https://stripe.com/guides/introduction-to-eu-vat-and-vat-oss)\n- [Thresholds](https://dashboard.stripe.com/tax/thresholds)\n- [monitoring tool works](https://docs.stripe.com/tax/monitoring)\n- [product tax code](https://docs.stripe.com/tax/tax-codes)\n- [origin address](https://docs.stripe.com/tax/set-up#origin-address)\n- [Union One Stop Shop (OSS)\nscheme](https://vat-one-stop-shop.ec.europa.eu/one-stop-shop_en)\n- [from the\ntable](https://docs.stripe.com/tax/supported-countries/european-union#eu-countries)\n- [single\naddress](https://docs.stripe.com/tax/customer-locations#address-hierarchy)\n- [small\nseller](https://docs.stripe.com/tax/supported-countries/european-union#eu-businesses-domestic-registration-small-sellers)\n- [reverse charge](https://docs.stripe.com/tax/zero-tax#reverse-charges)\n- [customer tax IDs](https://docs.stripe.com/invoicing/customer/tax-ids)\n- [applies the zero rate](https://docs.stripe.com/tax/zero-tax)\n- [the different types of reports](https://docs.stripe.com/tax/reports)\n- [One-Stop\nShop](https://stripe.com/guides/introduction-to-eu-vat-and-vat-oss#4-file-vat-returns)\n- [tax filing](https://docs.stripe.com/tax/filing)",
  "metadata": {
    "title": "Collect tax in the European Union | Stripe Documentation",
    "description": "Learn how to use Stripe Tax to calculate, collect, and report tax in the EU.",
    "sourceURL": "https://docs.stripe.com/tax/supported-countries/european-union"
  }
}