{
  "content": "# Exclusion examples\n\n## Learn about revenue recognition with exclusion examples.\n\nUnless stated otherwise, these exclusion examples assume that revenue\nrecognition takes place on a per-day basis.\n\n## Exclude transactions\n\nTransactions behave differently when excluded, depending on whether they have\nbeen paid or not. If a transaction is paid in cash, Stripe debits the cash\naccount and credits the exclusion account after exclusion. If it’s paid by\nCustomerBalance, Stripe debits the customer balance account and credits the\ncustomer balance adjustments account after exclusion. Stripe doesn’t generate\njournal entries for unpaid transactions; they behave as if the transaction never\noccurred.\n\nIf you exclude transactions in a closed accounting period, it incurs corrections\nfor transactions that have already been paid. Learn more about\n[corrections](https://docs.stripe.com/revenue-recognition/reports).\n\n### Exclude paid transactions\n\nThis example uses the following assumptions:\n\n- On January 5, 2022, at 09:00:00 UTC, you create a one-time payment of 10 USD\nusing either the Dashboard, the Charges APIs, or the Payment Intents APIs.\n- By default, Revenue Recognition immediately recognizes the revenue from this\none-time payment.\n- On February 5, 2022, you exclude the payment.\n- The accounting periods for January 2022 are either closed or open.\n\nAfter you exclude the payment:\n\n- The revenue account clears to 0 USD because the payment doesn’t generate\nrevenue.\n- The cash account remains at 10 USD, acknowledging the received payment.\n- An amount of 10 USD is added to the exclusion account.\n\nAt the end of February, your summary might reflect the following:\n\nAccountJanuaryFebruaryCash+10.00Revenue+10.00-10.00Exclusion+10.00\n### Exclude unpaid transactions\n\nThis example uses the following assumptions:\n\n- On January 1, 2022, at 00:00:00 UTC, a customer initiates a one-month\nsubscription (from January 1 to Jan 31) that costs 31 USD.\n- The subscription generates an invoice.\n- The invoice finalizes, but the customer doesn’t make a payment.\n- On February 1, 2022, you exclude the payment.\n- The accounting periods are open for January 2022.\n\nIf you exclude a finalized invoice during an open accounting period, it leaves\nno trace of activity related to the invoice. Stripe removes all of the account\nactivities, excluding the cash and customer balance account that isn’t involved\nin this case, and don’t generate journal entries from the finalization and\nexclusion of the invoice.\n\n## Links\n\n- [corrections](https://docs.stripe.com/revenue-recognition/reports)",
  "metadata": {
    "title": "Exclusion examples | Stripe Documentation",
    "description": "Learn about revenue recognition with exclusion examples.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/examples/exclusion"
  }
}