{
  "content": "# Sales-led B2B billing\n\n## Quote and bill complex sales contracts automatically on Stripe Billing.\n\nStripe Billing enables you to set up and automate workflows for your sales team.\nThis guide explains how to model complex sales contracts, use Quotes to\nnegotiate them with your customers, create sales-negotiated deals in the Stripe\nDashboard, and update or renew such contracts. If a feature in this guide\ndoesn’t have a Beta label, then it’s publicly available.\n\n## Request early access\n\n#### Beta signups are closed\n\nAs we work to roll out these features to all users, we’re no longer accepting\nusers to this beta.\n\n## Overview\n\nSales-led B2B billing features allow sales-focused businesses to track and\nmanage sales and fulfillment processes end-to-end. A typical sales deal flow is\nan iterative process that lasts as long as the lifecycle of your customer. It\nstarts with a quote that the sales team creates and finalizes with the customer.\nAfter finalizing the quote, your team shapes the deal in Stripe Billing.\nThroughout the lifecycle of the deal, events like end of term renewals,\nupselling new products, and amending mid-cycle changes require you to make\nchanges to the existing deal or create a new one. Using the Stripe sales-led B2B\nbilling features, you can automate and manage the end-to-end deal flow within\nStripe.\n\nSee the following diagram for a visual representation of a common deal\nlifecycle.\n\n![Deal\nflow](https://b.stripecdn.com/docs-statics-srv/assets/deal-flow.5b5d78bfd1e971b5143da8f450c506bf.png)\n\n## Model your contract\n\nQuotes allow you to deliver estimated pricing for requested sales deals and can\nhelp facilitate negotiation before beginning a subscription or invoice. You can\noffer pre-sales deal pricing by creating a quote for the customer. Whether your\nsold deal requires a single invoice, a subscription, or a multiphase ramp up\ndeal, use quotes to provide your customers with a price estimate, including any\ndiscounts or taxes.\n\nYour sales team can start drafting a quote in the Stripe dashboard or automate\nthe creation of one using the Stripe API. The quote remains in draft mode during\nthe initial negotiation. After you finalize the quote you can send it to the\ncustomer for approval. Upon approving the quote, your sales team can convert the\napproved quote to a deployed deal containing a subscription, invoice, or\nmultiphase installment plan.\n\nYou don’t use quotes exclusively during the initial deal creation process. You\nalso use quotes when customers renew, buy additional products mid-cycle\n(upsell), or request changes to their existing deals. In all of these scenarios,\nthe sales team typically negotiates a new quote and uses the approved quote to\napply an amendment to the existing deal or create a new deal. These\nfunctionalities work directly with Stripe subscriptions, subscription schedules,\nand invoices to provide flexibility with building a complex deal process.\n\nLearn more about some of the existing Stripe [quote\nfunctionalities](https://docs.stripe.com/quotes) and sign up in the [form\nabove](https://docs.stripe.com/billing/subscriptions/sales-led-billing#request-early-access)\nto get access to some of the more advanced deal flow quoting capabilities.\n\nIf you’re using a third-party quoting tool to create and finalize your quotes,\nyou can use one of our [connectors](https://docs.stripe.com/connectors) to\ncreate your sold deals within Stripe. For example, the [Stripe Billing connector\nfor Salesforce (beta)](https://docs.stripe.com/billing/integrations/salesforce)\nenables your sales team to manage subscriptions on Stripe directly on\nSalesforce.\n\n### Model your pricing\n\nUsing Stripe Products and Prices, you can model your subscription pricing model\nand one-off charges. Both subscriptions and invoices work with Products and\nPrices. In many sales deal scenarios, the sales team overrides the original\nprice based on the negotiated deal. Ad-hoc prices allow your team to override\npredefined prices. Read the [getting started\nguide](https://docs.stripe.com/products-prices/getting-started) to learn how to\ncreate products and prices. If you already have a product catalog in another\nsystem, you can also [import that product\ncatalog](https://docs.stripe.com/products-prices/getting-started#import-products-prices)\ninto Stripe using the API. If you have any questions, contact Stripe Support at\n[support-migrations@stripe.com](mailto:support-migrations@stripe.com).\n\n## Create a contract\n\nSales deals can become very complex. You might have billing cycle durations with\ndifferent pricing models, discounts, and advanced fee structures. A simple\nscenario is when you ramp up your pricing over a period of three years. Stripe\nBilling’s [subscription\nschedules](https://docs.stripe.com/billing/subscriptions/subscription-schedules)\nenable your sales team to create these deals. Your subscriptions can be basic\nflat rate monthly deals or complex multi-year ramp ups.\n\nThe following sections describe some of the sales-led B2B billing capabilities\nfor creating a sales deal.\n\n### Create contract subscriptions\n\nStripe’s sales-led B2B billing features work on top of Stripe Billing, our\nsubscriptions platform. Stripe Billing allows you to create subscriptions and\nupdate different aspects of subscriptions, such as the billing cycle and the\nsubscription price. You can use subscription schedules to automate these updates\nover time. Subscription schedules are made up of phases that define how and when\nchanges to a subscription occur. For example, you can set a subscription\nschedule to begin a subscription on a future date. Here is a quick video of how\nto create complex multi-phase subscription schedules using the Stripe Billing\ndashboard:\n\nSubscription schedules in the Dashboard\n\n### Create contract invoices\n\nStripe’s sales-led B2B billing features also work on top of Stripe Invoicing,\nallowing you to [create invoices](https://docs.stripe.com/invoicing) with\ncomplex fee structures, automated sales taxes, and due date modifications.\nConverting a quote automatically creates an invoice. You can also create them\nmanually from the Stripe Dashboard. After you create the invoice, you can also\nsend the invoice link to your users to pay it through a hosted invoice page.\nStripe Invoicing automates the email reminders for any past due and failed\npayments.\n\n### Prebill customers in advance Beta\n\nSome customers pay for a certain number of billing cycles when they sign the\ndeal. Sales prebills the customer when the deal is created. Using the Stripe\nprebilling feature you can charge customers for more than the next service\nperiod. This enables use cases like charging customers up front for their first\n3 months when they sign up for your service, or charging early for an upcoming\nrenewal.\n\nA prebilled subscription continues to cycle naturally, but no invoices are\ngenerated based on the recurring price until the prebilled period has ended.\nPrebilling creates an invoice immediately with the current period plus the\nnumber of additional cycles to collect up front. Afterward, a prebilled\nsubscription continues to cycle naturally. One-off subscription invoices are\ngenerated at the time of renewal if pending invoice items are created during the\nprebilled period.\n\n### Offer trials and discounts Beta\n\nSales teams often offer trials and discounts during deal negotiations to\nincentivize customers. You can offer free time-based trials such as a 14-day\nfree trial before sending the invoices, or paid trials that have a promotional\nprice for the first 2 months of the deal.\n\n### Additional discount features\n\nYou can apply multiple discounts to each phase of a given subscription. You can\nalso apply discounts at a line-item level for each price-point you sell.\n\n## Update a contract Beta\n\nDeals get updated often. For example, the customer might be approaching the end\nof the deal and need a renewal plan, they might be buying a new product soon\nafter the closing, or requesting a change to the originally agreed upon\ncontract. All of these reasons cause sales teams to create an amendment.\nAmendments allow your sales team to apply updates to deals without managing the\ncomplex changes that need to happen to every phase of the subscription. You can\napply amendments directly to an existing deal or apply them through a new quote\nagreement.\n\nChanges to a deal such as upgrading or downgrading can result in prorated\ncharges. You can configure your deal to enable proration charges when you apply\namendments. You can also decide to handle prorations differently for different\nphases of the deal using Stripe’s advanced proration features.\n\nYou can prebill customers, offer different trials, and apply additional\ndiscounts during the deal update process. Your sales team can apply these\nchanges from the Stripe Dashboard or automate it through our [third-party\nconnectors](https://docs.stripe.com/connectors).\n\n## Let customers manage invoices and subscriptions\n\nYou can use the Stripe customer portal as a no-code way to manage subscriptions\nand invoices. You can configure the customer portal to allow certain\nsubscription management features for your customers. After you create and amend\ndeals, customers can go to the customer portal to manage their payment method,\ndownload invoices, and pay invoices. Your sales team can share a direct link to\nthe customer portal with your customers or your product team to integrate it\ninside your SaaS application.\n\nYou can also use the Stripe API and webhooks to automatically apply the deal\nupdates inside your SaaS app or sync with third-party tools.\n\n## Migrate old deals to new pricing Beta\n\nIf you have deals that you need to update to a new pricing model, it might be\ntime consuming to update those deals manually. With the price migration toolkit,\nyou can migrate all or a portion of your existing deals to new pricing models.\n\nIf you have subscriptions from other sources, like an internal homegrown billing\nsystem or a third-party billing solution, you can [import them into Stripe\nBilling](https://docs.stripe.com/billing/subscriptions/migrate-subscriptions).\nIf you’re also moving payment processors from a third-party to Stripe Payments,\nyou can use our data migration process to request a migration on your behalf. To\nrequest support on data migration, contact\n[billing-migrations@stripe.com](mailto:billing-migrations@stripe.com).\n\n## Billing features\n\nHere’s a list of Stripe’s sales-led B2B billing capabilities. If you’re\ninterested in getting early access to some of these beta features, you can sign\nup in the [form\nabove](https://docs.stripe.com/billing/subscriptions/sales-led-billing#request-early-access).\n\nComponentDescription\n**Quotes**\n\nUse [quotes](https://docs.stripe.com/quotes) to combine recurring and one-off\nline items so you can provide your customers with a price estimate, including\nany discounts or taxes.\n\n**Advanced multi-phase quotes**\n\nBeta\nCreate quotes with multiple phases that correspond to your sales process phases.\n\n**Invoices**\n\nUse [Stripe Invoicing](https://docs.stripe.com/invoicing) to create, customize,\nand send invoices to customers. Automatically charge your customer’s payment\nmethod on file, or email them the invoice with or without a link to a payment\npage.\n\n**Hosted invoice page**\n\nUse the [Hosted Invoice\nPage](https://docs.stripe.com/invoicing/hosted-invoice-page#set-payment-methods)\nto securely collect payment from your customers. From the Hosted Invoice Page,\nyou can configure invoices to allow payment with one or more of the [supported\npayment methods](https://docs.stripe.com/invoicing/payment-methods).\n\n**Subscriptions**\n\nCreate subscriptions and multi-phase subscription schedules to model your\ncomplex deal flow.\n\n**Prebilling**\n\nBeta\nPrebill customers ahead of schedule. Prebilling lets you charge customers in\nadvance for upcoming billing cycles.\n\n**Advanced discounts**\n\nBeta\nApply multiple discounts to subscriptions or individual line items.\n\n**Prorate scheduled changes upfront**\n\nBeta\nBy default, prorations might occur when the subscription is updated. When\nupdates are scheduled for the same billing cycle, simplify prorations by\nprorating for all the scheduled changes up front rather than every time the\nupdates happen.\n\n**Price migrations**\n\nBeta\nUse price migration to move customers from an old pricing model to a new pricing\nmodel.\n\n**Amendments**\n\nBeta\nUse amendments to update an existing multi-phase contract.\n\n**Paid trials**\n\nBeta\nCharge a fee for trial days.\n\n**Customer portal**\n\nLet your customers manage their subscriptions through a Stripe-hosted [customer\nportal](https://docs.stripe.com/customer-management) without writing any code.\n\n## Links\n\n- [quote functionalities](https://docs.stripe.com/quotes)\n- [connectors](https://docs.stripe.com/connectors)\n- [Stripe Billing connector for Salesforce\n(beta)](https://docs.stripe.com/billing/integrations/salesforce)\n- [getting started\nguide](https://docs.stripe.com/products-prices/getting-started)\n- [import that product\ncatalog](https://docs.stripe.com/products-prices/getting-started#import-products-prices)\n- [subscription\nschedules](https://docs.stripe.com/billing/subscriptions/subscription-schedules)\n- [create invoices](https://docs.stripe.com/invoicing)\n- [import them into Stripe\nBilling](https://docs.stripe.com/billing/subscriptions/migrate-subscriptions)\n- [Hosted Invoice\nPage](https://docs.stripe.com/invoicing/hosted-invoice-page#set-payment-methods)\n- [supported payment methods](https://docs.stripe.com/invoicing/payment-methods)\n- [customer portal](https://docs.stripe.com/customer-management)",
  "metadata": {
    "title": "Sales-led B2B billing | Stripe Documentation",
    "description": "Quote and bill complex sales contracts automatically on Stripe Billing.",
    "sourceURL": "https://docs.stripe.com/billing/subscriptions/sales-led-billing"
  }
}