{
  "content": "# Collect tax in Switzerland and Liechtenstein\n\n## Learn how to use Stripe Tax to calculate, collect, and report tax in Switzerland and Liechtenstein.\n\nIn Switzerland and Liechtenstein, Stripe Tax supports calculation and collection\nof [VAT](https://www.estv.admin.ch/estv/en/home/value-added-tax.html).\nSwitzerland and Liechtenstein apply the same VAT rules and are considered one\ncountry for VAT purposes.\n\n## When to register for tax collection\n\nSee [Thresholds](https://dashboard.stripe.com/tax/thresholds) to get insights\nabout your potential tax registration obligations in Switzerland and\nLiechtenstein. Stripe also notifies you with email and Dashboard alerts when you\nneed to register to collect tax. Learn more about how the [monitoring tool\nworks](https://docs.stripe.com/tax/monitoring).\n\nForeign businesses that sell to customers in Liechtenstein or Switzerland must\nregister with the Swiss tax administration if their global taxable turnover\nexceeds 100,000 CHF in a calendar year. They must also register if they expect\ntheir global taxable turnover to exceed 100,000 CHF in the next 12 months.\n\nIf your business meets those criteria, then when you make your first taxable\ntransaction in Switzerland or Liechtenstein, you must appoint a Swiss\nrepresentative and register in Switzerland.\n\nYou don’t need to register in the following cases:\n\n- Your only sales in Switzerland and Liechtenstein are to businesses (B2B), and\nthe sales are subject to reverse charge.\n- You provide only tax-exempt services to customers in Switzerland and\nLiechtenstein.\n\n**Threshold**: 100,000 CHF (global)\n\n**Period**: 12 months\n\n**Included transactions**: All global taxable transactions.\n\n## Register to collect tax\n\nForeign businesses must appoint a fiscal representative to register for VAT\npurposes in Switzerland and provide cash or bank guarantee for future VAT\nliabilities.\n\nFind more information on how to register for VAT in Switzerland on the\n[government\nwebsite](https://www.estv.admin.ch/estv/en/home/value-added-tax.html).\n\nAfter you’ve registered to collect tax in Switzerland, open your Dashboard and\ngo to\n[Registrations](https://dashboard.stripe.com/tax/registrations?location=ch) to\nadd your registrations to Stripe. That turns on tax calculation and collection\nin Stripe for your transactions in Switzerland and Liechtenstein.\n\nLearn more about [how to add your\nregistration](https://docs.stripe.com/tax/registering#track-your-registrations-in-the-tax-dashboard)\nin the Dashboard.\n\n## How we calculate taxes\n\nStripe calculates VAT for your transactions in Switzerland and Liechtenstein.\nStripe considers most goods and services sales taxable unless explicitly\nexempted.\n\nIf your business is registered to collect VAT in Switzerland, you must collect\nVAT on all taxable services you sell in Switzerland or Liechtenstein. However,\nif you’re based outside of Switzerland and Liechtenstein and aren’t registered\nto collect VAT, then most services you provide in Switzerland or Liechtenstein\nare subject to reverse charge. Reverse charge applies to services provided to\ncustomers who are registered for VAT or who acquire services exceeding 10,000\nCHF in a calendar year that are subject to reverse charges.\n\nStripe does not support the special [Swiss VAT\nrule](https://www.gate.estv.admin.ch/mwst-webpublikationen/public/pages/taxInfos/cipherDisplay.xhtml?publicationId=1551451&componentId=1551564)\nthat mandates foreign businesses with annual sales in low-value goods to Swiss\ncustomers exceeding CHF 100,000 to levy Swiss VAT on their sales of goods. The\ndefinition of low-value goods varies based on the tax rate: it includes items\npriced below CHF 62 if the applicable tax rate is 8.1%, and items priced below\nCHF 193 if subject to a 2.6% tax rate.\n\n## Report and file your taxes\n\nStripe Tax has filing partners—Taxually, Marosa, and Hands-off Sales Tax\n(HOST)—to help automate your tax filing. These partners automatically sync your\ntax transaction data in real time, eliminating the need for manual data entry or\nfile transfers. Learn more about [tax\nfiling](https://docs.stripe.com/tax/filing).\n\nStripe also provides reports of your completed tax transactions. Go to\n[Registrations](https://dashboard.stripe.com/tax/registrations) to access these\nreports. Learn more about [the different types of\nreports](https://docs.stripe.com/tax/reports).\n\n## Links\n\n- [VAT](https://www.estv.admin.ch/estv/en/home/value-added-tax.html)\n- [Thresholds](https://dashboard.stripe.com/tax/thresholds)\n- [monitoring tool works](https://docs.stripe.com/tax/monitoring)\n- [Registrations](https://dashboard.stripe.com/tax/registrations?location=ch)\n- [how to add your\nregistration](https://docs.stripe.com/tax/registering#track-your-registrations-in-the-tax-dashboard)\n- [Swiss VAT\nrule](https://www.gate.estv.admin.ch/mwst-webpublikationen/public/pages/taxInfos/cipherDisplay.xhtml?publicationId=1551451&componentId=1551564)\n- [tax filing](https://docs.stripe.com/tax/filing)\n- [Registrations](https://dashboard.stripe.com/tax/registrations)\n- [the different types of reports](https://docs.stripe.com/tax/reports)",
  "metadata": {
    "title": "Collect tax in Switzerland and Liechtenstein | Stripe Documentation",
    "description": "Learn how to use Stripe Tax to calculate, collect, and report tax in Switzerland and Liechtenstein.",
    "sourceURL": "https://docs.stripe.com/tax/supported-countries/europe/switzerland"
  }
}