{
  "content": "# Handle webhook versioning\n\n## Learn how to upgrade the API version of your webhook endpoint.\n\nWebhook endpoints either have a specific API version set or use the default API\nversion of the Stripe account. If you use any of our static language SDKs (.NET,\nJava or Go) to process events, the API version set for webhooks should match the\nversion used to generate the SDKs. Matching these versions ensures successful\ndeserialization of the event object.\n\nUse this guide to safely upgrade your webhook endpoints to a newer API version\nthat may have breaking changes.\n\n## Figure out if the new API version has breaking changes\n\nEvery API version prior to\n[2024-09-30.acacia](https://docs.stripe.com/changelog/acacia#2024-09-30.acacia)\nhas breaking changes.\n\nStarting with the `2024-09-30.acacia` release, Stripe follows a [new API release\nprocess](https://stripe.com/blog/introducing-stripes-new-api-release-process)\nwhere we release new API versions monthly with no breaking changes. Twice a\nyear, we issue a new release (for example, Acacia) that starts with an API\nversion that has breaking changes. You can safely upgrade your webhook endpoints\nto any API version in the same release without making changes to your\nintegration.\n\n## Create a new disabled webhook endpoint\n\nCreate a new webhook endpoint with the following parameters:\n\n- `url`: the same URL as your original webhook endpoint, but add a query\nparameter to distinguish between events sent to the two different endpoints. For\nexample `https://example.com/webhooks?version=2024-04-10`.\n- `enabled_events`: the same events as your original webhook endpoint.\n- `api_version`: the API version you want to upgrade to. If you’re upgrading to\nthe latest API version, you can use the Dashboard or the API to create the\nendpoint. For other versions, use the API to set a specific version.\n\nAfter you create the new webhook endpoint, disable it. You will re-enable it in\nthe next step.\n\n![Two endpoints, but only the old one is sending\nevents](https://b.stripecdn.com/docs-statics-srv/assets/diagram-1.ac21ab637180179813f503649b543e99.png)\n\n## Update your webhook code to ignore events sent to the new endpoint\n\nUpdate your event processing code:\n\n- If the query parameter is for the older API version, process it as usual.\n- If the query parameter is for the newer API version, ignore the event and\nreturn a 200 response to prevent delivery retries.\n\nNext, enable the new webhook endpoint that you created in the previous step. At\nthis point every event is sent twice: once with the old API version and once\nwith the new one.\n\n![Two endpoints sending events, but only processing the old\none](https://b.stripecdn.com/docs-statics-srv/assets/diagram-2.f6b4d3cc0c78971b721fe173f19d5e28.png)\n\n## Update your webhook code to process events for the new endpoint\n\nUpdate the version of the Stripe library you’re using to match the version of\nyour new webhook endpoint. Make sure to read the changelog and handle any\nbreaking changes.\n\nUpdate your event processing code:\n\n- If the query parameter is for the older version, ignore the event. We\nrecommend returning a 400 status to let Stripe automatically retry the event.\nThis ensures that if you need to revert, events are re-sent to the older webhook\nendpoint.\n- If the query parameter is for the new version, process it.\n\n![Two endpoints sending events, but only processing the new\none](https://b.stripecdn.com/docs-statics-srv/assets/diagram-3.8a8b9da70ed66eca60434d406c82f476.png)\n\n## Monitor your new webhook endpoint\n\nIf events aren’t being correctly handled by your new code, try the following:\n\n- Revert to the earlier version of your code.\n- Temporarily disable the new webhook endpoint.\n- Process the failed events (if you returned a 400 status as described in the\nprevious step, Stripe automatically resends all the events).\n- Investigate and fix the issue.\n- Enable the new webhook endpoint and resume monitoring.\n\n## Disable the old webhook endpoint\n\nOnce the upgrade is successful, disable the old webhook endpoint to stop your\nserver from returning `400` status. If you don’t disable it, this may cause\nissues with integrations that relies on a `200` response.\n\nAfter you disable the old webhook endpoint, Stripe won’t re-deliver events that\nreturned a `400`.\n\n![Two endpoints, but only the new one is sending\nevents](https://b.stripecdn.com/docs-statics-srv/assets/diagram-4.907bbd1016f9fbe79283e8c35be7f3cd.png)\n\n## Links\n\n-\n[2024-09-30.acacia](https://docs.stripe.com/changelog/acacia#2024-09-30.acacia)\n- [new API release\nprocess](https://stripe.com/blog/introducing-stripes-new-api-release-process)",
  "metadata": {
    "title": "Handle webhook versioning | Stripe Documentation",
    "description": "Learn how to upgrade the API version of your webhook endpoint.",
    "sourceURL": "https://docs.stripe.com/webhooks/versioning"
  }
}