{
  "content": "# Revenue Recognition Performance Obligations APIPrivate preview\n\n## Learn how to model performance obligation fulfillment in Stripe Revenue Recognition.\n\n## Interested in the Revenue Recognition Performance Obligations API?\n\nPlease provide your email address below and our team will be in touch.\n\nCollect EmailSign upRead our [privacy policy](https://stripe.com/privacy).\n## Overview\n\nPerformance obligation fulfillment is an important part of revenue recognition\nin accounting and finance. It refers to the completion of a transaction in which\nthe seller has delivered the goods or services promised to the customer, and can\nrecognize revenue for the sale. There are several scenarios where fulfillment\noccurs and revenue can be recognized, including but not limited to:\n\n- **Delivery of tangible goods**: Fulfillment occurs when the physical goods\nhave been shipped to the customer and they’ve taken possession of the goods. The\ndelivery of the goods confirms that the customer has received the promised\nbenefit, and therefore you can recognize the revenue from the sale.\n- **Performance of a service**: In the case of a service-based sale, fulfillment\noccurs when the service has been performed and the customer has accepted the\nservice. After the customer has accepted the service, you can recognize the\nrevenue.\n- **Prepayment**: A customer pays for a service or goods in advance of receiving\nthe actual service or goods. You can recognize the revenue from the pre-payment\nover time as the service is delivered or the goods are used.\n\nThis guide explains how to use the Stripe Revenue Recognition Performance\nObligations API to achieve accurate revenue reporting.\n\n## Setup\n\nThis example uses a product named “Prepaid package.” Create the product as a\n[Stripe product](https://docs.stripe.com/invoicing/products-prices)—call it\n“Product Prepaid package.”\n\nUnder the Product Prepaid package, a create a\n[Price](https://docs.stripe.com/invoicing/products-prices) for one unit. The\nprice is 1 USD per unit. Call the price “Prepaid package.”\n\nSay you bill a customer for a 100 USD Product Prepaid package, which includes a\nPrice Prepaid package for 100 units. You want to defer the 100 USD upon\ninvoicing and to recognize it based on the usage.\n\n### Create a subscription or an invoice\n\nNow you can set up a subscription or a standalone invoice to bill the customer.\n\nFor a subscription, you’ll need to add a subscription item whose price is Price\nPrepaid package for 100 units.\n\nFor an invoice, you’ll need to add an invoice item whose price is Price Prepaid\nfor 100 units.\n\n### Create a Revenue Recognition rule\n\nTo defer the revenue upon invoicing, you’ll need to create a [Revenue\nRecognition rule](https://docs.stripe.com/revenue-recognition/rules). If no\nfulfillment events are ever sent, the revenue will be recognized entirely over\nthe specified period, which defaults to one year.\n\n![Performance Obligations API Revenue Recognition Rule\nExample](https://b.stripecdn.com/docs-statics-srv/assets/performance-obligations-api-rev-rec-rule.5a53e3837cf2eb1fd58944b46725c464.png)\n\n## Record usages\n\nYou can record usages through the API.\n\nIf you were to create an invoice on June 1, 2022, and 10 units are used on July\n29, 2022, you would send the below API request:\n\n```\ncurl https://api.stripe.com/v1/revenue_recognition/performance_obligations \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d \"target[type]\"=invoice_line_item \\\n -d \"target[invoice_line_item]\"=il_AAA \\\n -d \"period[start]\"=1659078000 \\\n -d amount=1000 \\\n -d currency=usd\n```\n\n## Reporting\n\n### Before fulfillment\n\nIf you download the debits and credits reports in June 2022, the following is\nwhat you would see. Because no usage is recorded yet, the whole invoice line\nitem will be deferred and recognized 12 months later.\n\nAccountJun 2022Jun 2023AccountsReceivable+100DeferredRevenue+100-100Revenue+100\n### Partial fulfillment\n\nWith the usage recorded in the section above, the reports would look like the\nfollowing in July 2022:\n\nAccountJun 2022Jul 2022Jun\n2023AccountsReceivable+100DeferredRevenue+100-10-90Revenue+10+90\n### Full fulfillment\n\nSuppose another usage is recorded on Aug 10, 2022 with the remaining amount (90\nUSD). The deferred revenue will be converted to revenue completely in Aug 2022:\n\nAccountJun 2022Jul 2022Aug\n2022AccountsReceivable+100DeferredRevenue+100-10-90Revenue+10+90\n\n## Links\n\n- [privacy policy](https://stripe.com/privacy)\n- [Stripe product](https://docs.stripe.com/invoicing/products-prices)\n- [Revenue Recognition rule](https://docs.stripe.com/revenue-recognition/rules)",
  "metadata": {
    "title": "Revenue Recognition Performance Obligations API | Stripe Documentation",
    "description": "Learn how to model performance obligation fulfillment in Stripe Revenue Recognition.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/performance-obligations-api"
  }
}