{
  "content": "# Incorporation documents\n\n## Learn about the documents Atlas uses to incorporate your company.\n\nHere are the documents Atlas uses to incorporate your company. After you form\nyour company, you can view your incorporation documents in the\n[Documents](https://dashboard.stripe.com/atlas/documents) tab of your Atlas\nDashboard.\n\nC corporationLLC\nAtlas helps you set up a company using templates created in collaboration with\nCooley LLP. These include common defaults and don’t include non-compete and\nnon-solicit clauses. This service isn’t a substitute for legal advice. If you\nneed customized documents, consider speaking with a lawyer.\n\nDocumentDescriptionCertificate of IncorporationFiled with the Delaware Division\nof Corporations to incorporate your company. Appoints your registered agent.\nOften needed to open a bank account. Contains your seven-digit state file number\nassigned by Delaware.Action by Written Consent of Sole IncorporatorAppoints the\ninitial board of directors.BylawsDefines the role of the board and officers, and\ncompany procedures such as holding board meetings and approving shares. Sets\nstandard rules for corporate governance.Certificate of Secretary of\nBylawsConfirms adoption of the company’s bylaws. Evidence your company has\nfollowed standard corporate procedures since incorporation.Initial Action by the\nBoard of DirectorsServes as your initial board meeting and approves issuance of\nfounders’ shares. Describes standard company tasks like approving the Bylaws,\nelecting officers, and setting your company’s fiscal year.Indemnification\nAgreementProtects the company’s officers and directors in the event of lawsuits\nwhile serving in their roles. Outlines when and how the company will cover\nexpenses associated with lawsuits.Stockholder Consent of Indemnification\nAgreementsApproves the Indemnification Agreement. Allows your company to provide\nlegal protection for your leadership team when they act on behalf of the\ncompany.Form SS-4Filed by Atlas with the IRS to request a tax ID (EIN) for your\ncompany.Form 8821Gives Atlas permission to call the IRS on your behalf to\nprevent delays in getting your EIN.Restricted Stock Purchase Agreement and\nAssignment AgreementDefines the terms of your initial share purchase in the\ncompany, including your vesting schedule and acceleration. Atlas founders pay\nfor their shares with the intellectual property (IP) they have developed on\nbehalf of the company. Shares are priced at $0.00001 at incorporation. If you\nhave significant IP or assets to contribute to the company, Atlas might not be\nright for you.Common Stock CertificateOfficial record of your ownership in the\ncompany. Shows the number of common stock shares issued to you, and outlines the\nrules for selling or transferring those shares.Section 83(b)Tax filing that\nallows founders to pay taxes on equity when it’s granted, rather than when it\nvests. It can help save you money on US personal taxes. Notifies the IRS of the\ndate you purchased your equity in your company, and the amount you purchased it\nfor. Atlas files 83(b) elections automatically for all founders.Stock Assignment\nSeparate from CertificateAllows the company to repurchase your shares based on\nterms in your Restricted Stock Purchase Agreement.Joint Escrow InstructionsPuts\nfounders’ shares in escrow with the company Secretary.Form of Employee\nConfidential Information and Invention Assignment AgreementCommonly used by\ncompanies to ensure that relevant IP created both before and after incorporation\nbelongs to the company. If you have any prior inventions you’d like to exclude\nfrom being assigned to the company, Atlas might not be right for you. Atlas\nomits non-compete and non-solicit clauses because they’re state specific, and\ncan be hard to enforce. You can work with a lawyer to include them after\nincorporation.\n\n## Links\n\n- [Documents](https://dashboard.stripe.com/atlas/documents)",
  "metadata": {
    "title": "Incorporation documents | Stripe Documentation",
    "description": "Learn about the documents Atlas uses to incorporate your company.",
    "sourceURL": "https://docs.stripe.com/atlas/incorporation-documents"
  }
}