{
  "content": "# Company types\n\n## Form a C corporation or an LLC using Stripe Atlas.\n\nWith Stripe Atlas, you can incorporate a Delaware C corporation (C corp), a\nDelaware Limited Liability Company (LLC), or a subsidiary (also a C corp). Each\nentity type is suited to different business needs. This guide outlines what you\nneed to know about each entity.\n\nC corporationLLC\nWith Stripe Atlas, you can incorporate a new Delaware C corporation or a\nsubsidiary of an existing corporation. Here are a few characteristics that are\ncommon to C corporations.\n\n- **Ownership**: Used to grant equity to employees, advisors, and investors.\n- **Capital** : Preferred by institutional investors who might be unable to\ninvest in LLCs.\n- **Tax treatment**: Can typically use early startup losses to offset future\ntaxes, subject to some limitations.\n\nIf your company is a subsidiary of an existing company, you need to issue shares\nto your parent company after incorporation. Atlas provides a standard template\nthat you can customize with a lawyer based on your specific circumstances.\n\n## Tax implications of incorporating near the end of a calendar year\n\nIf you plan to incorporate near the end of the calendar year, consider the tax\nimplications. C corps and LLCs operating in Delaware before December 31 are\nsubject to annual tax for that year. Annual tax isn’t prorated. Waiting until\nJanuary 1 to incorporate could save you a full year of Delaware annual tax.\n\nYour company might also owe federal corporate income tax or taxes in other\nstates and countries. Consult with a tax professional to understand the tax\nimplications of incorporating near the end of a calendar year.\n\n## Next steps\n\n- [Get started with Stripe Atlas](https://docs.stripe.com/atlas/signup)\n- [Learn more about Section 83(b)\nelections](https://docs.stripe.com/atlas/83b-election)\n\n## Links\n\n- [Get started with Stripe Atlas](https://docs.stripe.com/atlas/signup)\n- [Learn more about Section 83(b)\nelections](https://docs.stripe.com/atlas/83b-election)",
  "metadata": {
    "title": "Company types | Stripe Documentation",
    "description": "Form a C corporation or an LLC using Stripe Atlas.",
    "sourceURL": "https://docs.stripe.com/atlas/company-types"
  }
}