{
  "content": "# Best practices for risk management\n\n## Protect your integration by implementing best practices for preventing, mitigating, and responding to payments risk.\n\nThese best practices for protecting your Connect integration are based on what\nwe’ve learned from thousands of platforms, extensions, and plug-ins.\n\n## Decide your approach to negative balance liability\n\nBecause your choice of negative balance liability can significantly impact your\nplatform and connected accounts, consider it carefully before onboarding any\naccounts. We advise that new platforms have Stripe take responsibility for\nnegative balances on connected accounts. Only consider taking responsibility as\nthe platform if you’re confident in your ability to manage merchant risk.\n\n## Best practices for both approaches\n\n### Prevent fraudulent transactions by enabling Radar\n\nWhen you enable Radar, payment risk scoring is on by default at the user level,\npreventing transactions with high fraud risk. For information on using Radar\nwith connected accounts, see [Using Radar with\nConnect](https://docs.stripe.com/connect/radar).\n\n### Manage notifications and communications with Stripe\n\n#### Webhook notifications\n\nStripe uses [webhooks](https://docs.stripe.com/webhooks) to notify you of your\nconnected accounts’ activities. Set up [Connect\nwebhooks](https://docs.stripe.com/connect/webhooks) so you can avoid delays in\nfund transfers by promptly responding to connected account updates and Stripe\nrequests.\n\nStripe requests additional information if the provided user information fails\nverification. An incorrect date of birth or last name might be the result of a\ndata entry error. You can help your connected accounts respond to failed\nverifications by directing them to [Stripe-hosted\nonboarding](https://docs.stripe.com/connect/hosted-onboarding) or [Embedded\nonboarding](https://docs.stripe.com/connect/embedded-onboarding), or request the\ndata yourself if you use [API\nonboarding](https://docs.stripe.com/connect/api-onboarding).\n\nWhen a user updates their account information (for example, bank account),\nStripe sends you a notification of the change.\n\n#### Accounts to review\n\nThe [Accounts to\nReview](https://dashboard.stripe.com/connect/accounts_to_review) tab in your\nConnect Dashboard helps you monitor the risk and onboarding status of all of\nyour connected accounts. This tab allows you to view any risk or onboarding\nrestrictions that impact your accounts or that will impact them in the future.\nIt also provides clear instructions on how to resolve open requirements.\n\n#### Support transparency\n\nYou can use your Connect dashboard to [view support\ncases](https://docs.stripe.com/connect/dashboard/managing-individual-accounts#view-and-unblock-support-cases)\nthat your connected accounts have opened with Stripe and help unblock them by\nproviding additional context. Specifically, you can view a list of support\ncases, review conversations between connected accounts and Stripe, and send\nprivate messages to Stripe Support with information to help resolve issues.\n\n### Concerns about sanctions\n\nAs a US company, Stripe complies with all sanctions programs administered by the\nUS Office of Foreign Assets Control (OFAC), along with a number of other\nnational and international sanctions regimes. That includes prohibitions against\ninteractions with certain individuals and entities, as well as comprehensive\nbans on business dealings involving certain countries or regions targeted by\nsanctions regimes.\n\nStripe screens all accounts, including connected accounts, in compliance with\nour own obligations under sanctions regimes. If a connected account is flagged\nas a possible sanctions concern, Stripe pauses payouts from that account and\nemails the platform to request additional information. If you have a preferred\nemail address for receiving sanctions-related requests, [contact Stripe\nSupport](https://support.stripe.com/contact).\n\nPayouts from the connected account remain paused until the review has been\ncleared. Disregarding or violating sanctions can lead to fines, regulatory\naction, and loss of licensing for both Stripe and our users.\n\n## Best practices for platform negative balance liability connected accounts\n\n### Core considerations\n\nPlatforms can bring merchant risk management in-house and further tailor their\nconnected accounts’ experiences using risk tooling that Stripe provides. For\nadditional details on strategy and approach to risk management, see our [guide\non risk management for software\nplatforms](https://stripe.com/guides/introduction-to-risk-management). Starting\na risk management solution involves several investments. Some of the core\nconsiderations include:\n\n- Screening and detection: Risk screening infrastructure to understand the risk\nprofile of connected accounts and prevent or reduce fraud and credit risk. This\nincludes building detection mechanisms to identify risky connected accounts.\n- Monitoring and mitigation: Systems to monitor risk signals and take action\n(such as pausing payouts, pay-ins, and so on) to mitigate exposure in response\nto changes in risk signals over time. Building workflows in your product to make\nsure that users have resolution paths in response to actions, such as uploading\nidentity documents, verifying legal entity information or providing additional\nrisk related information.\n- Risk specialists: Risk operations teams can monitor risk exposure and\nintervene in response to signals. Make sure that your operations teams can\nsupport connected account owners with questions about risk actions taken on\ntheir account.\n\n### Reduce the risk of fraudulent merchants using your platform\n\nBefore going live, establish best practices for preventing fraud and managing\nrisk. There’s no foolproof method to detect bad actors. Mitigate [fraud\nrisk](https://docs.stripe.com/disputes/prevention/fraud-types) by following risk\nmanagement best practices to assess an account’s holistic risk profile. The more\nyou understand your connected account and their business, the better the risk\nassessment. Stripe recommends that you:\n\n- Verify your connected accounts before they can do business through your\nplatform.\n- Examine an account’s online presence through social or professional profiles\nsuch as Facebook, X (formerly Twitter), or LinkedIn.\n- Closely review the account’s website, including considering whether it’s\nappropriate for them to have one.\n- Collect any appropriate licenses for their business.\n- Confirm their email address if it’s linked to their business domain. For\nexample, send an email to an address at that domain and require a response from\nit.\n- Collect and verify platform-appropriate information such as a physical\naddress, inventory list, or selling history.\n- Monitor activity on your platform to get a sense of typical behavior, which\nyou can use to identify future suspicious behavior.\n- Pause payments or payouts when suspicious behavior is detected.\n- Use the built-in fraud tools to identify and prevent fraud on individual\ncharge attempts. For information on how Radar works with Connect, see [Using\nRadar with Connect](https://docs.stripe.com/connect/radar).\n- Add additional verifications to Connect onboarding and disable payouts or\npayments until the checks pass.\n\nIf you suspect that a connected account is committing fraud, Stripe recommends\nrejecting that account. That reduces losses by preventing the account from\nreceiving more funds and helps improve Stripe’s fraud detection systems.\n\n### Prevent account take-overs\n\nBad actors can target your connected accounts and compromise them, an attack\nknown as account takeover (ATO). Attackers commonly obtain account credentials\nusing methods like phishing, data breaches, and guessable passwords. They use\nthe credentials to create unauthorized transactions and other fraudulent\nactivities on the account. To help prevent account takeovers, it’s good practice\nto:\n\n- Require two-factor authentication when your connected account users log in\n- Educate your connected accounts about phishing and other vulnerabilities\n- Enforce unique password policies\n- Monitor anomalous login activity, especially when it involves new device\nidentifiers or IP addresses\n- Monitor changes to sensitive account data such as passwords, email addresses,\nand bank account information that originates from new devices\n- Use identity checks to assist in two-factor authentication recovery or in\nresponse to suspicious activity\n\n### Mitigate credit risks\n\nManaging [disputes and chargebacks](https://docs.stripe.com/disputes/prevention)\nare a normal part of doing business when accepting card payments. To build an\neffective strategy for preventing disputes, employ a number of different\nmethods. The following subsections contain some recommendations to help you\nmanage your exposure, protect your business, and support your accounts.\n\n### Account monitoring\n\nMonitor your accounts. The more you understand your connected account and their\nbusiness, the better you can assess their risk.\n\n- Examine connected account balances through [the\nAPI](https://docs.stripe.com/connect/account-balances#accounting-for-negative-balances)\nor [the\nDashboard](https://docs.stripe.com/connect/dashboard/viewing-all-accounts). In\nthe [Dashboard’s accounts\noverview](https://dashboard.stripe.com/test/connect/accounts/overview), use\nfilters to investigate accounts that might require you to take action, such as\naccounts with negative balances.\n- Review financial activity on an account. When viewing the account in the\nDashboard, click **View financial reports** in the **Activity** card.\n- Create alerts to monitor riskier accounts so you can quickly adjust your\nstrategies. Riskier accounts have higher dispute rates (dispute activity above\n0.75% is generally considered excessive), sharply reduced volume, or negative\nbalances.\n\n### Riskier accounts\n\nFor newer sellers or service providers that might be riskier, consider delaying\nor holding payouts until goods or services are delivered. Learn more about\n[account balances](https://docs.stripe.com/connect/account-balances) and [payout\nscheduling](https://docs.stripe.com/connect/manage-payout-schedule).\n\nFor platforms with users on manual payouts, you can update your payout creation\nlogic to defer or slow down payouts for riskier accounts.\n\nFor connected accounts that receive automatic payouts, you can slow them by\nextending the payout schedule on a per-account basis in the Dashboard or by\nsetting\n[settings.payouts.schedule](https://docs.stripe.com/api/accounts/update#update_account-settings-payouts-schedule)\nin the API. When [viewing the account in the\nDashboard](https://dashboard.stripe.com/test/connect/accounts/overview), click\n**Edit payout schedule** in the **Balance** card’s overflow menu :\n\n![Edit the payout schedule in the Stripe\nDashboard](https://b.stripecdn.com/docs-statics-srv/assets/edit-payout-schedule.0ad82911f52d981bc62e0a046efca02a.png)\n\n### Impact from chargebacks and negative balances\n\nConsider product or service refunds instead of having to manage chargebacks and\nnegative balances. It might be better for the customer and also less expensive\nfor you. Your options include:\n\n- Issue refunds. You can check whether the connected account’s balance can cover\nthe refund using the\n[Dashboard](https://docs.stripe.com/connect/dashboard/viewing-all-accounts) or\nby [retrieving it](https://docs.stripe.com/api/balance/balance_retrieve) using\nthe API. If their balance can’t cover the refund, you can [reverse the\ntransfer](https://docs.stripe.com/connect/separate-charges-and-transfers#reverse-transfers)\nwithout issuing the refund, which results in a negative balance on the account.\n- Issue refunds based on certain parameters. For example, you can wait until the\naccount’s balance is no longer negative to issue refunds or immediately issue\nthe refund knowing that future payments can cover the amount.\n- Proactively cancel and refund charges that are likely to be disputed. The loss\non the transaction might be better for the account than getting a chargeback. In\naddition, there are costs that come with chargebacks and the [potential\nscrutiny](https://docs.stripe.com/disputes/monitoring-programs) from card\nnetworks.\n- Permit your team to handle refunds by [adding them to your platform\naccount](https://docs.stripe.com/get-started/account/teams/roles).\n- Pause collection of recurring payments for\n[subscriptions](https://docs.stripe.com/billing/subscriptions/pause-payment)\nthat are at high risk for chargebacks. That gives you more control over when to\nresume the\n[subscription](https://docs.stripe.com/billing/subscriptions/creating). For\nexample, if your platform offers classes that have been canceled for the next\nfew months, you can pause collection of payments for those classes.\n- Protect your platform from negative balances by [adding\nfunds](https://docs.stripe.com/connect/top-ups) to your platform balance.\n- If you have access to [Stripe Sigma](https://docs.stripe.com/stripe-data), use\nit to generate a report of each account’s [negative balance over\ntime](https://dashboard.stripe.com/sigma/queries/templates/Account%20balances%20for%20each%20connected%20account).\n\n### Negative balances on accounts Australia Canada Europe (SEPA, UK) New Zealand US\n\nIf your connected accounts are in Australia, Canada, Europe (SEPA countries,\nincluding the UK), New Zealand, or the US, you can allow Stripe to cover\nnegative balances by automatically debiting their external accounts. In New\nZealand, automatic debiting is only supported for connected accounts where\nStripe is responsible for collecting updated information when requirements are\ndue or change (including Standard and Express accounts). Otherwise, connected\naccounts can cover negative balances with future payment volume.\n\nBy default, automatic debiting is set to false for connected accounts where the\nplatform is responsible for collecting updated information when requirements are\ndue or change (including Custom accounts). You can toggle the automatic debits\nsetting on an account using the Dashboard or by setting\n[debit_negative_balances](https://docs.stripe.com/api/accounts/object#account_object-settings-payouts-debit_negative_balances)\nusing the API.\n\nFrom the\n[Dashboard](https://dashboard.stripe.com/test/connect/accounts/overview), select\nan account and open the **Balance** card’s overflow menu (). You can view all\nconnected accounts that have the automatic debits setting turned off by using\nthe **Debit negative balances** filter:\n\n![Stripe Dashboard using the Debit negative balances\nfilter](https://b.stripecdn.com/docs-statics-srv/assets/debit-negative-balances-filter.ae29916e89cbf02aad1826a8e6e9ba50.png)\n\n### Use Stripe’s tools to manage merchant risks\n\nStripe provides platforms with several tools to monitor and manage risk.\n\n**Loss prevention tools**\n\n- **Debit Negative Balances**: For connected accounts in certain countries, you\ncan allow Stripe to automatically debit their external accounts to cover\nnegative balances. Otherwise, negative balances can be covered by future payment\nvolume. You can toggle the automatic debits setting on an account using the\nDashboard or by setting\n[debit_negative_balances](https://docs.stripe.com/api/accounts/object#account_object-settings-payouts-debit_negative_balances)\nusing the Accounts API.\n- **Set payout timing**: You can set default\n[delay_days](https://docs.stripe.com/api/accounts/update#update_account-settings-payouts-schedule-delay_days)\nfor payouts to connected accounts that are considered risky or are located in\ncountries with higher fraud rates.\n\n**Additional risk signals**\n\n- **Identity**: Streamline risk processes by providing ID verification during\nonboarding or prior to enabling payouts.\n- **Financial Connections**: Minimize fraud by matching bank account ownership\nwith the identity of a connected account user before accepting payments or\npayouts. Fully underwrite accounts with a deep understanding of balance and\ntransaction data.\n\n**Actioning**\n\n- **Pause payouts**: In the Dashboard, you can pause payouts as a first line of\ndefense after you identify suspicious activity. Pausing payouts stops a\nconnected account from completing payouts to their bank account.\n- **Pause payments**: In the Dashboard, you can pause payments as a second line\nof defense. Pausing payments on a suspicious connected account limits your\nexposure by stopping it from collecting payments through your platform.\n- **Reject account**: You can use the API or Dashboard to remove fraudulent or\nrisky connected accounts from your platform. Rejecting an account is permanent\nand should only be used as the last line of defense.\n\n## Links\n\n- [Using Radar with Connect](https://docs.stripe.com/connect/radar)\n- [webhooks](https://docs.stripe.com/webhooks)\n- [Connect webhooks](https://docs.stripe.com/connect/webhooks)\n- [Stripe-hosted onboarding](https://docs.stripe.com/connect/hosted-onboarding)\n- [Embedded onboarding](https://docs.stripe.com/connect/embedded-onboarding)\n- [API onboarding](https://docs.stripe.com/connect/api-onboarding)\n- [Accounts to Review](https://dashboard.stripe.com/connect/accounts_to_review)\n- [view support\ncases](https://docs.stripe.com/connect/dashboard/managing-individual-accounts#view-and-unblock-support-cases)\n- [contact Stripe Support](https://support.stripe.com/contact)\n- [guide on risk management for software\nplatforms](https://stripe.com/guides/introduction-to-risk-management)\n- [fraud risk](https://docs.stripe.com/disputes/prevention/fraud-types)\n- [disputes and chargebacks](https://docs.stripe.com/disputes/prevention)\n- [the\nAPI](https://docs.stripe.com/connect/account-balances#accounting-for-negative-balances)\n- [the\nDashboard](https://docs.stripe.com/connect/dashboard/viewing-all-accounts)\n- [Dashboard’s accounts\noverview](https://dashboard.stripe.com/test/connect/accounts/overview)\n- [account balances](https://docs.stripe.com/connect/account-balances)\n- [payout scheduling](https://docs.stripe.com/connect/manage-payout-schedule)\n-\n[settings.payouts.schedule](https://docs.stripe.com/api/accounts/update#update_account-settings-payouts-schedule)\n- [retrieving it](https://docs.stripe.com/api/balance/balance_retrieve)\n- [reverse the\ntransfer](https://docs.stripe.com/connect/separate-charges-and-transfers#reverse-transfers)\n- [potential scrutiny](https://docs.stripe.com/disputes/monitoring-programs)\n- [adding them to your platform\naccount](https://docs.stripe.com/get-started/account/teams/roles)\n- [subscriptions](https://docs.stripe.com/billing/subscriptions/pause-payment)\n- [subscription](https://docs.stripe.com/billing/subscriptions/creating)\n- [adding funds](https://docs.stripe.com/connect/top-ups)\n- [Stripe Sigma](https://docs.stripe.com/stripe-data)\n- [negative balance over\ntime](https://dashboard.stripe.com/sigma/queries/templates/Account%20balances%20for%20each%20connected%20account)\n-\n[debit_negative_balances](https://docs.stripe.com/api/accounts/object#account_object-settings-payouts-debit_negative_balances)\n- [Debit Negative\nBalances](https://docs.stripe.com/connect/account-balances#automatically-debit-connected-accounts)\n-\n[delay_days](https://docs.stripe.com/api/accounts/update#update_account-settings-payouts-schedule-delay_days)\n- [Identity](https://docs.stripe.com/identity)\n- [Financial Connections](https://docs.stripe.com/financial-connections)\n- [Pause\npayouts](https://docs.stripe.com/connect/pausing-payments-or-payouts-on-connected-accounts)\n- [Reject account](https://docs.stripe.com/api/account/reject)",
  "metadata": {
    "title": "Best practices for risk management | Stripe Documentation",
    "description": "Protect your integration by implementing best practices for preventing, mitigating, and responding to payments risk.",
    "sourceURL": "https://docs.stripe.com/connect/risk-management/best-practices"
  }
}