{
  "content": "# How Connect works\n\n## Learn how Connect's features support multiparty integrations.\n\nBusinesses such as marketplaces and software platforms use Connect to manage and\nroute payments and payouts between sellers, customers, service providers, and\nother entities.\n\n- **Onboarding**: Onboard and verify sellers using connected accounts with\nStripe-hosted flows, or build your own with our APIs.\n- **Account management**: Enable sellers to manage their account with\nStripe-hosted Dashboards, embedded components, or custom interfaces you can\nbuild with our APIs.\n- **Payments**: Integrate payments and route funds to sellers on your platform.\n- **Payouts**: Pay out sellers with a variety of payout options. Enable\ncross-border payouts for global sellers.\n- **Platform tools**: Manage your platform or marketplace with a sophisticated\nsuite of platform tooling for monetization, seller support, risk management, and\ntax reporting.\n\n## Elements of a Connect integration\n\nA Connect integration consists of five main components:\n\n- Your platform’s web or mobile application\n- Your platform’s Stripe account\n- Connected accounts\n- Stripe payments\n- Stripe payouts\n\nWhen onboarding to Connect, you create a Connect application on your platform’s\nStripe account. The Connect application allows you to create and access data on\nyour connected accounts. You use your Stripe API keys to make [API requests on\nbehalf of your connected\naccounts](https://docs.stripe.com/connect/authentication).\n\n![An overview of interactions between a Connect platform, customers, and\nconnected\naccounts](https://b.stripecdn.com/docs-statics-srv/assets/connect-overview.c6c7d0fac01a655bc51523add1eecd21.png)\n\nConnect offers a number of different options for onboarding connected accounts\nand creating payments and payouts on them. Giving connected accounts access to\nStripe-hosted Dashboards and embedded components lets you customize their\nfinancial workflows while minimizing your development effort and time to launch.\n\nConnect charge types offer different ways to orchestrate payments to your\nconnected accounts, whether enabling them to accept payments directly or\nfacilitating payments between multiple sellers. Connect payouts enable you to\nmanage payout timing, destination payout accounts, and payout monetization on\nyour connected accounts.\n\n## Availability\n\nThe countries where you can have connected accounts depends on the business\nlocation of your platform’s country:\n\n- [Cross-border payouts](https://docs.stripe.com/connect/cross-border-payouts):\nIf your platform qualifies, you can pay out connected accounts in their local\ncurrencies. Stripe determines if your platform meets the criteria to support\ncross-border payouts.\n- Extra features: If using Connect with additional payment methods or with\n[Stripe Terminal](https://docs.stripe.com/terminal), country availability is\nalso dependent on those features.\n\n### Country availability\n\n## Use cases\n\nConnect is highly flexible and designed to support many multiparty use cases:\n\n- **SaaS platforms**: Enable connected accounts to accept payments directly.\nPlatforms such as Squarespace enable businesses to build their own online stores\nto sell directly to customers.\n- **Marketplaces**: Collect payments and pay out to multiple sellers. Platforms\nsuch as Airbnb connect homeowners to potential guests.\n- **Top-up and pay out**: Pay out to accounts without accepting payments. Add\nfunds to your platform account and then transfer funds to your connected\naccounts without processing payments on Stripe.\n- **In-person payments**: Add Stripe Terminal to your multiparty integration.\nEnable your connected accounts to accept in-person payments alongside online\npayments with a single integration.\n\n## Design an integration\n\nTo determine how to build a Connect integration for your use case:\n\n- Complete the [Connect platform\nonboarding](https://dashboard.stripe.com/connect/set-up/welcome) process or view\n[example integrations](https://docs.stripe.com/connect#example-integrations).\n- After onboarding, review your [integration\nguide](https://docs.stripe.com/connect/design-an-integration). The guide is\ncustomized with selections you’ve made in platform onboarding.\n- Follow the [onboarding\nquickstart](https://docs.stripe.com/connect/onboarding/quickstart) to set up and\nstart using your integration.\n\n## Links\n\n- [API requests on behalf of your connected\naccounts](https://docs.stripe.com/connect/authentication)\n- [Cross-border payouts](https://docs.stripe.com/connect/cross-border-payouts)\n- [Stripe Terminal](https://docs.stripe.com/terminal)\n- [Connect platform\nonboarding](https://dashboard.stripe.com/connect/set-up/welcome)\n- [example integrations](https://docs.stripe.com/connect#example-integrations)\n- [integration guide](https://docs.stripe.com/connect/design-an-integration)\n- [onboarding quickstart](https://docs.stripe.com/connect/onboarding/quickstart)",
  "metadata": {
    "title": "How Connect works | Stripe Documentation",
    "description": "Learn how Connect's features support multiparty integrations.",
    "sourceURL": "https://docs.stripe.com/connect/how-connect-works"
  }
}