{
  "content": "# Virtual bank account numbers\n\n## Learn best practices for using Virtual Bank Account Numbers (VBANs) for reconciliation on Stripe.\n\nVirtual Bank Account Numbers (VBANs) are an important part of the bank transfers\npayment method. To accept funds from a bank transfer, Stripe issues a VBAN to\nyour customer. When the customer transfers money to that VBAN, Stripe\nautomatically allocates the funds to the customer’s cash balance. After these\nfunds arrive on the customer’s cash balance, Stripe carries out further\nreconciliation steps to associate the funds with the correct PaymentIntent or\nInvoice.\n\nAfter a customer has been allocated a VBAN, it belongs to them forever. Any\nadditional funds that are sent to that VBAN are automatically added to\ncustomer’s cash balance. Because VBANs are permanent, it’s important to\nunderstand their limits and best practices for using them.\n\n## Allocation\n\nThere are several ways to allocate a VBAN to a customer.\n\n- When you create and confirm a **PaymentIntent** with the customer balance\npayment method, Stripe looks for an existing VBAN that is assigned to the\ncustomer and for the country specified in the request. If the customer does not\nhave an appropriate VBAN, Stripe generates a new VBAN for the customer.\n- When you create a new **Invoice** with the customer balance payment method,\nStripe looks for an existing VBAN that matches the country and is assigned to\nthe customer specified in the request. If the customer does not have an\nappropriate VBAN, Stripe generates a new VBAN for the customer.\n- The [Funding Instructions\nAPI](https://docs.stripe.com/payments/customer-balance/funding-instructions)\ncreates VBANs without requiring an existing PaymentIntent or Invoice. You can\nuse this API when you don’t expect payment from a customer yet but still want to\ncreate a new VBAN for them.\n\n## Limits and Best Practices\n\nWhen you integrate with bank transfers, only request a VBAN for a customer if\nthey’re likely to make a payment using a bank transfer. In these cases, you only\ngenerate a VBAN when creating a PaymentIntent or a Invoice.\n\nDon’t assign VBANs to inactive customers or make VBAN allocation part of your\nregistration flow.\n\nDue to regional differences in VBAN availability, Stripe enforces different\nlimits per region. If you need more VBANs than the limits allow, please [reach\nout to our support team](https://support.stripe.com/).\n\nRegionLimitsUSWe allow up to 5,000 new VBANs every 24 hours.UKWe allow up to\n2,000 new VBANs every 24 hours.EUWe allow up to 5,000 new VBANs every 24 hours\nand enforce a lifetime limit of 50,000 VBANs per account. Stripe also charges [a\nfee](https://stripe.com/pricing/local-payment-methods) for every new VBAN\nallocation over 1,000 allocations made in the EU.JPWe allow up to 1,000 new\nVBANs every 24 hours.MXWe allow up to 1,000 new VBANs every 24 hours.\n\n## Links\n\n- [Funding Instructions\nAPI](https://docs.stripe.com/payments/customer-balance/funding-instructions)\n- [reach out to our support team](https://support.stripe.com/)\n- [a fee](https://stripe.com/pricing/local-payment-methods)",
  "metadata": {
    "title": "Virtual bank account numbers | Stripe Documentation",
    "description": "Learn best practices for using Virtual Bank Account Numbers (VBANs) for reconciliation on Stripe.",
    "sourceURL": "https://docs.stripe.com/payments/customer-balance/virtual-bank-account-numbers"
  }
}