{
  "content": "# Product release phases\n\n## Learn how Stripe describes product release phases.\n\nStripe uses specifically-named release phases to describe the availability of\nfeatures in the Stripe API, Dashboard, and other product areas. These phases\nenable us to incrementally release new features and improve them based on your\nfeedback.\n\nUse the table below to learn more about each phase and what to expect.\n\nProduct release phaseWho can request accessFeature completenessHow to get\nsupportPrivate preview or private developer preview- Restricted to a subset of\naccounts.\n- Access is by invitation only.\n- **Completeness**: Expect incompleteness and some limited functionality as we\ncontinue development and build the product in partnership with early users.\n- **Changes**: Breaking changes expected over time as we update and develop\nfunctionality.\n- **Support**: Directly from the Stripe product team.\n- **Documentation**: Directly from the Stripe product team and from the [Stripe\ndocs](https://docs.stripe.com/) and [Stripe\nsupport](https://support.stripe.com/) (if applicable).\nPublic preview or developer preview- Open to any user with a Stripe account.\n- Most public previews are self-opt-in, but some might require users to request\naccess from Stripe.\n- **Completeness**: Not feature-complete and might include major new\nfunctionality or changes before release.\n- **Changes**: Some breaking changes expected as we develop and update\nfunctionality.\n- **Support**: Stripe Support.\n- **Documentation**: From Stripe docs and support pages.\nGeneral availability (GA)- Open to any user with a Stripe account.\n- Most general availability features are self-opt-in, but some might require\nusers to request access from Stripe.\n- **Completeness**: Feature-complete.\n- **Changes**: No breaking changes expected; any future changes handled through\nAPI version upgrades.\n- **Support**: Stripe Support.\n- **Documentation**: From Stripe docs and support pages.\n\nProducts or features that you have access to in preview (previously known as\n“beta” or “Beta”) are subject to terms and conditions applicable to private\npreview, private developer preview, public preview, developer preview, or beta.\n\n## Links\n\n- [Stripe docs](https://docs.stripe.com/)\n- [Stripe support](https://support.stripe.com/)",
  "metadata": {
    "title": "Product release phases | Stripe Documentation",
    "description": "Learn how Stripe describes product release phases.",
    "sourceURL": "https://docs.stripe.com/release-phases"
  }
}