{
  "content": "# Currency conversions\n\n## Learn more about how Stripe handles currency conversions for you.\n\nStripe supports processing charges in [135+\ncurrencies](https://docs.stripe.com/currencies), allowing you to present prices\nin a customer’s native currency. This can improve sales and help customers avoid\nconversion costs. To present prices in your customer’s currency, specify the\npresentment currency when [creating a\nPaymentIntent](https://docs.stripe.com/api/payment_intents/create).\n\nPayments automatically convert to your default settlement currency. Stripe uses\nthe exchange rate at the time of the charge to protect your earnings from rate\nfluctuations between the payment and your anticipated payouts.\n\nIn certain countries, Stripe might support settlement in additional currencies.\nIf you need liquidity in additional currencies, you can enable settlement in\nthose currencies and add a bank account in the [payout settings of your\nDashboard](https://dashboard.stripe.com/account/payouts).\n\n#### Adaptive Pricing\n\nPayment Links and integrations using the [Checkout Sessions\nAPI](https://docs.stripe.com/api/checkout/sessions) can automatically convert\nthis price to an international customer’s local currency based on their\nlocation. Learn more about [Adaptive\nPricing](https://docs.stripe.com/payments/checkout/adaptive-pricing).\n\n## Interested in localizing your prices to your buyers' currency?\n\nPlease provide your email address below and our team will contact you soon.\n\nCollect EmailSign upRead our [privacy policy](https://stripe.com/privacy).\n## Calculate foreign exchange rates\n\nWhen Stripe provides currency conversion services for transactions, Stripe\ngenerally applies the mid-market rate based on pricing data sourced from\nthird-party service providers. Mid-market rate is the average between the buy\nand the sell price of a currency. Currency conversion on Stripe is subject to\nfees as detailed on [our pricing page](https://stripe.com/pricing).\n\nIn certain circumstances, Stripe might apply the rate at which we source the\ncurrency owed to you. For example, this can happen if a new exchange rate is\nmandated by a government or if there is a large discrepancy in rates between our\nservice providers. Stripe does so to mitigate exchange rate risk to you and to\nStripe. Rarely, Stripe may take other actions to mitigate risk. If we do so,\nwe’ll provide additional notice to you.\n\nYou can check the current rate for currency conversions on Stripe by using our\n[estimation page](https://dashboard.stripe.com/currency_conversion). You can\nalso see the actual exchange rate applied in a transaction through the [Balance\nTransactions\nAPI](https://docs.stripe.com/api/balance_transactions/object#balance_transaction_object-exchange_rate)\nor in your [Dashboard](https://dashboard.stripe.com/test/payments). Note that\nthe estimation page shows the baseline exchange rate and excludes the Stripe\nfees for currency conversion, which is incremental to this rate.\n\n## Conversions on disputes and refunds\n\nIf a currency-converted payment is disputed or refunded, the amount you received\nis converted back to the [presentment\ncurrency](https://docs.stripe.com/currencies#presentment-currencies) at the\ncurrent exchange rate. Exchange rates fluctuate with the market, so the rate\nused during the payment often differs from the rate used when a dispute or\nrefund occurs. The amount deducted from your merchant balance depends on the\ncurrent rate and this amount might be more or less than the original payment.\nThe customer is always refunded the exact amount they paid and in the currency\nthey paid in, regardless of any rate fluctuations.\n\nFor example, if your settlement currency is EUR and you process a 60 USD payment\nat a rate of 0.88 EUR per 1 USD, the converted amount is 52.80 EUR (excluding\nthe Stripe fee). If the rate is 0.86 EUR per 1 USD at the time of refund, the\namount deducted from your account balance is only 51.60 EUR.\n\n## Countries with foreign exchange control\n\nRemittance to or from countries with foreign exchange control (including, but\nnot limited to, Brazil) is carried out exclusively through authorized channels,\npursuant to the legislation applicable in those countries.\n\n## Additional settlement currencies\n\nIn some countries, additional currencies might be enabled for settlement. If you\nhave liquidity needs in additional currencies, you can enable or disable these\non the [payout settings of your\ndashboard](https://dashboard.stripe.com/account/payouts). If there are multiple\nbank accounts available for a given currency, Stripe uses the one set as\n`default_for_currency` for settlement and payouts.\n\nIf you have accumulated a balance in a currency without an associated bank\naccount, a conversion occurs if you create a manual payout in that currency.\n\n```\ncurl https://api.stripe.com/v1/payouts \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d amount=1000 \\\n -d currency=xaf\n```\n\nAs long as there are sufficient funds in the balance for the specified currency,\nStripe automatically converts the funds to the default bank account’s currency.\n\n#### Note\n\nIf you enable a currency as a settlement currency by mistake, you can pay out\nfunds in your default currency using a manual payout, then disable the\naccidental settlement currency so you don’t continue to accrue funds in that\ncurrency.\n\n## Conversions on Stripe fees\n\nIf you incur a Stripe fee in a currency for which you don’t have a linked bank\naccount, we automatically convert that fee to your default settlement currency\nat the time the fee is incurred before charging you. This conversion uses the\nbaseline exchange rate and does not incur any additional fees. For example, if\nyou’re a Stripe Billing user whose default currency is USD, you might incur the\n0.5% variable fee when you present in a non-USD currency. If you have a\nsubscriber to whom you present in EUR for their monthly\n[subscription](https://docs.stripe.com/billing/subscriptions/creating) of 100\nEUR, we convert that 0.50 EUR Stripe Billing fee to USD at the baseline rate at\nthe time of the charge at no additional conversion cost to you.\n\n## See also\n\n- [Payouts](https://docs.stripe.com/payouts)\n- [Multi-currency\nsettlement](https://docs.stripe.com/payouts/multicurrency-settlement)\n\n## Links\n\n- [Connect](https://docs.stripe.com/connect)\n- [additional considerations](https://docs.stripe.com/connect/currencies)\n- [135+ currencies](https://docs.stripe.com/currencies)\n- [creating a PaymentIntent](https://docs.stripe.com/api/payment_intents/create)\n- [payout settings of your\nDashboard](https://dashboard.stripe.com/account/payouts)\n- [Checkout Sessions API](https://docs.stripe.com/api/checkout/sessions)\n- [Adaptive Pricing](https://docs.stripe.com/payments/checkout/adaptive-pricing)\n- [privacy policy](https://stripe.com/privacy)\n- [our pricing page](https://stripe.com/pricing)\n- [estimation page](https://dashboard.stripe.com/currency_conversion)\n- [Balance Transactions\nAPI](https://docs.stripe.com/api/balance_transactions/object#balance_transaction_object-exchange_rate)\n- [Dashboard](https://dashboard.stripe.com/test/payments)\n- [presentment\ncurrency](https://docs.stripe.com/currencies#presentment-currencies)\n- [subscription](https://docs.stripe.com/billing/subscriptions/creating)\n- [Payouts](https://docs.stripe.com/payouts)\n- [Multi-currency\nsettlement](https://docs.stripe.com/payouts/multicurrency-settlement)",
  "metadata": {
    "title": "Currency conversions | Stripe Documentation",
    "description": "Learn more about how Stripe handles currency conversions for you.",
    "sourceURL": "https://docs.stripe.com/currencies/conversions"
  }
}