{
  "content": "# Dispute and fraud card monitoring programs\n\n## Learn about the monitoring programs operated by the card networks, and what to do if you're placed into one.\n\n#### Upcoming changes to Visa monitoring programs\n\nThe [Visa\nsection](https://docs.stripe.com/disputes/monitoring-programs#visa-programs)\ndescribes Visa’s new monitoring program and corresponding changes to existing\nprograms.\n\nAs part of your financial obligations to the card networks, you must keep\n[disputes](https://docs.stripe.com/disputes) (also called chargebacks) and fraud\nat acceptable levels. If they exceed the thresholds dictated by a network (for\nexample,\n[Visa](https://docs.stripe.com/disputes/monitoring-programs#visa-programs) or\n[Mastercard](https://docs.stripe.com/disputes/monitoring-programs#mastercard-programs)),\nthe network places you into one of their monitoring programs. As part of a\nprogram, you can incur monthly fines and additional fees until you reduce your\ndispute or fraud levels in a sustained way.\n\nStripe can work with you on a remediation plan to reduce the levels of disputes\nor fraud related to your account. We also communicate directly with the networks\nand relay information on a monthly basis. Download our [remediation\ntemplate](https://d37ugbyn3rpeym.cloudfront.net/docs/files/compliance/monitoring_program_remediation_template.pdf)\nto get started.\n\nWhile monitoring programs are comparatively rare, take them seriously. If you’re\nplaced into one, you must take immediate action to address the situation.\nFailure to comply with the requirements of a program within the specified time\nperiod can result in the network refusing to process further payments to you.\nThis can put your ability to accept any credit card payments [at\nrisk](https://docs.stripe.com/disputes/match).\n\n#### Note\n\nThis page is a general guide for Stripe users, not a comprehensive reference for\ncard network monitoring programs. For complete and up to date information about\nmonitoring programs, see the documentation provided by the networks.\n\n## Understanding disputes and chargebacks\n\nFor the purposes of monitoring programs, a dispute or chargeback occurs when\nfunds move out of an account due to a disputed payment, regardless of the\nreason. The terms “dispute” and “chargeback” are interchangeable. The Visa\nmonitoring program refers to disputes, while the Mastercard and AusPayNet\nmonitoring programs refer to chargebacks.\n\nMonitoring programs don’t consider refunds when identifying disputes. In some\ncases, if you issued a full refund at least 10 days before a dispute, we can ask\nto have the dispute removed from the account. The issuer might have missed the\nrefund and raised the dispute by mistake, but that rarely happens.\n\nSimilarly, monitoring programs don’t consider dispute outcomes. If they did,\nthey’d have to wait for the outcome of every dispute, which can take months,\nbefore including it in their calculations. They’re also more interested in how\nsuccessfully you prevent disputes than in whether you win them.\n\nSome disputes where you have no liability don’t appear in your Dashboard or API\nresponses because Stripe handles them on your behalf. They don’t count toward\nyour Stripe dispute or fraud rates, and we don’t charge you for them. However,\nmonitoring programs still include them in their calculations. That can create a\ndiscrepancy between your data and the dispute rates that the networks calculate\nfor you, especially if you issue a lot of refunds. For example:\n\n- You refunded the payment before the customer submitted the dispute.\n- The dispute duplicates a previously resolved dispute.\n- The card network created or processed the dispute in error.\n\nIn some cases, the data reported to Stripe by the card networks doesn’t match\nthe data visible in your Dashboard. It can happen because of discrepancies or\nformatting issues in your statement descriptors, having multiple Merchant IDs\n(MIDs), or double-counted charges. If Stripe updates your MID during a month, it\ncan affect your Mastercard data. If you think a card network made a calculation\nerror, contact [Stripe support](https://support.stripe.com/).\n\nThe following scenarios don’t count as disputes:\n\n- Unescalated\n[inquiries](https://docs.stripe.com/disputes/how-disputes-work#inquiries), where\na card issuer begins an investigation but never returns the disputed payment.\n- [Early fraud\nwarnings](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\n(EFWs), which are informational messages from card network reports about\nsuspected fraud. Although they don’t count as disputes, they do count as fraud,\nregardless of their outcome, and Visa’s\n[VFMP](https://docs.stripe.com/disputes/monitoring-programs#vfmp) program\nincludes them in its calculations.\n- Non-disputed funds that move through a card network’s dispute system. Such\nmovement can occur as part of Visa’s [Rapid Dispute\nResolution](https://docs.stripe.com/disputes/how-disputes-work#respond-dispute)\nprogram.\n\n## Monitoring program calendars\n\nVisa and Mastercard monitoring programs track activity by month, while the\nAusPayNet monitoring program tracks activity by quarter.\n\nVisa and Mastercard programs calculate monthly rates differently. Visa\ncalculates the ratio of disputes or fraud to the total number of payments in the\nsame calendar month. Mastercard calculates the ratio of disputes or fraud to the\ntotal number of payments in the previous month. Both networks assign a dispute\nor fraud report to the month in which they received it, regardless of when the\noriginal payment occurred.\n\nVisa and Mastercard monitoring programs use specific nomenclature to refer to\ntheir monthly rate calculations:\n\nA “data month” is the month in which a network receives a dispute or fraud\nreport. Mastercard refers to two different data months, one for disputes and the\nother for sales.\n\nA “report month,” “reporting month,” or “identification month” is the month in\nwhich a program identifies a business based on its data meeting a threshold.\nIt’s usually the month after the data month containing that data.\n\n## Estimate your dispute or fraud rate\n\nIf you have [Stripe Sigma](https://stripe.com/sigma) or [Data\nPipeline](https://stripe.com/data-pipeline), you can use it to [track your\nestimated dispute or fraud rate for a given monitoring\nprogram](https://docs.stripe.com/stripe-data/query-disputes-and-fraud-data#tracking-monitoring-programs).\nWe offer [a guide to help you implement a continuous fraud management\nprocess](https://stripe.com/guides/improve-fraud-management-with-radar-for-fraud-teams-and-stripe-data)\nusing those tools.\n\nIf you don’t have either of those products, you can manually estimate your\ndispute rate. Export your Visa or Mastercard disputes from the **Payments** tab\nin your Dashboard and compare them to your payments according to a program’s\nformula. Networks count payments by their capture date and disputes by their\ncreation date. For accounts outside the US, count payments and disputes for a\ncalendar month. For accounts in the US, there’s a delay between receiving\ndisputes from our financial partner and reporting them to the card network. To\naccount for that delay, count payments for a calendar month, and count disputes\nfrom the 5th of that month to the 5th of the following month.\n\nYou can also track EFWs using the [Early Fraud\nWarnings](https://docs.stripe.com/api/radar/early_fraud_warnings) API. In\naddition, when we receive a fraud report for a payment that hasn’t already been\ndisputed or refunded, we send a notification to the primary email on your\naccount.\n\n## Visa monitoring programs\n\nVisa evaluates your activity monthly against the thresholds established in their\nmonitoring programs. If Visa places you in a program, Stripe notifies you. You\nhave 12 months to meet the thresholds, or Visa can restrict your ability to\naccept Visa payments.\n\n### Regional considerations\n\nExcept for [VFMP\n3DS](https://docs.stripe.com/disputes/monitoring-programs#vfmp3ds), which\napplies to US businesses only, Visa enforces its monitoring programs on all\nbusinesses in all Stripe supported countries.\n\nFor users in the US, Europe, Canada, Australia, and Brazil, both domestic and\ncross-border activity count toward monthly totals. For users outside of those\nregions, only cross-border activity is counted.\n\nVisa places individual accounts in its programs, but identifies an account by\nthe static component of its [statement\ndescriptor](https://docs.stripe.com/get-started/account/statement-descriptors)\nand its acquiring bank. Because banks often vary by country or region, one\nStripe business might represent multiple monitored accounts to Visa.\n\n- A Stripe business that uses one statement descriptor in Canada and a second\nstatement descriptor in both Canada and the US qualifies as three accounts to\nVisa: one for each descriptor in each country.\n- A Stripe business that uses the same statement descriptor in Ireland, France,\nand Germany results in only one account because Visa aggregates its EU volume.\n- A Stripe business with multiple statement descriptors represents that many\nVisa accounts. To aggregate the dispute and fraud rates:- Give each descriptor\nthe same static prefix.\n- If updating existing statement descriptors, ask Stripe to contact Visa and\nrequest that they aggregate your transactions.\n- Make the change at the end of a month so it doesn’t affect the rate\ncalculations for that month.\n\n### VAMP: Visa Acquirer Monitoring Program Effective April 1, 2025\n\nThe VAMP program identifies merchants based on:\n\n- VAMP Ratio: (fraud + non-fraud disputes) / total transactions- Fraud is\ndefined as [early fraud warning\n(EFW)](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\ndata sourced from Visa’s TC40 reporting\n- Minimum of 1,000 monthly combined fraud and non-fraud disputes\n- VAMP Enumeration Ratio: Monthly enumerated transactions / total transactions-\nMeasures card testing activity\n- Minimum of 300,000 enumerated transactions identified\n\nStripe notifies you if your ratios place you at risk for enrollment. You can\navoid enrollment by reducing your fraud at this time.\n\nVAMP only enrolls accounts it classifies as `Excessive` when their counts and\nrates exceed the following thresholds. After the metric falls below the\nthreshold, VAMP releases the account from the program.\n\nProgram Type ThresholdVAMP Ratio- April 1, 2025: 1.5% globally (0.9% in LAC)\n- January 1, 2026: 0.9% globally (1.5% in CEMEA)\nVAMP Enumeration Ratio20\n### VFMP 3DS: Visa Fraud Monitoring Program-3DS (US-only)\n\nVFMP-3DS applies only to US-based users with US-based custom accounts and an\nexcessive level of fraud on domestic Visa 3D-Secure-authenticated (3DS)\ntransactions on US-issued cards.\n\n#### Note\n\nBy default, Stripe allows all authenticated 3DS payments to go through. You can\nadjust your rules to block 3DS payments that are flagged as high risk. You can\nalso consider other signals that usually apply to normal charges, such as\nvelocity, transaction size, and CVC/AVS checks.\n\nVisa calculates the fraud level using [early fraud warning\n(EFW)](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\ndata sourced from their TC40 reporting. Users are placed into this program if\nthey meet or exceed the monthly thresholds for both of the following criteria:\n\n- The total USD volume of EFWs for Visa 3DS-authenticated payments (Fraud\nVolume)\n- The ratio of the USD volume of EFWs for Visa 3DS-authenticated payments to the\nUSD volume of all captured Visa 3DS-authenticated payments (Fraud Rate)\n\nAn EFW belongs to the month in which the TC40 was reported, not the month when\nthe reported payment was captured. For example, calculations for February\ninclude 3DS-authenticated payments captured in February and EFWs reported in\nFebruary for 3DS-authenticated payments, even if the potentially fraudulent\npayments were captured in January. The February calculations don’t consider any\npayments captured in January.\n\nEarly warningStandardFraud volume Fraud rate Fines50,000 USD0.50%None. You have\nthe opportunity to take action that reduces your fraud level before it exceeds a\nthreshold where penalties are incurred.\nYou might not receive an early warning notification if you reach the standard\nthreshold immediately after reaching the early warning threshold.\n\n### Retiring Visa programs Deprecated as of March 31, 2025\n\nThe following guidance relates to the disputes and fraud monitoring programs\nVisa enforces until\n[VAMP](https://docs.stripe.com/disputes/monitoring-programs#visa-programs)\nbecomes effective.\n\n#### Early warning notifications\n\nYou might receive an early warning notification from Visa if you’re at risk for\nbeing placed in one of its programs. Such notifications give you an opportunity\nto preemptively reduce the level of fraud on your account. Early warning\nnotifications might not occur for accounts that reach a program’s standard or\nexcessive threshold immediately after meeting its early warning threshold.\n\n#### Remediation\n\nVisa removes you from a program when your level of disputes or fraud drops below\nthe standard threshold for 3 consecutive months, even if you’re at the excessive\nlevel. If you reach a program’s excessive threshold, excessive penalties apply\nuntil you exit the program entirely. Dropping below the excessive threshold\ndoesn’t reduce your penalties to the standard level.\n\n#### Note\n\nDropping below the threshold doesn’t reset your timeline. If you remain below\nthe threshold for 1 or 2 months, then reach it again, your original timeline\nresumes. That means that if 10 months pass without exiting a program, exceeding\nthe threshold in any month prevents you from exiting before the end of the\ntimeline.\n\nMonitoring your dispute and fraud levels accurately is important. For example,\nVisa counts disputes regardless of whether the dispute was hidden due to a\nrefund, regardless of liability shift, and regardless of whether you won the\ndispute.\n\nAs part of the remediation process, Stripe can require you to provide details on\nthe steps you’re taking and your timeline for implementing them.\n\n#### VDMP: Visa Dispute Monitoring Program\n\nVDMP applies to users with an unusually high level of disputed payments on their\naccount. Users are placed into this program if they meet or exceed the monthly\nthresholds for both of the following criteria:\n\n- The total number of payment disputes (dispute count)\n- The ratio of disputed payments to all captured payments ([dispute\nrate](https://docs.stripe.com/disputes/measuring#dispute-rate-usage))\n\nA payment dispute belongs to the month in which it’s raised, not the month when\nthe original payment was captured. For example, calculations for February\ninclude payments captured in February and disputes raised in February, even if\nthe payments being disputed were captured in January. The February calculations\ndon’t consider any payments captured in January.\n\nEarly WarningStandardExcessiveDispute Count Dispute Rate Fines750.65%None. You\nhave the opportunity to take action that reduces your dispute level before it\nexceeds a threshold where fines are incurred.\nYou might not receive an early warning notification if you reach the standard or\nexcessive threshold immediately after reaching the early warning threshold.\n\n#### VFMP: Visa Fraud Monitoring Program\n\nVFMP applies to users with an excessive level of fraud on their account, which\nVisa calculates using [early fraud warning\n(EFW)](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\ndata sourced from their TC40 reporting. Users are placed into this program if\nthey meet or exceed the monthly thresholds for both of the following criteria:\n\n- The total USD volume of EFWs (Fraud Volume)\n- The ratio of the USD volume of EFWs to the USD volume of all captured payments\n(Fraud Rate)\n\nAn EFW belongs to the month in which the TC40 was reported, not the month when\nthe reported payment was captured. For example, calculations for February\ninclude payments captured in February and EFWs reported in February, even if the\npotentially fraudulent payments were captured in January. The February\ncalculations don’t consider any payments captured in January.\n\nEarly WarningStandardExcessiveFraud Volume Fraud Rate Fines50,000 USD0.65%None.\nYou can take action that reduces your fraud level before it incurs penalties.\nYou might not receive an early warning notification if you reach the standard or\nexcessive threshold immediately after reaching the early warning threshold.\n\n#### VFMP: Visa Fraud Monitoring Program (digital goods merchants)\n\nThe VFMP for digital goods merchants applies to small ticket and digital goods\nmerchants with excessive levels of fraud on their account. Visa calculates the\nfraud level using [early fraud warning\n(EFW)](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\ndata sourced from their TC40 reporting. The VFMP for digital goods merchants\napplies to businesses with the following MCCs:\n\n- 5735 — Record Stores\n- 5815 — Digital Goods Media — Books, Movies, Digital artwork/images, Music\n- 5816 — Digital Goods — Games\n- 5817 — Digital Goods — Applications (Excludes Games)\n- 5818 — Digital Goods — Large Digital Goods Merchant\n\nUsers are placed into this program if they meet or exceed the monthly thresholds\nfor all of the following criteria:\n\n- The total USD volume of EFWs for relevant payments (Fraud volume)\n- The total count of EFWs for relevant payments (Fraud count)\n- The ratio of the USD volume of EFWs for relevant payments to the USD volume of\nall captured relevant payments (Fraud Rate)\n\nAn EFW belongs to the month in which the TC40 was reported, not the month when\nthe reported payment was captured. For example, calculations for February\ninclude relevant payments captured in February and EFWs reported in February for\nrelevant payments, even if the potentially fraudulent payments were captured in\nJanuary. The February calculations don’t consider any payments captured in\nJanuary.\n\nEarly WarningStandardFraud volume Fraud count Fraud rate Fines15,000\nUSD1500.45%None. You have the opportunity to take action that reduces your fraud\nlevel before it exceeds a threshold where penalties are incurred.\n## Mastercard monitoring programs\n\nMastercard’s Excessive Chargeback Program (ECP) consists of two levels:\n[Excessive Chargeback Merchant\n(ECM)](https://docs.stripe.com/disputes/monitoring-programs#ecm) and [High\nExcessive Chargeback Merchant\n(HECM)](https://docs.stripe.com/disputes/monitoring-programs#hecm), and it\napplies to users in all supported countries. The [Excessive Fraud Merchant (EFM)\nCompliance Program](https://docs.stripe.com/disputes/monitoring-programs#efm) is\na separate program that applies to users in all supported countries besides\nGermany, India, and Switzerland.\n\nIf your account exceeds program thresholds, Mastercard places you into that\nprogram and Stripe notifies you. If you exceed both EFM and ECP thresholds,\nyou’re placed in EFM but not ECP. However, Mastercard tracks both thresholds.\nFor example, you exceed EFM and ECP thresholds in March and April, but exceed\nonly ECP thresholds in May. In April, you’re placed in month 2 of EFM and fined\naccordingly. In May, you’re placed in month 3 of ECP despite the EFM\nidentifications taking precedence in prior months.\n\n### Remediation\n\nMastercard removes you from a program when your chargebacks drop below the\nprogram threshold for 3 consecutive months. If you’re in HECM, and your\nchargebacks drop below the HECM threshold but still meet the ECM threshold, you\nmove to the ECM level.\n\nMonitoring your chargeback and fraud levels accurately is important. For\nexample, Mastercard counts a chargeback regardless of whether it was hidden due\nto a refund, regardless of liability shift, and regardless of its outcome.\n\nAs part of the remediation process, Stripe can require you to provide details on\nthe steps you’re taking and your timeline for implementing them.\n\n### ECP: Mastercard Excessive Chargeback Program\n\nUsers are placed into ECP if they meet or exceed the monthly thresholds for both\nof the following criteria:\n\n- The total number of payment chargebacks (chargeback count)\n- The ratio of the chargeback count for the current month to the total number of\ncaptured payments from the preceding month ([chargeback\nrate](https://docs.stripe.com/disputes/measuring#dispute-rate-usage))\n\nA payment chargeback belongs to the month in which it’s raised, not the month\nwhen the original payment was captured. For example, calculations for February\nuse payments captured in January and chargebacks raised in February, including\nchargebacks for payments captured in February.\n\n### ECM: Mastercard Excessive Chargeback Merchant\n\nDispute Count Chargeback Rate Fines100-2991.5-2.99%Fines begin in month two and\ncontinue at increasing rates in subsequent months. See the timeline below for\ndetails.Number of months above ECM thresholds Fine Issuer recovery assessment10\nUSDNo21,000 USDNo32,000 USDNo4-65,000 USDYes7-1125,000 USDYes12-1850,000\nUSDYes19+100,000 USDYes\nIssuer recovery assessment applies an additional 5 USD per chargeback fee for\neach chargeback over 300 chargebacks. For example, a merchant identified in\nmonth 4 of ECM with 400 disputes is assessed a 5,500 USD fine (5,000 USD +\n(400-300) x 5 USD).\n\n### HECM: Mastercard High Excessive Chargeback Merchant\n\nDispute Count Chargeback Rate Fines300+3%Fines begin in month two and continue\nat increasing rates in subsequent months. See the timeline below for\ndetails.Number of months above ECM thresholds Fine Issuer recovery assessment10\nUSDNo21,000 USDNo32,000 USDNo4-610,000 USDYes7-1150,000 USDYes12-18100,000\nUSDYes19+200,000 USDYes\nMastercard communicates total fine amounts to merchants through Stripe.\n\n### EFM: Mastercard Excessive Fraud Merchant Compliance Program\n\nUsers are placed into EFM if they meet or exceed the monthly thresholds for all\nof the following criteria:\n\n- Number of e-commerce Mastercard payments\n- The total USD volume of fraud-related chargebacks (net fraud volume) with\ndispute reason code 4837 or 4863\n- The ratio of the number of fraud-related chargebacks in the current month to\nthe number of e-commerce transactions in the preceding month (fraud chargeback\nrate)\n- The percentage of Mastercard payments that use 3-D Secure (3DS)\n\nThe fraud chargeback rate uses a similar calculation to the chargeback rate for\nECP, but it considers only fraud-related chargebacks.\n\nEFM applies to users who meet all of the following conditions:\n\n- Minimum of 1,000 e-commerce Mastercard payments\n- Net fraud volume is greater than 50,000 USD (15,000 USD for Australia)\n- Fraud chargeback rate is greater than 0.50% (0.20% for Australia)\n- Total 3DS Mastercard payment count is less than or equal to:- 10% of total\nMastercard payment count (non-regulated countries)\n- 50% of total Mastercard payment count (regulated countries)\nNumber of months above ECM thresholds Fine 10 USD2500 USD31,000 USD4-65,000\nUSD7-1125,000 USD12-1850,000 USD19+100,000 USD\nYou can request that Mastercard suspend an assessed fine one time during an open\ncase. However, only do so if you’re confident that you’ll be below the threshold\nto exit the program for the next 3 months. If you request a suspension of fines\nand fall below the threshold for 2 months, but exceed it in the following month,\nfine assessments continue until you exit the program.\n\n## AusPayNet monitoring programs\n\nThe AusPayNet (APN) Card-Not-Present (CNP) fraud mitigation program is designed\nto reduce CNP payments fraud within the Australian payment industry (AU-based\nusers and cardholders only). Where user fraud rates exceed certain defined\nthresholds for two consecutive quarters, the APN reserves the option to mandate\n[Strong Customer Authentication\n(SCA)](https://docs.stripe.com/disputes/monitoring-programs#sca) for all\ntransactions. Stripe notifies you if your account exceeds program thresholds for\nthe preceding quarter.\n\n### FMP: APN Fraud Monitoring Program\n\nUsers who meet or exceed both the following criteria thresholds are placed into\nFMP:\n\n- **Fraud chargeback amount**: Total value (in AUD) of fraudulent chargebacks\nreceived in the quarter is greater than 50,000 AUD.\n- **Fraud-to-sales ratio**: The ratio of fraud chargeback amount to sales value\nin the quarter is greater than or equal to 0.20\n\n#### Note\n\nAPN excludes card-present and 3DS authenticated payment transactions in these\nthreshold computations.\n\nNumber of quarters above FMP thresholds Remediation measures 1You must implement\nfraud controls to reduce fraudulent chargebacks. We recommend performing\n[SCA](https://docs.stripe.com/disputes/monitoring-programs#sca) on a subset of\nCNP transactions that you define as high risk.2You must do one or more of the\nfollowing:- Perform risk based SCA (as above)\n- Use SCA on all CNP transaction (excluding [SCA exempted\ntransactions](https://docs.stripe.com/disputes/monitoring-programs#sca-exemptions))\n- Introduce more sensitive or effective fraud controls\n3You must pass all CNP transactions through to the cardholder’s issuing bank for\nSCA. Failure to do so might result in off-boarding.4+You might be off-boarded.\nWhen your CNP transactions fall below the threshold criteria for FMP for one\nquarter, APN releases you from the FMP and SCA obligations.\n\n### SCA: Strong Customer Authentication\n\nSCA is an authentication method in which you verify cardholder’s identity using\nat least two of the following factors:\n\n- Knowledge factor: something only the cardholder knows, for example a password\n- Possession factor: something only the cardholder possess, for example a mobile\nphone\n- Inherence factor: something the cardholder is, for example fingerprint or\nfacial recognition\n\n### SCA exemptions\n\nAPN exempts the following types of transactions from the SCA requirement:\n\n- Recurring transactions: Series of repeated transactions with SCA applied on\nthe first charge of the recurring series\n- Trusted customer transactions: Transactions where you have previously\nidentified/authenticated the cardholder and the cardholder uses the same card on\nfile with matching identifiers\n- Wallet transactions: Digital or mobile wallet transactions where the\ncardholder identity has been verified and each subsequent transaction is\nauthorized by the cardholder using biometrics or a passcode\n\n## Best practices for preventing fraud and disputes\n\nFollowing these guidelines can help you avoid being placed into card network\nmonitoring programs.\n\n### Prevent identifiable fraud\n\nConsider using separate authorization and capture in combination with review\nrules. Issuers are required to report possible fraud for a captured payment,\neven if it gets refunded, but aren’t required to report it for a payment\nauthorization. If you identify and reverse a fraudulent or suspicious payment\nauthorization before it’s captured, it isn’t reported.\n\n### Prevent disputes for canceled subscriptions\n\n- Offer a quick and easy way to cancel. An in-app cancellation button is often\nthe best solution, because it doesn’t require the cardholder to wait to confirm\ntheir refund.\n- Clearly communicate billing terms up front prior to accepting cardholder\ninformation.\n- Require the cardholder to click a button that confirms their agreement to the\nbilling terms.\n- If offering a free or discounted trial, send a reminder before it expires\nallowing the cardholder an opportunity to cancel.\n- Implement a flexible refund or return policy. For example, if a user cancels\nthe day after being billed, offer a full or prorated refund.\n- Send billing reminders, especially if on a yearly\n[subscription](https://docs.stripe.com/billing/subscriptions/creating).\nTypically 7 days before a yearly renewal and 2 to 3 days before a monthly\nrenewal.\n- Third party solutions, such as Ethoca and Verifi. These companies work with\ncertain issuers so that an alert is raised when a chargeback is about to be\ninitiated, allowing the user an opportunity to refund.\n\n### Prevent disputes for unreceived products\n\n- Clearly communicate shipping times prior to checkout.\n- Clearly and quickly communicate any shipping delays and offer an option for\nthe cardholder to receive a refund if they don’t want to wait.\n- Ship items quickly and provide the cardholder with a tracking number when the\nitem has been shipped.\n- For higher value goods, require a signature upon delivery to prevent missing\npackages or potential “friendly fraud.”\n- Make sure items are well stocked and either indicate when an item is\nbackordered or remove it from the site.\n\n### Prevent disputes for unacceptable products\n\n- Implement a flexible refund policy and issue them under reasonable\ncircumstances.\n- Clearly describe the items being sold and display accurate images when\npossible.\n- Reevaluate any products which tend to see higher dispute rates for these\nreasons. It’s possible the items could be defective.\n- Clearly display the full price of the item, including any taxes, and make sure\nto present it to the cardholder before accepting their payment information.\n\n### Prevent friendly fraud disputes\n\nA [friendly\nfraud](https://docs.stripe.com/disputes/prevention/fraud-types#friendly-fraud)\ndispute occurs when a customer disputes a legitimate charge that they believe to\nbe fraudulent. The best way to prevent such disputes is to collect as much\ninformation as possible when capturing a payment. For example, clearly\ncommunicate billing terms and shipping times, require the cardholder to agree to\nthe terms of service, ship only to verified addresses, or require a signature\nupon delivery.\n\n### Prevent other types of disputes\n\nLess common disputes, such as `general` or `duplicate`, can indicate things like\nan unrecognized statement descriptor or a confusing billing statement. Normally,\nsuch disputes make up a small percentage of the total. However, if you find any\nof them to be very common, it could indicate some other issue at the root of the\nproblem. For example, a large number of `general` disputes can result from\npoorly designed receipts that make customers question the amounts they were\ncharged.\n\n## Links\n\n- [Visa\nsection](https://docs.stripe.com/disputes/monitoring-programs#visa-programs)\n- [prevention guide](https://docs.stripe.com/disputes/prevention)\n- [disputes](https://docs.stripe.com/disputes)\n- [remediation\ntemplate](https://d37ugbyn3rpeym.cloudfront.net/docs/files/compliance/monitoring_program_remediation_template.pdf)\n- [at risk](https://docs.stripe.com/disputes/match)\n- [Stripe support](https://support.stripe.com/)\n- [inquiries](https://docs.stripe.com/disputes/how-disputes-work#inquiries)\n- [Early fraud\nwarnings](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\n- [VFMP](https://docs.stripe.com/disputes/monitoring-programs#vfmp)\n- [Rapid Dispute\nResolution](https://docs.stripe.com/disputes/how-disputes-work#respond-dispute)\n- [Stripe Sigma](https://stripe.com/sigma)\n- [Data Pipeline](https://stripe.com/data-pipeline)\n- [track your estimated dispute or fraud rate for a given monitoring\nprogram](https://docs.stripe.com/stripe-data/query-disputes-and-fraud-data#tracking-monitoring-programs)\n- [a guide to help you implement a continuous fraud management\nprocess](https://stripe.com/guides/improve-fraud-management-with-radar-for-fraud-teams-and-stripe-data)\n- [Early Fraud Warnings](https://docs.stripe.com/api/radar/early_fraud_warnings)\n- [statement\ndescriptor](https://docs.stripe.com/get-started/account/statement-descriptors)\n- [dispute rate](https://docs.stripe.com/disputes/measuring#dispute-rate-usage)\n- [subscription](https://docs.stripe.com/billing/subscriptions/creating)\n- [friendly\nfraud](https://docs.stripe.com/disputes/prevention/fraud-types#friendly-fraud)",
  "metadata": {
    "title": "Dispute and fraud card monitoring programs | Stripe Documentation",
    "description": "Learn about the monitoring programs operated by the card networks, and what to do if you're placed into one.",
    "sourceURL": "https://docs.stripe.com/disputes/monitoring-programs"
  }
}