{
  "content": "# Using trial periods on subscriptions\n\n## Delay payments on active subscriptions using trial periods.\n\nYou can start a customer’s\n[subscription](https://docs.stripe.com/billing/subscriptions/creating) with a\nfree trial period by providing a `trial_end` argument when [creating the\nsubscription](https://docs.stripe.com/api#create_subscription):\n\n```\ncurl https://api.stripe.com/v1/subscriptions \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d customer={{CUSTOMER_ID}} \\\n -d \"items[0][price]\"={{PRICE_ID}} \\\n -d trial_end=1610403705\n```\n\nThe `trial_end` parameter takes a timestamp indicating the exact moment the\ntrial ends. When creating a subscription, you can alternatively use the\n[trial_period_days](https://docs.stripe.com/api#create_subscription-trial_period_days)\nparameter: an integer representing the number of days the trial lasts, from the\ncurrent moment.\n\nWhen creating a subscription with a trial period, no payment method is required\nfor the customer. An immediate [invoice](https://docs.stripe.com/api/invoices)\nis still created, but for $0.\n\nWhen the trial ends, if the subscription `status` isn’t `paused`, we generate an\ninvoice and send an `invoice.created` event notification. Approximately 1 hour\nlater, we attempt to charge that invoice. A new billing cycle also begins for\nthe customer when the trial ends.\n\nTo end a trial early, make an [update\nsubscription](https://docs.stripe.com/api#update_subscription) API call, setting\nthe `trial_end` value to a new timestamp, or **now** to end immediately:\n\n```\ncurl https://api.stripe.com/v1/subscriptions/{{SUBSCRIPTION_ID}} \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d trial_end=now\n```\n\n## Combining trials with billing cycle anchor\n\nAs of API version [2018-02-05](https://docs.stripe.com/upgrades#2018-02-05), you\ncan also combine trials with `billing_cycle_anchor`, resulting in a free period\nfollowed by a prorated period, leading into a fixed billing cycle.\n\nFor example, suppose it’s the 15th of the month and you want to give your\ncustomer a free 7 day trial (until the 22nd), and then start normal billing on\nthe 1st. You can do this through the API by combining trials with\n`billing_cycle_anchor`. (This isn’t currently available through the\n[Dashboard](https://dashboard.stripe.com/test/subscriptions).)\n\nIn this example, the customer gets an invoice for a *prorated* amount on the\n22nd (for the period until the 1st). Then, on the 1st, they’ll be invoiced again\nfor the full amount, and again on the 1st of the following month, and so on.\n\n```\ncurl https://api.stripe.com/v1/subscriptions \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d customer={{CUSTOMER_ID}} \\\n -d \"items[0][price]\"={{PRICE_ID}} \\\n -d trial_end=1610403705 \\\n -d billing_cycle_anchor=1611008505\n```\n\n## Combining trials with usage-based billing\n\nYou can use trial periods for subscriptions with [usage-based\nbilling](https://docs.stripe.com/products-prices/pricing-models#usage-based-pricing).\nDuring the trial period, any usage accrued doesn’t count toward the total\ncharged to the customer at the end of the billing cycle. After the trial period\nends, usage accrues and is billed at the end of the next billing cycle.\n\n### Trials and aggregate usage\n\nIf you use the `aggregate_usage`\n[parameter](https://docs.stripe.com/api/prices/create#create_price-recurring-aggregate_usage)\nand set the behavior to `last_ever`, your customer will be billed for the last\nusage record if it falls within the trial period, even if the usage occurred\nduring the trial period.\n\nFor example, if you provide file storage you might want to offer a month of free\nstorage, but then charge for the first month if the customer continues to store\nfiles with your service.\n\n### Metered billing with paused subscriptions\n\nYou can send [meter events](https://docs.stripe.com/api/billing/meter-event)\nassociated with a price on a subscription even while it’s paused. However, after\nthe subscription resumes, the invoice won’t include any meter events sent during\nthe paused state. Future invoices only include meter events that occur after the\nresume date. If you use [legacy usage\nrecords](https://docs.stripe.com/billing/subscriptions/usage-based-legacy), you\ncan’t create new usage records while a subscription is paused.\n\n## Combining trials with add_invoice_items\n\nTrial periods for subscriptions can be combined with one time prices and\n`add_invoice_items`. This may happen if you want to charge a one time fee or add\non at the same time as starting a trial. Note that doing this will cause an\ninvoice to be cut immediately for the amount of the one time item at the\nbeginning of the trial.\n\n## Compliance requirements for trials and promotions\n\nYou must comply with card network\n[requirements](https://support.stripe.com/questions/2020-visa-trial-subscription-requirement-changes-guide)\nwhen offering trials, whether they’re free or not. This includes scenarios like\nfree trials or charging customers a reduced price for the first few months and\nthen automatically charging them your normal rate. When using our trials\nfeatures, you can enable [messaging\nsettings](https://dashboard.stripe.com/settings/billing/automatic) in the Stripe\nDashboard to help you meet the requirements.\n\nIf you notify users of [successful\npayments](https://dashboard.stripe.com/settings/emails), Stripe automatically\ndisplays information about the trial and the cancellation URL in those\nnotifications.\n\nIf you don’t use these settings, you’re still responsible for complying with the\nrequirements.\n\nWhen customer emails are enabled, a reminder is sent seven days before a trial\nends. If a trial is shorter than seven days, the reminder email is sent as soon\nas the trial begins. If trials are renewed, a reminder email is resent.\n\nIf both trial reminders and subscription renewal reminders are enabled during a\ntrial, customers only receive the trial ending reminder. Renewal emails are then\nsent for subsequent billing periods.\n\nThe cancellation policy link is a URL that is displayed on customer receipts,\nalong with other trial information. This information is included for all card\npayments. The cancellation URL is also included in the reminder email that is\nsent to customers seven days before their trial ends.\n\nFor statement descriptors, if you manually set the [statement\ndescriptor](https://docs.stripe.com/api/invoices/object#invoice_object-statement_descriptor)\non the invoice, the trial text isn’t appended so you need to add it. If you use\n[product statement\ndescriptors](https://docs.stripe.com/api/products/object#product_object-statement_descriptor),\nthe trial text is appended automatically. If your statement descriptor is\ngreater than 10 characters, make sure it still makes sense to your customers\nwith the trial text appended. There is a 22 character\n[limit](https://docs.stripe.com/get-started/account/statement-descriptors#requirements)\nso anything after the 10th character is overwritten with `* TRIAL OVER`.\n\nIf you don’t manually set the statement descriptor or use product statement\ndescriptors, the trial text is appended to your account’s statement descriptor.\nIf needed, you can set up a [shortened\ndescriptor](https://dashboard.stripe.com/settings/public) to ensure the trial\ntext displays correctly.\n\n### Meeting requirements without using Stripe’s features\n\nIf you offer trials or promotions without using our trials features, you still\nneed to comply with the\n[requirements](https://support.stripe.com/questions/2020-visa-trial-subscription-requirement-changes-guide).\nYou can listen for the\n[invoice.upcoming](https://docs.stripe.com/api/events/types#event_types-invoice.upcoming)\nevent to determine when to send email notifications. To add text to your\nstatement descriptor that indicates the promotion is over:\n\n- Listen for the `customer.subscription.updated` event\n- Check to see if a trial or promotion has ended\n- Update the [statement\ndescriptor](https://docs.stripe.com/api/invoices/update#update_invoice-statement_descriptor)\non the subscription’s `latest_invoice`\n\nYou need to update the latest invoice within an hour of its creation while it’s\nstill in draft status.\n\n## Create free trials without collecting payment method\n\n#### Security tip\n\nWhile starting a free trial without a payment method lets your potential\ncustomers try your product or service faster, it can also allow spammers to\ncreate lots of fake customers, usage, and subscriptions. We recommend carefully\nconsidering the signup flow here to balance making it easy for real customers\nand difficult for spam bots to abuse (for example, requiring customers to create\na user account and complete a captcha before starting their free trial\nsubscription).\n\nYou can sign customers up for a free trial of a subscription without collecting\ntheir payment details in the Dashboard, the API, and Checkout. When you create\nthe subscription, you can specify whether to cancel or pause the subscription if\nthe customer didn’t provide a payment method during the trial period. To cancel\nor pause the subscription, set the\n`trial_settings.end_behavior.missing_payment_method` parameter when you create\nor update the subscription:\n\n- **Cancel subscription**-If the free trial subscription ends without a payment\nmethod, it cancels immediately. You can create another subscription if the\ncustomer decides to subscribe to a paid plan in the future. Set\n`missing_payment_method=cancel` to cancel the subscription when it reaches the\nend of a trial without an available payment method.\n- **Pause subscription**-If the free trial subscription ends without a payment\nmethod, it pauses and doesn’t cycle until it’s resumed. When a subscription is\npaused, it doesn’t generate invoices (unlike when a subscription’s [payment\ncollection](https://docs.stripe.com/billing/subscriptions/pause-payment) is\npaused). When your customer adds their payment method after the subscription has\npaused, you can resume the same subscription. The subscription can remain paused\nindefinitely. Set `missing_payment_method=pause` to pause the subscription when\nit reaches the end of a trial without an available payment method.\n\nAlternatively, set `missing_payment_method=create_invoice` to invoice at the end\nof the trial if no payment method is present. If a payment method isn’t provided\nwhen the invoice finalizes, the subscription moves into `past_due`.\n\nConfigure reminder emails to collect customer’s payment details in your [free\ntrial messaging\nsettings](https://dashboard.stripe.com/settings/billing/automatic).\n\n### Configure free trials without payment methods to cancel\n\nUse the Dashboard, the API, or Checkout to create free trials of a subscription\nwithout collecting payment details from your customers, and to configure your\nsubscription to cancel if the trial ends without a payment method.\n\nDashboardAPICheckout\nYou can use the Dashboard to sign customers up for a free trial of a\nsubscription without collecting their payment details:\n\n- From the Subscriptions settings of the Dashboard, select **+Create\nsubscription**.\n- After adding your customer and product information, select **+Add free\ntrial**, then input how many days the free trial lasts.\n- Select the **Pause or cancel if free trial ends without a payment method**\noption, then select **Cancel immediately**. If you’re using [test\nclocks](https://docs.stripe.com/billing/testing/test-clocks), advance to the end\nof the trial. You won’t see an upcoming invoice for the subscription.\n- Listen to the `customer.subscription.deleted` event that informs you when a\nsubscription cancels at the end of trials without a payment method.\n\nIf you provide a payment method or select the **Email invoice to customer with\nlink to payment page** option, the **Pause or cancel if free trial ends without\na payment method** option won’t be visible.\n\n### Configure free trials without payment methods to pause\n\nUse the Dashboard, the API, or Checkout to create free trials of a subscription\nwithout collecting payment details from your customers, and to configure your\nsubscription to pause if the trial ends without a payment method.\n\nDashboardAPICheckout\nYou can use the Dashboard to sign customers up for a free trial of a\nsubscription without collecting their payment details:\n\n- From the Subscriptions settings of the Dashboard, select **+Create\nsubscription**.\n- After adding your customer and product information, select **+Add free\ntrial**, then input how many days the free trial lasts.\n- Select the **Pause or cancel if free trial ends without a payment method**\noption, then select **Pause**. If you’re using [test\nclocks](https://docs.stripe.com/billing/testing/test-clocks), advance to the end\nof the trial. You won’t see an upcoming invoice for the subscription.\n- Listen to the `customer.subscription.paused` event that informs you when a\nsubscription pauses at the end of trials without a payment method.\n\nIf you provide a payment method or select the **Email invoice to customer with\nlink to payment page** option, the **Pause or cancel if free trial ends without\na payment method** option won’t be visible.\n\n### Collect payment details from your customer before their trial ends\n\nConfigure your subscription to automatically send a reminder email when the\ncustomer’s trial is about to expire. You must comply with the card network\nrequirements when offering trials. Learn more about [compliance requirements for\ntrials and\npromotions](https://docs.stripe.com/billing/subscriptions/trials#compliance).\n\n### Events\n\n[Events](https://docs.stripe.com/api#event_types) are triggered every time a\nfree trial changes. Make sure that your integration properly handles the events.\nFor example, you might want to email a customer before a free trial ends. Learn\nmore about [handling subscription\nevents](https://docs.stripe.com/billing/subscriptions/webhooks#events).\n\nThe following table describes the events that trigger before a free trial ends,\nwhen a trial subscription pauses or cancels, and when a subscription is resumed\nand becomes active.\n\nEventDescriptionUse case`customer.subscription.deleted`Sent when a subscription\nends.Stop providing access to your product in response to this event. The\nsubscription moves to the `canceled` status and sends this event after a free\ntrial ends without a payment method and if the subscription’s\n`missing_payment_method` end behavior is set to\n`cancel`.`customer.subscription.resumed`Sent when a subscription is no longer\npaused. When you receive this event, grant the customer access to the product if\naccess was revoked while the subscription was paused.Paused subscriptions are\nconverted into active subscriptions after being resumed. Resuming a subscription\nmight generate an invoice and corresponding Payment Intent that must be paid\nbefore the subscription moves out of the `paused`\nstatus.`customer.subscription.paused`Sent when a subscription is fully paused.\nInvoicing won’t occur until the subscription resumes. When you receive this\nevent, you can revoke the customer’s access to the product until they add a\npayment method and the subscription resumes.Stop providing access to your\nproduct in response to this event. The subscription moves to the `paused` status\nand sends this event after a free trial ends without a payment method and if the\nsubscription’s `missing_payment_method` end behavior is set to `pause`. The\nsubscription remains `paused` until explicitly\nresumed.`customer.subscription.trial_will_end`Sent three days before the trial\nperiod ends. If the trial is less than 3 days, this event is triggered.Configure\nthe subscription to automatically send an email to your customer 3 days before\nthe trial period ends.\n### Use the customer portal to collect payment\n\nAfter you create a subscription for a customer without collecting a payment\nmethod, you can redirect them to the Billing customer portal to add their\npayment details.\n\nFirst, configure the [Billing customer\nportal](https://docs.stripe.com/customer-management) to enable your customers to\nmanage their subscriptions.\n\nNext, collect billing information from your customers:\n\n- Listen to the [customer.subscription.trial_will_end\nevent](https://docs.stripe.com/api/events/types#event_types-customer.subscription.trial_will_end).\n- If the subscription doesn’t have a [default payment\nmethod](https://docs.stripe.com/api/subscriptions/object#subscription_object-default_payment_method),\nget the customer’s email using the [Customers\nAPI](https://docs.stripe.com/api/customers/retrieve) and send them a message\nwith a link to your site. It’s helpful to embed the customer ID in the email.\nFor example: `https://example.com?...&customer={{CUSTOMER_ID}}`.\n- When the customer enters your site, create a customer portal session using the\ncustomer ID from the previous step.\n- Redirect the customer to the customer portal, where they can update their\nsubscription with payment details.\n\n### Allow customers to reactivate their subscriptions in the customer portal\n\nTo enable the subscription of a customer whose trial ended in a `paused`\nsubscription through the customer portal, enable the free trial without payment\nmethod feature when creating a new subscription in the Dashboard.\n\n### Send an email reminder before the trial ends\n\nTo send a reminder email prior to the end of the trial, select the **Link to a\nStripe-hosted page** option in the [Subscriptions and emails\nsetting](https://dashboard.stripe.com/settings/billing/automatic). The reminder\nemail contains a link for the customer to add or update their payment details.\nWe don’t send free trial reminder emails in [test\nmode](https://docs.stripe.com/test-mode). Learn more about how to [setup free\ntrial\nreminders](https://docs.stripe.com/billing/revenue-recovery/customer-emails#trial-ending-reminders).\n\nUse the `customer.subscription.trial_will_end` event to send your own hosted\nemails to customers. After you see the event in the Dashboard, it’s confirmed\nthat your email has been sent.\n\n### Convert a trial if customers provide payment information before the trial ends\n\nSubscriptions and upcoming invoices are created at the start of the trial and\nbecome active at the end of the trial if the customer provides a payment method.\n\n### Configure pausing when a payment method isn’t provided\n\nAfter a free trial ends, you can configure subscriptions to pause if no default\npayment method is available for a subscription on a per-subscription basis.\n\nYou can update subscriptions while they’re paused. Updates that typically\ngenerate prorations (adding items, changing price or plan, changing quantity,\nand so on) won’t generate proration line items because the customer isn’t being\ncharged while the subscription is paused. If you want to extend a trial after a\nsubscription transitions into a `paused` status, you must resume the\nsubscription before configuring a trial.\n\nWe check `default_source` and `default_payment_method` on the subscription and\ncustomer to determine whether a subscription is missing a payment method at the\nend of a trial.\n\n### Resume a paused subscription\n\nUse the Dashboard, API, customer portal, or Hosted Invoice Page to resume a\npaused subscription.\n\nDashboardAPICustomer portalHosted Invoice Page\nTo resume a paused subscription in the Dashboard, navigate to the subscription,\nthen select **Resume Subscription** under the **Actions** menu. Select **Reset\nbilling cycle** or **Always invoice** (if you’re not resetting the billing\ncycle) from the **Resume subscription** modal to charge the customer\nimmediately.\n\n### Invoicing a subscription\n\nWhile paused, a subscription won’t create an invoice. If you want to continue\ncreating invoices, use `pause_collection` to stop collecting payments while\ncontinuing to invoice and advance billing periods.\n\nTo preview the invoice that’s generated when a paused subscription is resumed,\nspecify a\n[subscription_resume_at](https://docs.stripe.com/api/invoices/upcoming#upcoming_invoice-subscription_resume_at).\n\n## See also\n\n- [Products and prices](https://docs.stripe.com/products-prices/overview)\n- [Prices](https://docs.stripe.com/api#prices)\n- [Subscriptions](https://docs.stripe.com/api#subscriptions)\n- [Managing subscription billing\ncycles](https://docs.stripe.com/billing/subscriptions/billing-cycle)\n\n## Links\n\n- [subscription](https://docs.stripe.com/billing/subscriptions/creating)\n- [creating the subscription](https://docs.stripe.com/api#create_subscription)\n-\n[trial_period_days](https://docs.stripe.com/api#create_subscription-trial_period_days)\n- [invoice](https://docs.stripe.com/api/invoices)\n- [change the subscription’s billing\ncycle](https://docs.stripe.com/billing/subscriptions/billing-cycle)\n- [update subscription](https://docs.stripe.com/api#update_subscription)\n- [2018-02-05](https://docs.stripe.com/upgrades#2018-02-05)\n- [Dashboard](https://dashboard.stripe.com/test/subscriptions)\n- [usage-based\nbilling](https://docs.stripe.com/products-prices/pricing-models#usage-based-pricing)\n-\n[parameter](https://docs.stripe.com/api/prices/create#create_price-recurring-aggregate_usage)\n- [meter events](https://docs.stripe.com/api/billing/meter-event)\n- [legacy usage\nrecords](https://docs.stripe.com/billing/subscriptions/usage-based-legacy)\n-\n[requirements](https://support.stripe.com/questions/2020-visa-trial-subscription-requirement-changes-guide)\n- [messaging settings](https://dashboard.stripe.com/settings/billing/automatic)\n- [successful payments](https://dashboard.stripe.com/settings/emails)\n- [statement\ndescriptor](https://docs.stripe.com/api/invoices/object#invoice_object-statement_descriptor)\n- [product statement\ndescriptors](https://docs.stripe.com/api/products/object#product_object-statement_descriptor)\n-\n[limit](https://docs.stripe.com/get-started/account/statement-descriptors#requirements)\n- [shortened descriptor](https://dashboard.stripe.com/settings/public)\n-\n[invoice.upcoming](https://docs.stripe.com/api/events/types#event_types-invoice.upcoming)\n- [statement\ndescriptor](https://docs.stripe.com/api/invoices/update#update_invoice-statement_descriptor)\n- [payment\ncollection](https://docs.stripe.com/billing/subscriptions/pause-payment)\n- [test clocks](https://docs.stripe.com/billing/testing/test-clocks)\n- [Events](https://docs.stripe.com/api#event_types)\n- [handling subscription\nevents](https://docs.stripe.com/billing/subscriptions/webhooks#events)\n- [Billing customer portal](https://docs.stripe.com/customer-management)\n- [customer.subscription.trial_will_end\nevent](https://docs.stripe.com/api/events/types#event_types-customer.subscription.trial_will_end)\n- [default payment\nmethod](https://docs.stripe.com/api/subscriptions/object#subscription_object-default_payment_method)\n- [Customers API](https://docs.stripe.com/api/customers/retrieve)\n- [test mode](https://docs.stripe.com/test-mode)\n- [setup free trial\nreminders](https://docs.stripe.com/billing/revenue-recovery/customer-emails#trial-ending-reminders)\n-\n[subscription_resume_at](https://docs.stripe.com/api/invoices/upcoming#upcoming_invoice-subscription_resume_at)\n- [Products and prices](https://docs.stripe.com/products-prices/overview)\n- [Prices](https://docs.stripe.com/api#prices)\n- [Subscriptions](https://docs.stripe.com/api#subscriptions)",
  "metadata": {
    "title": "Using trial periods on subscriptions | Stripe Documentation",
    "description": "Delay payments on active subscriptions using trial periods.",
    "sourceURL": "https://docs.stripe.com/billing/subscriptions/trials"
  }
}