{
  "content": "# Automation recipes\n\n## View example recipes for common automations.\n\nIn this guide, we provide popular automation recipes to give you an idea of how\nto use automations in different scenarios. To get an overview of the different\ntriggers, filter conditions, and actions available, see\n[Automations](https://docs.stripe.com/billing/automations).\n\n## Custom dunning flow for annual subscribers\n\nIncrease your recovery rate by customizing dunning behavior based on billing\ninterval, invoice amount, or customer segment. For example, you might want to\ngrant longer grace periods to annual or high-value customers, or retry more\nfrequently for a specific customer segment.\n\nTo customize automations:\n\n- Click **New automation**.\n- Give the automation a descriptive name, such as “Annual subscriber dunning.”\n- Select the **Subscription payment fails** as the trigger.\n- (Optional) Choose the conditions that must be met for the automation to run.\nIn this case, Subscription interval is: **yearly**.\n- Add the **Start retry policy** action, and select **+ Create new retry\npolicy** in the dropdown. Choose **Smart Retries for subscriptions** and retry\nup to **8 times** within **2 months**.\n- (Optional) Add a delay of 7 days as an additional grace period for manual\noutreach.\n- Add the **Cancel subscription** action.\n- Add the **Mark invoice uncollectible** action (which makes it a write-off for\n[Revenue\nRecognition](https://docs.stripe.com/revenue-recognition/methodology/subscriptions-and-invoicing#uncollectible-invoices)).\n\n## Notify your team when high value invoices are overdue\n\nTo improve cash flow and customer communications, keep track of high-value\nunpaid invoices. This recipe automates notifications for high-value invoices,\nenabling your team to take proactive measures to encourage the customer to pay\nthe outstanding invoice.\n\nTo implement these notifications:\n\n- Click **New automation**.\n- Give the automation a descriptive name, such as “Notify Collections team of\nhigh-value late invoices.”\n- Select the **Invoice is overdue** as the trigger.\n- Add a filter condition to select invoices **greater than** **$500**.\n- Add a **Send email** action and select a recipient using the company email\ndomain.\n- Write a short memo such as “Invoice over $500 is overdue by X days” in the\nmemo field.\n\nModify this recipe to meet your specific business needs, such as adjusting the\noverdue dollar amount and length of overdue period. The recipient must use the\ncompany email domain or be a user on the Stripe account.\n\n## Email a confirmation when a subscription is canceled\n\nTo enhance customer communication, automatically send subscribers a confirmation\nemail when their subscription is canceled.\n\nSending the confirmation email doesn’t prevent churn, but it can help to\nmaintain a positive customer relationship and provide an opportunity to gather\nthe cancellation reason, which allows you to further improve your service.\n\nTo set up this recipe with automations:\n\n- Click **New automation**.\n- Give the automation a descriptive name, such as “Subscription cancellation\nconfirmation.”\n- Select the **Subscription is canceled** as the trigger.\n- (Optional) Add a filter condition to restrict the automation by customer\nsegment, subscription product or plan, or subscription amount.\n- Select the **Send email to customer** action.\n- Stripe provides a predefined email template for the confirmation email. The\nemail includes the subscription details and confirms the cancellation date. You\nalso have the option to include a link to a cancellation reason survey.\n\n## Give new users a spend credit at signup\n\nBusinesses with usage based pricing models can give new users a spend credit to\nget started. This can lower the barrier to entry for new users trying your\nproducts by helping reduce friction to sign up and increase activation rates.\n\nTo set this recipe with automations:\n\n- Click **New automation**.\n- Give the automation a descriptive name, such as “New customer spend credit.”\n- Select **Customer is created** as the trigger.\n- (Optional) Select the **Create a subscription** action.\n- Select the **Credit customer balance** action.\n- At the prompt, enter the amount of the credit.\n\nModify this recipe to meet your specific needs, such as adjusting the dollar\namount of the credit adjustment and whether you want to create a subscription\nfor this new customer.\n\n## Links\n\n- [Automations](https://docs.stripe.com/billing/automations)\n- [Revenue\nRecognition](https://docs.stripe.com/revenue-recognition/methodology/subscriptions-and-invoicing#uncollectible-invoices)",
  "metadata": {
    "title": "Automation recipes | Stripe Documentation",
    "description": "Learn how to use automations in Stripe to create custom dunning flows, manage customer communications, create custom notifications, and issue signup credits for new users.",
    "sourceURL": "https://docs.stripe.com/billing/automation-recipes"
  }
}