{
  "content": "# Revenue Recognition with subscriptions and invoicing\n\n## Learn how Revenue Recognition works with subscriptions and invoices.\n\nBecause of the detailed information available on subscriptions and\n[invoices](https://docs.stripe.com/api/invoices), Revenue Recognition can\naccurately defer and recognize revenue for these resources. Revenue Recognition\ntreats each invoice line item and subscription item as its own performance\nobligation.\n\nRevenue Recognition amortizes revenue by the millisecond, but our example uses a\ndaily interval.\n\n## Licensed subscriptions\n\nLicensed subscriptions are subscriptions that generate invoices for a service\noffered in an upcoming subscription interval. At the end of the interval, the\nsubscription cycles and generates a new invoice for the next interval.\n\nEach subscription item corresponds to a single line item on the invoice, and\nautomatically populates the period for that line item with the period start and\nend for the subscription item.\n\nLet’s take a look at an example and timeline for a simple monthly subscription.\n\n- On January 15, a customer starts a monthly subscription that costs 31 USD,\nwhich generates an invoice that gets finalized.\n\nIn this case, the period of service is from January 15 to February 14. The 31\nUSD is therefore recognized over 17 days in January and 14 days in February. If\nyou inspected the account balances at the end of January, you’d see that 17 USD\nof revenue was recognized, and 14 USD of revenue remains deferred (to be\nrecognized in February).\n\nAccountJanRevenue+17.00DeferredRevenue+14.00\n## Metered subscriptions\n\nWhile licensed subscriptions items bill in advance, metered subscription items\nbill in arrears—at the point of invoice, all service has already been provided\nand all revenue recognized.\n\nMetered subscriptions allow businesses to submit usage information as service is\nprovided, prior to generating an invoice. Because service is provided, the\nrevenue must be recognized prior to the point of invoice.\n\nThis example introduces the concept of unbilled accounts receivable, which\nrepresents the amount of cash a business can expect to receive based on the\nservice that they’ve already provided, but not yet invoiced.\n\nThis next example is for a metered subscription item where usage is submitted\nover time.\n\n- On January 15, a customer subscribes to a monthly metered subscription at 1\nUSD per unit, and with `aggregate_usage=sum`.\n- On January 25th, they use 15 units.\n- On February 4th, they use another 17 units.\n- On February 14th, the subscription generates an invoice of 32 USD.\n- The invoice is finalized for 32 USD, but isn’t paid yet.\n\nIn this case, the period of service is from January 15 to February 14, but you\ndon’t generate an invoice until February 14. However, the revenue from the 15\nunits of usage still needs to be recognized in January, for an amount of 15 USD.\nIf you inspected the account balances at the end of January, you’d see that 15\nUSD of revenue was recognized, but instead of debiting accounts receivable,\nunbilled accounts receivable was debited.\n\nAccountJanRevenue+15.00UnbilledAccountsReceivable+15.00\nIf you later inspected the account balances at the end of February, you’d\nobserve the following:\n\nAccountJanFebRevenue+15.00+17.00UnbilledAccountsReceivable+15.00-15.00AccountsReceivable+32.00\n## Upgrades and downgrades\n\nSubscriptions can be upgraded and downgraded mid-month, and revenue needs to be\nrecognized accordingly. If an invoice is cut mid-month to handle the prorated\ncharges, the revenue schedule is also adjusted accordingly.\n\nThis next example is for a subscription that’s upgraded mid-month.\n\n- On April 1, a customer starts a monthly subscription for 90 USD, which\ngenerates and finalizes an invoice.\n- On April 21, the customer upgrades the subscription to cost 120 USD instead,\nwhich generates an invoice that accounts for the remaining 10 days of the month.\n\nIn this example, the customer receives 20 days of service with the 90 USD\nmonthly subscription (60 USD in value) and 10 days of service with the 120 USD\nmonthly subscription (40 USD in value). Therefore, in April, the recognized\nrevenue is 100 USD.\n\n## Standalone invoices\n\nThe algorithm for recognizing revenue for standalone invoices is the same as\nthat of a licensed subscription—the main difference is that line item periods\naren’t automatically populated.\n\nTo recognize revenue correctly, remember to set the period for each invoice line\nitem. If you don’t set a period on an invoice line item, the amount on that\ninvoice line item is recognized immediately when the invoice finalizes. If you\nneed to override or add a new service period, use the [Data Import\nfeature](https://docs.stripe.com/revenue-recognition/data-import) to configure\nyour invoice data, or set\n[rules](https://docs.stripe.com/revenue-recognition/rules) to customize revenue\ntreatments on different invoices.\n\nIn this example, an invoice has two line items, one with a period set, and one\nwithout.\n\n- On January 15, you create an invoice and finalize it with- A line item for 31\nUSD with a period from January 15 to February 14.\n- A line item for 5 USD with no period set.\n\nIn this case, the invoice is for a total of 36 USD. The 31 USD is recognized\nover 17 days in January and 14 days in February, but the 5 USD is immediately\nrecognized on January 15. If you inspected the account balances at the end of\nJanuary, you’d see that 22 USD (17 + 5) of revenue was recognized, and 14 USD of\nrevenue remains deferred (to be recognized in February).\n\nAccountJanRevenue+22.00DeferredRevenue+14.00\n## Uncollectible invoices\n\nWhen an invoice is marked as uncollectible, we clear the accounts receivable\naccount since we no longer expect payment.\n\nParts of the revenue for the invoice might have already been recognized. Upon\nmarking it uncollectible, the recognized revenue is offset by contra revenue in\nthe bad debt account.\n\nParts of the revenue for the invoice might still be deferred. Upon marking it\nuncollectible, the remaining deferred revenue is cleared.\n\nIn this example the invoice for a subscription finalizes and is later marked\nuncollectible.\n\n- On January 15, a customer starts a monthly subscription for 31 USD. The\ninvoice for 31 USD gets created and finalized.\n- On February 1, the invoice is marked as uncollectible.\n\nIn this case, the customer received 17 days of service, but didn’t pay. The 17\nUSD that’s recognized at that point would be considered bad debt. The 14 USD in\ndeferred revenue for a service that has yet to be provided is zeroed out. If you\ninspected the account balances on February 1, you’d see the following:\n\nAccountJanFebAccountsReceivable+31.00-31.00Revenue+17.00DeferredRevenue+14.00-14.00BadDebt+17.00\nAn uncollectible invoice might still be paid. When the invoice is paid, the bad\ndebt account is cleared out using a part of the received cash amount. The\nremaining cash amount goes to the recoverables account.\n\n## Voided invoices\n\nWhen you void an invoice, the invoice has reached a terminal state. We therefore\nclear the accounts receivable account since the invoice can no longer be paid.\n\nYou might have already recognized parts of the revenue for the invoice. Upon\nvoiding, the recognized revenue is offset by contra revenue in the voids\naccount.\n\nParts of the revenue for the invoice might still be deferred. Upon voiding, the\nremaining deferred revenue is cleared.\n\nIn this example, the invoice for a subscription is finalized and later voided.\n\n- On January 15, a customer starts a monthly subscription for 31 USD. The\ninvoice for 31 USD gets created and finalized.\n- On February 1, the invoice is voided.\n\nIn this case, the customer received 17 days of service, but didn’t pay. The 17\nUSD that’s recognized at that point would be voided. The 14 USD in deferred\nrevenue for service that has yet to be provided, is zeroed out. If you inspected\nthe account balances on February 1, you’d see the following:\n\nAccountJanFebAccountsReceivable+31.00-31.00Revenue+17.00DeferredRevenue+14.00-14.00Voids+17.00\n## Credit notes\n\nCredit notes allow the amount due on an invoice to be reduced after it\nfinalizes. Since the expected payment is reduced, accounts receivable are\nreduced by the amount of the credit note.\n\nIf the credit note has no line items, the credit note is divided proportionally\namong all line items, based on the line item amounts. If the credit note has a\nspecified line items, the credit note only applies to that line item.\n\nYou might’ve already recognized parts of the revenue for the invoice. When a\ncredit note is issued, recognized revenue is proportionally offset by contra\nrevenue in the credit notes account, based on the proportion of revenue that you\nrecognized.\n\nParts of the revenue for the invoice might still be deferred. When a credit note\nis issued, deferred revenue is reduced, based on the proportion of revenue\nthat’s still deferred.\n\nIn this example, the invoice for a subscription finalizes and a credit note is\nissued later.\n\n- On January 1, a customer starts a three month subscription for 90 USD. The\ninvoice for 90 USD gets created and finalized.\n- On February 1, a credit note of 45 USD is issued.\n\nAt the end of March, the account balances would resemble the following:\n\nAccountJanFebMarAccountsReceivable+90.00-45.00Revenue+31.00+14.00+15.50DeferredRevenue+59.00-43.50-15.50CreditNotes+15.50\n## Tax liability\n\nTo accurately handle your tax liability on invoices and subscriptions, use the\n`default_tax_rates` and `tax_rates` attribute on those resources to assign tax\nrates. If tax is modeled as a regular item, Revenue Recognition doesn’t\nautomatically differentiate between revenue and tax unless you configure a\n[custom rule](https://docs.stripe.com/revenue-recognition/rules).\n\nIt’s worth noting that taxes aren’t recognizable as revenue. For example, an\ninvoice for 50 USD with an exclusive tax of 5 USD has 50 USD in recognizable\nrevenue and 5 USD of tax liability. The invoice and accounts receivable totals\nare both 55 USD.\n\nIn this example the invoice has an exclusive tax rate.\n\n- On January 1, a customer starts a monthly subscription for 31 USD with an\nexclusive tax rate of 10%. The total due amount on the generated invoice is\n34.10 USD.\n- The invoice is paid immediately.\nAccountJanRevenue+31.00Cash+34.10TaxLiability+3.10\nSimilarly, let’s take a look at an example for an invoice with an inclusive tax\nrate.\n\n- On January 1, a customer starts a monthly subscription for 31 USD with an\ninclusive tax rate of 10%. The total due amount on the generated invoice is 31\nUSD.\n- The invoice is paid immediately.\nAccountJanRevenue+27.90Cash+31.00TaxLiability+3.10\n## Customer credit balance\n\nThe customer credit balance is a balance on a customer that gets applied to\nfuture invoices automatically. Because the customer credit balance is treated as\nan additional payment (rather than a discount, for example), applying it to an\ninvoice doesn’t reduce the tax liability for that invoice.\n\nHandling the customer credit balance involves what we call the customer balance\naccount, which tracks the interactions between customer credit balance and\ninvoices.\n\nIn this example, an invoice is created for a customer that maintains a customer\ncredit balance.\n\n- On January 15, an invoice for 31 USD is created and finalized. None of the\nline items have a service period, so revenue is immediately recognized.\n- The customer has -11 USD in their customer credit balance. Stripe\nautomatically applies -11 USD to the invoice and adjusts the customer credit\nbalance to 0 USD.\n- The customer pays 20 USD.\n\nIn this case, the resulting account balances would look like\n\nAccountJanCash+20.00Revenue+31.00CustomerBalance-11.00\n\n## Links\n\n- [invoices](https://docs.stripe.com/api/invoices)\n- [Data Import feature](https://docs.stripe.com/revenue-recognition/data-import)\n- [rules](https://docs.stripe.com/revenue-recognition/rules)",
  "metadata": {
    "title": "Revenue Recognition with subscriptions and invoicing | Stripe Documentation",
    "description": "Learn how Revenue Recognition works with subscriptions and invoices.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/methodology/subscriptions-and-invoicing"
  }
}