{
  "content": "# Handling complaints\n\n## Learn how to properly handle complaints about Stripe Treasury or Stripe Issuing.\n\nComplaints are any expression of dissatisfaction with a product, service,\npolicy, or employee related to Stripe Treasury and/or Issuing, except those\nexpressions made by employees of your company. Proper handling of complaints is\nmandatory when offering financial services products.\n\nYou must provide your customers with an easily identifiable and accessible way\nto submit complaints. Include instructions on how to efficiently submit\ncomplaints close to your customer support contact information or an equally\nobvious location. You’re ultimately responsible for resolving complaints, but\nStripe can provide guidance and support when needed.\n\nStripe expects you to acknowledge all operational (standard) complaints within 5\nbusiness days and resolve them within 15 business days from the complaint\nsubmission date. You must maintain records of all complaints and resolutions in\naccordance with applicable law. Upon request, you must provide Stripe with\nreasonable access to all pending and resolved complaints.\n\nWhen you or someone representing your platform becomes aware of an executive\ncomplaint regarding Treasury or Issuing products, promptly notify Stripe within\n1 business day of the complaint submission date. Executive complaints include\nany threats of litigation or complaints from regulators and complaints that\nallege Unfair or Deceptive Acts and Practices (UDAP), discrimination, consumer\nharm, or legal concerns. Upon receipt of an executive complaint, please refrain\nfrom further interaction with the customer until Stripe reviews the complaint.\nStripe works closely with you to resolve all executive complaints.\n\nIn addition, you must report an aggregated list of complaints to Stripe on a\nmonthly basis. Stripe uses the list to make sure that the product is adhering to\nregulatory requirements. Facilitate easy complaint submission by providing clear\nand obvious options on your support site or other relevant customer service\nproduct area.\n\nComplaint typeNotification to StripeAcknowledgement to\ncustomerResolutionAggregated reportingExecutiveWithin 1-2 business daysWithin 5\nbusiness daysWithin 15 business daysMonthly by the tenth of the\nmonthOperationalReasonable access, upon requestWithin 5 business daysWithin 15\nbusiness daysMonthly by the tenth of the month\nTo demonstrate your adherence to these complaint handling requirements, Stripe\nasks that you keep thorough records of all complaints. This includes email\ninteractions and any documentation developed in the course of resolving\ncomplaints.\n\nGiven that you’re responsible for managing customer support, as well as\nresolving most complaints, it’s important to distinguish between a regular\ncustomer service inquiry and a complaint. The following guidelines help you\ndistinguish between general customer service inquiries and complaints. If you’re\nuncertain, forward the customer inquiry to Stripe to help determine whether the\ncommunication constitutes a complaint.\n\n## Complaint channels\n\nYour platform can receive complaints through various means, including by\ntelephone, in person, social media, email, a regulatory agency, direct written\ncommunication, and so on. You must forward complaints to Stripe in email. If you\npermit your customers to raise complaints through means other than email, either\ndirect your customer to resend the complaint in an email, or summarize the\nuser’s complaint and email the complaint to Stripe. You must address all\ncomplaints, regardless of how you receive them.\n\n## Complaint types\n\nThe following table provides guidelines to determine the type of complaint you\nmight receive.\n\nExecutiveOperationalLegal/regulatory complaints, which include:- A private\npractice attorney or lawyer acting on behalf of their client\n- A federal or state attorney general acting in response to a person who has\nfiled a complaint with a regulatory agency\n- A federal or state government agency acting in response to a person who has\nfiled a complaint with a regulatory agency\n- A person threatening to bring a legal action against your platform, Stripe, or\na banking partner\n- Complaints that allege Unfair or Deceptive Acts and Practices (UDAP),\ndiscrimination, or consumer harm\n- Product or service complaints, which are complaints about customer service or\nproduct functionality and might include complaints related, but not limited to,\nthe following:\n\n- Fees or premiums\n- Disclosures or notices\n- Servicing\n- Application form\n- Transactions\n- Account management\n- Third-party service providers\n- Advertising or marketing\n- Privacy or security complaints, which are complaints related, but not limited\nto:\n\n- Fraud\n- Identity theft\n- Criminal activity, such as robbery or theft\n- Unauthorized access to a customer’s information\n- Honoring opt-in, opt-out, and do-not-call requests\n- Unauthorized product enrollment, account openings, or upgrades (including the\naddition of unauthorized ancillary add-on products), or other improper sales\npractices\n\n## Differentiating between complaints and customer service inquiry\n\nA customer service inquiry can be verbal or written, and includes a request to\nyou for information and assistance related to a Treasury or Issuing program\nelement. This could include address changes; account inquiries; questions about\na product’s availability in certain jurisdictions; technical inquiries related\nto your platform, Stripe’s platform, or a third-party platform that’s integrated\nwith Stripe’s platform; or a request for refund of fees.\n\nThe key distinguishing factor that differentiates an inquiry from a complaint is\nthe customer’s expression of dissatisfaction, which might be transparent either\nin the use of specific phrasing (“trigger words”) or in the customer’s general\ntone in communicating.\n\nThe following trigger words differentiate a complaint from a customer service\ninquiry:\n\n- Abuse or abusive **\n- Marital status (married, single, or divorced)\n- Angry or mad\n- Military or service member\n- Annoyed\n- National origin **\n- Attorney or lawyer\n- Opt in or opt out\n- Bait and switch **\n- Predatory **\n- Bias or prejudice **\n- Privacy\n- Deceived **\n- Problem\n- Disclosure or disclose\n- Race, minority, or color **\n- Discrimination or discriminate **\n- Redlining or redline **\n- Disgraceful **\n- Regulator or regulatory\n- Exploit or manipulate **\n- Religion, age, or disability **\n- Fairness or unfair **\n- Ridiculous\n- Financial injury\n- Sex or gender **\n- Foul language\n- Sexual orientation **\n- Fraud or ID theft\n- Sue\n- Hide or hidden\n- Unauthorized\n- Lawsuit\n- Unbelievable **\n- Litigation\n- Unfair **\n- Low income or poor\n- Unhappy or not happy\n- Ludicrous\n\n** Complaints containing these trigger words or synonyms might allege unfair or\ndeceptive acts and practices (UDAP) or discrimination. This list isn’t\nexhaustive and Stripe might add other trigger words to this list.\n\nIn addition to the preceding trigger words, consider the tone of the\ncommunication and reference the examples below when making a determination and\nconsider similar circumstances for complaint identification.\n\n- A customer expresses dissatisfaction with you, your Stripe-run products or\nservices, Stripe, or a bank partner.\n- A customer states that they wish to file a complaint.\n- A customer states that a business practice or employee interaction is\nmisleading, unfair, deceptive, abusive, or a combination of these.\n- A customer alleges discrimination.\n- A customer threatens to file suit against you, Stripe, or a bank partner.\n- Customer alleges that you, your Stripe-run products or services, Stripe, or a\nbank partner violate a specific law or regulation or questions the legality of a\npractice.\n- A customer notes multiple or repeated attempts to obtain information or\nresolve a concern (use of words like “still,” “repeated,” and so on).\n- An attorney sends a complaint letter on behalf of a customer.\n- A regulatory or government agency initiates a complaint.\n\nExamples of what isn’t a complaint:\n\n- A customer address correction or change.\n- Account inquiries or requests for assistance.\n- Inquiries regarding technical assistance (for example, error messages) or\nproblems interacting with the Stripe platform, its integration with third-party\nservices, or both.\n\n## Complaints tracking\n\nStripe requires all Issuing and Treasury platforms to regularly share complaints\nreceived from their connected accounts. You must complete reporting each month\nbefore the tenth calendar day of the following month.\n\nEach platform receives a unique and secure form after onboarding to record\ncomplaints. If your platform can’t locate your complaints form, contact\n[complaints-issuing-treasury@stripe.com](mailto:complaints-issuing-treasury@stripe.com).\n\nIf you don’t receive any complaints in a month, you must still let Stripe know\nby following the steps in the **No complaints attestation** tab in your\nplatform’s unique complaints form.\n\n### Required information\n\nA standard set of fields is required for each complaint received. All fields are\nrequired except where noted. You can also find this table in the **Definitions**\ntab of your complaints form.\n\nComplaint FieldStripe’s Definition`date_input`The date the complaint information\nwas first added to this tracker.`date_received`The date of ticket or case\ncreation for the complaint.`user_name`Business name (Business’s\nDBA).`received_by`Servicer or personnel managing complaint\nintake.`account_ID`Business unique identifier or\ntoken.`complaint_classification`Classify whether it’s an operational or\nexecutive complaint.`stripe_product`The Stripe product that the complaint\npertains to. If related to a card, select Issuing.`complaint_category`Classify\nthe category of complaint as: Privacy or Security, Legal or Regulatory, or\nProduct or Service.`complaint_sub_category`The type of activity the complaint is\nabout.`complaint_channel`The intake channel for the\ncomplaint.`complaint_description`Brief description of the user’s\ncomplaint.`alleges_UDAP_or_discrimination`Classify whether the complainant\nalleges a UDAP (unfair or deceptive acts and practices) or discriminatory acts.\nUltimately, whether a complaint alleges a UDAP or discriminatory practice hinges\non the language used (see list of “trigger words” above) and the general\nsentiment of the business’s complaint.`user_stage`Classify the stage for the\nuser in the customer lifecycle.`systemic_issue_identified`Disclosure of whether\nthe complaint revealed a systemic issue that needs rectifying.`date_resolved`The\ndate a resolution was communicated to the customer and executed to close the\nticket. Required only after complaint is resolved`redress_reqd`Disclosure of\nwhether a rectifying action (e.g., reimbursement) was necessary to resolve the\nticket. Required only after complaint is\nresolved`description_of_corrective_action`Description of resolution steps\nundertaken to close the ticket. Required only after complaint is\nresolved`internal_links`Internal links of items such as documents and\ncorrespondence that were used to resolve the ticket.\nOptional`user_correspondence_links`Links to user correspondence that allows an\nauditor or a regulator to review the ticket history and resolution. Required if\napplicable to the case, but not required if there is no source of user\ncorrespondence`reason_exceeded_15_days`The reason that the resolution took\nlonger than 15 business days. Required only after complaint is resolved and\nresolution exceeded 15 business days",
  "metadata": {
    "title": "Handling complaints | Stripe Documentation",
    "description": "Learn how to properly handle complaints about Stripe Treasury or Stripe Issuing.",
    "sourceURL": "https://docs.stripe.com/treasury/handling-complaints"
  }
}