{
  "content": "# Stripe invoices in NetSuite\n\n## Learn about how the connector syncs Stripe invoices to NetSuite.\n\nThe Stripe Connector for NetSuite automatically syncs the invoices that you\ncreate from Stripe Billing\n[subscriptions](https://docs.stripe.com/billing/subscriptions/overview) or\n[Stripe Invoicing](https://docs.stripe.com/invoicing/overview) into NetSuite.\nThe connector creates a representation of these subscription invoices (including\nproduct prices) as NetSuite invoices. When using Stripe subscriptions, Stripe\ncreates an invoice each period (for example, every month or year), which results\nin the connector creating an invoice in NetSuite to represent the subscription.\n\nStatusActionInvoice paidThe connector creates a NetSuite customer payment and\napplies it against the NetSuite invoice.Invoice unpaidThe invoice in NetSuite\nremains open or is automatically marked as uncollectible.Refund initiatedThe\nconnector creates a credit memo and customer refund, and applies the credit memo\nto the refund to reverse the cash and income for the invoice and\npayment.Subscription changedSubscription changes (such as a different product or\nquantity purchased) aren’t represented on the invoice for the current\nsubscription. The invoice for the next subscription cycle includes prorations\nand product changes.\n## Subscription changes in Stripe\n\nYour customers might want to [upgrade or\ndowngrade](https://docs.stripe.com/billing/subscriptions/upgrade-downgrade)\ntheir subscriptions.\n\nSubscription changes won’t modify the Stripe and NetSuite invoice for the\ninitial invoice. The initial invoice continues to generate revenue during the\nspecified billing period. The new invoice generates revenue during the new\nsubscription period.\n\n### Subscription upgrades\n\nIf your customer wants to upgrade their subscription, you charge the difference\nbetween the unused time proration of the current subscription and the cost of\nthe new subscription. In NetSuite this appears as additions to the subscription\ninvoice.\n\n### Subscription downgrades\n\nIf your customer wants to downgrade their subscription and the new subscription\ncosts less, you apply a credit for the unused amount of the original\nsubscription to the next invoice. The customer isn’t refunded, and the balance\ngets added to the customer in Stripe.\n\nWhen the next billing period occurs, Stripe uses the customer balance to pay the\ninvoice. The connector creates a credit memo against the invoice to represent\nthe amount applied with the customer balance. If the customer balance is greater\nthan the invoice amount, Stripe applies the remaining balance to subsequent\ninvoices.\n\n## Subscription changes in NetSuite\n\nThe approach you use to handle subscription changes depends on how you want to\nrecognize revenue in NetSuite.\n\nSituationSubscription changesRevenue recognitionA customer signs up for a yearly\nsubscription but wants to switch to a monthly subscription.In Stripe, do the\nfollowing:- Fully refund the original subscription.\n- Cancel the original subscription.\n- Create a new subscription with the updated period.\nUse this approach if you don’t want to recognize any revenue in NetSuite for the\noriginal yearly subscription.A customer signs up for a yearly subscription but\nwants to switch to a monthly subscription. Or a customer wants to switch their\nsubscription period in the middle of their subscription.In Stripe, do the\nfollowing:- Partially refund the original subscription for the prorated unused\ntime on the subscription.\n- Cancel the original subscription.\n- Create a new subscription with the updated period.\nUse this approach if you want to partially recognize revenue in NetSuite for the\nnew monthly subscription.A customer wants to switch their subscription period in\nthe middle of their subscription.In Stripe, change the original yearly\nsubscription term to the new monthly subscription term.Ask your implementation\npartner to discuss using this approach with the connector.\n## Trial invoices\n\nStripe subscriptions with [trial\nperiods](https://docs.stripe.com/billing/subscriptions/trials) create\nzero-balance invoices in Stripe. The connector can either sync these trial\nperiod invoices into NetSuite or ignore them.\n\nTrial invoices use a special invoice structure in Stripe. All line items on the\ninvoice are set to zero, so the invoice doesn’t impact accounting. This differs\nfrom coupons or discount codes, which creates an invoice with a net total of\nzero.\n\nThe connector still syncs invoices that have non-zero line items, because the\ninvoice might have a net total of zero but contain line items that have general\nledger impact.\n\n## Customer balance or credit\n\nThe connector supports paying an invoice with a Stripe [customer credit\nbalance](https://docs.stripe.com/billing/customer/balance), but this approach\nisn’t recommended.\n\nIf your customer has a negative account balance, they can use their credit\nbalance to partially or fully pay an invoice. For example, if they downgrade\ntheir subscription to a lower cost plan, it creates a negative invoice in\nStripe. The unused, prorated value gets added to the customer balance. The\ncredit memo applies to the next invoice to represent the portion of the invoice\npaid using the customer balance. If the invoice has multiple line items, the\nconnector uses the generic `Stripe Customer Balance Item`. The connector uses\nthe generic Stripe item because it can’t identify which portion of the customer\nbalance to apply to each item, even if the customer balance pays the full\ninvoice amount.\n\nA positive account balance might occur if a plan change or manual adjustment\ncreates a balance that’s less than the minimum payment amount in the invoice\ncurrency. In this case, the connector uses a unique `Stripe Customer Balance\nDebit Item` to represent the balance amount on the next invoice. If the invoice\namount is below the minimum, the invoice isn’t created in NetSuite.\n\n## Manage Stripe invoices\n\nWhen you [edit an invoice](https://docs.stripe.com/invoicing/invoice-edits) in\nStripe, the connector voids the original NetSuite invoice with a credit memo.\nThe connector then creates a new invoice to reflect the changes made to the\nStripe invoice.\n\n### Negative Stripe invoices\n\nNetSuite doesn’t allow negative invoices. Because of this, Stripe represents\nnegative invoices as a zero-dollar invoice in NetSuite, with the negative amount\napplied on the next invoice as a customer balance credit.\n\n### Invoice payment failures\n\nStripe attempts multiple payments on an invoice. If a [payment\nfails](https://docs.stripe.com/billing/subscriptions/webhooks#payment-failures),\nthe invoice remains unpaid in Stripe and open in NetSuite. You must do one of\nthe following:\n\n- Manually pay the invoice.\n- Mark the invoice as uncollectible.\n- Mark the invoice as void.\n\nYou can also [configure\nStripe](https://dashboard.stripe.com/settings/billing/automatic) to\nautomatically mark the invoice as\n[uncollectible](https://docs.stripe.com/connectors/netsuite/stripe-invoices-netsuite#uncollectible-invoices),\nand the connector closes it in NetSuite.\n\n### One-time prices\n\nYou can create one-time price objects as lines on an invoice by passing\n`price_data`. The price object is automatically archived after it’s used on the\ninvoice. The connector uses the global `Stripe Item` for one-time price objects.\n\n## Uncollectible invoices\n\nYou can mark an open, unpaid invoice as\n[uncollectible](https://docs.stripe.com/api/invoices/mark_uncollectible) if\npayment fails on a subscription that’s past due.\n\nMarking an invoice as uncollectible results in the following:\n\n- Stripe treats the subscription as if the user paid and stops attempting to\ncollect payment.\n- The user’s subscription continues as normal, but the subscription status\nremains as `past_due`.\n- The connector automatically creates and applies a credit memo in NetSuite by\ndefault. The credit memo reverses the entries to accounts receivable and makes\nthe entry to an income account. If you don’t want the connector to automatically\nclose an invoice, enable the `Keep unpaid invoices open` feature.\n\nIf your payment retry setting for Stripe subscriptions is to cancel the\nsubscription, it marks the associated invoice as uncollectible.\n\nThe connector doesn’t support reopening invoices that are marked as\nuncollectible in Stripe.\n\nThe connector doesn’t support reopening invoices marked as uncollectible in\nStripe.\n\n### Mark an invoice as uncollectible\n\n- On the [Subscriptions and\nemails](https://dashboard.stripe.com/settings/billing/automatic) tab in the\nDashboard, navigate to the **Manage failed payments for subscriptions** section.\n- For the **Invoice status**, select **mark the invoice as uncollectible** if\nall retries for a payment fail.\n\nThis setting affects how the connector records an invoice’s final state in\nNetSuite.\n\nYou might not need to enable this setting if your system has additional\nrequirements, or you have a custom process to close unpaid invoices in NetSuite.\nIf you don’t enable this setting, any open, unpaid invoices with failed payment\nattempts remain open in NetSuite.\n\n### Revenue recognition and bad debt\n\nWhen creating a credit memo to close an invoice, the connector uses the same\nrevenue recognition schedules as used on the original invoice items. On the\ncredit memo, you can represent all bad debt that’s marked as uncollectible with\neither of the following:\n\n- The original items on the invoice\n- A unique global item to override the default item\n\nUsing a bad debt item allows you to customize the account that the bad debt\nposts to. If you use a unique global item to represent bad debt, the schedules\nfrom the original invoice aren’t copied to the credit memo.\n\nThe connector reports to NetSuite the date that Stripe records the following\ninvoice statuses: `paid`, `uncollectible`, or `void`. If you use a customized\ndunning system to handle payment retries and invoice status changes, the closing\ndate for the invoice might differ from the Stripe closing date.\n\n## Shipping cost\n\nThe connector’s invoice syncing feature supports Stripe [shipping\nrates](https://docs.stripe.com/api/shipping_rates). If a Stripe invoice has a\nshipping cost, the connector creates a `Stripe Shipping` global item in your\nNetSuite instance and uses this item to create a NetSuite invoice line item that\nrepresents the shipping cost.\n\n## See also\n\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation)\n- [Subscription invoices](https://docs.stripe.com/billing/invoices/subscription)\n- [How subscriptions\nwork](https://docs.stripe.com/billing/subscriptions/overview)\n\n## Links\n\n- [subscriptions](https://docs.stripe.com/billing/subscriptions/overview)\n- [Stripe Invoicing](https://docs.stripe.com/invoicing/overview)\n- [upgrade or\ndowngrade](https://docs.stripe.com/billing/subscriptions/upgrade-downgrade)\n- [trial periods](https://docs.stripe.com/billing/subscriptions/trials)\n- [customer credit balance](https://docs.stripe.com/billing/customer/balance)\n- [edit an invoice](https://docs.stripe.com/invoicing/invoice-edits)\n- [payment\nfails](https://docs.stripe.com/billing/subscriptions/webhooks#payment-failures)\n- [configure Stripe](https://dashboard.stripe.com/settings/billing/automatic)\n-\n[uncollectible](https://docs.stripe.com/connectors/netsuite/stripe-invoices-netsuite#uncollectible-invoices)\n- [uncollectible](https://docs.stripe.com/api/invoices/mark_uncollectible)\n- [shipping rates](https://docs.stripe.com/api/shipping_rates)\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation)\n- [Subscription invoices](https://docs.stripe.com/billing/invoices/subscription)",
  "metadata": {
    "title": "Stripe invoices in NetSuite | Stripe Documentation",
    "description": "Learn about how the connector syncs Stripe invoices to NetSuite.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/stripe-invoices-netsuite"
  }
}