{
  "content": "# Import AU BECS data\n\n## Migrate your AU BECS data to Stripe, including mandate handling, migration notification, and file formatting requirements.\n\nWhen you migrate AU BECS data from your previous processor, you import the data\nin Stripe as a payment method object (pm_).\n\n## Import the mandates\n\nDuring the customer onboarding process, businesses must collect a mandate that\nauthorizes them to debit the account. In the BECS Direct Debit system, these\nmandates are called Direct Debit Requests (DDRs).\n\nThese mandates or DDRs refer to the original authorized agreement that the\ncustomer and the business have already established.\n\nIn migrating payment details to Stripe, we create a new Direct Debit Request for\nyou to replace your existing direct debit request mandates. This new DDR:\n\n- Represents the same agreement the customer initially authorized for the first\ndirect debit instruction.\n- Requires no new information from the customer. The original agreement stays\nthe same.\n\n### Account limits\n\nNew users are subject to default limits of 1,500 AUD per transaction and 4,500\nAUD per week for Australia BECS Direct Debit transactions. If you need higher\nlimits, let us know in your [migration request\nform](https://docs.stripe.com/get-started/data-migrations/pan-import#request-migration).\n\n## Migration notification\n\nInform your customers about the migration before it happens. The original\napproval is sufficient, so they don’t need to give permission again or set up a\nnew AU BECS Direct Debit mandate.\n\nReassure your customers that their current mandates are valid and require no\naction from them, unless they choose to cancel the mandate.\n\n## AU BECS debit notification\n\nAU BECS regulations require you to [notify your\ncustomers](https://docs.stripe.com/payments/au-becs-debit#debit-notification-emails)\nwhen debiting their AU BECS payment method.\n\nYou can choose to have Stripe automatically send this email notification, or you\ncan send it manually. Stripe requires the customer email address in the\nmigration data to comply with this regulation.\n\n## AU BECS file guidance\n\n- A processor can provide a number of different fields.\n- We advise your processor to provide a full export of all customer and payment\nmethod data to Stripe.\n- Stripe can filter out any unnecessary fields from the previous processor’s\ndata as needed.\n- Stripe can merge multiple received files if either the old customer ID or the\nold source ID is present in both files.\n\n## File formatting requirements\n\nExport data files must meet the following data standards for us to proceed with\nan import:\n\n- The file must be in CSV format.\n- The file must be UTF-8 encoded.\n- Delimit rows by a single newline character `\n` (not `\\r\n`).\n- Delimit columns by a comma (`,`).\n- You must wrap all fields containing commas in double quotes (`\"`). We\nrecommend wrapping all fields in double quotes.\n- Leave empty fields entirely empty (no character in between delimiters). You\nmust not denote a missing field with `NULL`, `N/A`, or any other value.\n- Escape any double quotes that are part of the content with another double\nquote per the CSV RFC. Example: `\"William` `\"\"Bard of Avon\"\"` `Shakespeare\"`\n- Fields can’t contain newline characters (`\\r` or `\n`) within a field. An example of what to avoid would be: `101 1st Ave\nApt 1`.\n- All rows must have the same number of columns.\n- Columns support any order.\n- You must encrypt sensitive data files with our [PGP\nkey](https://docs.stripe.com/get-started/data-migrations/pan-import#migration-pgp-key)\nbefore submitting them through SFTP.\n\n## AU BECS data fields\n\nFieldRequiredAdditional infoOld customer IDRequiredWe create a customer ID for\neach unique old customer ID provided.NameRequiredWe must include the name of the\nperson on the mandate.Account NumberRequiredThe bank account number.BSB\nNumberRequiredThe 6 digit bank state branch number of the bank\naccount.EmailRequiredAU BECS requires you to email a notification to the\ncustomer upon signup and debit of their AU BECS payment method. Stripe can send\nthis email notification automatically or you can manually send it.Stripe\ncustomer IDOptionalStripe customer ID to map the mandates to if required.Old\nsource IDOptionalUnique representation of a payment method.Address line\n1OptionalFirst line of the address for the customer’s AU BECS mandate.Address\nline 2OptionalSecondary details of the address for the customer’s AU BECS\nmandate.CityOptionalCity address for the customer’s AU BECS\nmandate.StateOptionalState of the address for the customer’s AU BECS\nmandate.PostalOptionalZip code of the address for the customer’s AU BECS\nmandate.CountryOptionalMust be in the form of the ISO 2 letter country\ncode.PhoneOptionalPhone number of the account holder.Customer/AU BECS\nMetadataOptionalAny additional metadata.\n\n## Links\n\n- [Request a payment data\nimport](https://docs.stripe.com/get-started/data-migrations/pan-import)\n- [AU BECS](https://docs.stripe.com/payments/au-becs-debit)\n- [migration request\nform](https://docs.stripe.com/get-started/data-migrations/pan-import#request-migration)\n- [notify your\ncustomers](https://docs.stripe.com/payments/au-becs-debit#debit-notification-emails)\n- [PGP\nkey](https://docs.stripe.com/get-started/data-migrations/pan-import#migration-pgp-key)",
  "metadata": {
    "title": "Import AU BECS data | Stripe Documentation",
    "description": "Migrate your AU BECS data to Stripe, including mandate handling, migration notification, and file formatting requirements.",
    "sourceURL": "https://docs.stripe.com/get-started/data-migrations/au-becs-imports"
  }
}