{
  "content": "# Updating service agreement acceptances\n\n## Learn how to update your connected accounts and handle acceptance of the Stripe Connected Account Agreement and other disclosures.\n\nWorking with connected accounts where your platform is liable for negative\nbalances, including Custom and Express accounts, provides a lot of flexibility.\nYou can access almost every Stripe\n[account](https://docs.stripe.com/api/accounts) property through the API.\n\nPlatforms can use the API to perform many account management functions,\nincluding:\n\n- Handle acceptance and re-acceptance of the Stripe Connected Account Agreement\n(for accounts with no Stripe-hosted Dashboard access, including Custom\naccounts).\n- Handle [identity\nverification](https://docs.stripe.com/connect/identity-verification) (for\naccounts with no Stripe-hosted Dashboard access, including Custom accounts).\n- Manage the connected business’s information, such as its name, logo, and URL.\n- Set some charge behaviors.\n- Establish [payout\nhandling](https://docs.stripe.com/connect/payouts-connected-accounts).\n\nYou can make those account updates with an [update\naccount](https://docs.stripe.com/api/accounts/update) call.\n\n## View and update a connected account through the platform’s Dashboard\n\nYou can update some account settings in the [Connected\naccounts](https://dashboard.stripe.com/connect/accounts/overview) section of\nyour Dashboard.\n\nClick any connected account in the list to open that account’s details page. The\ninformation that you can view and change depends on the account type or\ncontroller properties. Common tasks on this page include checking the status of\npayouts and searching for payments.\n\n## Stripe’s service agreements for connected accounts\n\nTo provide Stripe Connect services to your connected accounts, Stripe must\nestablish a direct contractual relationship with them. That requires all\nconnected accounts with no Stripe-hosted Dashboard access to accept the correct\nStripe service agreement. The service agreement your accounts must accept\ndepends on whether they’re merchants subject to Stripe’s full terms of service\nor are payment recipients subject to the recipient service agreement. You’re\nresponsible for making sure that your accounts agree to the correct service\nagreement before accepting or receiving payments through Stripe on your\nplatform.\n\nIf, after onboarding, one of your connected accounts transfers its ownership or\nupdates its verified tax identification number, the updated account owner must\nprovide their agreement to the correct Stripe service agreement. You’re\nresponsible for obtaining that agreement.\n\n### Referencing Stripe’s service agreement\n\nYou must present your connected accounts with a link to the correct agreement,\nand they must expressly consent to it prior to using Stripe. For example, at the\npoint of account activation, you can present language such as the following:\n\nFull service agreementRecipient service agreement\nBy registering your account, you agree to our Services Agreement and the [Stripe\nConnected Account Agreement](https://stripe.com/connect-account/legal/full).\n\n### Add Stripe’s service agreement to your terms of service\n\nYou can make accepting Stripe’s service agreement easy for connected accounts by\nincluding it in your terms of service. In your terms, include a link to the\ncorrect Stripe service agreement and clearly state that accepting your terms\nincludes accepting the Stripe service agreement. Here are some examples of text\nyou can include in your terms:\n\nFull service agreementRecipient service\nagreementFrenchSpanishItalianPortugueseGermanJapanese\nPayment processing services for [account holder term, for example, drivers or\nsellers] on [platform name] are provided by Stripe and are subject to the\n[Stripe Connected Account\nAgreement](https://stripe.com/connect-account/legal/full), which includes the\n[Stripe Terms of Service](https://stripe.com/legal) (collectively, the “Stripe\nServices Agreement”). By agreeing to [this agreement / these terms / and so on]\nor continuing to operate as a [account holder term] on [platform name], you\nagree to be bound by the Stripe Services Agreement, as the same may be modified\nby Stripe from time to time. As a condition of [platform name] enabling payment\nprocessing services through Stripe, you agree to provide [platform name]\naccurate and complete information about you and your business, and you authorize\n[platform name] to share it and transaction information related to your use of\nthe payment processing services provided by Stripe.\n\n### Indicating acceptance\n\nFor connected accounts where the platform collects updated information for due\nor changed requirements, you must collect the updated acceptance of Stripe’s\nservice agreement.\n\nTo indicate to Stripe that a connected account accepted Stripe’s service\nagreement, make an [update account\ncall](https://docs.stripe.com/api/accounts/update), providing the acceptance\ndate and IP address:\n\n```\ncurl https://api.stripe.com/v1/accounts/{{CONNECTED_ACCOUNT_ID}} \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d \"tos_acceptance[date]\"=1609798905 \\\n -d \"tos_acceptance[ip]\"=\"8.8.8.8\"\n```\n\n### Acquirer disclosure\n\nTo meet Stripe’s Financial Partner requirements, you must advise your connected\naccounts of Stripe’s acquirers and their contact information in a clear and\nconspicuous manner, including [this\ndisclosure](https://stripe.com/legal/acquirer-disclosure). For accounts that\nfall solely under the Recipient Service Agreement, you don’t need to include\nthis disclosure.\n\nIf your accounts provide acceptance of Stripe’s service agreement through a\nStripe onboarding product, it includes that disclosure.\n\n## Disclosing how Stripe processes connected account data\n\nWhile providing your connected accounts with Connect services, Stripe processes\ntheir data as explained in [Stripe’s Privacy\nPolicy](https://stripe.com/privacy). You must disclose that to your accounts by\nproviding them with a link to that policy.\n\nIn addition, connected accounts in Canada must consent to allow Stripe to obtain\ninformation from credit agencies to verify their identities. You can obtain that\nconsent in your onboarding flow by incorporating language like the following\nwhere users agree to your terms of service:\n\nOur payment processor can obtain information from credit agencies to verify your\nidentity. That information will be used for the purposes described in their\nPrivacy Policy.\n\nIf you are using a Stripe onboarding product like embedded onboarding, but\nproviding a link to your own privacy policy, your privacy policy must include a\nlink to Stripe’s Privacy Policy and the following language:\n\nPrivacy policy link\nWhen you provide personal data in connection with , Stripe receives that\npersonal data and processes it in accordance with Stripe’s Privacy Policy.\n\nFor Stripe to lawfully process personal data according to your instructions, you\ncan be legally required to provide additional disclosures or obtain additional\nconsents. Talk to your lawyer about which disclosures and consents might apply\nto your platform and connected accounts.\n\n## See also\n\n- [Identity Verification](https://docs.stripe.com/connect/identity-verification)\n- [Account Tokens](https://docs.stripe.com/connect/account-tokens)\n- [Control Bank and Debit Card\nPayouts](https://docs.stripe.com/connect/payouts-connected-accounts)\n- [Manage bank accounts and debit\ncards](https://docs.stripe.com/connect/payouts-bank-accounts)\n- [Receive payouts](https://docs.stripe.com/payouts)\n- [Full API reference](https://docs.stripe.com/api)\n\n## Links\n\n- [configured with\nproperties](https://docs.stripe.com/connect/update-to-typeless-connect)\n- [account](https://docs.stripe.com/api/accounts)\n- [identity verification](https://docs.stripe.com/connect/identity-verification)\n- [payout handling](https://docs.stripe.com/connect/payouts-connected-accounts)\n- [update account](https://docs.stripe.com/api/accounts/update)\n- [Connected accounts](https://dashboard.stripe.com/connect/accounts/overview)\n- [Stripe Connected Account\nAgreement](https://stripe.com/connect-account/legal/full)\n- [Stripe Terms of Service](https://stripe.com/legal)\n- [this disclosure](https://stripe.com/legal/acquirer-disclosure)\n- [Stripe’s Privacy Policy](https://stripe.com/privacy)\n- [Account Tokens](https://docs.stripe.com/connect/account-tokens)\n- [Manage bank accounts and debit\ncards](https://docs.stripe.com/connect/payouts-bank-accounts)\n- [Receive payouts](https://docs.stripe.com/payouts)\n- [Full API reference](https://docs.stripe.com/api)",
  "metadata": {
    "title": "Updating service agreement acceptances | Stripe Documentation",
    "description": "Learn how to update your connected accounts and handle acceptance of the Stripe Connected Account Agreement and other disclosures.",
    "sourceURL": "https://docs.stripe.com/connect/updating-service-agreements"
  }
}