{
  "content": "# Overview of ACH SEC codes\n\n## Learn about different types of customer authorizations for ACH Direct Debit.\n\nA Standard Entry Class (SEC) code is a three letter code that describes how a\ncustomer or business authorized an ACH transaction. SEC codes are defined and\nmaintained by [Nacha](https://www.nacha.org/newrules), the governing body for\nthe ACH network.\n\nBusinesses must make sure that the correct code is used when initiating debit\ntransactions to make sure they comply with ACH Direct Debit rules and\nappropriate authorization evidence in the event of a dispute. The business is\nresponsible under the ACH Direct Debit rules for indicating the appropriate SEC\ncode for each ACH transaction.\n\nStripe currently supports four types of SEC codes for ACH Debits. If you don’t\nspecify a mandate collection method, Stripe defaults to using WEB for consumer\nbank accounts and CCD for business bank accounts.\n\nThe mandate requirements under ACH Direct Debit rules and applicable law vary\nbased on the type of mandate collected. The information on this page relating to\nyour compliance with ACH mandate requirements is for your general guidance, and\nisn’t legal advice. If you’re unsure of the applicable mandate requirements,\nconsult with a professional about your obligations.\n\n## WEB (Internet Initiated/Mobile Entry)\n\nThis code is used to initiate entries to a consumer’s account when the internet\nor a mobile device is used to initiate the transaction. WEB is the default\nunless you indicate otherwise. Refunds processed for WEB transactions use the\nPPD SEC code.\n\n## CCD (Corporate Credit or Debit Entry)\n\nThis code is used to facilitate business-to-business payments and is applied to\ncharges to all PaymentMethods that have `account_holder_type=company`,\nregardless of the authorization type.\n\n## PPD (Prearranged Payment and Deposit)\n\nThis code is used to initiate entries to a consumer’s account, based on standing\nor single-entry authorization from that customer in writing. Your customer’s\nauthorization must be in writing and signed or otherwise authenticated (that is,\nconfirm the customer’s identity and agreement such as using a phone for a\npreviously provided written authorization). Authorizations need to include\ninformation required for [online\nmandates](https://docs.stripe.com/payments/ach-direct-debit#mandates-for-online-custom-payment-forms)\nand you must provide a copy of the authorization to your customer.\n\nTo initiate a PPD debit, you must create a mandate with offline customer\nacceptance. You can do so by confirming a PaymentIntent or a SetupIntent with\noffline customer acceptance and providing a `collection_method=paper` mandate\noption as shown below:\n\nPaymentIntentSetupIntent\n```\ncurl https://api.stripe.com/v1/payment_intents/{{PAYMENT_INTENT_ID}}/confirm \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d \"mandate_data[customer_acceptance][type]\"=offline \\\n -d \"mandate_data[customer_acceptance][accepted_at]\"=1647448692 \\\n-d\n\"payment_method_options[us_bank_account][mandate_options][collection_method]\"=paper\n```\n\n## TEL (Telephone-Initiated Entry) Beta\n\nThis code is used to initiate debit transactions to a consumer’s account when\nauthorization is given over the telephone. TEL debits are currently in private\nbeta. Contact Stripe Support if you initiate bank debits to consumer accounts\nover the telephone.\n\n### Requirements for Telephone-initiated payments\n\nIf your business accepts ACH payments over the telephone, Stripe supports single\nTEL ACH debit transactions. Don’t use a TEL entry where a standing authorization\nis in place or to support a recurring transaction. TEL entries have their own\nNacha requirements that you need to meet prior to accepting and processing these\npayments.\n\n#### Existing relationship\n\nYou can only use a TEL entry if:\n\n- You and the customer have an existing relationship, which means that:- You and\nthe customer have a written agreement in place for the provision of goods or\nservices; or\n- Your customer has purchased goods or services from you within the past 2\nyears; or\n- You don’t have an existing relationship with the customer, but the customer\ninitiated the telephone call to you.\n\nYour customer’s pre-existing relationship with one of your affiliates is not\nsufficient to be an existing relationship between you and your customer.\n\n#### Verifications\n\nYou must establish and implement commercially reasonable procedures to verify\nthe identity of the customer (for example, name, address, and telephone number).\nAdditionally, you must establish and implement commercially reasonable\nprocedures to verify that the routing numbers provided by your customers are\nvalid.\n\n#### Authorization requirements\n\nYour customer’s explicit oral authorization is needed prior to you initiating a\ndebit entry to their account. Authorizations need to include information\nrequired for [online\nmandates](https://docs.stripe.com/payments/ach-direct-debit#mandates-for-online-custom-payment-forms),\nalong with a telephone number available to your customer for inquiries.\n\nIn addition, you must capture authorization by either an audio recording of the\ncustomer’s oral authorization (in accordance with applicable state law regarding\nthe recording of calls) or providing written notice to the customer of their\nauthorization *before* the first debit of their bank account.\n\nSample scriptTo confirm your payment, I understand that you, {{customer’s name}}\nauthorize {{business name}} to debit you on {{debit date}} for the amount of\n{{amount}} for {{service provided}}. The account information you’ve provided me\nis as follows: Bank Name: {{bank name}}. Bank ABA Routing Number: {{routing\nnumber}}. Bank Account Type: {{checking/savings}}. Bank Account Number:\n{{account number}}. Is this information correct? As of today’s date, {{date}},\nthis debit authorization is valid and will remain in effect until you,\n{{customer name}}, notify {{business name}} of its cancellation by calling\n{{customer support phone number}}\n\nFor single TEL entries, if you provide a written notice instead of audio\nrecording the authorization, you should indicate how you will provide that\nnotice (for example, emails and mailed letters).\n\n## Links\n\n- [Nacha](https://www.nacha.org/newrules)\n- [online\nmandates](https://docs.stripe.com/payments/ach-direct-debit#mandates-for-online-custom-payment-forms)",
  "metadata": {
    "title": "Overview of ACH SEC codes | Stripe Documentation",
    "description": "Learn about different types of customer authorizations for ACH Direct Debit.",
    "sourceURL": "https://docs.stripe.com/payments/ach-direct-debit/sec-codes"
  }
}