{
  "content": "# Stripe Capital eligibility\n\n## Learn more about our offer eligibility criteria.\n\nStripe determines your eligibility for a financing offer based on a variety of\nfactors related to your Stripe accounts, including your processing volume and\nthe size of your customer base.\n\nWe automatically review your business for financing offer eligibility on a daily\nbasis. If you become eligible, you’ll receive an email and you can view your\noffer in the Dashboard under the [Capital\ntab](https://dashboard.stripe.com/capital).\n\nYou might see a banner in the Stripe Dashboard that indicates that you’re on\ntrack for a future offer. This isn’t a guarantee of a future offer or of\nspecific terms and doesn’t reflect a decision or evaluation.\n\n#### Note\n\nIf your business has multiple Stripe accounts, a financing offer might be\ngenerated based on the combined information from those accounts. Changes to one\naccount without corresponding updates to others might affect your financing\neligibility. This includes changes to your business name, Employee\nIdentification Number (EIN), and business address.\n\n## Minimum eligibility requirements\n\nTo qualify for a financing offer through Stripe Capital, your business must:\n\n- Have processed payments on Stripe for 3 months or more.\n- Have a processing volume of 5,000 USD minimum per year and an average\nprocessing volume of USD 1,000 for the last 3 months.\n- Be in good standing with Stripe Capital. If your business previously applied\nfor a Capital offer and was rejected, you’re not eligible to receive a new offer\nfor 30 days.\n- Be based in the US. The Stripe Capital program only supports businesses\nlocated or incorporated in the US. Business representatives must also provide a\nphysical US home address.\n- Certain geographic limitations may apply. Funding might not be available in\ncertain states due to local rules and regulations.\n\n#### Note\n\nMeeting the minimum eligibility requirements doesn’t guarantee that your\nbusiness qualifies for a Stripe Capital offer, or will be approved at\napplication.\n\n## Important factors we consider\n\nIn addition to the minimum requirements, Capital’s underwriting models may\nevaluate many other characteristics of your business to determine eligibility.\nWe’ve highlighted some key considerations:\n\n- *A growing business.* How much you process through Stripe influences the size\nof your financing offer. Businesses with positive growth trajectories are more\nlikely to be eligible for an offer.\n- *A steady processing record.* A consistent, steady processing record with\nlimited periods of low or zero volume shows stability in your business and\nincreases your likelihood of qualifying for an offer.\n- *A large customer base.* Businesses with more customers are more likely to be\neligible for an offer.\n- *A low dispute rate.* Businesses with low rates of unresolved chargebacks are\nmore likely to qualify for funding.\n\n## Additional steps you can take\n\nThe more information we can see about the health of your business, the better we\ncan evaluate your eligibility for a Capital offer.\n\n- *Connect your business bank account.* Securely [linking your bank\naccount](https://docs.stripe.com/get-started/account/linked-external-accounts)\nlets Stripe view your bank balances and transactions to better determine your\neligibility for an offer.\n- *Bring more processing volume onto Stripe.* Our underwriting model is based on\nthe payment volume that you process on Stripe. Shifting transaction volume from\nother payment sources onto Stripe increases your overall Stripe processing\nvolume and improves your likelihood of receiving an offer.\n\n## Links\n\n- [Capital tab](https://dashboard.stripe.com/capital)\n- [linking your bank\naccount](https://docs.stripe.com/get-started/account/linked-external-accounts)",
  "metadata": {
    "title": "Stripe Capital eligibility | Stripe Documentation",
    "description": "Learn more about our offer eligibility criteria.",
    "sourceURL": "https://docs.stripe.com/capital/eligibility"
  }
}