{
  "content": "# Revenue Recognition methodology\n\n## Learn how Revenue Recognition works within Stripe.\n\nRevenue Recognition is integrated with other Stripe objects to provide\nintelligent default settings for how to recognize revenue.\n\nRevenue Recognition automatically calculates all transactions that happen within\nStripe down to the millisecond, including subscriptions, invoices, one-time\npayments, refunds, disputes, and so on.\n\n## Chart of accounts\n\nStripe built Revenue Recognition on top of a double-entry accounting ledger that\ntracks debits and credits resulting from your business activity.\n\nTo get the most out of Revenue Recognition, it helps to understand the default\nchart of accounts and the debits and credits that impact those accounts.\n\nIncome statement accountsBalance sheet accountsAccount Debit or Credit type\nDescription RevenueRevenue (credit)Recognizable portion of finalized invoices,\nprorated invoice items, and metered billing that count towards revenue during\nthe month. For example, if an invoice line item is for 90 USD with 10 USD in\ntaxes, the total invoice is 100 USD, but the recognizable portion is only 90\nUSD.RefundsContra revenue (debit)Portion of the refunded amount previously\nrecognized. For example, if you issue a 120 USD refund on an annual subscription\nduring the second month, 20 USD for the first 2 months is contra revenue. The\nremaining 100 USD is adjusted and reflected in your deferred revenue balance in\nthe balance sheet.DisputesContra revenue (debit)Portion of the disputed amount\npreviously recognized. For example, if there’s a 120 USD dispute on an annual\nsubscription during the second month, 20 USD for the first 2 months is contra\nrevenue. The remaining 100 USD is adjusted and reflected in your deferred\nrevenue balance in the balance sheet.Credit notesContra revenue (debit)Portion\nof the credit note amount previously recognized. For example, if there’s a 120\nUSD credit note on an annual subscription during the second month, 20 USD for\nthe first 2 months is contra revenue. The remaining 100 USD is adjusted and\nreflected in your deferred revenue balance in the balance sheet.Bad debtContra\nrevenue (debit)Previously recognized revenue from invoices that have been marked\nas uncollectible.VoidsContra revenue (debit)Previously recognized revenue from\ninvoices that have been voided.Unbilled voidsContra revenue (debit)Previously\nrecognized revenue from prorated invoice items that have been deleted. These\nitems are sometimes deleted when they generate unbilled accounts receivable and\nrevenue.TransferContra revenue (debit)Previously recognized revenue from\nseparate transfers.DiscountsContra revenue (debit)Recognized revenue from\ninvoices that received discounts. Revenue Recognition discount as contra revenue\nsupport is currently in private beta.Customer balance adjustmentsExpense\n(debit)Expenses incurred due to manual adjustments to a customer credit balance\nor exclusion associated with post-paid credit notes on customer balance.External\ncustomer balance adjustmentsExpense (debit)Expenses incurred due to exclusion\nassociated with post-paid credit notes on external customer\nbalance.UnderpaymentsExpense (debit)Expenses incurred due to transfers that\nunderpay an invoice, as used by the [customer credit\nbalance](https://docs.stripe.com/invoicing/bank-transfer#underpayments) payment\nmethod or [Sources](https://docs.stripe.com/sources/customers).FeesExpenses\n(debit)Expenses incurred due to Stripe fees.RecoverablesGains (credit)Recovered\nfunds that aren’t attributable to revenue. For example, if you have a 120 USD\ndispute on an annual subscription during the second month, 20 USD for the first\n2 months is contra revenue and the remaining 100 USD is adjusted from the\ndeferred revenue balance. If you win the dispute and 120 USD is returned to you,\n20 USD is reflected as revenue and the remaining 100 USD is reflected as\nrecoverables.ExclusionGains (credit)Excluded funds that aren’t attributable to\nrevenue. To exclude transactions, set up [exclusion\nrules](https://docs.stripe.com/revenue-recognition/rules/create-a-rule#treatments)\nor use [exclusion\nimport](https://docs.stripe.com/revenue-recognition/data-import#exclusion-import).Fx\nlossLoss (debit)Total loss due to foreign currency exchange rates.Other lossLoss\n(debit)The portion of contra revenue that exceeds the total invoice represents\nan overcompensation in cash to the customer. For example, if a 100 USD invoice\nis partially refunded by 80 USD and then disputed for an additional 80 USD, 60\nUSD will be categorized as “Other loss.”Connect transfer lossLoss (debit)Total\nloss due to destination charge refund, and the transfer reversal will reverse\nthe ConnectTransferLoss account.\n## Data modeling for Revenue Recognition\n\nSee the following descriptions of how Revenue Recognition handles common Stripe\nresources to learn how Revenue Recognition uses data modeling.\n\n### Subscriptions and Invoicing\n\nSubscriptions and Invoices are higher level resources that contain detailed\ninformation about each transaction.\n\nSubscriptions create invoices on each cycle, with each subscription item\ncorresponding to an invoice line item. The period of each line item is\nautomatically populated with the period of the subscription item.\n\nRevenue Recognition treats each invoice line item as its own performance\nobligation. When the invoice finalizes, the total recognizable amount is\ndeferred and subsequently amortized evenly over the period of each invoice line\nitem.\n\nIf a period isn’t set on an invoice line item, the amount on that invoice line\nitem is recognized entirely when the invoice is finalized. Use the [Data Import\nfeature](https://docs.stripe.com/revenue-recognition/data-import) to configure\nyour invoice data, or set\n[rules](https://docs.stripe.com/revenue-recognition/rules) to customize when and\nhow invoice line items are recognized.\n\nFor more details and examples regarding how Revenue Recognition handles\nsubscriptions and invoices with specific scenarios involving upgrades,\ndowngrades, discounts, taxes, and so on, review the [Subscriptions and\nInvoicing](https://docs.stripe.com/revenue-recognition/methodology/subscriptions-and-invoicing)\npage.\n\n### One-time payments\n\nOne-time payments created in the Dashboard or through the\n[Charges](https://docs.stripe.com/api/charges) and\n[PaymentIntents](https://docs.stripe.com/api/payment_intents) APIs don’t contain\nas much information as invoices.\n\nBecause no service period or fulfillment information exists for them, by\ndefault, one-time payments are recognized immediately when the payment occurs.\n\n[Import data](https://docs.stripe.com/revenue-recognition/data-import) to add a\nservice period or split a payment into different revenue recognition schedules.\nThis allows you to customize revenue treatment behavior and configure rules such\nas payment amount, description, and customer email.\n\nFor more details and examples on how Revenue Recognition handles one-time\npayments, review the [One-time\npayments](https://docs.stripe.com/revenue-recognition/methodology/one-time-payments)\npage.\n\n### Refunds and disputes\n\nRevenue Recognition handles refunds and disputes by generating contra revenue to\noffset already recognized revenue.\n\nFor transactions with both already-recognized and deferred revenue, the\nrecognized portion is added to either the refunds or disputes contra revenue\naccount, which cancels out the deferred revenue.\n\nFor more details and examples on how Revenue Recognition handles refunds and\ndisputes, review the [Refunds and\nDisputes](https://docs.stripe.com/revenue-recognition/methodology/refunds-and-disputes)\npage.\n\n### External transactions\n\nYou can track revenue collected outside of Stripe using invoices. Configure the\ninvoice as you would any other, and then mark the invoice as paid either\ndirectly in the Dashboard, or through the `paid_out_of_band` option in the API.\n\nInvoices marked as paid outside of Stripe contribute not to the cash account,\nbut rather to the external asset account.\n\n#### Caution\n\nIf you’d like to consolidate your financial data from outside Stripe onto\nRevenue Recognition, review the [Data\nimport](https://docs.stripe.com/revenue-recognition/data-import) page.\n\n### Multi-currency\n\nIf your business handles transactions in multiple currencies, accurately\nrecognizing revenue can be complicated.\n\nRevenue Recognition processes transactions and generates journal entries based\non your account’s settlement currencies. Transactions with presentment\ncurrencies that aren’t supported as settlement currencies are automatically\nconverted to your account’s default settlement currency.\n\nFor payments and paid invoices, we use the exchange rate for the actual money\nmovement (that is, reflected on the balance transaction). If you incur a time\ndelay between issuing a bill (for example, an invoice) and it getting paid, the\ndifference in amounts because of changing exchange rates between the two times\nis added to the FxLoss account.\n\nFor more details and examples on how Revenue Recognition handles multiple\ncurrencies, review the\n[Multi-currency](https://docs.stripe.com/revenue-recognition/methodology/multi-currency)\npage.\n\n### Data availability\n\nRevenue Recognition computes your data twice daily, at 0:00am UTC and at 12:00pm\nUTC.\n\nThe data processed at 0:00am UTC encompasses account activity from the prior\nday’s 12:00pm to that day’s 11:59pm UTC. The 12:00pm UTC update covers activity\nfrom 0:00am to 11:59am UTC of the same day.\n\nIt can take up to 24 hours to process the data. Users in time zones far from UTC\nmight notice slight delays in reports because late-day activity in PST\ncorresponds to early hours of the following day in UTC.\n\nAs an example, you might have account activity occurring on August 1, 2023, from\n0:00 am to 11:59 am UTC. You can expect to see this activity reflected in the\nRevenue Recognition reports by August 4, 2023, at 12:00 pm UTC. Similarly, you\ncan access reports for activity from 12:00 pm to 11:59 pm UTC on August 1, 2023\nby August 5, 2023, at 0:00 am UTC.\n\n## Journal entries\n\nEvery billing activity in Stripe generates a set of journal entries. A journal\nentry is a record of a transaction. Each journal entry consists of a debit and a\ncredit account. For example, an entry which finalizes an invoice would debit\nAccountsReceivable and credit DeferredRevenue. Paying an invoice would debit\nCash and credit AccountsReceivable.\n\nThese entries can occur in asset, liability, equity, expense, or revenue\naccounts. You can learn more about the definitions of each account that will\nappear in a journal entry under our [Chart of\naccounts](https://docs.stripe.com/revenue-recognition/methodology#chart-of-accounts)\nsection.\n\nThe table below shows the applicable billing activities for common journal\nentries. You can export journal entries to CSV using the debits and credits\nreport, which you can find in the [Reports tab in the\nDashboard](https://dashboard.stripe.com/revenue-recognition). In addition, there\nare options to download debits and credits reports by the event type, which\nprovide a brief description of the recorded event, which can help you understand\nthe nature of each journal entry.\n\n#### Caution\n\nThe following table isn’t the complete set of entries. We’ll be periodically\nupdating the entries. If there’s a specific entry that you require assistance\nwith, please [create a\nticket](https://support.stripe.com/contact/email?topic=financial_reports) on our\nsupport page.\n\nDebit Credit Definition Accounts receivableDeferred revenueInvoice being\nfinalizedUnbilled accounts receivableUnbilled invoice item being\ninvoicedPassthrough feesFinalize an invoice with passthrough feesTax\nliabilityFinalize an invoice with taxBad debtAccounts receivableMark an invoice\nas uncollectiblePending cashMark an invoice with a pending ACH as\nuncollectibleRecoverablesMark an invoice which is partially paid with customer\nbalance as uncollectibleCashAccounts receivableInvoice is paidCustomer\nbalancePaying for a negative customer balanceExclusionCash is excludedPending\ncashACH paying invoice is confirmedRecoverablesWinning a dispute for amounts\nthat were previously adjusted from deferred revenue balanceConnect transfer\nlossCashLoss from a transferCredit notesAccounts receivablePrepaid credit note\nis issued on an unpaid invoiceCustomer balancePost paid credit note credits\ncustomer balanceExternal customer balancePost paid credit note credits external\ncustomer balanceCustomer balanceCustomer balance adjustmentsReduce the amount\nowned by the customerCustomer balance adjustmentsCustomer balanceIncrease the\namount owned by the customerDeferred revenueCashCaused by Refunds and\nDisputesRevenueRevenue is recognizedExternal assetAccounts receivableMark an\ninvoice as paid outside of StripeRefundsCashRefundTax liabilityCustomer\nbalanceCredit note on an invoice with tax, and it credits customer\nbalanceExternal customer balanceCredit note on an invoice with tax, and it\ncredits external customer balanceUnbilled accounts receivableRevenueRevenue\nrecognized on unbilled invoice itemUnbilled voidsUnbilled accounts\nreceivableUnbilled invoice item is deletedVoidsAccounts receivableVoid an\ninvoiceBad debtVoid an uncollectible invoiceCustomer balanceVoid an invoice\npartially paid with customer balance\nThe activities above are all based on positive amounts. It is important to note\nthat these billing activities can be reversed. These reverse activities occur\nwhen activities are triggered on negative invoice line item amounts.\n\n## Negative Line Item\n\nA negative line item occurs when the value of the line item becomes higher than\nthe amount it is paid for. This occurs typically during a subscription downgrade\nor upgrade when the product tier changes.\n\nHere is an example of journal entries which contains a negative line item caused\nby a downgrade:\n\n- On April 1, the invoice is generated for a monthly subscription worth 90 USD\nand the customer pays for it.\n- On April 21, the customer requests a downgrade of their service to a 30 USD\nsubscription. This results in 2 unbilled line items for the remaining time of\nthe subscription.- il_1 is for the remaining time on new plan worth 10 USD\n- il_2 is for the remaining time of old plan worth -30 USD\n- On May 1, the invoice is generated containing the line items generated by the\ndowngrade as well for the new line item, il_3, representing the month of May.\nThe customer pays for the invoice on the same day.\n- On May 4, the customer requests a full refund on the invoice for May,\nresulting in full refunds on the line item created by the downgrade as well as\nthe new line item for May. We process the refund.\nDate Debit Credit Amount Line Item 2022-04-21Unbilled accounts\nreceivableRevenue10 USDil_1RevenueUnbilled accounts receivable30\nUSDil_22022-05-01Accounts receivableDeferred revenue30 USDil_3CashAccounts\nreceivable30 USDil_3Deferred revenueRevenue30 USDil_3Accounts receivableUnbilled\naccounts receivable10 USDil_1CashAccounts receivable10 USDil_1Unbilled accounts\nreceivableAccounts receivable30 USDil_2Accounts receivableCash30\nUSDil_22022-05-04RefundsCash10 USDil_1CashRefunds30 USDil_2RevenueCash30 USDil_3\n\n## Links\n\n- [customer credit\nbalance](https://docs.stripe.com/invoicing/bank-transfer#underpayments)\n- [Sources](https://docs.stripe.com/sources/customers)\n- [exclusion\nrules](https://docs.stripe.com/revenue-recognition/rules/create-a-rule#treatments)\n- [exclusion\nimport](https://docs.stripe.com/revenue-recognition/data-import#exclusion-import)\n- [Data Import feature](https://docs.stripe.com/revenue-recognition/data-import)\n- [rules](https://docs.stripe.com/revenue-recognition/rules)\n- [Subscriptions and\nInvoicing](https://docs.stripe.com/revenue-recognition/methodology/subscriptions-and-invoicing)\n- [Charges](https://docs.stripe.com/api/charges)\n- [PaymentIntents](https://docs.stripe.com/api/payment_intents)\n- [One-time\npayments](https://docs.stripe.com/revenue-recognition/methodology/one-time-payments)\n- [Refunds and\nDisputes](https://docs.stripe.com/revenue-recognition/methodology/refunds-and-disputes)\n-\n[Multi-currency](https://docs.stripe.com/revenue-recognition/methodology/multi-currency)\n- [Chart of\naccounts](https://docs.stripe.com/revenue-recognition/methodology#chart-of-accounts)\n- [Reports tab in the\nDashboard](https://dashboard.stripe.com/revenue-recognition)\n- [create a\nticket](https://support.stripe.com/contact/email?topic=financial_reports)",
  "metadata": {
    "title": "Revenue Recognition methodology | Stripe Documentation",
    "description": "Learn how Revenue Recognition works within Stripe.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/methodology"
  }
}