{
  "content": "# Link in the Payment Request Button\n\n## Let your customers check out faster with Link and the Payment Request Button.\n\n#### Caution\n\nStripe no longer recommends using the Payment Request Button as part of your Web\nElements integration. To integrate Link, use one of our preferred Elements: the\nLink Authentication Element, Express Checkout Element, or Payment Element.\n\nWhen new customers come to your site, they can use\n[Link](https://docs.stripe.com/payments/link) in the [Payment Request\nButton](https://docs.stripe.com/stripe-js/elements/payment-request-button) to\npay with their saved payment details. With Link, they don’t need to manually\nenter their payment information.\n\nAdditionally, Link is fully compatible with the other features you receive from\ncard payments (for example, subscriptions), and there’re no additional fees. To\nturn Link off or on, go to your [payment method\nsettings](https://dashboard.stripe.com/settings/payment_methods).\n\n![User paying for Link using the Payment Request\nButton](https://b.stripecdn.com/docs-statics-srv/assets/link-in-prb-pay.addb77c45640c8f3f3c872d40ade0aaa.png)\n\nCompleting payment using Link with the Payment Request Button\n\n## Returning Link customers\n\nReturning customers can authenticate by clicking the **Link** button and\nentering an SMS or email code. After they authenticate, Link loads their\npreviously saved payment details, allowing them to make payments with a single\nclick. If they previously authenticated their account in the last 90 days,\neither on your site or through a different Link-enabled business, they can pay\ninstantly without re-authenticating. New Link customers are prompted to save\ntheir information in a Link account when they click the **Link** button.\n\n## Link and Connect platforms\n\nLink is automatically available through the Payment Request Button to any\nconnected accounts that access the Payment Request Button through a Connect\nplatform integration.\n\n- If you’re a Connect platform, you can manage Link for your connected accounts\nthrough the [payment method\nsettings](https://dashboard.stripe.com/settings/payment_methods) page.\n- If you’re a connected account processing payments through a Connect platform,\nyour platform manages Link for you when payments are processed through the\nplatform. For payments processed without a platform, you can use the [payment\nmethod settings](https://dashboard.stripe.com/settings/payment_methods) page in\nyour Dashboard to manage Link for the Payment Request Button.\n\n## See also\n\n- [Stripe Web Elements](https://docs.stripe.com/payments/elements)\n- [Express Checkout\nElement](https://docs.stripe.com/payments/link/express-checkout-element-link)\n\n## Links\n\n- [Link](https://docs.stripe.com/payments/link)\n- [Payment Request\nButton](https://docs.stripe.com/stripe-js/elements/payment-request-button)\n- [payment method\nsettings](https://dashboard.stripe.com/settings/payment_methods)\n- [Stripe Web Elements](https://docs.stripe.com/payments/elements)\n- [Express Checkout\nElement](https://docs.stripe.com/payments/link/express-checkout-element-link)",
  "metadata": {
    "title": "Link in the Payment Request Button | Stripe Documentation",
    "description": "Let your customers check out faster with Link and the Payment Request Button.",
    "sourceURL": "https://docs.stripe.com/payments/link/payment-request-button-link"
  }
}