{
  "content": "# Email communications in embedded Connect integrations\n\n## Customize Stripe notifications to your connected accounts in a fully embedded integration.\n\nIn an embedded Connect integration, when connected accounts must review\ninformation or take action, Stripe sends email communications directly to them.\nThose emails direct your connected accounts to embedded components on your\nwebsite to review information or take required action. You must provide Stripe\nwith the URLs for those components so we can include them in the emails.\n\nYou can customize the messages that Stripe sends to match your platform brand,\nand you can view an account’s Stripe email history on the account’s details\npage.\n\n## Communications that Stripe sends to your connected accounts\n\nWe send the following emails to your connected accounts:\n\n- **Account emails** verify an account’s information, such as additions or\nchanges to an email address, phone number, or bank account.\n- **Compliance emails** notify accounts to provide required information. Stripe\noften needs to collect further information to maintain compliance with our\nfinancial partners.\n- **Risk emails** notify accounts when they’re under a risk review. These emails\noften provide instructions on how to submit information to resolve a risk\naction; for example, to remove a pause on payouts.\n- **Tax emails** (only when Stripe collects Stripe fees directly from connected\naccounts) notify users when their tax invoices or 1099s are ready to download.\n\nIf you want to send any other payments-related emails to your connected\naccounts, you must send them yourself. For example, to send emails for new\ndisputes, [listen for](https://docs.stripe.com/webhooks) the\n`charge.dispute.created` event on a connected account. When that event occurs,\nuse [the Disputes API](https://docs.stripe.com/api/disputes) to get the details\nand email them to the account.\n\nYou must [update your Connect settings with the\nURLs](https://dashboard.stripe.com/settings/connect/site-links) of your payments\nand account workflows so Stripe’s email communications can include links for\nyour accounts to respond.\n\n## Site links to your website components\n\nEmails sent by Stripe that contain a call to action include a link to perform\nthat action. For example, if we send an email directing a connected account to\nrespond to a risk notification, it must include a link to the page where you\nembedded your Notification banner component.\n\nBefore you can create a live mode Account Session, you must provide the URLs\nwhere you have integrated the embedded components into your website. Configure\nthe sending email domain and embedded component URLs in the **Site links**\nsection of [your platform’s Connect\nsettings](https://dashboard.stripe.com/settings/connect/embedded_ui).\n\n#### Note\n\nTest mode environments use the same URLs as live mode.\n\nFor embedded components integrated in your site, select **Yes** and enter the\nURL of the page that hosts the component. For any actions not handled by an\nembedded component, select **No** and enter the URL of the page on your site\nwhere the account can perform the action. After entering the URLs, test them to\nverify that they open the right pages. You can test a link by clicking\n**Validate**.\n\nYou must set URLs for the following:\n\n- Notification banner\n- Account management\n- Payments\n- Payouts\n- Balances\n- Documents (when Stripe collects Stripe fees directly from connected accounts)\n\nWhen sending an email, Stripe automatically appends the connected account ID to\nthe redirect URL as the `stripe_account_id` parameter. Use that parameter to\nidentify the account and verify that they’re authenticated. Set up the route on\nyour server to read the parameters and display the correct embedded component.\n\n## Preview and customize communications\n\nYou can customize the co-branded communications that we send to your connected\naccounts in your [communication\nsettings](https://dashboard.stripe.com/settings/connect/communication). To\ncustomize a category of emails, click **Preview and customize**.\n\n### Customize email branding\n\nYou can set your Business name, Logo, Icon, Brand color, and Accent color.\nStripe uses these values in the co-branded emails we send to your connected\naccounts.\n\n### Customize email domain\n\nBy default, emails are sent from a stripe.com address. You can [customize the\ndomain](https://docs.stripe.com/get-started/account/email-domain), but not the\nspecific address. We set the address automatically [based on the context of the\nmessage](https://support.stripe.com/questions/custom-email-domain).\n\n### Preview and test emails\n\nWhen you customize a category of co-branded Stripe emails, you can check their\nappearance and test their links in the preview on the right side of the page.\nSelect a specific email from the **Preview** dropdown list. You can also send\ntest emails to verify that they’re working correctly by clicking **Send email**.\n\n### View the history of emails sent to connected accounts\n\nYou can see the emails that Stripe has sent to your connected accounts on the\naccount details page under **Emails to this account**. To see the details of an\nemail, including its exact contents, its To: address, and its status (such as\nwhether it was delivered successfully or was opened), click it in the list.\n\n## Links\n\n- [listen for](https://docs.stripe.com/webhooks)\n- [the Disputes API](https://docs.stripe.com/api/disputes)\n- [update your Connect settings with the\nURLs](https://dashboard.stripe.com/settings/connect/site-links)\n- [your platform’s Connect\nsettings](https://dashboard.stripe.com/settings/connect/embedded_ui)\n- [communication\nsettings](https://dashboard.stripe.com/settings/connect/communication)\n- [customize the\ndomain](https://docs.stripe.com/get-started/account/email-domain)\n- [based on the context of the\nmessage](https://support.stripe.com/questions/custom-email-domain)",
  "metadata": {
    "title": "Email communications in embedded Connect integrations | Stripe Documentation",
    "description": "Customize Stripe notifications to your connected accounts in a fully embedded integration.",
    "sourceURL": "https://docs.stripe.com/connect/embedded-comms"
  }
}