{
  "content": "# Install Stripe Connector for Salesforce B2C Commerce Shopfront Reference Architecture\n\n## Learn about the Stripe Connector for Salesforce Commerce Cloud Shopfront architecture.\n\nStripe [Payment Element](https://docs.stripe.com/payments/payment-element)\nmodifies the default Commerce Cloud credit card collection and processing by\nusing Stripe.js, a JavaScript library, to securely tokenize credit card data.\nPayments are then processed using the tokenized data, instead of raw credit card\ninformation.\n\nDuring checkout, the cartridge creates a PaymentIntent for any new cards or\nalternate payment methods that a customer enters. This tokenized data generates\na Stripe Charge at the point of purchase.\n\n## Stripe.js sources\n\nWhen customers enter credit card or other payment information on the storefront,\nStripe.js tokenizes it in interactions between Stripe and the client (browser).\nUnmasked credit card data is therefore never sent to the Commerce Cloud servers.\n\n## Stripe PaymentIntent\n\nThe [PaymentIntent](https://docs.stripe.com/api/payment_intents) workflow guides\nyou through the process of collecting a payment from your customer. A\nPaymentIntent transitions through [multiple\nstatuses](https://docs.stripe.com/payments/paymentintents/lifecycle) throughout\nits lifetime as it interfaces with Stripe.js to perform authentication flows and\ncreates, at most, one successful charge.\n\nThe system creates a Stripe Charge (authorize or capture, based on Business\nManager configuration) from a successfully created and submitted Basket. All\nStripe Charges are created against a Stripe payment source.\n\n## AVS auto-fail transactions\n\nSite administrators can select a variety of AVS statuses to auto fail an order\nfor. If the Stripe charge returns any of the selected statuses for either\n`address_line1_check` or `address_zip_check`, the order is auto-failed and the\nStripe charge reversed. You can also manage these settings on the Stripe\nDashboard. Supported payment methods:\n\n- Cards (Visa, Mastercard, American Express, Discover, Diners Club, JCB,\nAlipay).\n- The Payment Request button element gives you a single integration for Apple\nPay, Google Pay, and the browser standard Payment Request API.\n\n## Limitations and constraints\n\nStripe offers a number of standard services that aren’t supported by the\ncartridge. These include support for subscriptions, plans, and coupons. There\naren’t any known locale specific restrictions in the cartridge.\n\nThe included RELAY OCAPI configurations are included as examples only. A RELAY\nimplementation requires additional configuration and testing along with the\nStripe team. For any locale specific restrictions, see the [Stripe.js\ndocumentation](https://docs.stripe.com/js).\n\n## Compatibility\n\nAvailable since Commerce Cloud Platform Release 16.8, SFRA version 4.4. The\ncartridge is available for installation on storefronts that support both\ncontroller and SFRA SiteGenesis implementations.\n\n## Privacy\n\nCommerce Cloud doesn’t store any unmasked credit card data. The cartridge\ntokenizes all payment data within direct client-to-Stripe communications and\nobscures any sensitive credit card data before it arrives on the Commerce Cloud\nservers. Similarly, all credit card data that Commerce Cloud retrieves from the\nStripe servers is either masked, tokenized, or both.\n\n## See also\n\n- [Implementation\nGuide](https://docs.stripe.com/connectors/salesforce-commerce-cloud/implementation-guide)\n- [Operations and\nMaintenance](https://docs.stripe.com/connectors/salesforce-commerce-cloud/operations-and-maintenance)\n- [User\nGuide](https://docs.stripe.com/connectors/salesforce-commerce-cloud/user-guide)\n-\n[Testing](https://docs.stripe.com/connectors/salesforce-commerce-cloud/testing)\n\n## Links\n\n- [Payment Element](https://docs.stripe.com/payments/payment-element)\n- [PaymentIntent](https://docs.stripe.com/api/payment_intents)\n- [multiple statuses](https://docs.stripe.com/payments/paymentintents/lifecycle)\n- [Stripe.js documentation](https://docs.stripe.com/js)\n- [Implementation\nGuide](https://docs.stripe.com/connectors/salesforce-commerce-cloud/implementation-guide)\n- [Operations and\nMaintenance](https://docs.stripe.com/connectors/salesforce-commerce-cloud/operations-and-maintenance)\n- [User\nGuide](https://docs.stripe.com/connectors/salesforce-commerce-cloud/user-guide)\n-\n[Testing](https://docs.stripe.com/connectors/salesforce-commerce-cloud/testing)",
  "metadata": {
    "title": "Install Stripe Connector for Salesforce B2C Commerce Shopfront Reference Architecture | Stripe Documentation",
    "description": "Learn about the Stripe Connector for Salesforce Commerce Cloud Shopfront architecture.",
    "sourceURL": "https://docs.stripe.com/connectors/salesforce-commerce-cloud/component-overview"
  }
}