{
  "content": "# Manage your usage-based billing setup\n\n## Learn how to handle billing-related tasks for your usage-based billing model.\n\nAfter you create your usage-based billing model, you can modify different parts\nof your billing setup. For example, you can update a subscription item’s price\nduring a billing cycle, backdate a subscription to include usage in the next\ninvoice, or cancel usage-based subscriptions.\n\n## Update prices mid-cycle\n\nYou can update a subscription item’s price during a billing cycle. However,\nlimitations apply when switching from one [meter\nprice](https://docs.stripe.com/api/prices/object#price_object-recurring-meter)\nto another.\n\nOn future invoices, we reflect only usage that occurs after the update. For\nexample, say you have a monthly subscription that you switch from price A to\nprice B on January 16. At the end of the month, the invoice includes usage from\nJanuary 16 to January 31 at price B. Usage from January 1 to January 16 isn’t\nbilled.\n\nAn exception exists if you use [billing\nthresholds](https://docs.stripe.com/billing/subscriptions/usage-based/alerts-and-thresholds#billing-thresholds)\nand have a threshold invoice already generated at the old price. For example,\nsay you generate a threshold invoice on January 10 using price A. That threshold\ninvoice is still charged to the customer. At the end of the month, the invoice\nincludes usage from January 16 to January 31 at price B. The earlier threshold\ninvoice doesn’t offset any usage for this end-of-month invoice.\n\nSimilar restrictions apply if you add a new subscription item with a billing\nmeter price in the middle of the subscription cycle. For example, say you add a\nnew subscription item with price C on January 16. At the end of the month, the\ninvoice includes usage from January 16 to January 31 at price C for that\nsubscription item.\n\nTo update the price for a subscription item:\n\n```\ncurl https://api.stripe.com/v1/subscription_items/{{SUBSCRIPTION_ITEM_ID}} \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d price={{NEW_PRICE_ID}}\n```\n\nTo delete a subscription item:\n\n```\ncurl -X DELETE\nhttps://api.stripe.com/v1/subscription_items/{{SUBSCRIPTION_ITEM_ID}} \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\"\n```\n\nAfter deletion, the invoice doesn’t reflect any usage from that item.\n\n## Create a backdated subscription\n\nYou can record usage for a customer even before creating a subscription for\nthem. After recording usage for a customer, use the\n[backdate_start_date](https://docs.stripe.com/api/subscriptions/create#create_subscription-backdate_start_date)\nto create a subscription before the first report. This allows you to include\nusage in the next subscription invoice.\n\n```\ncurl https://api.stripe.com/v1/subscriptions \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d customer={{CUSTOMER_ID}} \\\n -d \"items[0][price]\"={{PRICE_ID}} \\\n -d backdate_start_date=1710000000\n```\n\n## Cancel usage-based subscriptions\n\nWith usage-based billing, the bill the customer pays varies based on consumption\nduring the billing cycle. When changing the billing cycle results in a\nsubscription interval ending early, you charge the customer for the usage\naccrued during the shortened billing cycle.\n\n#### Note\n\nWe don’t support\n[proration](https://docs.stripe.com/billing/subscriptions/prorations) with\nusage-based billing.\n\nYou can’t reactivate canceled subscriptions. Instead, you can collect updated\nbilling information from your customer, update their default payment method, and\ncreate a new subscription with their existing customer record.\n\nIf you use\n[cancel_at_period_end](https://docs.stripe.com/api/subscriptions/update#update_subscription-cancel_at_period_end)\nto schedule the cancellation of a subscription, you can reactivate the\nsubscription at any time up to the end of the period. To do so, update\n`cancel_at_period_end` to `false`.\n\nFor subscriptions that cancel at period end, the final end of cycle invoice\nincludes metered usage for the last billing cycle. In this case Stripe also\ndisables the automatic collection of the end of cycle invoice and sets\n[auto_advance](https://docs.stripe.com/api/invoices/update#update_invoice-auto_advance)\nto `false`. You can resume automatic collection of the invoices manually by\nsetting `auto_advance` to `true`.\n\n## Links\n\n- [meter\nprice](https://docs.stripe.com/api/prices/object#price_object-recurring-meter)\n- [billing\nthresholds](https://docs.stripe.com/billing/subscriptions/usage-based/alerts-and-thresholds#billing-thresholds)\n-\n[backdate_start_date](https://docs.stripe.com/api/subscriptions/create#create_subscription-backdate_start_date)\n- [proration](https://docs.stripe.com/billing/subscriptions/prorations)\n-\n[cancel_at_period_end](https://docs.stripe.com/api/subscriptions/update#update_subscription-cancel_at_period_end)\n-\n[auto_advance](https://docs.stripe.com/api/invoices/update#update_invoice-auto_advance)",
  "metadata": {
    "title": "Manage your usage-based billing setup | Stripe Documentation",
    "description": "Use Stripe Billing to create your usage-based billing model and then handle related tasks, such as canceling subscriptions, making mid-cycle updates, and backdating subscriptions when you create them.",
    "sourceURL": "https://docs.stripe.com/billing/subscriptions/usage-based/manage-billing-setup"
  }
}