{
  "content": "# Best practices for using Stripe with Salesforce Billing\n\n## Learn how to set up Stripe with Salesforce billing.\n\nUse the information in this guide to learn how to import data, use payment\ncenter, test cards in payment center, and set batch size for optimal\nperformance.\n\n## Data import options\n\nYou can add payment methods using the quick action on the Payment Methods\nrelated list, which you can access from the Account record. If you need\nadditional help, refer to the Installation and Configuration guide.\n\n## Data import scenarios\n\nYou can also add Stripe customer data in other ways, such as with a data import\nusing information from Stripe or by using a custom script. If you use these\noptions, you need to make sure that you have certain values present in the\nSalesforce records.\n\nSee the following data import scenarios, and use whichever one best fits your\nuse case for importing data.\n\n## Import customers and payment methods\n\nTo import customers and payment methods, the Salesforce Admin needs to do the\nfollowing:\n\n- Import Customer records (required fields).- Account Name\n- Stripe [Customer](https://docs.stripe.com/api/customers/retrieve) ID\n- Import payment method records (required fields).- Payment Gateway record ID\n- Active checkbox set to True\n- Payment Gateway Token\n\n## Import existing customer and payment methods\n\nTo import existing customers and payment methods, the Salesforce Admin needs to\ndo the following:\n\n- Insert the Account record:- Because the Account records already exist in\nSalesforce, Account records updated with the Stripe\n[Customer](https://docs.stripe.com/api/customers/retrieve) ID. There are\nmultiple ways to match to an existing Account (such as an ID or Account Name).\n- Import payment methods required fields.- Payment Gateway record ID\n- Active checkbox set to **True**\n- Payment Gateway Token\n- Stripe [Customer](https://docs.stripe.com/api/customers/retrieve) ID\n\n## Import only payment methods\n\nTo import only payment methods, the Salesforce Admin needs to do the following:\n\n- Import the required fields for payment methods.- Payment Gateway record ID\n- Active checkbox set to **True**\n- Payment Gateway Token\n\n## Create a Payment Method from the Payment Center\n\nFrom Salesforce a user can create a payment in the payment center. The connector\ndoesn’t support creating and charging Payment Methods simultaneously from the\nPayment Center.\n\nThis problem occurs when a new payment is entered, and save this payment for\nlater use is selected.\n\n## Increase Salesforce throughput for batch payments in Salesforce Billing\n\nStripe recommends setting the Payment creation batch size in Salesforce Billing\nto the upper limit, which is currently 70.\n\n- Navigate to Salesforce Setup and search for installed packages.\n- Click **Configure** next to the Salesforce Billing package.\n- Navigate to the **Payment** tab.\n- Adjust the Payment creation batch size as needed.\n\n## Links\n\n- [Customer](https://docs.stripe.com/api/customers/retrieve)",
  "metadata": {
    "title": "Best practices for using Stripe with Salesforce Billing | Stripe Documentation",
    "description": "Learn how to set up Stripe with Salesforce billing.",
    "sourceURL": "https://docs.stripe.com/connectors/salesforce-billing/bestpractices"
  }
}