{
  "content": "# Radar analytics center\n\n## Review fraud patterns and their impact on your business in the Dashboard.\n\nThe [Radar analytics center](https://dashboard.stripe.com/radar) in the\nDashboard helps you analyze and understand the state of fraud for your business.\nStripe provides several reports with information about how much fraud\n[Radar](https://docs.stripe.com/radar) blocks for your business and the top\nfraud-related metrics for your business over time.\n\nUsing [Fraud insights](https://docs.stripe.com/radar/analytics/fraud-insights),\n[Sigma](https://stripe.com/sigma), or [Data\nPipeline](https://stripe.com/data-pipeline), you can use [Radar rule\nattributes](https://docs.stripe.com/radar/rules/reference#supported-attributes)\nalongside your own dataset to:\n\n- [Continuously improve your fraud\nmanagement](https://stripe.com/guides/improve-fraud-management-with-radar-for-fraud-teams-and-stripe-data).\n- Identify fraudulent payments.\n- Create a deeper understanding of your customers.\n- Analyze data in an environment that works best for you.\n\nWe’ve enhanced the depth and breadth of data we analyze in the new Radar\nanalytics center view, which appears by default in your **Radar Overview** tab\nof the Dashboard. To return to the legacy overview page, use the **New\noverview** toggle.\n\nRadar Analytics centerPreviewLegacy Radar overview\nThe **Overview** tab of your Radar Dashboard acts as a command center to help\nyou gauge the efficacy of your fraud prevention strategy and Radar\ninterventions. From here, you can:\n\n- View graphs detailing how fraud affects your business and how effectively\nRadar manages it.\n- Compare your fraud intervention results to other businesses like yours.\n- Track your fraud performance with network monitoring programs.\n- Learn more about fraud risk management tools and practices.\n\n## Configure your data set\n\n### Specify your time period\n\nBy default, statistics reflect the prior 30 days of transaction history,\nfollowing a 24-hour delay. To see data for a different time period:\n\n- Click the **Date** filter to open the time period editor.\n- Use the drop-down to choose a relative comparator.\n- Depending on the comparator you choose, set the parameters, such as *in the\nlast 1 months* or *between 2/26/2024 and 3/18/2024*.\n- Click **Apply**.\n\n### Choose how and which data appears\n\nClick **Configure** to customize the way data displays in the charts.\n\n- **Calculate rates by transaction volume** instead of payment count.\nTransaction volume is the cumulative amount charged for payments rather than the\nnumber of payments.\n- **Calculate fraud rates by fraud arrival date** instead of payment date. Fraud\narrival date is the timestamp when a transaction counts as fraud. This might be\nthe time the issuer flagged it or the time the card holder filed a dispute.\n- **De-duplicate multiple attempts per payment intent** so retries of the same\npayment count as a single instance.\n- **Include setup intents** to see activity from off-session payments like\nsubscriptions, invoices, and on-demand purchases.\n\n## Rate charts\n\nThe rate charts help you evaluate your fraud prevention strategy. They provide\ndetails about the level of fraudulent activity affecting your Radar-screened\ntransactions for a given time period and the portion of transactions you block.\nTogether, these snapshots give you a complete view of how well you’re managing\nfraud.\n\nEach chart includes the following elements:\n\n- The rate totals show the aggregate ratios for each metric represented in the\nchart for the entire time period.\n- The comparison icon indicates whether your rate is higher (exclamation icon)\nor lower (checkmark icon) than other Stripe businesses in your demographic. You\ncan click the icon to see details.\n- The bar chart shows the category ratios and rate at regular intervals for the\ntime period. You can hover over points in the graph to see metrics for specific\npoints in time.\n\nThe following sections describe the specific information provided for each rate\ncategory.\n\n### Fraud\n\nThe **Fraud** panel shows the aggregate ratios of transactions that resulted in\neither a fraud dispute or an early fraud warning that hasn’t escalated to a\ndispute. For each fraud indicator, you see the percentage of total transactions\nin the time period and the number of transactions or total amount charged for\ntransactions, depending on your\n[setting](https://docs.stripe.com/radar/analytics#choose-how-and-which-data-appears).\n\nThe totals section also shows your total fraud rate for the period with an icon\nindicating how your rate’s standing among comparable Stripe businesses. Hover\nover the icon to view detailed information about the fraud rates of similar\nStripe businesses and Stripe businesses within the same geographic region.\n\nThe interactive bar chart compares the ratio of fraud attributed to disputes\nversus early fraud warnings. Regularly reviewing this information can help you\nidentify and address spikes and avoid monitoring program repercussions. The\nchart also includes a line graph showing your fraud rate for the time period.\n\nEnable the **Estimate worst case fraud rate** toggle to impose a second line\ngraph showing the machine learning prediction of what fraud might be for the\nperiod, based on historical fraud arrival patterns. Cardholders can file\ndisputes 120 days or more after a payment, so the rate can fluctuate over time.\n\n#### Note\n\nIf you don’t see the **Estimate worst case fraud rate** toggle in your\nDashboard, your fraud volume is too low for Stripe to accurately model possible\nfraud or you enabled [Calculate fraud rates by fraud arrival\ndate](https://docs.stripe.com/radar/analytics#choose-how-and-which-data-appears).\n\nHover over specific points in the chart to view a modal with details for the\nspecific date. Details include the following data, if applicable for the date:\n\n- Rates of fraudulent disputes, early fraud warning payments, and possible fraud\n- Number of fraudulent dispute payments, early fraud warning payments, and\npossible fraud payments\n- Total amount charged in fraudulent dispute payments, early fraud warning\npayments, and possible fraud payments\n\n### Disputes\n\nThe **Disputes** panel shows the aggregate percentages of disputes due to fraud\ncompared with all other [types of\ndisputes](https://docs.stripe.com/disputes/categories) for the time period. It\nalso gives the dispute rate for the time period, calculated as the number of\ndisputed payments of any type divided by successful payments during the same\nperiod. The icon indicates your rate’s standing among comparable Stripe\nbusinesses. Hover over the icon to view detailed information about the dispute\nrates of similar Stripe businesses and Stripe businesses within the same\ngeographic region.\n\nThe interactive bar chart compares the ratio of disputes due to fraud to\ndisputes of any other type, such as “product not received.” Disputes for reasons\nother than fraud don’t count against your fraud rate. The chart also includes a\nline graph showing your dispute rate for the time period.\n\nHover over specific points in the chart to view a modal with details for the\nspecific date. Details include the following data, if applicable for the date:\n\n- Rates of fraudulent disputes, other disputes, and total disputes\n- Number of fraudulent disputes, other disputes, and total disputes\n- Total amount charged in fraudulent dispute payments, other dispute payments,\nand total disputed payments\n\n### Blocks\n\nThe **Blocks** panel shows the aggregate percentages of payments that Radar\nblocked due to a [high risk\nscore](https://docs.stripe.com/radar/rules#machine-learning-risk-checks)\ncompared to payments blocked by a custom rule. It also gives the block rate for\nthe time period, calculated as the total number of blocked payments divided by\nsuccessful payments during the same period. The icon indicates your rate’s\nstanding among comparable Stripe businesses. Hover over the icon to view\ndetailed information about the block rates of similar Stripe businesses and\nStripe businesses within the same geographic region.\n\nThe interactive bar chart compares the ratio of high risk blocks to rule blocks.\nThe chart also includes a line graph showing your block rate for the time\nperiod.\n\nHover over specific points in the chart to view a modal with details for the\nspecific date. Details include the following data, if applicable for the date:\n\n- Rates of high risk blocks, rule blocks, and total blocks\n- Number of high risk blocks, rule blocks, and total blocks\n- Total amount for high risk blocks, rule blocks, and total blocks\n\n## Rule matches\n\nThe **Rule matches** section gives you insight into how your rules are\nperforming. It shows which rules Radar acted on for all screened transactions\nduring the time period. The top of the panel shows the total number of\ntransactions processed during the time period and summary information for each\nrule action type:\n\n- Percentage of transactions where a rule match resulted in the prescribed\naction.\n- Total number of transactions where a rule match resulted in the prescribed\naction.\n\nYou can click any of the rule action type summary cards to view details about\nthe rule matches within that type.\n\n### Transactions\n\nThe **Transactions** detail shows a ratio graph of actions taken for all\ntransactions processed during the time period. For each action type, you see the\naggregate amount charged for all transactions where a rule match triggered the\nspecified action. Click an action type to view its details page.\n\nBelow the totals, an interactive line graph shows the transactions for each rule\naction type in a timeline for the period. Click the graph to view a modal with\nthe following statistics for each action type on that date:\n\n- **Rate** is the percentage of total transactions on that date where a rule\nmatch resulted in the prescribed action.\n- **Count** is the total number of transactions on that date where a rule match\nresulted in the prescribed action.\n- **Volume** is the total amount charged for transactions on that date where a\nrule match resulted in the prescribed action.\n\n### Blocked\n\nThe **Blocked** detail shows a ratio graph depicting the most matched block\nrules for the time period. You also see the number of, and total amount charged\nfor, transactions that each of the most matched rules blocked.\n\nBelow the totals for the time period, you can review the bar graph showing the\nratio of blocked payments for each of the most matched rules on each interval of\nthe time period.\n\n### 3DS\n\nThe **3DS** detail shows a ratio graph depicting the outcomes for transactions\nin the time period where a 3DS rule triggered 3DS authentication requests. You\nalso see the total amount charged for 3DS requests that succeeded and failed.\n\nBelow the totals for the time period, you can review the bar graph showing the\nratio of 3DS authentication outcomes for each interval of the time period.\n\n### Allow\n\nThe **Allow** detail shows a ratio graph depicting the outcomes of payments\noccurring during the time period for transactions that matched an allow rule.\nYou also see the total amount charged for allowed transactions in each outcome\ncategory:\n\n- **Legitimate**: Allowed transactions where no further action occurred.\n- **Disputes and Early fraud warnings**: Allowed transactions disputed for fraud\nor issued early fraud warning.\n- **Refunded** Allowed transactions that were refunded.\n\nBelow the totals for the time period, you can review the bar graph showing the\nratio of allowed payment outcomes for each interval of the time period.\n\n### Review\n\nThe **Review** detail allows you to monitor how well your manual review rules\nforeshadow a need for more decisive action. It might also act as a reminder to\ntake action on unreviewed transactions. The ratio graph compares the status of\ntransactions that triggered a manual review during the time period. You also see\nthe total amount charged for review transactions in each status category:\n\n- **Currently in review**: No review action taken.\n- **Approved**: Transactions reviewed and determined legitimate.\n- **Rejected**: Transactions reviewed and either refunded or canceled.\n- **Failed**: Transactions matched for review, but declined.\n- **Disputed**: Transactions matched for review, then ultimately disputed.\nTransactions previously counted as either still in review or approved only count\nas disputed after the cardholder files a dispute.\n\nClick any row in the table to open the **Rules** tab of the Dashboard, showing\nthe **Rule performance** metrics.\n\nBelow the totals for the time period, you can review the bar graph showing the\nratio of allowed payment outcomes for each interval in the time period.\n\n## Card monitoring programs\n\nCard networks track your fraud and dispute rates as part of their risk\nevaluation process. If your rates exceed their defined thresholds, they can\nplace your business in a monitoring program that assesses fines and fees until\nyou maintain fraud and disputes at acceptable levels.\n\nRadar analytics monitors your fraud and dispute rates against the thresholds for\nthe card monitoring programs and provides your current status. Click a program\ncard to see details about the program, including the penalties associated with\nrates in excess of the threshold.\n\n## Links\n\n- [Radar analytics center](https://dashboard.stripe.com/radar)\n- [Radar](https://docs.stripe.com/radar)\n- [Fraud insights](https://docs.stripe.com/radar/analytics/fraud-insights)\n- [Sigma](https://stripe.com/sigma)\n- [Data Pipeline](https://stripe.com/data-pipeline)\n- [Radar rule\nattributes](https://docs.stripe.com/radar/rules/reference#supported-attributes)\n- [Continuously improve your fraud\nmanagement](https://stripe.com/guides/improve-fraud-management-with-radar-for-fraud-teams-and-stripe-data)\n- [types of disputes](https://docs.stripe.com/disputes/categories)\n- [high risk\nscore](https://docs.stripe.com/radar/rules#machine-learning-risk-checks)",
  "metadata": {
    "title": "Radar analytics center | Stripe Documentation",
    "description": "Review fraud patterns and their impact on your business in the Dashboard.",
    "sourceURL": "https://docs.stripe.com/radar/analytics"
  }
}