{
  "content": "# Error handling\n\n## Learn how to handle errors when syncing Salesforce records using the connector.\n\nIf you encounter errors when using the Stripe Billing Connector for Salesforce\nCPQ to sync records from Salesforce to Stripe, use the following list to\nidentify and resolve the errors. In most cases, you must modify the Salesforce\nrecord data, then manually sync the record to recover from the error.\n\n## Data errors\n\nThe table below contains the errors you might encounter when syncing Salesforce\norders and how to resolve them.\n\nErrorDescriptionRecommendationUnsupported field value for `days_until_due`.The\nmapped field value for `days_until_due` must be an integer or supported `CPQ\nPayment Term` value.Update the mapped field value for `days_until_due` with an\ninteger or a supported `CPQ Payment Term` value (for example, Net-15, Net-30,\nNet-45, Net-60, or Net-90).Required mappings were empty for the Stripe\nobject.The connector requires specific fields on the order and order\nitems.Navigate to the Stripe Billing app in Salesforce and open the data mapper.\nMake sure that you set all required fields under `Subscription Schedule`,\n`Subscription Item`, and `Price Order Item`.The order line was deleted or not\nactivated.The order item’s fields indicate that it was deleted or not\nactivated.Verify that all order items are activated and not deleted.The\nconnector attempted to sync the amendment order when the initial order was\nskipped, because it didn’t match custom sync filters.You can specify custom\norder filters in the Stripe Billing app in Salesforce. These filters determine\nwhether or not to sync the Salesforce order.You can’t sync amendment Salesforce\norders before syncing the corresponding initial Salesforce order. This error\nindicates that the initial Salesforce order failed to sync because it didn’t\npass the order filter criteria, even though the amendment Salesforce order\npassed.\n## Amendment errors\n\nThe table below contains the errors related to amendment orders and how to\nresolve them.\n\nErrorDescriptionRecommendationOrder amendments must co-terminate with the\ninitial order.The Salesforce amendment order must end on the same date as the\ninitial Salesforce order.Update the Salesforce order amendment so that the end\ndate co-terminates with the initial order. This likely occurs when you update\nthe subscription term.The Stripe subscription for the evergreen order has\nalready been canceled and can’t be modified.The connector synced an evergreen\nSalesforce amendment order that’s attempting to amend a canceled Stripe\nsubscription.The Salesforce amendment order can’t be synced.The Stripe\nsubscription schedule has already been canceled and can’t be modified.The\nconnector synced a Salesforce amendment order that’s attempting to amend a\ncanceled Stripe subscription schedule.The Salesforce amendment order can’t be\nsynced.Amendment orders must start on the same day of the month as the initial\norder. Enable the feature for non-anniversary amendments to sync amendments on\nany day of the month.The Salesforce amendment order starts on a different day of\nthe month than the initial order.Update the Salesforce amendment order to start\non the same day of the month as the initial Salesforce order, or contact support\nto enable non-anniversary amendments in your account.The amendment order\nsubscription term doesn’t equal a number of whole months between the start and\nend date.This occurs when a non-anniversary amendment is synced and the\nsubscription term for the quote is unexpected.Update the subscription term for\nthe Salesforce amendment order to be a number of whole months between the start\nand end date of the Salesforce order.Unable to find the corresponding Stripe\nsubscription schedule for the amendment order.An amendment Salesforce order\nmodifies an initial Salesforce order that previously synced. This error\nindicates that the corresponding Stripe subscription schedule created during the\ninitial Salesforce order sync can’t be found because it was deleted.The\nSalesforce amendment order can’t be synced.The backend prorated order amendment\ncase isn’t supported.A Salesforce amendment order modifies an initial order that\nwas backend prorated, but the start dates don’t align.The connector doesn’t\nsupport this use case. Contact [support](https://support.stripe.com/) for next\nsteps.The amendment order represents all one-time invoices.The amendment order\nmust amend the initial order.To sync an order with one-time invoice items, you\nmust create and sync a new order with the one-time invoice items.More than one\ncontract was found for the amendment order.The connector detected multiple\ncontracts associated with the amendment order.Make sure the amendment order has\nonly one contract associated with it.More than one quote was found for the\namendment order.The connector detected multiple quotes associated with the\namendment order.Ensure there is only one quote tied to the amendment order.The\norder amendment isn’t associated with a quote.The connector couldn’t find a\ncorresponding quote associated with the amendment order.Make sure each amendment\norder has a related quote.\n## Quote errors\n\nThe table below contains the errors related to CPQ quotes and how to resolve\nthem.\n\nErrorDescriptionRecommendationThere’s no CPQ quote associated with the\nSalesforce order. Orders pushed to Stripe must have a related CPQ quote.All\nSalesforce orders need a corresponding CPQ quote. This error indicates that the\nconnector couldn’t find a corresponding quote.Regenerate the Salesforce order\nfrom a Salesforce CPQ quote.Unable to find the initial Salesforce CPQ quote\nassociated with the order amendment.All Salesforce orders that the connector\nsyncs need an associated Salesforce CPQ quote.Regenerate the Salesforce order\nfrom a Salesforce CPQ quote.You can’t specify the subscription term as a decimal\nvalue.The subscription term represents the contract duration in number of\nmonths. This value can’t be a decimal.Update the mapped subscription term with a\nwhole number.Billing frequency isn’t a supported `CPQ Billing Frequency`\noption.CPQ supports Monthly, Quarterly, Semiannual, and Annual as values for the\n`SBQQ__BillingFrequency__c` field.Update the `CPQ Billing Frequency` field value\nto `Monthly`, `Quarterly`, `Semiannual`, or `Annual`.\n## Price errors\n\nThe table below contains the errors related to prices and how to resolve them.\n\nErrorDescriptionRecommendationFound a corresponding Stripe price for the\nSalesforce price, but the price data has changed.The Salesforce pricebook entry\nthat’s linked to the order item previously synced, and the corresponding Stripe\nprice data has changed.Clear the Stripe ID from the Salesforce pricebook entry\nand sync the Salesforce order again. This results in a newly created Stripe\nprice for the pricebook entry.More than one consumption schedule is linked to a\npricebook, but there can only be one.The connector found more than one\nconsumption schedule linked to a pricebook, when there can only be one.Delete\none of the consumption schedules attached to the pricebook entry.The\nsubscription term can’t be a decimal value.The subscription term represents the\ncontract duration in number of months. This value can’t be a decimal.Update the\nmapped subscription term to a whole number.A decimal value was provided for the\nupper tier bound, but consumption rate tier bounds must be integers.The\nconnector found a decimal value for the upper tier bound of the Salesforce\nconsumption rate.Update the tier bound for the Salesforce consumption rate to an\ninteger.The pricing method on the consumption rate isn’t supported.The\n`SBQQ__PricingMethod__c` field accepts a value of `PerUnit` or `FlatFee`.Update\nthe `SBQQ__PricingMethod__c` field value to either `PerUnit` or `FlatFee`.The\nconsumption schedule type isn’t supported.The `Consumption Schedule Type` field\naccepts a value of `Range` or `Slab`.Update the `Consumption Schedule Type` to\neither `Range` or `Slab`.The `unit_amount_decimal` field can’t be empty for\nStripe price objects.The connector found an empty value for the mapped\nSalesforce value, and prices can’t be empty.Update the mapped Salesforce value\nto a positive integer.Unexpected `billing_scheme` value on Stripe price.The\nbilling scheme isn’t set to a valid value.Update the billing scheme to either\n`per_unit` or `tiered`.The pricing interval isn’t supported.The pricing interval\nisn’t set to a valid value.Update the pricing interval to either `Month` or\n`Year`.The retrieved Stripe price was empty.The corresponding Stripe price must\nhave a value.Remove the Stripe price ID from the corresponding Salesforce\nrecord, and then retry syncing the failed order.Two tiers were found with an\ninfinite boundary on the same price.The connector found two Salesforce\n`ConsumptionRate` objects associated with a single `ConsumptionSchedule`, both\nwith their upper bounds set to infinity.Update one of the `ConsumptionRate`\nrecords to have a finite upper bound, breaking the infinite boundary\ncondition.The default currency isn’t specified on your account configuration.The\nconnector couldn’t find a default currency.Set the default currency for your\norganization in Salesforce, and make sure the connector’s setting for `Billing\nCurrency` shows the correct currency.\n## Product errors\n\nThe table below contains the errors related to Salesforce products and how to\nresolve them.\n\nErrorDescriptionRecommendationProduct billing type isn’t a supported `CPQ\nProduct Billing Type` option.The product billing type (`SBQQ__BillingType__c`)\naccepts a value of `Advance` or `Arrears`.Update the product’s\n`SBQQ__BillingType__c` field to either `Advance` or `Arrears`.Adding Salesforce\nproducts with a renewable type to evergreen orders isn’t supported.Salesforce\nCPQ products accept a value of Renewable or Evergreen.The connector doesn’t\nsupport both product types in a single Salesforce order. To sync the Salesforce\norder, you must remove one of the order items.\n## Termination errors\n\nThe table below contains the errors related to termination orders and how to\nresolve them.\n\nErrorDescriptionRecommendationA termination order is processing, but more\namendments are queued.The connector is processing a termination order that\ncancels the subscription schedule, but there are more amendment orders to\nprocess.To terminate a Salesforce order, you must delete or deactivate any\namendment orders that are activated after the termination order. To amend a\nSalesforce order before terminating it, you must delete or deactivate the\ntermination Salesforce order so the amendment order is processed, then sync the\ntermination Salesforce order.Termination quantity is greater than the aggregate\nquantity for the order item.You’re attempting to reduce an order item’s quantity\nby more than the existing quantity, resulting in a negative quantity.Update the\norder item quantity to 0 or more.\n## Stripe errors\n\nThe table below contains common Stripe errors and how to resolve them. The\nconnector displays all Stripe errors that occur directly to the user.\n\nErrorDescriptionRecommendationThe request rate limit was exceeded.Learn more\nabout [rate limits](https://docs.stripe.com/rate-limits).The connector\nautomatically retries syncing the order at a later time. You can also use the\nManual Sync function to force a manual sync of the failed order.\n## Connector errors\n\nThe table below contains common connector errors. If you encounter any of these\nissues, [contact Stripe support](https://support.stripe.com/) to investigate\nfurther.\n\nErrorDescriptionRecommendationThe number of Quote or Quote Line Associations\ndiffers from the Order or Item coupons.The connector failed to automatically\ngenerate an Order coupon for a Quote or Quote Line coupon.Contact Stripe support\nto resolve this issue and generate the coupons before syncing.The calculated\nprice multiplier differs from the CPQ price multiplier.The Order failed to sync\nbecause the connector calculated a different price multiplier than CPQ.Confirm\nthat your Salesforce CPQ Proration Precision matches the settings in your\nSalesforce CPQ app. If they don’t match, update them to match. If the settings\nmatch, contact Stripe support to resolve this issue and investigate further.More\nthan one backend proration phase found.While syncing the Order, the connector\ndiscovered the subscription schedule in an unexpected state that it didn’t know\nhow to handle.Contact Stripe support to resolve this issue and investigate\nfurther.\n## See also\n\n- [Field defaults and custom\nmappings](https://docs.stripe.com/connectors/salesforce-cpq/field-mappings)\n- [Products and\nprices](https://docs.stripe.com/connectors/salesforce-cpq/products-prices)\n- [Order\namendments](https://docs.stripe.com/connectors/salesforce-cpq/subscription-order-amendments)\n- [Subscription\norders](https://docs.stripe.com/connectors/salesforce-cpq/subscriptions)\n\n## Links\n\n- [support](https://support.stripe.com/)\n- [rate limits](https://docs.stripe.com/rate-limits)\n- [Field defaults and custom\nmappings](https://docs.stripe.com/connectors/salesforce-cpq/field-mappings)\n- [Products and\nprices](https://docs.stripe.com/connectors/salesforce-cpq/products-prices)\n- [Order\namendments](https://docs.stripe.com/connectors/salesforce-cpq/subscription-order-amendments)\n- [Subscription\norders](https://docs.stripe.com/connectors/salesforce-cpq/subscriptions)",
  "metadata": {
    "title": "Error handling | Stripe Documentation",
    "description": "Learn how to handle and recover from any errors you receive when syncing Salesforce records using the Stripe Billing Connector for Salesforce CPQ.",
    "sourceURL": "https://docs.stripe.com/connectors/salesforce-cpq/error-handling"
  }
}