{
  "content": "# SaaS platform payments with subscription billing using Accounts v2Private preview\n\n## Learn how a SaaS platform charges its connected accounts with Stripe Billing using Accounts v2.\n\nSaaS (Software as a Service) platforms using\n[Connect](https://docs.stripe.com/connect) often charge subscription fees for\nproviding their platform services. Accounts v1 requires platforms to maintain\nseparate Stripe objects to enable a single business to both pay for a\nsubscription (as a `Customer`) and operate on the platform (as an `Account`).\nAccounts v2 allows you to manage all your interactions with your connected\naccounts through a single, multi-configuration object.\n\n## Interested in getting early access to Accounts v2?\n\nAccounts v2 is currently limited to preview users. If you’re interested in\ntrying it out, enter your email address below.\n\nCollect EmailSubmitRead our [privacy policy](https://stripe.com/privacy).\n## Using Connect and Billing in API v1 with Accounts and Customers\n\nIn API v1, `Account` objects support only Connect features. To charge a\nconnected account using a subscription, a platform must create a `Customer`\nobject representing the same connected account. Accounts v1 and Customers v1\nhave no explicit relationship, so the platform must manage those objects\nseparately and maintain a map of `Account` IDs to `Customer` IDs.\n\n#### SaaS platform relationships with Accounts and Customers in API v1\n\nPlatformConnected accountCustomerCreate paymentsBill by subscriptionRelationship\nof a SaaS platform with pairs of Accounts and Customers in API v1\n## Using Connect and Billing in API v2 with Accounts\n\nWith Accounts v2, a connected account that collects payments and pays you a\nsubscription fee doesn’t require both an `Account` object and a `Customer`\nobject. Instead, you represent it by assigning the applicable configurations to\nthe `Account`.\n\nTo enable a connected account to collect payments from customers, assign the\nMerchant configuration to the corresponding `Account`.\n\n#### Platform and Account with Merchant configuration\n\nPlatform\nAccount (Merchant)\n\nShopper\n\nPayment\n\nDirect paymentApplication feesPayment less feesAn Accounts v2 platform\nintegration with accounts that have the Merchant configuration\nTo enable the platform to collect payments, including subscription payments,\nfrom the connected account, add the Customer configuration to the `Account`.\n\n#### Platform and Account with Merchant and Customer configurations\n\nPlatform\nAccount (Merchant + Customer)\n\nShopper\n\nPayment\n\nSubscription\n\nDirect paymentApplication feesPayment less feesPaymentPaymentAn Accounts v2\nplatform integration with accounts that have the Merchant and Customer\nconfigurations\n#### Note\n\nYou can collect application fees from an `Account` with the Merchant\nconfiguration. Assigning the Customer configuration to it doesn’t affect that\nability.\n\n## The Accounts API v2\n\nIn API v2, `Account` objects can have multiple configurations. Each\nconfiguration represents a different type of business relationship and enables\ndifferent Stripe products. By assigning multiple configurations to an `Account`,\na SaaS platform can enable both Connect and Billing for it without also having\nto create a `Customer`.\n\nThe Accounts API v2 provides:\n\n- **Unified representation:** A single `Account` object can represent multiple\nrelationships between connected accounts and your platform.\n- **Flexible configurations:** Enable or change Stripe products and features by\nchanging the configurations assigned to an `Account`.\n- **Centralized identity data:** The `Account` object stores all of a connected\naccount’s identity data. When you add a configuration to an existing `Account`,\nyou don’t have to collect requirements that they already provided.\n\n## Private preview considerations\n\nThe [private preview release](https://docs.stripe.com/release-phases) of\nAccounts v2 has some limitations. Consider the following:\n\n- **Stripe products:** The preview integration uses Billing to collect\nsubscription fees and Connect to enable embedded payments.\n- **Dashboard access and account types:** Your connected accounts can’t use the\nfull or Express Stripe Dashboard. Build a custom interface or use [Connect\nembedded\ncomponents](https://docs.stripe.com/connect/get-started-connect-embedded-components).\n- **Payment methods:** `Accounts` with the Merchant configuration can accept\nonly card payments. They can’t accept wallet payments or Link payments,\nregardless of the Link integration.\n- **Charge types:** The preview integration supports only [direct\ncharges](https://docs.stripe.com/connect/direct-charges) and [destination\ncharges](https://docs.stripe.com/connect/destination-charges) with the\n`on_behalf_of` parameter. You can’t use destination charges without\n`on_behalf_of` or separate charges and transfers.\n\n## Links\n\n- [Connect](https://docs.stripe.com/connect)\n- [privacy policy](https://stripe.com/privacy)\n- [private preview release](https://docs.stripe.com/release-phases)\n- [Connect embedded\ncomponents](https://docs.stripe.com/connect/get-started-connect-embedded-components)\n- [direct charges](https://docs.stripe.com/connect/direct-charges)\n- [destination charges](https://docs.stripe.com/connect/destination-charges)",
  "metadata": {
    "title": "SaaS platform payments with subscription billing using Accounts v2 | Stripe Documentation",
    "description": "Learn how a SaaS platform charges its connected accounts with Stripe Billing using Accounts v2.",
    "sourceURL": "https://docs.stripe.com/connect/accounts-v2/saas-platform-payments-billing"
  }
}