{
  "content": "# Business bank accounts\n\n## Apply to open a business bank account with our partners.\n\nImmediately after incorporation or upon receiving your EIN, Stripe Atlas\nfounders can apply to open a business bank account with our partners. Find\nbanking options in your [Atlas Dashboard](https://dashboard.stripe.com/atlas) or\nour [support\narticle](https://support.stripe.com/questions/stripe-atlas-perks-partners). Note\nthat our partners determine account eligibility and might not support all Atlas\nbusinesses. You can also apply to any bank of your choice.\n\nAs of October 2024, our partners include Mercury, Brex, and Novo.\n\n## Mercury\n\n- Great for all startups, regardless of whether you plan to raise capital.\n- Available immediately after incorporation before you receive your EIN.\n- When you initiate your Mercury account application from the Atlas dashboard,\nwe pre-fill your application with your personal information, company\ninformation, and incorporation paperwork from your Atlas application.\n- Requires two addresses:- A legal address, which can be your company’s\nregistered agent address.\n- A physical address, which can be a US or non-US residential address.\n\n## Brex\n\n- Great for startups planning to raise capital.\n- Available immediately after incorporation before you receive your EIN.\n- Requires non-US founders to submit a US billing address, which can be a\nvirtual mailing address.\n\n## Novo\n\n- Great for small businesses and solo entrepreneurs with US founders.\n- Available after you receive your EIN.\n- Requires one or more founders to submit a US Social Security Number (SSN) and\na US physical address.\n\n## Links\n\n- [Atlas Dashboard](https://dashboard.stripe.com/atlas)\n- [support\narticle](https://support.stripe.com/questions/stripe-atlas-perks-partners)",
  "metadata": {
    "title": "Business bank accounts | Stripe Documentation",
    "description": "Apply to open a business bank account with our partners.",
    "sourceURL": "https://docs.stripe.com/atlas/payments-business-bank"
  }
}