{
  "content": "# Smart DisputesPublic preview\n\n## Put your disputes on auto-pilot.\n\nRequest an invite\nFighting disputes can be an expensive and time-consuming process, Smart Disputes\nallows you to automate the evidence collection and submission process for\neligible disputes on card transactions.\n\n[Request\ninvite](https://docs.stripe.com/disputes/smart-disputes#request-an-invite)\n\n!\n\n## Automate dispute management\n\nManaging disputes is time-consuming, and it’s often difficult to know what\nevidence to submit. Smart Disputes can help recover revenue and save time when\nfighting disputes by automating evidence collection, compilation, and\nsubmission.\n\n![Help save\ntime.](https://b.stripecdn.com/docs-statics-srv/assets/save-time.f510099858fb56db1483080a8a0324df.png)\n\n![Help recover\nrevenue.](https://b.stripecdn.com/docs-statics-srv/assets/recover-revenue.af6bf2a5c9b0e7d2926d051d186c0c8d.png)\n\n![No integration\nrequired.](https://b.stripecdn.com/docs-statics-srv/assets/no-integration.26a884bdb47ec61f137f824b51f4e165.png)\n\n**Help save time**\n\nSmart Disputes auto-assembles evidence packets for eligible disputes as soon as\nyou receive a dispute and submits them prior to the dispute deadline so you\ndon’t have to spend time fighting them.\n\n**Help recover revenue**\n\nBy harnessing AI and insights from Stripe’s network, the evidence packets are\ntailored to help you recover disputed revenue.\n\n**No integration required**\n\nSmart Disputes is built into Stripe, so there’s no extra integration work if you\nalready use Stripe.\n\n## How it works\n\nSmart Disputes uses an AI-powered rules engine to analyze incoming disputes. It\nextracts relevant evidence from Stripe’s extensive internal data, your\ntransaction data, and cardholder data. The system tailors this evidence to the\ndispute reason to help you win. Smart Disputes eligibility is determined by\nmultiple factors, including the dispute reason code, payment method, evidence\navailability, evidence relevance, and cost.\n\nWhen you receive a Smart Disputes eligible dispute, Stripe notifies you by email\nand in the Dashboard. If you don’t take any action, Smart Disputes automatically\nsubmits the pre-filled evidence packet just before the dispute times out. This\nensures you don’t miss any deadlines. If you don’t want to use Smart Disputes,\nyou can respond to the dispute by countering manually, or accepting the dispute\nbefore the deadline.\n\n#### Note\n\nYou can also turn off auto-submit in your [Dashboard\nsettings](https://dashboard.stripe.com/settings/disputes).\n\n![Dispute\nlifecycle.](https://b.stripecdn.com/docs-statics-srv/assets/dispute-flow.a082c69dafa1503c33d5f7bc7c92cdf4.png)\n\nEach evidence packet is based on data available to Stripe at the time the packet\nis generated and you are responsible for ensuring that the data shared with\nStripe is accurate and complete. Disputes countered with Smart disputes are not\nguaranteed to be resolved in your favor as the final decision lies with the\nissuer but you will only be billed a Smart Disputes fee on disputes that are won\nwith Smart Disputes. You will incur no Smart Dispute fee on lost disputes.\n\n[See pricing details here](https://stripe.com/pricing).\n\nSmart Disputes is designed to assist you, but it’s not a replacement for\nprofessional advice on handling disputes. We encourage you to take a look at\neach situation individually to determine how to respond to the dispute.\n\n## Request an invite\n\n## Interested in using Smart Disputes?\n\nTo request an invite, provide your email address.\n\nCollect EmailRequest InviteRead our [privacy\npolicy](https://stripe.com/privacy).\n\n## Links\n\n- [Dashboard settings](https://dashboard.stripe.com/settings/disputes)\n- [See pricing details here](https://stripe.com/pricing)\n- [privacy policy](https://stripe.com/privacy)",
  "metadata": {
    "title": "Smart Disputes | Stripe Documentation",
    "description": "Put your disputes on auto-pilot.",
    "sourceURL": "https://docs.stripe.com/disputes/smart-disputes"
  }
}