{
  "content": "# Stripe prices and coupons in NetSuite\n\n## Use the connector to represent Stripe prices and coupons in NetSuite.\n\nThe Stripe Connector for NetSuite syncs the Stripe\n[products](https://docs.stripe.com/products-prices/how-products-and-prices-work),\n[prices](https://docs.stripe.com/products-prices/how-products-and-prices-work),\nand [coupons](https://docs.stripe.com/billing/subscriptions/coupons) that you\ncreate into the following NetSuite items:\n\n- **Price**: Associated or grouped within a product\n- **Coupons**: Used to provide discounts (such as percentage or flat amount) on\nan invoice\n- **One-time items**: Used for miscellaneous billing charges\n\nUse NetSuite to manage the item configuration, such as account, deferred\nrevenue, reporting, revenue recognition options, and so on.\n\n## How NetSuite represents products and prices\n\nProducts in Stripe are like records that organize groups of price levels. Each\nprice has a corresponding item in NetSuite, while a product (or group of prices)\nisn’t represented in NetSuite.\n\nThe connector can represent Stripe prices in NetSuite in three ways:\n\n- **Every price in Stripe creates a unique NetSuite item.** This method provides\ndetailed reporting and control over revenue recognition and revenue accounts for\neach Stripe price. Because this method adds more entries to your item master,\nit’s a good fit for businesses with a moderate number of items (less than 100)\ncreated each day. If you receive a very high volume of entries (hundreds per\nday), this can impact the connector’s ability to sync other monetary\ntransactions.\n- **All prices use a single global NetSuite item.** This method posts every\nprice in Stripe to a single revenue account in NetSuite. This method keeps your\nitem master simple. With this method, you can’t customize revenue recognition\nacross different prices.\n\n#### Note\n\nTo use this method, ask your implementation partner to enable the **Enable\nglobal item workflow** feature in your Stripe app settings. Consult with your\nimplementation partner to understand all accounting and technical implications.\n- **Customize Stripe prices to use specific items in NetSuite.** To set specific\nprices to NetSuite items, you can either use the connector’s product to item\nmatching system or add metadata to the price programmatically. If you receive a\nvery high volume of entries (hundreds per day), this can impact the connector’s\nability to sync transactions.\n\n### Product to item matching system\n\nWhen you use the connector, the product to item matching system works as\nfollows:\n\n- The product to item matching system compares the fields you specify on a\nStripe price and a NetSuite item to identify matching values. Whitespace and\ncapitalization don’t affect the matching process.\n- If the system finds multiple matches, the connector chooses the first match\nfound.\n- If the system doesn’t find a match, the connector does one of the following,\ndepending on your settings:\n\n- Creates a new, unique item in NetSuite for the Stripe price (default)\n- Uses a generic Stripe item\n\nThe system can only link certain item types and must match on the full data\ncontained in each field. It can’t match partial data or strings that contain the\ndata. For example, the connector can’t match a NetSuite field that contains an\nID of `12345` with Stripe metadata that contains `Item ID 12345` because the\nNetSuite field is missing `Item ID`.\n\n#### Note\n\nUsing the price matching setting overrides the method of adding the\n`netsuite_service_sale_item_id` [metadata\nkey](https://docs.stripe.com/connectors/netsuite/custom-payment-application#metadata-keys)\nto the price object.\n\n### Add metadata to the Stripe price\n\nYou can programmatically [add\nmetadata](https://docs.stripe.com/connectors/netsuite/custom-payment-application#stripe-metadata)\nto the price object to specify which NetSuite item the connector can use on the\ninvoice in NetSuite.\n\nWhen creating an invoice item using the API, you can create a one-time price\nthat’s used for a single invoice and then automatically archived. Pass the\n[price_data](https://docs.stripe.com/api/invoiceitems/create#create_invoiceitem-price_data)\nand include a product ID. The system uses product-to-item matching for one-time\nprices; you can’t use metadata to specify which item to use in NetSuite.\n\n#### Note\n\nAsk your implementation partner about item mapping, which allows you to map\nexisting Stripe prices to NetSuite items.\n\n## How NetSuite represents coupons\n\n[Coupons](https://docs.stripe.com/billing/subscriptions/coupons) in Stripe are\nrepresented as non-posting discount items that are applied to items in NetSuite.\nThe connector supports multiple discounts on the invoice level and invoice line\nitem level.\n\nThe connector can represent Stripe coupons in NetSuite in three ways:\n\n- **Every coupon creates a unique NetSuite discount item.** This method provides\ndetailed reporting for each Stripe coupon, but adds more entries to your item\nmaster.\n- **All coupons use a single global NetSuite item.** This method posts every\ncoupon in Stripe to a single item in NetSuite. This method keeps your item\nmaster simple.\n\n#### Note\n\nTo use this method, ask your implementation partner to enable the **Enable\nglobal discount workflow** feature in your Stripe app settings. Consult with\nyour implementation partner to understand all accounting and technical\nimplications.\n- **Customize Stripe coupons to use specific discount items in NetSuite.** You\ncan have specific coupons use specific discount items by programmatically adding\nmetadata to the coupon before it’s used. If there’s no metadata present for a\nused coupon, the connector does one of the following, depending on your\nsettings:\n\n- Creates a new, unique coupon (default)\n- Uses a global discount item\n\n### Use coupons with revenue recognition\n\nCoupons don’t have a revenue period. For revenue recognition, coupons are\ncreated as non-posting discounts, by default. This means the discount amount is\nsubtracted from the total revenue recognized for the item it’s applied to.\n\n#### Note\n\nTo use this setting, ask your implementation partner to set the field mapping\n**Field defaults** in your Stripe app settings with the following JSON:\n`\"discount_item\": { \"non_posting\": true }`.\n\n### Post discounts\n\nYou can create discounts as posting items. If your business later requires\nrevenue recognition, you must modify the connector to make discounts\nnon-posting. Coupons that are created as posting discounts can cause problems\nwith revenue recognition calculation.\n\n### Stripe coupons and NetSuite discounts\n\nThere are some notable differences between Stripe coupons and NetSuite\ndiscounts:\n\n- Because the NetSuite discount model differs from Stripe, a coupon line is\nreflected in NetSuite as its own line.\n- While each discount is its own line in NetSuite, in Stripe you can apply\nmultiple discounts to a single line item.\n- A single line item in Stripe can result in multiple NetSuite line items.\n- You can’t add a discount directly to a credit note line item in Stripe. The\ndiscount can only be inherited from the parent invoice.\n\n## Change the default account for a NetSuite item\n\nWhen creating an item in NetSuite, the connector uses a default income account.\nYou can modify the income account for the NetSuite item at any time in the\n**Account mapping** > **Income** section of your Stripe app settings. Changes to\nthe NetSuite item’s configurations won’t affect the connector’s link between the\nprice and the item.\n\nFor example, the connector creates an item that posts to the wrong incoming\naccount. You can modify the item in NetSuite to change the income or deferred\nrevenue account.\n\nYou can’t modify the income account for an item if it contains a transaction\nfrom a closed accounting period. You also can’t modify a discount item after\nit’s used on a transaction.\n\n## See also\n\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation)\n- [Invoice payment\npage](https://docs.stripe.com/connectors/netsuite/invoice-payment-page)\n- [Customer payment\npage](https://docs.stripe.com/connectors/netsuite/customer-payment-page)\n\n## Links\n\n-\n[products](https://docs.stripe.com/products-prices/how-products-and-prices-work)\n- [coupons](https://docs.stripe.com/billing/subscriptions/coupons)\n- [metadata\nkey](https://docs.stripe.com/connectors/netsuite/custom-payment-application#metadata-keys)\n- [add\nmetadata](https://docs.stripe.com/connectors/netsuite/custom-payment-application#stripe-metadata)\n-\n[price_data](https://docs.stripe.com/api/invoiceitems/create#create_invoiceitem-price_data)\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation)\n- [Invoice payment\npage](https://docs.stripe.com/connectors/netsuite/invoice-payment-page)\n- [Customer payment\npage](https://docs.stripe.com/connectors/netsuite/customer-payment-page)",
  "metadata": {
    "title": "Stripe prices and coupons in NetSuite | Stripe Documentation",
    "description": "Use the connector to represent Stripe prices and coupons in NetSuite.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/stripe-prices-coupons-netsuite"
  }
}