{
  "content": "# Minimum balances for automatic payouts\n\n## Set a minimum balance in your Stripe account to manage cash flow and cover potential refunds, disputes, and fees.\n\nAutomatic payouts default to paying out your entire available balance according\nto your set schedule. This can result in insufficient funds to manage your\npayments business on Stripe, preventing you from processing refunds or disputes.\n\nMinimum balances for automatic payouts let you keep a specified amount in your\nStripe account after an automatic payout. Automatic payouts only pay out funds\nexceeding this minimum balance to your bank account. This helps minimize the\nrisk of a negative balance due to refunds, disputes, or fees after automatic\npayouts. You can use **Minimum Balances** to help:\n\n- Improve your cash flow management by keeping a balance to cover refunds,\ndisputes, and fees.\n- Receive comprehensive reconciliation reports with automatic payouts, including\nthe minimum balance you’ve set.\n\n#### Caution\n\nOnly use minimum balances to cover anticipated refunds, disputes, and fees. Not\nsupported in Brazil, India, and Thailand.\n\n[Express](https://docs.stripe.com/connect/express-accounts) and\n[Custom](https://docs.stripe.com/connect/custom-accounts) connected accounts\ncan’t set a minimum balance.\n\n## Set up minimum balances\n\nMinimum balances work with all automatic payout schedules. If you dip below the\nset minimum balance, Stripe attempts to renew first by using your available\nbalance. If you have no available balance, we use your incoming funds instead.\n\nTo set up a minimum balance:\n\n- Log in to the Dashboard. **Minimum Balances** are only available when you have\naccess to the [Stripe Dashboard](https://dashboard.stripe.com/settings/payouts).\n- Navigate to [Payout Settings](https://dashboard.stripe.com/settings/payouts).\nUnder the **Minimum Balance** section, toggle the option on, and set a fixed\namount.\n- Specify the amount you want to keep as a minimum balance. This amount remains\nin your account to cover potential refunds, disputes, and fees.\n- Save your settings. Your automatic payouts will now retain the specified\nminimum balance.\n\n![Minimum balance settings in the\nDashboard](https://b.stripecdn.com/docs-statics-srv/assets/minimum-balances.ca159ff2ac6b90b6fe4371eaadceba50.png)\n\n## Manage minimum balances\n\nYou can update the minimum balance as needed:\n\n- Navigate to [Payout Settings](https://dashboard.stripe.com/settings/payouts).\n- Under the **Minimum Balance** section, change the amount. If you choose a\nlower amount to keep as a minimum balance, we include the released funds on your\nnext scheduled payout. If you choose a higher minimum balance, we accumulate\nfrom new incoming payments. Regularly check your balance to verify it aligns\nwith your business needs.\n\nYou can also disable your **Minimum Balance** in the Dashboard:\n\n- Navigate to [Payout Settings](https://dashboard.stripe.com/settings/payouts).\n- Under the **Minimum Balance** section, set the amount to 0 or toggle the\noption off. When you turn off minimum balances, Stripe no longer retains the\nspecified minimum balance during automatic payouts. Your entire available\nbalance will be disbursed according to your payout schedule.\n\n#### Note\n\nConsider setting a minimum balance that covers your typical refund, dispute, and\nfee amounts. We generally recommend four to five times your average daily\nprocessing volumes, as this has proven effective in maintaining healthy cash\nflow.\n\n## Negative balances\n\nWith a **Minimum Balance** in place, the likelihood of a negative balance is\nsignificantly reduced. However, if you process refund amounts greater than your\nminimum balance amount at any given time, your balance becomes negative. To\nlearn more about handling [negative\nbalances](https://support.stripe.com/embedded-connect/questions/handling-negative-balances),\nsee [Fix a negative\nbalance](https://support.stripe.com/questions/fix-the-negative-balance-on-your-account).\n\n## Reconciliation reports\n\nWhen you enable **Minimum Balance**, your [Payout Reconciliation\nReport](https://docs.stripe.com/reports/payout-reconciliation) displays the\namount retained due to the minimum balance. This helps you see how the minimum\nbalance affects your payouts and transactions. The timing of your reconciliation\nreports remains unchanged. The reports shows the total payout and the amount\nretained based on the minimum balance.\n\nThe following sections illustrate how Stripe pays out and reconciles an account\nwith a set minimum balance using USD as example currency, workings for other\ncurrencies will be the same:\n\n- Total Balance: 30,000 USD\n- Minimum Balance: 10,000 USD\n- Payout Amount: 20,000 USD (30,000 USD Total Balance - 10,000 USD Minimum\nBalance)\n\nStripe initiates an automatic payout of 20,000 USD to your linked bank account.\nThe minimum balance of 10,000 USD remains in your Stripe account. You can see\nthe [Balance Transaction API](https://docs.stripe.com/api/balance_transactions)\nfor more details on the hold made for the minimum balance.\n\nYour reconciliation report shows the following details:\n\n- All transactions leading up to the total balance of 30,000 USD\n- A transaction for the retained amount of -10,000 USD (your selected Minimum\nBalance)\n- Results in a total payout amount of 20,000 USD\n\n## Minimum balances for Platforms\n\nYou can follow the above steps to set your own **Minimum Balance**. In most\ncases a minimum balance at your Platform should suffice to cover negative\nbalances and refunds for your connected accounts.\n\n#### Caution\n\nWe don’t support setting a minimum balance per connected account.\n\n## Interested in setting minimum balances for connected accounts?\n\nWe are working to support setting a minimum balance per connected account.\nPlease provide your email address below and our team will contact you soon.\n\nCollect EmailSign upRead our [privacy policy](https://stripe.com/privacy).\n## See also\n\n- [Receiving payouts](https://docs.stripe.com/payouts)\n\n## Links\n\n- [Express](https://docs.stripe.com/connect/express-accounts)\n- [Custom](https://docs.stripe.com/connect/custom-accounts)\n- [Stripe Dashboard](https://dashboard.stripe.com/settings/payouts)\n- [negative\nbalances](https://support.stripe.com/embedded-connect/questions/handling-negative-balances)\n- [Fix a negative\nbalance](https://support.stripe.com/questions/fix-the-negative-balance-on-your-account)\n- [Payout Reconciliation\nReport](https://docs.stripe.com/reports/payout-reconciliation)\n- [Balance Transaction API](https://docs.stripe.com/api/balance_transactions)\n- [privacy policy](https://stripe.com/privacy)\n- [Receiving payouts](https://docs.stripe.com/payouts)",
  "metadata": {
    "title": "Minimum balances for automatic payouts | Stripe Documentation",
    "description": "Set a minimum balance in your Stripe account to manage cash flow and cover potential refunds, disputes, and fees.",
    "sourceURL": "https://docs.stripe.com/payouts/minimum-balances-for-automatic-payouts"
  }
}