{
  "content": "# Troubleshoot the connector\n\n## Learn how to troubleshoot errors with the Stripe Connector for NetSuite.\n\nUse this guide to troubleshoot issues with the Stripe Connector for NetSuite,\nincluding identifying and resolving errors when syncing records or loading\npayment pages.\n\nFor further assistance, contact your implementation partner or [Stripe\nsupport](https://support.stripe.com/contact/email?topic=third_party_integrations&subject=%5BStripe%20Connector%20for%20NetSuite%20(SCN)%5D).\n\n## Sync records from Stripe to NetSuite\n\nThe following table describes data errors you might encounter when syncing\nrecords from Stripe to NetSuite. You can view all errors in the connector app’s\nsync records window.\n\nErrorSourceDescriptionResolutionNetSuite System Error: Unable to find a matching\nline for sub-list apply with key: [doc,line] and value: [12345,null].NetSuiteThe\nconnector can’t create a record as a payment (sub-list) entry on an existing\nNetSuite record. For example, the connector can’t create and apply a payment to\nan existing invoice that’s already paid in full. This error can also occur if\nthe credit memo amount is less than the refund amount, which might happen if tax\nor another amount modifies the automation setup in NetSuite.Inspect the NetSuite\nrecord in the error to see why the payment entry wasn’t successful. If the\nreason is still unclear, you can manually create the payment entry to help\nidentify the root cause.\n*Please enter values for: [Field Name].*\n\nNetSuite\n\nThe connector can’t create or update a NetSuite record because of a missing\nrequired field on that record. For example, if the connector tries to create an\ninvoice that requires the `Department` field, NetSuite won’t allow the connector\nto complete the action until there’s a value for `Department` in the create\ninvoice request.\n\nAdd a default value for the field. To do so, navigate to the **App settings** >\n**Field mapping** > **Field defaults** page in the connector. The connector uses\nthe default value when creating records of that type. Field defaults use the\nJSON format.\n\nFor example, to add a default value of 2 for `Department` on your invoices, you\nadd the following:\n\n```\ninvoice: {\n \"department_id\": 2\n}\n\n```\n\n*You have entered an Invalid Field Value [value] for the following field:\n[field].*\n\nNetSuite\n\nThe connector can’t create or update a NetSuite record because of one or more\ninvalid field values. This might happen if a field default uses a deleted or\nunavailable value.\n\nFor example, you might have `Class` as a required field for deposits. During\nonboarding, you add a field default of Corporate with an internal ID of 5 to\nsatisfy the requirement. After some time, the value for Corporate (ID: 5) is\ndeleted. When the connector attempts to create another bank deposit, it fails\nwith the following error message: `You have entered an Invalid Field Value\n'Corporate' for the following field: Class`\n\nModify the default value to use a valid field ID. To do so, navigate to the\n**App settings** > **Field mappings** > **Field defaults** page in the\nconnector.\n\nInvalid record referenced in metadata key `netsuite_metadata_id`\n(012345).ConnectorThe connector can’t sync the record because of a deleted\nNetSuite record that you previously synced or linked. For example, if you link a\nStripe refund to a credit memo and then delete the credit memo, you must update\nthe Stripe refund’s metadata key (`netsuite_credit_memo_id`) to point to the\ncorrect NetSuite credit memo internal ID.Update the refund metadata key\n`netsuite_credit_memo_id` to point to the new credit memo internal ID.Charge\namount 100.0 is different than the amount due on the corresponding invoice.\nTransaction ID:INV12345 (ID 1234567) amount due: 99.0.ConnectorThe invoice\npayment exceeds the amount due on the NetSuite invoice. This might happen if the\nconnector incorrectly syncs the Stripe invoice to NetSuite and you haven’t yet\nset up tax handling. This can also occur if you modify the total on the NetSuite\ninvoice during the period of time between when you sent the invoice and when the\ncustomer submitted payment.If your connector account isn’t set up to handle\ntaxes, contact your implementation partner for setup. If you manually modified a\nNetSuite invoice created by the connector, you must update the invoice to use\nthe original amount.\n## Load invoice or customer payment pages\n\nThe following table describes errors you might encounter when attempting to load\nan invoice payment page or a customer payment page. You can view all errors in\nthe connector app’s sync records window.\n\nErrorDescription`scn_account_disabled`The account is disabled\n(`account_config.disabled = true`).`scn_amount_due`The `Amount Due` field is\nrequired on a NetSuite invoice form. You can verify that Show is selected for\nthe `Amount Due` field by navigating from Customization > Forms > Transaction\nForms to the NetSuite invoice record form. Edit the form under the Screen Fields\nsublist.`scn_amount_too_large`The amount due is greater than the maximum amount\nallowed. Use a lower amount and try again.`scn_amount_too_small`The amount due\nis less than the minimum amount allowed. Use a higher amount and try\nagain.`scn_currency_not_found`The NetSuite invoice record or customer record\ndoesn’t have a set currency.`scn_duplicate_key`Two processes attempted to create\na [Checkout Session](https://docs.stripe.com/api/checkkout/sessions) at the same\ntime. Try again.`scn_invalid_argument`The NetSuite customer wasn’t found. Stripe\nblocked creating a [Checkout\nSession](https://docs.stripe.com/api/checkkout/sessions).`scn_invalid_customer_record`The\ncustomer record isn’t valid because the customer might be inactive, have an\ninvalid obfuscation signature, or be missing the customer payment page custom\nfield.`scn_invalid_internal_id`The internal ID value is incorrect. This error\noften means the formula is misconfigured and there’s a trailing character or\nsymbol at the end of the URL. For example, a `)`. Check the URL for any trailing\ncharacters or symbols, and provide a positive numeric\nvalue.`scn_invalid_livemode_value`The NetSuite bundle live mode value is\nincorrect.`scn_invalid_merchant_account`Stripe couldn’t find an account\nconfiguration for the business and live mode combination. This can occur if the\nbusiness doesn’t exist or if the business isn’t finished with onboarding to the\nconnector.`scn_invalid_payment_link_resource`The resource for the payment link\nis invalid because the record is either a sales order or an invoice with a zero\nbalance.`scn_invalid_record_type`You attempted to create a payment link from a\nNetSuite record that isn’t an invoice or sales order, which isn’t\nsupported.`scn_minimum_balance_not_met`You attempted to create a customer\npayment page for a customer with a balance that’s less than the minimum payment\namount (50 cents USD).`scn_missing_amount`The invoice is missing a remaining\namount. We recommend showing the amount remaining or amount due field on custom\ninvoice forms.`scn_no_customer_balance`The NetSuite customer doesn’t have a\nbalance.`scn_no_guid`The payment link structure is invalid. The payment link\nmust have a GUID and follow this structure:\n`/payment/{{{merchant}}}/live/invoice/{{{guid}}}`.`scn_no_id`The payment link\nstructure is invalid. The GUID must have exactly two parts separated by an\nunderscore. For example,\n`F1783B96F2111D47E053972C0C0AAEB5_1234567`.`scn_no_payment_methods_available`There\nare no valid payment method types for the Checkout\nsession.`scn_no_resource_lock`A resource lock could not be acquired, the\nresource is likely currently being modified by another process. Try again\nlater.`scn_ns_concurrent_request_limit_exceeded`All NetSuite connections are\nbeing used and the request was limited. Try again\nlater.`scn_ns_data_center_not_found`A NetSuite connection URL was not found.\nCheck your account configuration and try\nagain.`scn_ns_invalid_login_attempt`Failed to connect to NetSuite. Check your\naccount credentials and try again. This error can also occur intermittently with\ncorrect credentials.`scn_ns_record_changed`The record was modified concurrently\nby another process. Try again later.`scn_ns_unexpected_error`An unexpected error\noccurred within NetSuite. Try again later.`scn_payment_links_not_enabled` or\n`scn_customer_payment_page_not_enabled`The corresponding customer payment page\nor invoice payment page feature isn’t enabled on this account. Stripe blocked\ncreating a [Checkout\nSession](https://docs.stripe.com/api/checkkout/sessions).`scn_recent_payment_found`The\ncustomer payment page was used to submit a successful payment within the past 24\nhours. Only one payment is allowed per day.`scn_record_not_found`Stripe uses the\ninternal ID provided in a URL to search NetSuite for the invoice associated with\na payment link. This error can occur if:- An invoice record with the provided\ninternal ID doesn’t exist\n- The invoice record is missing a GUID in the\n`custbody_stripe_payment_link_guid` custom field\n- The GUID on the invoice record doesn’t match the GUID in the payment link URL\n`scn_too_many_parts`The payment link structure is invalid. The GUID must have\nexactly two parts separated by an underscore. For example,\n`F1783B96F2111D47E053972C0C0AAEB5_1234567`.`scn_unknown_error`An unknown error\noccurred. Contact support.`scn_unsupported_record_type`You attempted to created\na payment link from a NetSuite sales order, which isn’t supported.\n## Duplicate payments\n\nStripe and NetSuite handle duplicate payments differently. While Stripe allows\noverpayment of an invoice, NetSuite returns an error if a customer attempts to\nmake a payment on a fully paid invoice. By default, if a duplicate payment\noccurs in Stripe, the connector won’t sync the payment because NetSuite doesn’t\nallow a second payment.\n\nIf a duplicate payment causes an error when the connector attempts to reconcile\nthe payout during [deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation), you\ncan fix the issue by manually removing the first payment from the invoice to\nallow the second payment.\n\nYou can also allow the connector to handle duplicate payments for you. If you\nhave a NetSuite invoice that’s fully paid, the connector brings over duplicate\npayments as unapplied payments in NetSuite. The unapplied payment includes the\nfollowing memo: `Stripe Payment Error: could not apply to invoice XYZ.` You can\nthen use these unapplied payments on another invoice, or refund the payments\nmanually in Stripe. To search for duplicate payments in NetSuite, create a saved\nsearch using the memo as your criteria.\n\nYou can enable the connector to handle duplicate payments in the following ways:\n\n- Allow all duplicate payments in the connector by default. To do so, go to your\nconnector settings and enable **Allow duplicate invoice payments** in your\nStripe app settings. Contact your implementation partner to understand all\naccounting and technical implementations before they enable this feature for\nyou.\n- Using the Stripe API, add the `netsuite_allow_duplicate: true` field in the\nmetadata of a duplicate Stripe charge.\n\n## Stripe payment link fields\n\nMake sure to configure the following fields correctly.\n\nFieldDescriptionCurrencyThis field is mandatory and must appear on all invoice\ntemplates used with the Stripe payment link.Amount Due / Amount RemainingMake\nsure this field appears on the invoice. The URL displays a message to your\ncustomer if either this field isn’t shown, the value is zero, or the invoice has\nbeen paid.\n## Hidden GUID field\n\nThe `Hidden GUID` field won’t automatically create randomized IDs for invoices\ncreated before you installed the payment links bundle. This includes invoices\ncreated from previous sales orders.\n\nIf you receive a large volume of errors as a result of this default\nfunctionality, contact your Stripe representative.\n\n## Bundle updates\n\nWhen you update the bundle, the `Default Value` configuration resets to the\ndefault settings. You must reconfigure the `Default Value` configuration for it\nto function properly again for your customers.\n\n## Permissions\n\nIf you require specific permissions to access invoices, make sure to add those\npermissions to the `Stripe Limited Access` role (for example, by navigating to\n**Lists** > **Tax Details** > **Full**). This allows the connector to access\ninvoice information to create an invoice payment page.\n\n## Links\n\n- [Stripe\nsupport](https://support.stripe.com/contact/email?topic=third_party_integrations&subject=%5BStripe%20Connector%20for%20NetSuite%20(SCN)%5D)\n- [Checkout Session](https://docs.stripe.com/api/checkkout/sessions)\n- [deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)",
  "metadata": {
    "title": "Troubleshoot the connector | Stripe Documentation",
    "description": "Get troubleshooting guidance for resolving errors with the Stripe Connector for NetSuite, and issues with creating and configuring invoice payment links; tips for correctly setting up required fields; handling hidden GUIDs for pre-existing invoices; and managing bundle updates that might reset custom configurations.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/error-resolution"
  }
}