{
  "content": "# Stripe Partner Ecosystem\n\n## Learn about the Stripe Partner Ecosystem.\n\nJoin the community of Stripe partners that helps businesses with payments and\nfinancial infrastructure.\n\nWhen you partner with us to build payments solutions and financial services, you\ncan co-market with Stripe, influence our roadmap, build your own network, and\nengage with the partner community. Stripe partners also receive tools and\nresources to grow their business with Stripe, and access co-selling\nopportunities.\n\n## Stripe-verified partners\n\nAfter you complete your partner application and [general\nrequirements](https://docs.stripe.com/partners#requirements), you gain access to\nbenefits, including sales enablement, training, and certifications.\n\nAs you grow as a partner with Stripe, you can become a Stripe verified partner\nthrough one or more tracks. Becoming a verified partner requires a high level of\nproficiency with Stripe. You can demonstrate your proficiency through\n[certifications](https://docs.stripe.com/partners/training-and-certification),\napplication verifications, technology verifications aligned with your business\nplan, or embedded payments verification.\n\nVerifications help Stripe partners distinguish themselves and provide greater\nvalue to their clients. They also grant access to extra benefits, including the\nStripe Verified Partner badge, co-selling opportunities, co-marketing benefits,\nand increased visibility in the partner directory.\n\n## Partner tracks\n\nThe Stripe Partner Ecosystem has four tracks: apps, embedded payments, services\nand technology. You can choose one or more tracks, with benefits aligned to the\ndesired business goal. When you become verified on a partner track, it opens up\nadditional benefits and opportunities.\n\n### Apps track\n\nWe created the apps track for partners interested in building Stripe Apps or\nintegrations with other systems, as well as customizing the Stripe UI to enhance\nit.\n\nThese partners use the [Stripe Apps\nplatform](https://docs.stripe.com/stripe-apps) to extend and enhance Stripe, and\nlist their app on the [Stripe App Marketplace](https://marketplace.stripe.com/)\nfor discovery by businesses.\n\nThe apps track has two milestones: *build* and *growth*. All Apps partners start\nin the build stage upon passing the [app\nreview](https://docs.stripe.com/stripe-apps/review-requirements#app-review-process).\nPartners reach the growth milestone by having over 2,000 installs or 100 million\nUSD in payment volume processed through their app. Growth apps unlock\n[additional benefits](https://docs.stripe.com/partners#benefits-overview). To\nlearn more, see [building a Stripe\napp](https://docs.stripe.com/stripe-apps/how-stripe-apps-work).\n\n### Embedded Payments track\n\nThe embedded payments track is for partners who integrate payments and other\nStripe products into their platform. This includes incorporating financial\nservices into their products, offering features like invoicing and lending\nwithin their SaaS product, and opening up new revenue opportunities for\ncustomers. Partners who achieve verification in the embedded payments track are\nalso eligible for revenue sharing and marketing advisory funds. Learn more about\nthe business and technical\n[requirements](https://docs.stripe.com/partners#requirements) for joining the\nembedded payments track.\n\n### Services track\n\nThe services track is for partners who advise, implement, deploy, or offer\nservices with Stripe. Examples of partners in the services track include systems\nintegrators, software development agencies, payments advisors, and digital\nagencies. You get access to technical training, sales, and marketing resources\nto help you build your Stripe-based services practice. Learn more about the\nbusiness and technical\n[requirements](https://docs.stripe.com/partners#requirements) for joining the\nservices track.\n\n### Technology track\n\nThe technology track is for partners who develop products and solutions that\nwork seamlessly with Stripe. Cloud providers, ISVs, hardware companies, payment\nmethod providers, and SaaS companies are examples of technologies that fall\nunder this category. Partners under the technology track receive technical\ntraining, sales support, and marketing resources to build on Stripe or offer\nsolutions with Stripe.\n\nPartners on the technology track can provide services to support Stripe\nimplementations and integrations, and also fall under the services and apps\ntracks. Learn more about the business and technical\n[requirements](https://docs.stripe.com/partners#requirements) for joining the\ntechnology track.\n\n## Training and certification\n\nStripe offers both sales and technical training certifications.\n\n### Technical training\n\nWe offer two certifications for Stripe partners: architect and developer. For\nboth roles, Stripe offers self-paced training, instructor-led online events,\nworkshops, and online tools to deepen learning and Stripe expertise. Partners\nreceive their certification after completing a Stripe project and a\nmultiple-choice exam. By becoming certified, partners signal their expertise\nwithin the Stripe ecosystem. Learn more about [Stripe\ncertification](https://docs.stripe.com/partners/training-and-certification).\n\n### Sales training\n\nStripe offers optional training for sales teams to learn fundamentals of online\npayments. Partners can learn how Stripe products address business needs, how to\ngo to market with Stripe, and the most important parts of how the payments\nindustry works. [See our Fundamentals\ncourse](https://www.stripe.training/page/sales).\n\n## Requirements\n\nTo become a Stripe partner, you must:\n\n- Create and activate a free [Stripe\naccount](https://dashboard.stripe.com/register).\n- Complete the [partner\napplication](http://www.stripe.com/partners/become-a-partner).\n- Accept the [Stripe Partner Ecosystem\nAgreement](http://www.stripe.com/legal/partner-ecosystem).\n- Make sure you’re not on the [Stripe Restricted Businesses\nlist](http://www.stripe.com/restricted-businesses).\n\nTo become a Stripe verified partner, you must meet these additional\nrequirements:\n\nRequirementAppsEmbedded paymentsServicesTechnologyPass a Stripe technical\nverification Maintain a minimum of two [certified\nindividuals](https://docs.stripe.com/partners/training-and-certification)\n## Benefits overview\n\nStripe partners are eligible for benefits, including deal registration,\ntraining, sales enablement, marketing resources, partner support, and so on. You\ncan become a Stripe verified partner by achieving certification and verifying\nyour solution. This unlocks additional opportunities like co-selling with\nStripe, receiving referral incentives, and inclusion in the Stripe partner\ndirectory.\n\nSee the benefits for Stripe partners:\n\nProgram benefitsStripe partnerVerified apps trackVerified embedded payments\ntrackVerified services trackVerified technology trackBuild Technical training\nand certificationEligible for roundtables with product management1Project\ndelivery kits, including solution blueprints and templatesEligible for\ninvestment funding1[GitHub access](https://github.com/stripe/stripe-apps)Discord\nchannel accessApps product roadmap preview1Market Marketing content, campaign\nassets, how-to guides, and templatesStripe Verified Partner badge and\nco-branding guidelinesSocial media highlightsEligible for joint customer case\nstudies (by invitation)1Eligible to request market development funds\n(MDF)1Eligible for marketing advisory workshops and fundsAmplify your company\nand solution with a directory listingApp Marketplace listingApp Marketplace and\nStripe Dashboard promotion1App marketing eventsSell Deal registration to request\nco-selling supportSales enablement and payments educationCrossbeam account\nmapping for joint account planning1Eligible for Referral IncentiveEligible for\nStripe Connect revenue shareEngage Partner portal and partner supportEligible\nfor partner management1Eligible for partner awardsSponsorship and speaking\nopportunities at Stripe events1Eligible for Stripe participation in\npartner-hosted online events1\n1 Available to select verified partners and Apps partners who have achieved the\nGrowth milestone.\n\n## Program benefit details\n\nDig deeper into each program benefit.\n\n### Build\n\nDevelop solutions and services with Stripe.\n\n#### Technical training and certification\n\nStripe provides training, instructor-led online events, and workshops for Stripe\npartners to gain architect and developer certifications. Partners signal their\nexpertise within the Stripe Partner Ecosystem by being certified. Learn more\nabout [Stripe certification for\npartners](https://docs.stripe.com/partners/training-and-certification).\n\n#### Roundtables with product management\n\nStripe regularly hosts a series of invite only roundtables and delivers online\nevents with a select number of eligible partners to discuss the product roadmap.\nDuring these roundtables, partners can gain visibility into product plans,\nuncover industry trends, and understand Stripe’s go-to-market priorities.\n\n#### Solution blueprints\n\nPartners can draw from Stripe’s library of prebuilt solution blueprints that\nvisually document and capture business requirements and map the end-state to\ndifferent Stripe solutions. Stripe segments these blueprints across business\nmodels such as marketplaces, e-commerce and DTC, B2B SaaS, and embedded\npayments. Additionally, Stripe can provide blueprints for common third-party\nintegrations such as CRM, ERP, and e-commerce platforms.\n\nThese assets can help partners present complex topics like money movement in\nmultiple currencies across countries and provide clarity and value to your\nusers.\n\n#### Investment funding\n\nAvailable to partners with an assigned Stripe partner development manager, you\ncan use this fund to build solutions and support repeatable business cases. The\ninvestment fund has four general categories of business cases: competitive\nmigrations, API modernization, pre-sales workshops, and proof of concepts.\n\nIf partners have unique ideas beyond these four business cases, they can reach\nout to their partner development manager to see if their concept qualifies for\nour investment fund.\n\n#### GitHub access\n\nPartners in the apps track have access to the [Stripe Apps\nGitHub](https://github.com/stripe/stripe-apps) to submit tickets, track request\nprogress, and engage with the apps technical teams.\n\n#### Discord channel access\n\nPartners in the apps track can engage with Stripe and other app developers in\nour [Discord channel](https://discord.com/invite/stripe). Search `Stripe Apps`\nto engage with our community.\n\n#### Apps product roadmap preview\n\nPartners in the apps track might be eligible to access Stripe Apps platform\nroadmap previews. Product roadmap reviews occur regularly and might cover new\nfeatures, how to gain early access to new APIs, and extensibility opportunities.\n\n### Market\n\nAccelerate your marketing campaigns with prebuilt campaigns, customizable\nassets, and co-marketing funds.\n\n#### Marketing content, campaign assets, how-to guides, and templates\n\nMarket with Stripe using our “campaigns in a box” and solution toolkits. Stripe\nprovides resources for partners such as messaging frameworks, templated blogs,\nemails, and social content that you can customize to launch integrated campaigns\nthat drive demand.\n\n#### Stripe verified partner badge and co-branding guidelines\n\nPartners can download the Stripe Verified Partner badge (used externally to\npromote our partnership) from the partner portal. The Stripe Verified Partner\nbadge unlocks co-marketing benefits and amplification of partner services and\nofferings in the partner directory. Stripe provides partners with complete\nguidelines on co-branding with Stripe.\n\n#### Social media highlights\n\nStripe verified partners are eligible to be featured across Stripe’s social\nmedia channels, including our LinkedIn page, and have their message amplified to\nStripe’s customers and community.\n\n#### Marketing advisory workshops and funds\n\nPartners in the embedded payments track are eligible to receive one-on-one\nconsultations with the Stripe marketing team to discuss insights, best\npractices, and receive recommendations about how to improve acquisition,\nactivation, and lifecycle marketing strategies. By participating in a workshop,\npartners agree to staff a dedicated marketing resource with the capacity to\nexecute a marketing plan within 90 days. Partners can request marketing advisory\nfunds (MAF) to cover the cost of marketing activities recommended from the\nworkshop.\n\n#### Market development funds (MDF)\n\nPartners can request MDF to help fund 50% of the cost of co-marketing activities\nthat generate demand for their app, solution, or service. Examples of eligible\nactivities include integrated marketing campaigns, paid media, and digital and\nin-person customer-facing events. To be eligible to request MDF, partners must\nbe verified in the technology or services track and have an assigned Stripe\npartner development manager, or have achieved the growth milestone in the apps\ntrack.\n\n#### Joint customer case studies\n\nWe might invite Stripe partners to participate in a joint case study to showcase\nhow we worked together to solve a customer’s business challenge. Reach out to\nyour partner development manager if you have a story you’d like to nominate for\nconsideration.\n\n#### Amplify your company and solution with a directory listing\n\nThe Stripe partner directory listing provides Stripe verified partners with the\nopportunity to promote their company and relationship with Stripe. For Stripe\nverified partners, their company details page can help drive leads and build\nawareness of their solutions or services.\n\n#### App Marketplace listing\n\nStripe App Marketplace listings help businesses find partners in the apps track\nand understand how their product can help them run their business. Learn more\nabout [Stripe App Marketplace\nlistings](https://docs.stripe.com/stripe-apps/review-requirements).\n\n#### App Marketplace and Stripe Dashboard promotion\n\nPartners in the apps track are eligible to receive promotion of their Stripe App\nin the [Stripe App Marketplace](https://marketplace.stripe.com/) and in the app\ndrawer in the Stripe Dashboard.\n\n#### Stripe Apps marketing events\n\nPartners in the apps track are eligible to join marketing virtual events to\nlearn more about Stripe’s planned marketing activities and best practices on how\nto use our marketing templates to drive usage of your app. Partners can learn\nmore about scheduled marketing virtual events in Stripe’s partner newsletters.\n\n### Sell\n\nSubmit co-selling opportunities to help close deals faster.\n\n#### Deal registration\n\nThe Stripe Go-to-Market Partner team works with Stripe partners to grow our\nbusinesses together. Stripe partners can submit a referral to Stripe or they can\nco-sell with Stripe to close opportunities. You can use three channels for deal\nregistration: submit referrals through the partner portal, bulk upload files\nwith up to 50 leads, or register deals through an ungated lead form.\n\nPartners can also track the progress of a deal through the partner portal.\n\n#### Sales enablement and payments education\n\nStripe partners and Stripe verified partners can access self-service and guided\ntraining courses on how to sell Stripe solutions. The Business Foundations\ncourse helps our partners understand the basics of positioning Stripe solutions\nand identifying opportunities. The Stripe Fast Start series covers a number of\ntopics, including a Stripe overview and how to sell to different segments of the\nmarket. Stripe partners also have access to sales materials, including pitch\ndecks and discovery guides to drive engagement with their users.\n\n#### Crossbeam account mapping\n\nStripe uses the Crossbeam platform to help with account mapping between eligible\npartners and Stripe’s sales team. After completing onboarding, partners can\naccelerate co-selling with Stripe by discovering overlapping customers and\nprospects in an automated and secure manner. To learn more about this benefit\nand how to onboard, contact your partner development manager or submit a case\nthrough the partner portal.\n\n#### Referral incentive\n\nThe Stripe Partner Ecosystem Referral Incentive is a program that rewards apps,\ntechnology, and services track partners for submitting and closing eligible new\nopportunities with Stripe with a payout that’s time-bound and based on the deal\nsize of new referrals. Stripe partners can take advantage of this incentive by\nreferring new customers who’ve never processed payments with Stripe or by\nreferring existing customers who want to increase their business on Stripe.\n\n#### Stripe Connect revenue share program\n\nPartners in the embedded payments track using Stripe Connect might be eligible\nfor the revenue share program, which enables your company to grow as your\ncustomers expand with Stripe.\n\n#### Drive ecosystem revenue through PartnerStack\n\nStripe partners can work with PartnerStack to launch, scale, and grow their\nindirect channels and drive revenue to their business. PartnerStack provides an\nexclusive discount for members of the Stripe Partner Ecosystem. To learn more\nabout this tool and how to build a partner program, submit a case through the\npartner portal.\n\n### Engage\n\nStay close to our product roadmap and leadership teams as you build a\npartnership with us.\n\n#### Partner portal and partner program support\n\nUse the Stripe partner portal to access partner resources. You can submit and\ntrack leads and opportunities, complete training and certifications, download\nmarketing materials, request market development funds, and find support for all\nother needs.\n\n#### Eligible for partner management\n\nSelect verified partners are eligible for one-on-one support with a dedicated\npartner development manager. As the partner’s main point of contact, the partner\ndevelopment manager can assist with go-to-market strategies, help close deals\nwith Stripe sellers, and coordinate enablement sessions.\n\n#### Partner awards\n\nOur partner awards recognize select Stripe partners who lead the way with\ncustomer solutions through Stripe and showcase their Stripe expertise.\n\n#### Sponsorship and speaking opportunities\n\nWe might invite select verified partners to participate in speaking\nopportunities at Stripe events to increase their visibility among Stripe sellers\nand customers.\n\n## Links\n\n- [certifications](https://docs.stripe.com/partners/training-and-certification)\n- [Stripe Apps platform](https://docs.stripe.com/stripe-apps)\n- [Stripe App Marketplace](https://marketplace.stripe.com/)\n- [app\nreview](https://docs.stripe.com/stripe-apps/review-requirements#app-review-process)\n- [building a Stripe\napp](https://docs.stripe.com/stripe-apps/how-stripe-apps-work)\n- [See our Fundamentals course](https://www.stripe.training/page/sales)\n- [Stripe account](https://dashboard.stripe.com/register)\n- [partner application](http://www.stripe.com/partners/become-a-partner)\n- [Stripe Partner Ecosystem\nAgreement](http://www.stripe.com/legal/partner-ecosystem)\n- [Stripe Restricted Businesses\nlist](http://www.stripe.com/restricted-businesses)\n- [GitHub access](https://github.com/stripe/stripe-apps)\n- [Discord channel](https://discord.com/invite/stripe)\n- [Stripe App Marketplace\nlistings](https://docs.stripe.com/stripe-apps/review-requirements)",
  "metadata": {
    "title": "Stripe Partner Ecosystem | Stripe Documentation",
    "description": "Learn about the Stripe Partner Ecosystem.",
    "sourceURL": "https://docs.stripe.com/partners"
  }
}