{
  "content": "# Customized start of day\n\n## Set your start of day to make your automatic payouts reconciliation easier to track.\n\nStripe supports customized start of day for automatic\n[payouts](https://docs.stripe.com/payouts) to group and send payments in your\nlocal timezone with a “customized day” starting time. This makes payout\nreconciliation easier to track as payouts contain payments processed in a day of\nyour timezone, versus payments processed in a UTC day.\n\nFor example, if a user in Singapore starts their customized day at midnight SGT\n(Singapore Time), the payments they process from midnight SGT to the following\nmidnight SGT belong to the same day. If they start their day at 06:00 SGT,\npayments collected between 06:00 SGT on a given day and 06:00 SGT the next day\nare attributed to the given day.\n\nYour default start of day is UTC midnight [except for some users in Asia-Pacific\n(APAC)\nmarkets](https://support.stripe.com/questions/default-start-of-day-for-asia-pacific-%28apac%29-payouts).\nYou can change your start of day to a time in the allowed range (usually between\nmidnight and morning) in your local timezone.\n\n## Feature availability\n\nCustomized start of day is available in the following countries:\n\nAustraliaHong KongIndiaIndonesiaJapanMalaysiaNew\nZealandPhilippinesSingaporeThailand\n## Interested in this feature for the United States?\n\nAccess to Custom Start of Day is currently limited to US private beta users. To\nget access, enter your email address below. We'll determine your eligibility,\nand add you to the waiting list.\n\nCollect EmailSign upRead our [privacy policy](https://stripe.com/privacy).\n## Change start of day\n\nTo change the start of day:\n\n- In the Dashboard, navigate to **Settings** > **Business** > [Bank accounts and\ncurrencies](https://dashboard.stripe.com/settings/payouts).\n- In the **Start of day** section, change the default setting to your preferred\nstart of day.\n\n![Start of day settings in the\nDashboard](https://b.stripecdn.com/docs-statics-srv/assets/payout-schedule-page-start-of-day-1.b11ce1ceac6e24873a3a5a2a68594ba3.png)\n\nAfter you set the start of day, it doesn’t take effect immediately. The new\nstart of day only takes effect at the new time. For example, if your current\ntime is equivalent to 07:00 Asia/Singapore, and you set the start of day to\n00:00 Asia/Singapore, this new start of day takes effect in 17 hours.\n\n![Dashboard callout notifying when the new start of day takes\neffect](https://b.stripecdn.com/docs-statics-srv/assets/payout-schedule-page-start-of-day-2.f64163c5eb39a0eb6c1f6757e50d73b7.png)\n\nThe settings at the time of the original transaction apply to the payout as\nwell. For example, if the settings at the time of the original transaction\nindicate a 7-day payout timing, this rule applies to the payout regardless of\nany later changes in time zones. Let’s say a merchant has a balance of 1000 USD.\n500 USD is attributed to UTC Monday and 500 USD is attributed to UTC Tuesday. If\ntheir start of the day changes to Singapore Time (SGT) on Wednesday, the 1000\nUSD balance is still assigned to UTC Monday and Tuesday, and the payout will be\nprocessed on the next Monday and Tuesday under UTC, not SGT. Only the payments\ncreated after the change to SGT will follow the new time zone in terms of payout\ntiming.\n\n## Example\n\nA restaurant merchant’s business hours are 10AM to 9PM PST, all the transactions\nmade before the start of business count towards the previous day because they’ve\nchosen 10AM as their start of day. Assuming this merchant is on a daily\nautomatic payout plan and a 4 business day schedule, all transactions made\nbetween 10AM PST Monday and 10AM PST Tuesday are grouped into Monday’s sales and\narrive in the merchant’s bank before the end of Friday in one payout.\n\n## See also\n\n- [Receiving payouts](https://docs.stripe.com/payouts)\n\n## Links\n\n- [payouts](https://docs.stripe.com/payouts)\n- [except for some users in Asia-Pacific (APAC)\nmarkets](https://support.stripe.com/questions/default-start-of-day-for-asia-pacific-%28apac%29-payouts)\n- [privacy policy](https://stripe.com/privacy)\n- [Bank accounts and currencies](https://dashboard.stripe.com/settings/payouts)",
  "metadata": {
    "title": "Customized start of day | Stripe Documentation",
    "description": "Set your start of day to make your automatic payouts reconciliation easier to track.",
    "sourceURL": "https://docs.stripe.com/payouts/customized-start-of-day"
  }
}