{
  "content": "# Measuring disputes\n\n## Learn about the potential issues that occur from excessive disputes, and how to avoid them.\n\nThe Stripe Dashboard displays two different calculations to measure your\ndisputes: dispute activity and dispute rate.\n\n- **Dispute activity** represents the percentage of disputes on successful\npayments by *dispute* date.\n- **Dispute rate** represents the percentage of disputes on successful payments\nby *charge* date.\n\nThe two calculations are best understood with an example. Let’s say you\nprocessed 1,000 payments in a given week. In that same week, you also received\n10 disputes.\n\nOnly 3 of those disputes were from the 1,000 payments processed that week. The\nother 7 disputes were from payments that were processed at an earlier date.\n(Because disputes take a while to come in, this delay is very common.)\n\nThe dispute activity for this week would be 1% (10 disputes on 1,000 payments).\nThe dispute rate for this week would be 0.3% (3 disputes on 1,000 payments).\n\n## Dispute activity\n\nDispute activity and dispute rate serve different purposes. The card networks’\n[dispute and card fraud monitoring\nprograms](https://docs.stripe.com/disputes/monitoring-programs) use the dispute\n*activity* calculation. If the dispute activity for your business exceeds the\nthresholds set by the networks for a prolonged period of time (usually multiple\nmonths), you might be subject to fines. You can find the dispute activity for\nyour account in the [Dashboard](https://dashboard.stripe.com/)’s **Analytics**\nsection.\n\n!\n\n## Dispute rate\n\nThe dispute *rate* is a more accurate representation of fraud and disputes for\nyour business, because it shows which actual payments were disputed. For\nexample, you could use the dispute rate to see a particular sale that resulted\nin more disputes than usual, or to pick out fraud attack patterns.\n\nBecause cardholders can dispute a charge up to 120 days after a payment was made\n([and sometimes even\nlater](https://docs.stripe.com/disputes/how-disputes-work#timing)), the dispute\nrate might change for dates more recent than 120 days old. We show this\ncalculation on the [Radar for Fraud Teams](https://dashboard.stripe.com/radar)\npage in the Dashboard.\n\n!\n\n## Excessive dispute activity\n\nEach card network maintains a series of [dispute and card fraud monitoring\nprograms](https://docs.stripe.com/disputes/monitoring-programs) that apply to\nbusinesses operating with high dispute activity. Excessive dispute activity not\nonly affects your ability to process with Stripe, but with other processors as\nwell—and can even result in fines from the card networks. All disputes, whether\nthey’re won or lost, count towards your dispute rate, so the best strategy to\navoid monitoring programs is [dispute\nprevention](https://docs.stripe.com/disputes/prevention).\n\nThe credit card processing industry standard recognizes dispute activity above\n0.75% as excessive, but other factors, such as a sudden spike or steep upward\ntrend can trigger placement in a monitoring program before dispute activity\nreaches the 0.75% threshold. For this reason, if we ever see higher dispute\nactivity or a significant increase in potentially fraudulent activity on your\naccount, we’ll proactively reach out to see how we can help.\n\n## Predicted dispute activity\n\nIn some cases, our machine learning models can predict if your account might be\nin danger of excessive dispute activity at a point in the future. If that\nhappens, we’ll alert you so that you can take proactive steps to [identify and\nprevent disputes and fraud](https://docs.stripe.com/disputes/prevention).\n\n!\n\nThough we can predict dispute trends with some confidence, we cannot predict\nwhich particular payments will be disputed. Keep in mind that we cannot be\ncertain of the predicted rate—your actual dispute activity depends upon any\nfurther disputes received.\n\n## Early fraud warnings\n\n[Early fraud\nwarnings](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\n(EFWs) are messages from Visa and Mastercard that card issuers on these two\nnetworks generate to flag payments they suspect might be fraudulent.\n\nThese aren’t informational notes from the card networks. EFWs do sometimes\nprovide the opportunity for you to refund a fraudulent payment before it becomes\na fraud dispute, but they’re equally as important when used as a metric by the\nnetworks to measure a business’s propensity for fraudulent transactions. Visa in\nparticular counts these fraud warnings toward identification in their [VFMP\nmonitoring program](https://docs.stripe.com/disputes/monitoring-programs#vfmp).\n\n## See also\n\nNow that you have learned about measuring disputes, you may want to learn more\nabout how to prevent disputes, or move on to related subjects:\n\n- [Preventing disputes and fraud](https://docs.stripe.com/disputes/prevention)\n- [How to continuously improve your fraud management with\nRadar](https://stripe.com/guides/improve-fraud-management-with-radar-for-fraud-teams-and-stripe-data)\n- [Identifying\nfraud](https://docs.stripe.com/disputes/prevention/identifying-fraud)\n- [Query disputes and fraud\ndata](https://docs.stripe.com/stripe-data/query-disputes-and-fraud-data)\n- [Types of fraud](https://docs.stripe.com/disputes/prevention/fraud-types)\n\n## Links\n\n- [dispute and card fraud monitoring\nprograms](https://docs.stripe.com/disputes/monitoring-programs)\n- [Dashboard](https://dashboard.stripe.com/)\n- [and sometimes even\nlater](https://docs.stripe.com/disputes/how-disputes-work#timing)\n- [Radar for Fraud Teams](https://dashboard.stripe.com/radar)\n- [dispute prevention](https://docs.stripe.com/disputes/prevention)\n- [Early fraud\nwarnings](https://docs.stripe.com/disputes/how-disputes-work#early-fraud-warnings)\n- [VFMP monitoring\nprogram](https://docs.stripe.com/disputes/monitoring-programs#vfmp)\n- [How to continuously improve your fraud management with\nRadar](https://stripe.com/guides/improve-fraud-management-with-radar-for-fraud-teams-and-stripe-data)\n- [Identifying\nfraud](https://docs.stripe.com/disputes/prevention/identifying-fraud)\n- [Query disputes and fraud\ndata](https://docs.stripe.com/stripe-data/query-disputes-and-fraud-data)\n- [Types of fraud](https://docs.stripe.com/disputes/prevention/fraud-types)",
  "metadata": {
    "title": "Measuring disputes | Stripe Documentation",
    "description": "Learn about the potential issues that occur from excessive disputes, and how to avoid them.",
    "sourceURL": "https://docs.stripe.com/disputes/measuring"
  }
}