{
  "content": "# Split tax forms\n\n## Split your tax forms for your connected accounts after a change of ownership occurs during the tax year.\n\nSplitting a 1099 tax form means that you distribute the amount initially\nreported on a single 1099 form across two 1099 forms. You can split a 1099 form\nafter a change of ownership occurs during the tax year for the legal entity\nreceiving the form. Splitting a 1099 form assigns a portion of the reported\namount to the legal entity before the change and assigns the remaining amount to\nthe legal entity after the change.\n\nChanges to the legal entity of your connected accounts may include these\nexamples:\n\n- Change of ownership—The owner of the connected account sells the business to a\nnew entity.\n- Change of legal entity type—The owner of the connected account changes the\nbusiness type from individual to company, and wants to file for both entities.\n- Change of Tax Identification Number (TIN)—A sole proprietorship that uses the\nindividual’s social security number (SSN) as the business TIN changes it to an\nemployer identification number (EIN), and wants to file for both entities.\n\n#### Note\n\nChanging the TIN doesn’t necessarily require a split (for example, if the change\nwas due to an oversight). You’ll need to determine whether changing the TIN\nrequires a split, an [update](https://docs.stripe.com/connect/modify-tax-forms),\nor a [correction](https://docs.stripe.com/connect/correct-tax-forms). Work with\nyour tax advisor to ensure you understand the split requirements specific to\nyour business.\n\n## Create a split\n\nYou can split a tax form beginning January 4th of the year following that form’s\ntax year. For example, you can split a 2024 tax form starting January 4th, 2025.\nTo create a split, select the form in the\n[Dashboard](https://dashboard.stripe.com/connect/taxes/forms) and then click\n**Split** from the menu on the detail pane. You can filter by the account ID to\nidentify the form of the connected account you want to create a split for.\n\n#### Note\n\nYou can’t split a form after you manually edit the numerical data. To split one\nof these forms, you must revert the numerical data on the form to the\nStripe-supplied values by clicking **Undo edits** on the **Totals** section. If\nthe split forms are drafts, you can then\n[update](https://docs.stripe.com/connect/modify-tax-forms) the draft form prior\nto filing. If you have already filed the original form, you can then update form\ntotals on the split forms with a\n[correction](https://docs.stripe.com/connect/correct-tax-forms).\n\n![Click Split from the menu on the detail\npane](https://b.stripecdn.com/docs-statics-srv/assets/split-menu.8cd4a2d5b6f4ca57d77c36b0f1617bdb.png)\n\nIn the **Split 1099 tax form**, provide the date of the legal entity change and\nthen click **Split**.\n\n![Provide date of legal entity change on Split 1099 tax\nform](https://b.stripecdn.com/docs-statics-srv/assets/split-tax-form.46d061fd477e72d8b0dc0c672d2f624e.png)\n\nYou’ll see two forms for the connected account:\n\n- Form one includes the amounts from January 1 to the day before the specified\nsplit date.\n- Form two includes the amounts from the specified split date to December 31.\n\nIf the legal entity is the same on both forms, they’re marked `Needs Attention`.\nTo correct this, you can [update the\nform](https://docs.stripe.com/connect/modify-tax-forms) to replace the values\nfor relevant payees.\n\n#### Note\n\nYou have to update the identity information on the forms (name, address, TIN)\ncorrectly, so that it isn’t the same as what it was before the split. You are\nresponsible for marking the right identity information on each of the split\nforms.\n\nAfter you update the form so that the payee information is different for each\nform, the form status changes to `Ready`. Click **File** to send both forms to\nthe IRS.\n\n#### Note\n\nSplit forms can only be delivered using postal mail. Paperless deliveries using\nthe Express app is not currently supported.\n\n## Links\n\n- [update](https://docs.stripe.com/connect/modify-tax-forms)\n- [correction](https://docs.stripe.com/connect/correct-tax-forms)\n- [Dashboard](https://dashboard.stripe.com/connect/taxes/forms)",
  "metadata": {
    "title": "Split tax forms | Stripe Documentation",
    "description": "Split your tax forms for your connected accounts after a change of ownership occurs during the tax year.",
    "sourceURL": "https://docs.stripe.com/connect/split-tax-forms"
  }
}