{
  "content": "# Subscription pricing plans\n\n## A new way to pay for Stripe Billing and Stripe Tax.\n\nStripe customers can pay for Stripe\n[Billing](https://stripe.com/billing/pricing) and\n[Tax](https://stripe.com/tax/pricing) with a subscription-based plan.\nSubscription-based plans allow you to choose how you pay for these products: pay\nas you go for more flexibility, or choose a subscription plan for more\npredictable monthly costs. You can sign up for a subscription-based plan from\nthe [Your plans](https://dashboard.stripe.com/settings/plans) page in the Stripe\nDashboard.\n\n![Shows the two options to pay for the\nproducts](https://b.stripecdn.com/docs-statics-srv/assets/pricing-table.eafa7d8dfc064306931fe137b2f458be.png)\n\n## How Stripe subscription plans work\n\nSubscription-based plans provide more predictable monthly costs as well as\npotential discounts versus pay-as-you-go plans. To sign up for a subscription\nplan:\n\n- Select the monthly product usage entitlement that’s appropriate for your\nbusiness. Product usage entitlement is the Billing volume per month for Stripe\nBilling, and transactions per month for Tax.\n- Sign up for an annual contract that’s paid monthly.\n- At the start of each subscription month, pay a subscription fee that covers\nyour selected product entitlement. If applicable, at the end of each month, pay\nan overage fee for any product usage beyond your selected amount. Fees are\nautomatically deducted from your Stripe balance.\n\n## Plan availability by country\n\nWe currently support subscription-based plans in most countries. The countries\nthat we do not yet support are Brazil, Gibraltar, Hungary, India, Indonesia,\nItaly, Japan, Liechtenstein, Malaysia, Mexico, Philippines, Singapore, Thailand,\nand the Quebec province of Canada. If you’re interested in subscription-based\nplans in a country where plans aren’t yet available, fill out the forms below to\nbe notified when subscription-based plans become available in your region.\n\n## Get notified about updates to the Stripe Billing subscription plan\n\nCollect EmailSign upRead our [privacy policy](https://stripe.com/privacy).\n## Get notified about updates to the Stripe Tax subscription plan\n\nCollect EmailSign upRead our [privacy policy](https://stripe.com/privacy).\n\n## Links\n\n- [Billing](https://stripe.com/billing/pricing)\n- [Tax](https://stripe.com/tax/pricing)\n- [Your plans](https://dashboard.stripe.com/settings/plans)\n- [privacy policy](https://stripe.com/privacy)",
  "metadata": {
    "title": "Subscription pricing plans | Stripe Documentation",
    "description": "Use Stripe's Subscription Pricing to manage your spend.",
    "sourceURL": "https://docs.stripe.com/finance-automation/subscription-pricing"
  }
}