{
  "content": "# Invoice Rendering Templates\n\n## Use Invoice Rendering Templates to personalize your invoice appearance for different customers\n\nYou can tailor content on your invoices for specific groups of customers.\nExamples might include:\n\n- Displaying specific text in your invoice’s footer field for customers from a\nparticular country\n- Displaying a specific memo note for customers with a particular revenue\nchannel\n- Grouping line items in a certain manner for customers with complex\ntransactions\n\nThis guide describes how you can use Invoice Templates to:\n\n- Store and reuse common values for invoice fields instead of entering them for\nevery relevant invoice\n- Store, manage, and update invoice field values that apply to large sets of\ncustomers\n- Configure Line Item Grouping rules, which cannot be set outside of Invoice\nTemplates\n- For subscription invoices, customize invoice values without interacting\ndirectly with the invoice\n\n### Set up templates\n\nYou can create Invoice templates only in the Dashboard. You can’t create them\nusing the API.\n\n- In your Billing settings, select the [Invoice templates\ntab](https://dashboard.stripe.com/settings/billing/invoice-templates).\n- Click **+ Create template**.\n- Enter a name for your template.\n- Specify values for the fields you want to include in the template. Templates\nsupport the memo, footer, and custom fields.\n- Optionally, you can [define one or more line item groups using Common\nExpression Language (CEL)\nexpressions](https://docs.stripe.com/invoicing/group-line-items).\n- To see a preview of your template, enter the ID of an applicable invoice in\nthe **Invoice ID** field of the Preview pane. However, any values set directly\non that invoice override the corresponding template value. For example, if that\ninvoice has a footer value, the preview displays the invoice’s footer, not the\ntemplate’s footer.\n\n### Apply templates to invoices\n\nDashboardAPI\nIn the Dashboard, you can apply a template to invoices in a few ways:\n\n- In the Invoice editor\n- In the Subscriptions editor, to apply to all invoices associated with the\nsubscription\n- In a customer’s invoice settings, to apply to all future invoices associated\nwith that customer\n\n### Override and update templates\n\nYou can configure invoice footer, memo, and custom field values in multiple\nplaces. When multiple values can apply to an invoice field, they’re prioritized\nin the following order, from highest to lowest:\n\nPrioritySettingMethod1 On the invoiceDashboard or APIOn the\nsubscriptionDashboard only2 Template applied to the invoiceDashboard or\nAPITemplate applied to the subscriptionDashboard only3Template attached to the\ncustomerDashboard or API4Invoice settings on the customerAPI only5Invoice\nsettings on the accountDashboard only\n#### Note\n\nDefined invoice settings always apply unless overridden by a higher-priority\nsetting. For example, consider a customer that has an attached invoice template.\nTo create a one-time invoice for that customer without using the attached\ntemplate, you must either apply a different template to the invoice or set the\ninvoice values directly.\n\nWhen you update or replace a template, the new values apply to all future\ninvoices associated with the template. For example, consider a customer with an\nexisting subscription where the customer has an attached invoice template, and\nno subscription template overrides it. If you update a value in the customer’s\ntemplate, the new value applies to future invoices for that customer’s existing\nsubscription.\n\n## Links\n\n- [Invoice templates\ntab](https://dashboard.stripe.com/settings/billing/invoice-templates)\n- [define one or more line item groups using Common Expression Language (CEL)\nexpressions](https://docs.stripe.com/invoicing/group-line-items)",
  "metadata": {
    "title": "Invoice Rendering Templates | Stripe Documentation",
    "description": "Use Invoice Rendering Templates to personalize your invoice appearance for different customers",
    "sourceURL": "https://docs.stripe.com/invoicing/invoice-rendering-template"
  }
}