{
  "content": "# Automations\n\n## Learn how to customize subscription and invoice workflows with automations.\n\nStripe Billing automations are a no-code way to build custom, automated\nworkflows to streamline your business processes, enhance customer communication,\nand improve revenue recovery efforts.\n\nTailor automated workflows to fit your specific use case, for example:\n\n- [Custom dunning flow for annual\nsubscribers](https://docs.stripe.com/billing/automation-recipes#custom-dunning-flow)\n- [Notify your team when high value invoices are\noverdue](https://docs.stripe.com/billing/automation-recipes#invoice-overdue-notifications)\n- [Email a confirmation when a subscription is\ncanceled](https://docs.stripe.com/billing/automation-recipes#subscription-cancellation-confirmation)\n- [Give new users a 10 USD spend credit at\nsignup](https://docs.stripe.com/billing/automation-recipes#signup-spend-credit)\nBeta\n\nWorkflows consist of triggers, filter conditions, and actions. This guide\ndescribes how to use those to build and configure your own custom automation.\nFollow an [automation\nrecipe](https://docs.stripe.com/billing/automation-recipes) to get started with\ncommon use cases.\n\n## Set up automations\n\nTo get started with automations, follow these steps:\n\n- In the Stripe Dashboard, go to the [Automations\ntab](https://dashboard.stripe.com/test/revenue_recovery/automations) in Billing.\n- Click **New automation** or press the **n** key.\n- Name the automation.\n- Select the event that you want to trigger the automation.\n- (Optional) Add [filter\nconditions](https://docs.stripe.com/billing/automations#choose-filter-conditions)\nso that your automation only runs when the specified conditions are met.\n- Add a sequence of actions and delays.\n- (Optional) If the selected trigger applies to other automations, drag the new\nautomation to the desired position in the priority order, then click **Save**.\n\n#### Warning\n\nWhen using automations, the\n[next_payment_attempt](https://docs.stripe.com/api/invoices/object#invoice_object-next_payment_attempt)\nis no longer set in `invoice.payment_failed` webhooks but is set in\n`invoice.updated` webhooks.\n\n## Choose a trigger\n\nYou can choose from five triggers:\n\nTriggerDescriptionExample use caseInvoice due date upcomingActions are executed\nrelative to the due date of the invoice. The automation terminates when the\ninvoice is paid, voided, or\n[auto_advance](https://docs.stripe.com/api/invoices/object#invoice_object-auto_advance)\nis turned off. This trigger is only for invoices with `collection_method` set to\n`send_invoice`.Manage customer communication by scheduling `invoice.will_be_due`\nwebhooks at custom intervals.Invoice is finalizedTriggered when an invoice is\nfinalized. The automation terminates when the invoice is paid, voided, or\n[auto_advance](https://docs.stripe.com/api/invoices/object#invoice_object-auto_advance)\nis turned off.Mark invoices for certain customer segments as uncollectible\n(write-off) after a period of time.Invoice is overdueTriggered when an invoice\nbecomes overdue. The automation terminates when the invoice is paid, voided, or\n[auto_advance](https://docs.stripe.com/api/invoices/object#invoice_object-auto_advance)\nis turned off. This trigger is only for invoices of type `send`.Manage customer\ncommunication by scheduling `invoice.overdue` webhooks at custom intervals.\nManage collections by scheduling emails to the collections team.Subscription is\ncanceledTrigger when a subscription is canceled.Email a cancellation\nconfirmation to the customer. Optionally include a cancellation reason\nsurvey.Subscription payment failsTriggered when a subscription invoice payment\nfails its first attempt. The automation terminates when the invoice is paid,\nvoided, or\n[auto_advance](https://docs.stripe.com/api/invoices/object#invoice_object-auto_advance)\nis turned off.- Custom retry behavior for a subset of customers\n- Notify your collections team of high-value payment failures.\n\n## Choose filter conditions\n\nAfter selecting a trigger, you can add one or more filter conditions. These\nconditions need to be met for your automation to run. For example, if you filter\nfor customers on annual subscriptions, the automation only runs if there are\nannual subscriptions.\n\nDepending on the trigger, the following filter conditions are available:\n\nConditionDescriptionCustomer metadataA key-value pair to match on customer\n[metadata](https://docs.stripe.com/api/metadata).Invoice metadataA key-value\npair to match on invoice\n[metadata](https://docs.stripe.com/api/metadata).Invoice amountA minimum or\nmaximum amount per invoice defined in your default currency. Invoices not\ndenominated in your default currency are evaluated against their\nconversion.Subscription intervalLimit to yearly or monthly\nsubscriptions.ProductLimit to invoices or subscriptions that contain at least\none of the products specified.\nYou can use the [Metadata API field](https://docs.stripe.com/api/metadata) to\ndirectly apply metadata for customers and invoices.\n\n## Choose actions\n\nThe following table describes the available actions for the various triggers:\n\nActionDescriptionSupported triggersSet retry policyA retry policy defines how\nfailed charges are retried. This action allows you to create a custom policy and\nattach it to an invoice.Subscription payment failsMark subscription unpaidThe\nsubscription continues to generate invoices each billing cycle, which remain in\n`draft` state.Subscription payment failsCancel subscriptionCanceling\nsubscriptions disables creating new invoices for the subscription and stops\nautomatic collection of all invoices from the subscription by setting\n`auto_advance` to `false`. When you cancel a subscription, the Automation\nimmediately stops running.Subscription payment failsMark invoice\nuncollectibleThe customer is unlikely to pay this invoice and you want to treat\nit as bad debt in your accounting process.- Subscription payment fails\n- Invoice finalized\n- Invoice overdue\nSend team emailEmail a custom memo, along with details about the trigger to a\nteam member or internal email address.All triggersSend subscription cancellation\nemailEmail a cancellation confirmation to your customers. You also have the\noption to include a survey link to collection cancellation reasons.Subscription\nis canceledSend `invoice.will_be_due` webhookYou can schedule this webhook to be\ntriggered with custom delays to get reminders about an invoice that’s about to\nbe due.Invoice due date is setCreate subscription BetaCreates a subscription for\nthe newly created customer with a single product and price.Customer is\ncreatedCredit customer balance BetaMakes a positive adjustment to the customer\ncredit balance in the amount you choose.Customer is created\n## Manage and edit your automations\n\nThis section describes how to priority order and pause or stop automations.\nThese actions help make sure your automations run as expected.\n\n### Priority ordering\n\nYou can configure multiple automations for the same trigger, but each event only\ntriggers one automation. When an event occurs that applies to multiple\nautomations, Stripe checks their filter conditions in priority order and runs\nthe first one that matches. All other automations are ignored.\n\nIf an automation executes, it ignores your global settings.\n\n- **Scenario A**: You create an automation for the `Subscription payment fails`\nevent with no conditions applied. In this scenario, the automation runs every\ntime a subscription payment fails. Your default settings for subscription\npayment failure won’t run.\n- **Scenario B**: You create an automation for the `Subscription payment fails`\nevent with the condition that the invoice must be greater than 100 USD. In this\nscenario, the automation runs if the subscription payment fails and the invoice\nis over 100 USD. If a subscription payment fails and the invoice is less than\n100 USD, your default settings for subscription payment failure run instead.\n\nTo change a trigger’s priority order, open the list of automations, click the\noverflow menu () for any of that trigger’s automations, and select **Update\npriority**. You can also select it from the **Actions** menu on the automation\ndetails page. In the **Set priority** panel, drag each automation to the desired\nposition and then click **Save**.\n\n### Pausing or stopping automations\n\nTo switch off or pause an automation, go to the [Automations\ntab](https://dashboard.stripe.com/test/revenue_recovery/automations) on the\nRevenue recovery page and turn off that automation’s toggle. If any executions\nare in progress for that automation, you can let them finish or immediately\ncancel all of them.\n\nYou can turn the automation on again at any time.\n\n## Join our automations beta\n\nIf you're interested in early access to triggers and actions that are still in\nbeta, please register your interest below.\n\nCollect EmailSubmitRead our [privacy policy](https://stripe.com/privacy).\n\n## Links\n\n- [Custom dunning flow for annual\nsubscribers](https://docs.stripe.com/billing/automation-recipes#custom-dunning-flow)\n- [Notify your team when high value invoices are\noverdue](https://docs.stripe.com/billing/automation-recipes#invoice-overdue-notifications)\n- [Email a confirmation when a subscription is\ncanceled](https://docs.stripe.com/billing/automation-recipes#subscription-cancellation-confirmation)\n- [Give new users a 10 USD spend credit at\nsignup](https://docs.stripe.com/billing/automation-recipes#signup-spend-credit)\n- [automation recipe](https://docs.stripe.com/billing/automation-recipes)\n- [Automations\ntab](https://dashboard.stripe.com/test/revenue_recovery/automations)\n- [filter\nconditions](https://docs.stripe.com/billing/automations#choose-filter-conditions)\n-\n[next_payment_attempt](https://docs.stripe.com/api/invoices/object#invoice_object-next_payment_attempt)\n-\n[auto_advance](https://docs.stripe.com/api/invoices/object#invoice_object-auto_advance)\n- [metadata](https://docs.stripe.com/api/metadata)\n- [privacy policy](https://stripe.com/privacy)",
  "metadata": {
    "title": "Automations | Stripe Documentation",
    "description": "This docs article explains core concepts of automations in Stripe and provides steps to set up and manage automations with examples of automation recipes like custom dunning flows, overdue invoice notifications, subscription cancellation confirmation, and creating signup credits.",
    "sourceURL": "https://docs.stripe.com/billing/automations"
  }
}