{
  "content": "# Create a rule\n\n## Learn how to create a rule.\n\nYou can create and manage Revenue Recognition rules from the Stripe Dashboard.\nTo create a rule, click **Add rule** from the [Rules\npage](https://dashboard.stripe.com/revenue-recognition/rules).\n\nA rule consists of the following key components:\n\n- Name\n- Apply to\n- Revenue treatment and allocation\n- Effective period\n\n![Create a\nrule](https://b.stripecdn.com/docs-statics-srv/assets/add-rule.26297e9f9ea8ffc213a94784cba9ea27.png)\n\n## Conditions (“Apply to”)\n\nA set of conditions specifies which transactions (for example, charges,\n[invoice](https://docs.stripe.com/api/invoices) line items) that a rule applies\nto.\n\n#### Caution\n\nA transaction fulfills the condition requirement when all the conditions are\ntrue.\n\n## Effective period\n\nAn effective period specifies the time period that a rule applies to.\n\nFor an invoice line item, if the finalization time for the invoice falls within\nthe specified effective period, the invoice line item fulfills the effective\nperiod requirement.\n\nFor a charge, if the balance transaction that it corresponds to has a creation\ntime that falls within the specified effective period, the charge fulfills the\neffective period requirement.\n\n#### Caution\n\nFor a rule to apply to a transaction, the transaction must fulfill both the\neffective period and condition requirements. When you update the effective\nperiod, the rule retroactively applies to previous accounting periods. If the\nprevious periods are closed, changes are reflected in the first open accounting\nperiod. You can avoid corrections by re-opening previous periods.\n\n## Treatments\n\nWhen a transaction fulfills both the effective period and condition requirement,\na set of defined treatments are applied.\n\nA treatment consists of its type and the allocation percentage.\n\nThe allocation percentage specifies how much of the amount the type of treatment\napplies to.\n\nThe type of treatment specifies how to treat the amount. Here are the treatment\ntypes that we support:\n\n- Defer and recognize revenue at a specified time (applicable to charges only)\n- Categorize the amount as passthrough fees\n- Categorize the amount as tax\n- Exclude the amount\n- Amortize the amount over a specified period (applicable to charges only)\n- Amortize the amount over the service period for an invoice line item\n(applicable to invoice line items only)\n\n## See also\n\n- [Examples](https://docs.stripe.com/revenue-recognition/rules/examples)\n\n## Links\n\n- [Rules page](https://dashboard.stripe.com/revenue-recognition/rules)\n- [invoice](https://docs.stripe.com/api/invoices)\n- [Examples](https://docs.stripe.com/revenue-recognition/rules/examples)",
  "metadata": {
    "title": "Create a rule | Stripe Documentation",
    "description": "Learn how to create a rule.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/rules/create-a-rule"
  }
}