{
  "content": "# Revenue Recognition with multiple currencies\n\n## Understand the roles of presentment and settlement currencies in Revenue Recognition.\n\nTwo types of currencies are important for the purpose of revenue\nrecognition—presentment currencies and settlement currencies. Presentment\ncurrencies are the currencies that your customers use to pay, settlement\ncurrencies are the currencies that you receive payment in.\n\nFor all transactions with presentment currencies matching one of your settlement\ncurrencies, Revenue Recognition processes journal entries in that currency\ndirectly. In this case, no currency conversion takes place because you can\nreceive payment in that currency directly. Transactions with presentment\ncurrencies that aren’t supported as a settlement currency are automatically\nconverted to the default settlement currency for your Stripe account.\n\nPayments and paid [invoices](https://docs.stripe.com/api/invoices) use the\nexchange rate for the actual money movement (that is, what’s reflected on the\nbalance transaction) for revenue recognition. For example, if you collected 10\nEUR from a customer that settled in your account as 12 USD, Revenue Recognition\nuses 12 USD as the transaction amount.\n\nOne-time payments and invoices that are paid immediately when they finalize\ndon’t incur exposure to fluctuating exchange rates or foreign exchange gains or\nlosses.\n\n## FX loss\n\nHowever, sometimes an invoice is finalized first, and paid later. In this case,\nthe exchange rate may have changed between finalization and payment, creating a\nneed to track gains and losses because of foreign exchange.\n\nFor revenue recognition purposes (for example, calculating accounts receivable),\nany activity that gets booked before an invoice is paid uses an estimated\nexchange rate at the time the invoice finalizes. The difference between the\nestimated exchange rate and the actual exchange rate, if any, is added to the\nFxLoss account.\n\nIn this example, the exchange rate changes between when the invoice finalizes\nand when it’s paid—and assumes your account settles in USD, but the customer is\npaying in EUR.\n\n- On January 1, an invoice finalizes for 30 EUR. The EUR to USD exchange rate is\n1.20\n- On February 1, the customer pays the invoice for 30 EUR. The EUR to USD\nexchange rate is 1.10\n\nBecause of the change in exchange rate, we expected to receive 36 USD at the\ntime the invoice finalized, but we only received 33 USD when it was paid,\nresulting in a net FX loss of 3 USD.\n\nAccountJanFebAccountsReceivables+36.00-36.00Revenue+36.00Cash+33.00FxLoss+3.00\n## FX Loss from refunds and disputes\n\nFxLoss can occur whenever you have a time delay between two operations, which\ncould happen when a payment gets refunded later.\n\nIn this example, the exchange rate changes between a one time payment and when\nit gets refunded—and assume your account settles in USD, and the customer is\npaying in EUR.\n\n- On January 1, the customer makes a one time payment for 30 EUR. The EUR to USD\nexchange rate is 1.20.\n- On February 1, they receive a refund for 30 EUR. The EUR to USD exchange rate\nis 1.10\n\nBecause of the change in exchange rate, you received 36 USD, but refunded only\n33 USD, resulting in a net FX gain of 3 USD.\n\nAccountJanFebRevenue+36.00Cash+36.00-36.00Refunds+33.00FxLoss-3.00\n\n## Links\n\n- [invoices](https://docs.stripe.com/api/invoices)",
  "metadata": {
    "title": "Revenue Recognition with multiple currencies | Stripe Documentation",
    "description": "Understand the roles of presentment and settlement currencies in Revenue Recognition.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/methodology/multi-currency"
  }
}