{
  "content": "# Mexico bank transfers\n\n## Learn about Mexico bank transfers and its supported features.\n\n#### Caution\n\n[Learn\nmore](https://support.stripe.com/questions/mexico-bank-transfers-citi-migration-context-and-faqs)\nabout the Citibank changes and how this impacts Mexico bank transfers.\n\nBank transfers are a popular way to pay in Mexico. For merchants, bank transfers\nhelp reduce customer decline rates, fraud, and chargebacks, and have lower fees\nthan credit cards. For customers in Mexico that have access to bank transfers in\ntheir banking apps, it’s a convenient way to pay.\n\nPayment method propertiesBusiness locationsProduct support- **Customer\nlocations**\n\nMexico\n- **Presentment currency**\n\nMXN\n- **Payment confirmation**\n\nCustomer-initiated\n- **Payment method family**\n\nBank transfers\n- **Recurring payments**\n\nYes\n- **Connect support**\n\nYes\n- **Dispute support**\n\nNo\n- **Manual capture support**\n\nNo\n- **Refunds / Partial refunds**\n\nYes / Yes\n\n## Target user segments\n\nIn particular, the Stripe bank transfer product serves users that process high\naverage order volume (AOV) and low-frequency payments. This includes B2C\nMarketplaces with high AOV, B2B SaaS businesses, and fintech businesses.\n\n## Product features\n\nCitibanamex (the local Mexico unit of Citigroup, Inc.) processes payments for\nthe Stripe bank transfer product. Citibanamex is a member of the SPEI network\nand provides the necessary basic capabilities for processing bank transfer\npayments.\n\nOur product offers automatic reconciliation and management of partial payments\nand over payments, in addition to refunds. The bank transfer product is for\nusers who want low-code and no-code solutions in Mexico, and it allows them to\nmanage bank transfer payments through solutions such as\n[invoices](https://docs.stripe.com/api/invoices) created in the Dashboard.\n\nOur bank transfer product also offers successful payment confirmation\nnotifications. Stripe provides a message, (either in an API response or in the\nDashboard), indicating that a specific payment intent has been paid. On business\ndays, we expect to provide successful payment confirmation of most payments\nwithin 30 minutes of the transfer. On non-business days, such as weekends or\nbank holidays, we provide payment confirmation for most payments on the next\nbusiness day. For certain payments, you might experience delays of up to several\ndays, and delays because of of online system maintenance.\n\nAs soon as Stripe receives the successful payment confirmation from Citibanamex\n(based on the timing described above), the Dashboard updates to show the credit\nor completed payment. Funds can get paid out to the user’s bank account as soon\nas 3 days after Citibanamex has confirmed the bank transfer.\n\n#### Note\n\nDue to reporting limitations, our product doesn’t offer immediate payment\nconfirmation notifications or settlements. As a result, our product is better\nsuited for businesses that process high AOV, low-frequency payments, such as B2B\nbusinesses rather than consumer retail businesses.\n\n## Get started\n\nGet started with [accepting bank transfer\npayments](https://docs.stripe.com/payments/bank-transfers/accept-a-payment) or\nlearn more about the [customer\nbalance](https://docs.stripe.com/payments/customer-balance).\n\n## Links\n\n- [Learn\nmore](https://support.stripe.com/questions/mexico-bank-transfers-citi-migration-context-and-faqs)\n- [invoices](https://docs.stripe.com/api/invoices)\n- [accepting bank transfer\npayments](https://docs.stripe.com/payments/bank-transfers/accept-a-payment)\n- [customer balance](https://docs.stripe.com/payments/customer-balance)",
  "metadata": {
    "title": "Mexico bank transfers | Stripe Documentation",
    "description": "Learn about Mexico bank transfers and its supported features.",
    "sourceURL": "https://docs.stripe.com/payments/bank-transfers/acerca-de-transferencias-bancarias"
  }
}