{
  "content": "# Treasury connected account onboarding guide\n\n## Learn how to reduce friction while onboarding your connected accounts.\n\nWhen a Connect platform uses Stripe Treasury to offer financial services to its\nconnected accounts, the account onboarding process must consider fraud\nprevention and regulatory compliance. For example, financial services providers\nmust employ Know Your Customer (KYC) and Know Your Business (KYB) client data\ncollection and verification procedures. Use this guide to implement a Treasury\nonboarding process for your connected accounts.\n\n## KYC and KYB onboarding\n\nBefore you launch your embedded finance capabilities, implement an onboarding\nflow that collects the [necessary KYC and KYB information from your connected\naccounts](https://docs.stripe.com/connect/identity-verification). The [US\nTreasury Financial Crimes Enforcement\nNetwork](https://www.fincen.gov/resources/statutes-and-regulations/cdd-final-rule)\n(FinCEN) sets and enforces the legal requirements for customer due diligence,\nwhich each financial institution or partner can supplement with additional\nrequirements.\n\n#### Note\n\nWhen onboarding connected accounts that use Treasury features, you must collect\ntheir requirements up front. Don’t use incremental onboarding.\n\nWhen onboarding connected accounts to Treasury, Stripe only presents your\nplatform with the core business compliance requirements. Your platform is\nresponsible for collecting the required KYC and KYB information during\nonboarding and passing it to Stripe. The specific process depends on [the type\nof onboarding flow you implement](https://docs.stripe.com/connect/onboarding).\nStripe then performs checks to determine if the connected accounts meet KYC and\nKYB requirements and to flag potential risks of money laundering or fraud. Those\nchecks include:\n\n- Verifying ID documents using public and private databases\n- Checking application information against databases of known fraudulent actors\nand criminals (such as known terrorists and money launderers)\n- Validating addresses\n- Verifying that an application is from a registered business with the\nappropriate licenses\n\n### Required information from your connected accounts\n\nTo open a Treasury financial account for a connected account, you must collect\ninformation including, but not limited to:\n\n- Business name\n- Legal entity type\n- Tax ID number\n- Merchant category code (MCC)\n- Company name\n- Company address\n- Information about company owners, including:- SSN\n- Date of birth\n- Title\n- Ownership percentage\n\nTo review the full requirements for opening a financial account associated with\na connected account, see [Required verification\ninformation](https://docs.stripe.com/connect/required-verification-information#US-full-company--card_payments%7Ctransfers%7Cus_bank_account_ach_payments).\n\n## Ways to onboard connected accounts to Treasury\n\nYou can onboard your connected accounts onto Connect and Treasury using the\nStripe-hosted onboarding flow or using the Stripe API to pass verification\ninformation to Stripe.\n\nBenefits of Stripe-hosted onboarding include:\n\n- With [Stripe-hosted\nonboarding](https://docs.stripe.com/connect/hosted-onboarding), you don’t need\nto design or build a custom onboarding UI. Stripe provides a customizable web\nform that collects the required identity information from your connected\naccounts.\n- Hosted onboarding dynamically adjusts input fields depending on account\ncapabilities, product usage, country, and business type.\n- You can use hosted onboarding if you need support for mobile browsers,\naccessibility, and localization.\n- Hosted onboarding allows you to automatically collect all currently required\ninformation up front or incrementally, depending on what’s needed (see\n[onboarding\nflows](https://docs.stripe.com/connect/identity-verification#onboarding-flows)).\nTo use Stripe Treasury products, connected accounts must provide all information\nto satisfy KYC requirements up front.\n\nBenefits of API onboarding include:\n\n- [API onboarding (custom\nonboarding)](https://docs.stripe.com/connect/api-onboarding) gives you full\ncontrol over the onboarding UI and process.\n- You don’t need to redirect connected account holders to an external\nStripe-hosted page.\n- You can design the information collection flow for your connected accounts.\n\n## Keep up with changing requirements\n\nChanging requirements can necessitate gathering additional information from\nconnected accounts. While hosted onboarding dynamically updates to reflect new\nrequirements, platforms using API onboarding need to make sure they update their\nUI and collect this information. If a connected account has already onboarded\nusing hosted onboarding and the requirements change, you can forward them the\nhosted onboarding link. Clicking it prompts them to provide the new required\ninformation. You can obtain new requirements for accounts using the methods\ndetailed in the [Required verification\ninformation](https://docs.stripe.com/connect/required-verification-information)\nguide.\n\nYou can also use a mixture of hosted and API onboarding. If you use hosted\nonboarding but have already collected some information from a different source,\nyou can pass that information to Stripe through the [identity verification\nprocess](https://docs.stripe.com/connect/identity-verification) and prefill the\nhosted onboarding page with the provided information. In that case, the\nconnected account can modify or verify the information within the Stripe-hosted\nUI.\n\n## Tips for onboarding\n\nTo make sure onboarding is successful and boost conversion for your Treasury\nproduct, keep the following tips in mind:\n\n- Consider onboarding connected accounts to the `treasury` capability to start,\neven if you don’t plan to create a Treasury financial account until later. If\nyou decide to perform Treasury onboarding later, prevent friction by setting\nclear expectations during onboarding that additional information might be\nrequired to use all aspects of the product.\n- If you already have a Connect integration, or have otherwise collected\nidentifying information from your connected accounts, you can use the API to\npass data you already have. Doing so reduces the amount of information a\nconnected account needs to provide through hosted onboarding.\n- For issued cards, provide the card use case to help cardholders understand how\nit works.\n- If a connected account has recently incorporated their business, they might\nnot have their TIN entered in the IRS database yet. In that case, their TIN\nmight come back as unverified until the IRS database updates. The account is\nstill usable, and Stripe periodically attempts to reverify the TIN.\n- Hosted onboarding allows you to test out your integration. If you want more\ncustomization, you can switch to custom onboarding.\n- Only onboard connected accounts that Stripe and Treasury can support. Review\nthe [Treasury requirements](https://docs.stripe.com/treasury/requirements) for\nsupportability, and follow the guidelines on [marketing Treasury to\nusers](https://docs.stripe.com/treasury/compliance).\n- Offering incentives to onboard, such as a free subscription period or\nincentive funds, can help boost activation and engagement.\n\n### See also\n\n- [Connect integration\nguide](https://docs.stripe.com/connect/design-an-integration?connect-onboarding-surface=api&connect-dashboard-type=none&connect-economic-model=buy-rate&connect-loss-liability-owner=platform&connect-charge-type=direct)\n- [Treasury documentation on opening connected\naccounts](https://docs.stripe.com/treasury/account-management/connected-accounts#requirements)\n- [Documentation on opening Treasury financial\naccounts](https://docs.stripe.com/treasury/account-management/financial-accounts)\n\n## Links\n\n- [necessary KYC and KYB information from your connected\naccounts](https://docs.stripe.com/connect/identity-verification)\n- [US Treasury Financial Crimes Enforcement\nNetwork](https://www.fincen.gov/resources/statutes-and-regulations/cdd-final-rule)\n- [the type of onboarding flow you\nimplement](https://docs.stripe.com/connect/onboarding)\n- [Required verification\ninformation](https://docs.stripe.com/connect/required-verification-information#US-full-company--card_payments%7Ctransfers%7Cus_bank_account_ach_payments)\n- [Stripe-hosted onboarding](https://docs.stripe.com/connect/hosted-onboarding)\n- [onboarding\nflows](https://docs.stripe.com/connect/identity-verification#onboarding-flows)\n- [API onboarding (custom\nonboarding)](https://docs.stripe.com/connect/api-onboarding)\n- [Required verification\ninformation](https://docs.stripe.com/connect/required-verification-information)\n- [Treasury requirements](https://docs.stripe.com/treasury/requirements)\n- [marketing Treasury to users](https://docs.stripe.com/treasury/compliance)\n- [Connect integration\nguide](https://docs.stripe.com/connect/design-an-integration?connect-onboarding-surface=api&connect-dashboard-type=none&connect-economic-model=buy-rate&connect-loss-liability-owner=platform&connect-charge-type=direct)\n- [Treasury documentation on opening connected\naccounts](https://docs.stripe.com/treasury/account-management/connected-accounts#requirements)\n- [Documentation on opening Treasury financial\naccounts](https://docs.stripe.com/treasury/account-management/financial-accounts)",
  "metadata": {
    "title": "Treasury connected account onboarding guide | Stripe Documentation",
    "description": "Learn how to reduce friction while onboarding your connected accounts.",
    "sourceURL": "https://docs.stripe.com/treasury/examples/onboarding-guide"
  }
}