{
  "content": "# File Section 83(b) elections as a non-US founder\n\n## Learn about filing an 83(b) election as a non-US founder.\n\n#### Note\n\nStripe Atlas does not provide tax or legal advice. Consult tax and legal\nprofessionals for advice on how to meet ongoing legal, tax, and accounting\nobligations that apply to you and your company.\n\nIf you live outside the US but file US tax returns, startup lawyers recommend\nmaking a Section 83(b) election because it might save you on future US taxes.\n\nIf you currently don’t file US tax returns but might become a US taxpayer in the\nfuture, it’s important to make a Section 83(b) election. Failing to do so could\nlead to additional US tax liability when your stock vests.\n\nIf you’re not a US taxpayer and don’t plan to become one, making a Section 83(b)\nelection is unnecessary as it only impacts US tax liability.\n\nThe IRS requires a US Taxpayer Identification Number (TIN) at the time of\nfiling. Use either your Social Security Number (SSN) or an Individual Taxpayer\nIdentification Number (ITIN). If you don’t have either when you incorporate with\nStripe Atlas, Stripe informs the IRS that you are a non-US taxpayer, and you\nintend to apply for an ITIN after you become a US taxpayer. Consult a tax\nadvisor to determine if and when you should get an ITIN.\n\n[Atlas files 83(b) elections for all C-corp\nfounders](https://support.stripe.com/questions/atlas-filing-your-83%28b%29-election-using-auto-83%28b%29).\nLLC founders don’t need to file an 83(b) tax election, as equity in an LLC\ncreated with Atlas doesn’t vest.\n\n## Links\n\n- [Atlas files 83(b) elections for all C-corp\nfounders](https://support.stripe.com/questions/atlas-filing-your-83%28b%29-election-using-auto-83%28b%29)",
  "metadata": {
    "title": "File Section 83(b) elections as a non-US founder | Stripe Documentation",
    "description": "Learn about filing an 83(b) election as a non-US founder.",
    "sourceURL": "https://docs.stripe.com/atlas/83b-elections-non-us-founders"
  }
}