{
  "content": "# Issuing balance\n\n## Learn how to make funds available to your cards.\n\nTo spend money using cards, add funds to the Issuing balance on your account.\nThis balance represents funds reserved for Issuing and is safely separated from\nyour earnings, payouts, and funds from other Stripe products.\n\nPush fundingFunding from Stripe BalancePull funding (US-only)\nUsing the Stripe Dashboard or API, you can access the bank account and routing\ninformation you need to push funds from your external bank account. When that\naccount receives funds, they’re immediately available as a\n[top-up](https://docs.stripe.com/api/topups) to your Stripe account’s Issuing\nbalance.\n\nFor a given currency, the provided bank account information will be unique and\nable to receive funds any number of times. Funds always arrive in your Issuing\nbalance in the specified currency. In some cases, your bank might perform\ncurrency conversion.\n\nRegionPayment SchemeCurrency SupportedSpeedMaximum amount acceptedUnited\nStatesBeta Wire Transfer from US banks onlyUSDA few minutes to 1 business\ndayVaries by bank, usually many millionsACH Credit TransferUSDSeveral hours to\nseveral business daysVaries by bank, usually less than $25kEuro area SEPA Credit\nTransferEURAbout a day€999,999,999.99United Kingdom FPSGBPAbout 2 hours during a\nbank’s business hours, or at the start of the next banking day.£1\nmillionBACSGBP2-3 business days£20 million\nSelect region:\n\nUnited States (beta)Euro areaUnited Kingdom\n## Access account information for push funding in the Dashboard\n\nTo access account information for push funding:\n\n- Navigate to the [Balances page](https://dashboard.stripe.com/balance/overview)\nin the Dashboard.\n- Scroll down to the **Issuing balance** heading and click **Add to balance**.\n- Choose your **Issuing balance** and specify how much to add. Click **Next**.\n- Select **Wire transfer** from the dropdown, and expand **Show instructions**\nto see the information you need to send a wire.\n\nTo send a wire from your bank, use the routing and account number, along with\nthe beneficiary information.\n\nWires from banks outside the US aren’t allowed. Funds received from an\ninternational wire are returned to the sender’s bank account, which can take up\nto 3 business days.\n\n### Request early access\n\nAccess to US push funding is currently limited to US beta users. You must be an\nIssuing customer to join the beta. To request access to the beta, log in to your\nStripe account and refresh the page. [Contact\nStripe](https://stripe.com/contact/sales) for more information.\n\n## Enable notifications about your balance\n\nYou can enable email notifications to help monitor your Issuing balance from\nyour settings. To configure these notifications:\n\n- Visit your Balance notifications\n[settings](https://dashboard.stripe.com/settings/issuing/balance-notifications)\npage.\n- Choose from two types of alerting thresholds:- Fixed amount: Receive an alert\nwhenever your Issuing balance falls below this amount.\n- Ratio of balance to rolling spend: Receive an alert whenever the ratio of your\nIssuing balance to your spend over the previous 24 hours falls below the\nthreshold. For example, if you set your threshold to 80% and your spend over the\npast day is 100 USD, you receive an alert whenever your balance falls below 80\nUSD.\n\n## Links\n\n- [top-up](https://docs.stripe.com/api/topups)\n- [Balances page](https://dashboard.stripe.com/balance/overview)\n- [Contact Stripe](https://stripe.com/contact/sales)\n-\n[settings](https://dashboard.stripe.com/settings/issuing/balance-notifications)",
  "metadata": {
    "title": "Issuing balance | Stripe Documentation",
    "description": "Learn how to make funds available to your cards.",
    "sourceURL": "https://docs.stripe.com/issuing/funding/balance"
  }
}