{
  "content": "# How to incorporate your company\n\n## Learn what you need to get started with Atlas.\n\n## What Atlas does for you\n\nStripe Atlas incorporates your company in Delaware, gets your company tax ID\n(EIN) from the IRS, issues founders equity, and files your 83(b) election. After\nincorporating you can open a business bank account, charge customers using\nStripe payments, and access discounts on tools for founders.\n\nAtlas costs 500 USD, which covers incorporation (plus state fees), and your\nfirst year of registered agent services. After that, we charge 100 USD annually\nto maintain your registered agent. We’ll refund your fee if we’re unable to\nsupport your business. Read more about Stripe Atlas’ [restricted business\ncategories](https://support.stripe.com/questions/stripe-atlas-restricted-business-categories).\n\nAtlas provides legal information and self-serve tools that assist you in\nproviding this information, filling out template documents, and filing these\nwith the appropriate government offices. Atlas isn’t a law firm and doesn’t\nprovide legal, tax, or accounting advice. Atlas can’t guarantee that your\nbusiness will be approved to use Stripe payments. Using Atlas isn’t a substitute\nfor individual advice from qualified legal, tax, or accounting professionals.\nDouble-check that the documents we populate are aligned with your company’s\nunique circumstances, because you will need to work with a lawyer to make any\nchanges after your incorporation documents are executed.\n\n## When to consider talking to a lawyer before using Atlas\n\nAtlas is appropriate for most founders, but not all. If you have unique\nconsiderations such as any of the following, consider talking to a lawyer before\nusing Atlas. This list is not exhaustive.\n\n- **You’re contributing significant intellectual property (IP) or other assets\nto your company**. Atlas forms C corporations with an industry standard fair\nmarket value (FMV) of 100 USD, which might not be accurate if you have\nsubstantially valuable IP.\n- **You have prior inventions you want to exclude from being assigned to your\ncompany**. Atlas assigns all prior inventions relevant to your company to the\nnewly incorporated company.\n- **You want to include non-compete or non-solicit clauses in your formation\ndocuments**. Atlas omits non-compete and non-solicit clauses because they’re\nstate specific, change on a regular basis, and can be hard to enforce. If you\nuse Atlas, you can work with a lawyer to include them after incorporation.\n- **You or your co-founders reside in India**. If you or any of your co-founders\nlive in India, Atlas is not suitable for you. Consider consulting a lawyer about\nODI laws in your country before proceeding.\n- **You’re rolling over qualified small business stock (QSBS) gains from a\nprevious company to your new one**. Atlas automatically purchases shares on all\nfounders’ behalf using IP and doesn’t support purchasing stock with cash.\n- **You don’t want to file an 83(b) election**. Atlas automatically files 83(b)\nelections for all founders, a step that startup lawyers recommend, and one\nexpected by investors.\n\n#### Note\n\n[Create an account](https://dashboard.stripe.com/register/atlas) to start your\ncompany with Stripe Atlas. To get started, you’ll need to provide information\nabout your company, founders, ownership structure, and officers.\n\n## What you need to submit your application\n\nReview the following table and submit the required information.\n\nWhat we need from youCompany structureSelect the entity type that aligns with\nyour company goals. Stripe Atlas supports forming Delaware C corporations,\nlimited liability companies (LLCs), and C corporation subsidiaries.\nCompany name\n\nEnter a legal name for your company. The Atlas application checks if a name is\navailable in the State of Delaware, but you can also check if a name is\navailable on [Delaware’s\nwebsite](https://icis.corp.delaware.gov/eCorp/EntitySearch/NameSearch.aspx).\n\nIf you’re creating the new company as a subsidiary of an existing company, you\nalso need to provide the following information about the existing parent\ncompany:\n\n- Parent company legal name\n- Parent company country\n- Parent company tax ID number\nCompany descriptionProvide a few sentences to describe your company. It’s okay\nif this changes. We only use this to verify that you aren’t operating in a\n[restricted business\ncategory](https://support.stripe.com/questions/stripe-atlas-restricted-business-categories).Company\nwebsiteYou can use your company website if you already have one. If not, provide\nyour social profile like LinkedIn, X, and so on. We use this to verify that\nyou’re a real person.Company addressIf you don’t have an official company\naddress yet, you can use your home address or get a virtual address through one\nof our partners. We include this address in your EIN application to the IRS and\nin incorporation documents. The IRS will send a physical copy of your EIN\nconfirmation letter to this address. You’ll also receive a digital copy of your\nEIN confirmation letter from Atlas.Company US phone numberIf you don’t have a\ncompany phone number, you can use a personal number or get a virtual phone\nnumber through one of our partners. We include this only in your EIN application\nto the IRS. This number won’t be publicly listed anywhere.\nFounders\n\nWe need the following information about you and any co-founders:\n\n- First and last name as they appear on a government ID\n- Email address\n- Date of birth (only for the founder who submits the Atlas application)\n- SSN or ITIN (we include this in your EIN application and your 83(b) election)\n- Home address (we use it to verify your identity, and in your 83(b) election.\nWe don’t share it or use it for marketing purposes. You won’t receive mail at\nthis address)\nOwnershipTell us how much each founder will own and set up an equity pool for\nyour future team if you’re creating a C corporation.\nRoles and officers\n\nChoose your company’s role and officers:\n\n- Board of Directors (or LLC Managers): Choose who can make important company\ndecisions such as granting ownership, fundraising, or selling the company.\n- C corporation and subsidiary roles: Name a President and Secretary for your\ncompany. One person can hold both roles.\n\n## How we use your information\n\nStripe uses your information to generate the legal documents necessary to form\nyour company in Delaware, get an EIN from the IRS, and file your [83(b)\nelection](https://docs.stripe.com/atlas/83b-election). If you apply to Stripe\npayments or other Stripe products, your information goes through additional\nreview. The [Stripe Atlas Agreement](https://stripe.com/atlas/legal) and the\n[Stripe Privacy Policy](https://stripe.com/us/privacy) have further detail about\nthe information we collect and how we use that information.\n\n## After you sign your documents\n\nAfter you sign and submit your application, we’ll review it within 1 business\nday to ensure we have all necessary information. We’ll notify you if we need\nmore time or additional details about your company to complete your review. You\ncan track the status of your company in the [Atlas\nDashboard](https://dashboard.stripe.com/atlas).\n\n## Company formation\n\nOnce we have all the information we need about your company, we’ll file your\nincorporation paperwork with Delaware.\n\nC corporationLLC\nIncorporation in Delaware usually takes 1–2 business days. Immediately after\nincorporation, Atlas automatically purchases shares on your behalf and issues\nthem to you. Atlas founders pay for their shares with IP developed on behalf of\nthe company.\n\nIf your company is a subsidiary of an existing company, you’ll need to issue\nshares to your parent company after incorporation. Atlas provides a standard\ntemplate that you can customize with a lawyer based on your specific\ncircumstances.\n\n## Payments and banking before receiving your tax ID\n\nAtlas automatically gets your company an IRS tax ID, called an [Employer\nIdentification Number\n(EIN)](https://www.irs.gov/businesses/small-businesses-self-employed/employer-id-numbers),\nafter filing your incorporation in Delaware. *After incorporating with Atlas,\nyou can start accepting US card payments on Stripe, open a business bank account\nwith Mercury or Brex, and begin fundraising before the IRS assigns your EIN.*\nOther third party services might require your EIN before you can start using\ntheir products, and you’ll need it later to pay taxes and hire employees.\n\nYou can activate US card payments on Stripe for your Atlas company before\nreceiving your EIN. Stripe offers no-code payment options, including Payment\nLinks and Invoicing, and all Atlas companies get one year of free payments\nprocessing on Stripe (up to 100,000 USD in revenue). Atlas sends you an email\nwhen your company is incorporated in Delaware (typically 1–2 business days days\nafter you submit your application). You can activate Stripe Payments from that\nemail, or from your Atlas Dashboard, and Atlas automatically prefills the fields\nthat you completed during your Atlas application. You’ll need to submit a US\nphone number (our partners in the Perks section of the Atlas Dashboard can help\nif you need one). *You can only use Payouts to transfer your Stripe balance to\nyour bank account after you receive your EIN.* You can access additional payment\nmethods beyond US card payments only after your EIN is available.\n\nThe IRS typically processes EIN applications in 1–2 business days if you provide\na US company address, a US company phone number, and a US Social Security\nnumber. If you don’t submit any of these three pieces of information, the IRS\ncould take 35–45 business days. Atlas emails you when your EIN is available.\n\n## Getting your company tax ID from the IRS\n\nAtlas automatically gets your EIN by filing [Form\nSS-4](https://www.irs.gov/pub/irs-pdf/fss4.pdf) with the IRS. You also complete\n[Form 8821](https://www.irs.gov/pub/irs-pdf/f8821.pdf), which allows Atlas to\ncall the IRS on your behalf to get your company’s EIN as fast as possible.\n\nIf the founder filling out the Atlas application has a US Social Security Number\n(SSN), a US address, and a US phone number, Atlas will automatically get their\ncompany’s EIN in 1–2 business days after incorporation. If the founder doesn’t\nhave an SSN, Atlas will get their company’s EIN in 35–45 business days after\nincorporation.\n\nWe make a few assumptions when we submit your company’s EIN application to the\nIRS. We assume your company **doesn’t**:\n\n- Have or expect to have any employees who will receive a Form W-2 in the next\n12 months.\n- Own a [highway motor\nvehicle](https://sa.www4.irs.gov/modiein/individual/help/keyword.jsp?keyword=Highway%20Motor%20Vehicle)\nwith a [taxable gross\nweight](https://sa.www4.irs.gov/modiein/individual/help/keyword.jsp?keyword=Taxable%20Gross%20Weight)\nof 55,000 pounds or more.\n- Need to file [Form\n720](https://sa.www4.irs.gov/modiein/individual/help/keyword.jsp?keyword=Form%20%20720)\n(Quarterly Federal Excise Tax Return).\n- Involve [gambling or\nwagering](https://sa.www4.irs.gov/modiein/individual/help/keyword.jsp?keyword=Gambling/Wagering).\n- Sell or manufacture alcohol, tobacco, or firearms.\n\nIf any of these assumptions are incorrect prior to incorporation, please work\nwith a tax expert to file applicable employment taxes and/or excise taxes for\nyour company. Many companies hire employees after incorporation; our\n[partners](https://support.stripe.com/questions/legal-and-tax-advice-for-your-stripe-atlas-company)\ncan help you do this compliantly.\n\n#### Note\n\nTo get a company tax ID (EIN) using Stripe Atlas, begin by [creating an\naccount](https://dashboard.stripe.com/register/atlas).\n\n## Registered agent service\n\nTo maintain good standing, Delaware requires that companies have a registered\nagent to receive official notices. The initial 500 USD setup fee includes one\nyear of registered agent services, which automatically renews each year for 100\nUSD. Your registered agent might contact you directly to share legal notices and\nofficial communications from Delaware. Your registered agent address isn’t a\ngeneral purpose mail-forwarding address for your company and shouldn’t be listed\nas a company address. You can separately use a virtual address service to\nreceive general mail, for customer contact, and to apply to open a bank account.\n\n## Next steps\n\n- [Learn about Section 83(b)\nelections](https://docs.stripe.com/atlas/83b-election)\n- [Business taxes](https://docs.stripe.com/atlas/business-taxes)\n- [Business bank accounts](https://docs.stripe.com/atlas/payments-business-bank)\n\n## Links\n\n- [restricted business\ncategories](https://support.stripe.com/questions/stripe-atlas-restricted-business-categories)\n- [Create an account](https://dashboard.stripe.com/register/atlas)\n- [Delaware’s\nwebsite](https://icis.corp.delaware.gov/eCorp/EntitySearch/NameSearch.aspx)\n- [83(b) election](https://docs.stripe.com/atlas/83b-election)\n- [Stripe Atlas Agreement](https://stripe.com/atlas/legal)\n- [Stripe Privacy Policy](https://stripe.com/us/privacy)\n- [Atlas Dashboard](https://dashboard.stripe.com/atlas)\n- [Employer Identification Number\n(EIN)](https://www.irs.gov/businesses/small-businesses-self-employed/employer-id-numbers)\n- [Form SS-4](https://www.irs.gov/pub/irs-pdf/fss4.pdf)\n- [Form 8821](https://www.irs.gov/pub/irs-pdf/f8821.pdf)\n- [highway motor\nvehicle](https://sa.www4.irs.gov/modiein/individual/help/keyword.jsp?keyword=Highway%20Motor%20Vehicle)\n- [taxable gross\nweight](https://sa.www4.irs.gov/modiein/individual/help/keyword.jsp?keyword=Taxable%20Gross%20Weight)\n- [Form\n720](https://sa.www4.irs.gov/modiein/individual/help/keyword.jsp?keyword=Form%20%20720)\n- [gambling or\nwagering](https://sa.www4.irs.gov/modiein/individual/help/keyword.jsp?keyword=Gambling/Wagering)\n-\n[partners](https://support.stripe.com/questions/legal-and-tax-advice-for-your-stripe-atlas-company)\n- [Business taxes](https://docs.stripe.com/atlas/business-taxes)\n- [Business bank accounts](https://docs.stripe.com/atlas/payments-business-bank)",
  "metadata": {
    "title": "How to incorporate your company | Stripe Documentation",
    "description": "Learn what you need to get started with Atlas.",
    "sourceURL": "https://docs.stripe.com/atlas/signup"
  }
}