{
  "content": "# Replacement cards\n\n## Learn how to replace cards that are expired, damaged, lost, or stolen.\n\nYou can replace cards that are expired, damaged, lost, or stolen. The process\ndiffers slightly for each kind of card replacement.\n\n- **Card expired**: The card has reached its expiration date and is no longer\nvalid.\n- **Card damaged**: The cardholder requests a new card for a reason other than\nlost or stolen (for example, a physical card’s chip no longer reads properly).\n- **Card lost/stolen**: The card is reported lost or stolen and a new card\nnumber, expiry, security code are issued.\n\nDepending on the scenario, the replacement card might have a different card\nnumber, expiry, or security code from the original:\n\nScenarioNew card numberNew security codeNew expiryCard expiredNoYesYesCard\ndamagedNoYesYesCard lost/stolenYesYesYes\n## Replacements for expired or damaged cards\n\nPhysical cards can get damaged, and both physical cards and virtual cards\nexpire, but you can create replacement cards that have the same card number. The\ncardholder can continue to use the original card before the replacement card is\nactivated, as long as the card isn’t too damaged or already expired. Activating\nthe replacement card cancels the original card if it isn’t already canceled.\n\nTo create a replacement card for an expired or damaged card, create a\n[Card](https://docs.stripe.com/api#issuing_card_object) with `replacement_for`\nusing the expired or damaged `Card` ID and `replacement_reason` set to `expired`\nor `damaged`.\n\n```\ncurl https://api.stripe.com/v1/issuing/cards \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d cardholder=ich_1Cm3pZIyNTgGDVfzI83rasFP \\\n -d currency=usd \\\n -d type=virtual \\\n -d replacement_for=ic_1LL8wgLUVt6Jcs5dgLLfwcAE \\\n -d replacement_reason=expired\n```\n\n## Replacements for lost or stolen cards\n\nLost or stolen cards get new card numbers for security reasons. We need to\ncancel the original cards before we can create the replacement card.\n\nTo create a replacement card for a lost or stolen card:\n\n- Cancel the lost or stolen card by using the [update\ncard](https://docs.stripe.com/api#update_issuing_card) endpoint to set its\n`status` to `canceled` and its `cancellation_reason` to `lost` or `stolen`.\n- Create a [Card](https://docs.stripe.com/api#issuing_card_object) with\n`replacement_for` using the lost or stolen `Card` ID and `replacement_reason`\nset to `lost` or `stolen`.\n\n```\ncurl https://api.stripe.com/v1/issuing/cards/ic_1CoYuRKEl2ztzE5GIEDjQiUI \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d status=canceled \\\n -d cancellation_reason=lost\n```\n\n```\ncurl https://api.stripe.com/v1/issuing/cards \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d cardholder=ich_1Cm3pZIyNTgGDVfzI83rasFP \\\n -d currency=usd \\\n -d type=virtual \\\n -d replacement_for=ic_1CoYuRKEl2ztzE5GIEDjQiUI \\\n -d replacement_reason=lost\n```\n\n## All replacements\n\nAll replacement cards have renewed expiration dates and new security codes.\nAuthorizations made on the original cards are migrated to the replacements, but\nmight still clear on the original cards. Like the originals, replacement cards\nmust be activated before use.\n\n## Card-on-file updating\n\nFor many of our card programs, Stripe automatically updates the card details on\nfile with acquiring merchants, even when a card is completely reissued. This\nfeature offers several benefits, including saving your cardholders the hassle of\nmanually re-entering card details when their cards expire.\n\n### Card expired or damaged\n\nUpdating the payment details for a card that has been replaced due to expiration\nor damage ensures that recurring payments and stored payment details continue to\nfunction. This enables cardholders to continue making payments when they replace\na card.\n\n### Card lost or stolen\n\nStripe doesn’t update businesses with the new card number, expiry, and security\ncode of a replacement card if the old card is marked as being lost or stolen.\n\n## Links\n\n- [Card](https://docs.stripe.com/api#issuing_card_object)\n- [update card](https://docs.stripe.com/api#update_issuing_card)",
  "metadata": {
    "title": "Replacement cards | Stripe Documentation",
    "description": "Learn how to replace cards that are expired, damaged, lost, or stolen.",
    "sourceURL": "https://docs.stripe.com/issuing/cards/replacements"
  }
}