{
  "content": "# Standard accounts guide\n\n## Learn about the changes to Connect onboarding requirements, and how your connected accounts will be affected in Australia, Europe, New Zealand, and the United States.\n\nTo adapt to changes in financial regulations, Stripe has made important updates\nto [Connect](https://docs.stripe.com/connect) that affect the information\ncollection requirements. Many of these requirements relate to gathering\ninformation to verify companies and individuals. Stripe already manages this\ninformation collection for Standard accounts. Stripe will start collecting\nupdated requirements from new businesses when they sign up for your platform. If\nyou have existing users that are affected by these changes, Stripe will contact\nthem to collect updated information. You don’t need to take action.\n\n## Updated requirement: beneficial owners\n\nInformation about the [beneficial owners of a\nbusiness](https://support.stripe.com/questions/beneficial-owner-and-director-definitions)\nis required for accounts in Australia, Europe, New Zealand, and the United\nStates.\n\n- Owner: Any individual who owns a significant percentage of the company (often\n25% or more).\n- Executive (sometimes referred to as a controller): Any individual who\nexercises significant control over your company. Individuals considered to\n*exercise significant control* over the company are those responsible for\nmanaging and directing the business and may include executive officers or senior\nmanagers such as CEO, CFO, COO, Managing Member, General Partner, President,\nVice President, or Treasurer.\n- Representative: The individual responsible for creating and maintaining the\naccount. This is typically the end user who is interacting with your platform on\nbehalf of the business.\n\nFor detailed information about the required information that Stripe collects\nfrom your Standard accounts, see [Required Verification\nInformation](https://docs.stripe.com/connect/required-verification-information).\n\n## Impact to your connected accounts\n\nStripe has updated the Dashboard to collect the required information for your\nnew connected accounts.\n\nExisting accounts that need to update their information will be contacted by\nStripe later this year. They’ll receive emails and Stripe Dashboard\nnotifications that will guide them through the information collection process.\n\n## Recommended actions\n\nIf you have any customer-facing documentation that references onboarding onto\nStripe, you might want to update it to reflect the updated information\nrequirements.\n\nTo provide a better user experience, it’s a best practice to identify accounts\nthat can’t process payments. An account can be unable to process payments\nbecause of verification issues or missing information. Stripe works to resolve\nthese cases directly with your customers, but you should also monitor your\nconnected accounts and tell customers who can’t process payments to log into\ntheir Stripe account to resolve the issue. To determine whether or not an\naccount can process payments, check the `charges_enabled` attribute on the\n[Account\nobject](https://docs.stripe.com/api/accounts/object#account_object-charges_enabled).\n\nFor more information about requirements, see the [company\nownership](https://support.stripe.com/questions/owners-and-directors) and\n[beneficial\nowners](https://support.stripe.com/questions/beneficial-owner-and-director-definitions)\nsupport articles.\n\n## Links\n\n- [Connect](https://docs.stripe.com/connect)\n- [beneficial owners of a\nbusiness](https://support.stripe.com/questions/beneficial-owner-and-director-definitions)\n- [Required Verification\nInformation](https://docs.stripe.com/connect/required-verification-information)\n- [Account\nobject](https://docs.stripe.com/api/accounts/object#account_object-charges_enabled)\n- [company ownership](https://support.stripe.com/questions/owners-and-directors)",
  "metadata": {
    "title": "Standard accounts guide | Stripe Documentation",
    "description": "Learn about the changes to Connect onboarding requirements, and how your connected accounts will be affected in Australia, Europe, New Zealand, and the United States.",
    "sourceURL": "https://docs.stripe.com/connect/required-updates/standard-accounts-guide"
  }
}