{
  "content": "# PAN data across Stripe accounts\n\n## Securely copy sensitive primary account number data within Stripe.\n\nStripe’s self-serve data copy service allows you to copy customer and payment\ndata from one Stripe account to another Stripe account in the Dashboard.\n\nA data copy involves two parties: the sender account and the recipient account.\n\n- **Sender account**: The Stripe account currently storing the customer data.\nThis is the account to copy the data from.\n- **Recipient account**: The Stripe account where you want to store the customer\ndata. This is the account to copy the data to.\n\nBefore beginning the copying process, the sender and the recipient must provide\ntheir account IDs to each other. If you’re the sender account, work with a user\nof the recipient account to share account IDs. If you’re the recipient account,\nwork with a user of the sender account to share account IDs. Find your account\nID by going to the [User settings](https://dashboard.stripe.com/settings/user)\nin the Dashboard while logged into your account.\n\n## Data copying considerations\n\nConsider the following when copying data to a new account:\n\n- We can only copy data from one account to another. We can’t merge or move the\ndata. After it’s complete, the copied data exists on both the destination and\nsource accounts.\n- We only copy the raw [Customer](https://docs.stripe.com/api/customers/object)\nobjects and associated payment data objects. The supported payment methods\ninclude:\n\n- Cards stored as [Card](https://docs.stripe.com/api/cards/object) objects\n- Cards stored as [Source](https://docs.stripe.com/api/sources/object) objects\n- Cards stored as [Payment\nmethod](https://docs.stripe.com/api/payment_methods/object) objects\n- US ACH records stored as [Bank\naccount](https://docs.stripe.com/api/customer_bank_accounts/object) objects\n- We can’t copy Single Euro Payments Area (SEPA), BACs, or ACH records stored as\npayment method objects at this time.\n- We can’t copy individual\n[Charges](https://docs.stripe.com/api/charges/object),\n[PaymentIntents](https://docs.stripe.com/api/payment_intents/object),\n[Invoices](https://docs.stripe.com/api/invoices/object),\n[Plans](https://docs.stripe.com/api/plans/object),\n[Subscriptions](https://docs.stripe.com/api/subscriptions/object),\n[Coupons](https://docs.stripe.com/api/coupons/object),\n[Events](https://docs.stripe.com/api/events/object), Logs, [Guest\ncustomers](https://support.stripe.com/questions/guest-customer-faq), or any\nother Stripe objects.\n- The copy operation doesn’t change customer IDs, resulting in the same IDs for\ncustomers in both the destination and source account data.\n- The copy process assigns new object IDs of the same payment type to payment\ndata. For example, the process assigns a new card object ID to all card objects\nand new payment method object IDs to all payment method objects. After the copy\nprocess is complete, Stripe creates and uploads a CSV mapping file to the\n**Documents** section of the recipient’s Dashboard. The mapping file is\navailable to the recipient only. The mapping file contains the following\nheaders:\n\n- `customer_id_old`\n- `source_id_old`\n- `customer_id_new`\n- `source_id_new`\n\nCustomer IDs don’t change during the copying process, so `customer_id_old` and\n`customer_id_new` have the same value after the copy finishes. `source_id_old`\nis the old payment method ID from the sharing account, and `source_id_new` is\nthe new payment method ID from the recipient account.\n- Source account data remains intact. We recommend keeping the original source\naccount as a backup for your data.\n- The recipient account must be an activated account. To activate the account,\nlog in to the Dashboard and follow the prompts at the top-left of the home\nscreen to activate payments.\n- You can’t copy deleted customers from the sharing account to the recipient\naccount. After you delete a Customer, there’s no way to restore that customer.\n- If you delete a customer in the recipient account, a second copy doesn’t\nrestore that customer.\n- During a second copy involving the same accounts and same customers,\npreviously-copied Customer objects aren’t duplicated. The second copy copies\nover brand new Stripe Customer objects or new payment methods only for\npreviously-copied Customer objects. If you delete a customer in the account,\nre-copying that customer from the sharing account doesn’t restore that customer.\n- The copy includes only Stripe Customer objects (`cus_xxx`). We can’t copy\nGuest (`gcus_xxxx`) customers—see [Guest\ncustomers](https://support.stripe.com/questions/guest-customer-faq) to learn\nmore. Sender accounts must have Customer objects stored to process a data copy.\n- Accounts can perform up to 50 copies per day. Stripe limits copies to\nunauthorized accounts to one copy until the recipient account authorizes the\nfirst copy request.\n- If any expired cards are included in the records that you copy over to the\ndestination account, there’s the possibility that [Card Account\nUpdater](https://stripe.com/guides/optimizing-authorization-rates#card-account-updater)\n(CAU)—if turned on for the destination account—will communicate with the card\nnetworks to automatically update these cards. This can result in additional CAU\nfees for the destination account. To avoid the possibility of CAU fees related\nto a self-serve copy, the destination account team must work with the source\naccount team to make sure that no expired cards are included in the copy data\nset.\n\n## Full or partial copy\n\nYou can perform a full or partial copy. A full copy sends all customers from the\nsender account. A partial copy sends a subset of customers from the sender\naccount.\n\nA partial copy entails sending a subset of customers from the sender account to\nthe recipient account. There are two ways to complete a partial copy:\n\n- **Select customers in the Dashboard**: Recommended for copies of less than 15\ncustomers\n- **Upload a CSV file with a list of customer IDs**: Recommended for copies of\nmore than 15 customers\nFull copyPartial copy with customer selectionPartial copy with CSV upload\nYou need to complete three steps for a full data copy:\n\n- The sender shares their customer data with the recipient.\n- The recipient authorizes and accepts the customer data from the sender.\n- The copying process finishes.\n\n## Share customer data with the recipient\n\n- The sender logs into their [Stripe\naccount](https://dashboard.stripe.com/login) and navigates to the\n[Customers](https://dashboard.stripe.com/customers) page.\n- They click ** customers**.\n- In the ** Method** field, they click ** all customers**.\n- They enter the account ID (`acct_xxxx`) of the recipient account and click\n**Continue**. If they haven’t previously shared customers with this recipient\naccount, they receive a message stating that the recipient needs to authorize\nyour request before the copy occurs.\n- They click **Confirm**.\n- After successfully sharing the data with the recipient, the sender can see the\npending copy request at the top of their Customers page.\n\n## Authorize and accept customer data from the sender\n\nThe recipient logs into their [Stripe\naccount](https://dashboard.stripe.com/login) and navigates to the [Customers\npage](https://dashboard.stripe.com/customers), where they see a banner at the\ntop advising that the sender wants to share their data. The recipient clicks\n**Authorize and Accept**.\n\n## The copying process finishes\n\nAfter the sender completes the previous steps, the copy begins processing. The\nsender and recipient can see the in-progress copy banner at the top of the\nCustomers page in the Dashboard.\n\nMost data copies finish within 72 hours, after the sender shares the customer\ndata with the recipient and the recipient authorizes and accepts the customer\ndata from the sender. Copies of fewer than 10,000 customers typically complete\nwithin a couple of hours.\n\nWhen the copying process is complete, the sender and recipient can see the\ncompleted copy banner at the top of the Customers page in the Dashboard. The\nrecipient has the option to download the mapping file.\n\n## into or out of a Connect account\n\nIf the sender account is a Connect account without access to the Stripe\nDashboard, reach out to your contact at the Platform to let them know you need a\ndata copy. The Platform account owner or Data Migration Specialist needs to\nfollow these steps:\n\nPartial copy with customer selection isn’t available for Connect accounts.\n\nFull copyPartial copy with CSV upload- The Platform account owner or Data\nMigration Specialist logs into their Stripe account and navigates to the\n[Connect](https://dashboard.stripe.com/connect/accounts/overview) page.\n- The sender locates and selects the correct Connect account where the customers\nare stored.\n- They navigate to the Customers section within the Connect account.\n- They click ** customers**.\n- In the ** Method** field, they click ** all customers**.\n- They enter the account ID (format: acct_xxxx) of the recipient account and\nclick **Continue**. If they haven’t previously shared customers with this\nrecipient account, they receive a message stating that the recipient needs to\nauthorize your request before the copy occurs.\n- They click **Confirm**. After successfully sharing the data with the\nrecipient, they can see the pending copy request at the top of the Customers\npage within the Connect account.\n- The recipient follows standard steps for authorizing and accepting customer\ndata.\n\nIf the recipient account is a Connect account that doesn’t have access to the\nStripe Dashboard, reach out to your contact at the Platform to let them know you\nneed a data copy.\n\nThe Platform account owner, Admin, or Data Migration Specialist need to\nauthorize and accept customer data from the sender after the sender shares it.\n\nTo authorize the data, the recipient logs into the Platform Stripe account,\nnavigates to the Connect page, locates the Connect account where the customers\nwere shared, and clicks **Authorize and Accept** on the banner in the Customers\nsection.\n\nIf your customers are stored in a Platform account that you don’t own, inform\nyour contact at the Platform that you need a data copy. Direct them to follow\nthe steps to share your customers with the recipient account. Platform accounts\ntypically store customers for several unrelated Connected accounts. Make sure\nthe Platform account shares only your customers, by following the steps to do a\npartial copy.\n\n## Status page\n\nIf you’re an account owner or data migration specialist, you can view\nin-progress and completed copies by going to the Customers page and selecting\n** customers** then **Status page**. You can toggle between **Shared** data\nand **Received** data.\n\nFor all other roles, you can view in-progress and complete copies on the [copy\nstatus page](https://dashboard.stripe.com/copy-status).\n\n### Shared\n\nOn the Shared tab, you can see copies where your account was the sender account,\nsharing your customers to other accounts.\n\n**In progress** copies are copies that are currently processing or where the\nsender account has initiated the copy, but the recipient hasn’t authorized and\naccepted it. For **Pending** copies, the recipient needs to authorize and accept\nthe copy to proceed. Most **In progress** copies finish within 72 hours. Copies\nof fewer than 10,000 customers typically complete within a couple of hours.\n\n**Previously shared** copies are copies that were successful or canceled from\nyour account to another.\n\n### Received\n\nOn the Received tab, you can see copies where your account was the recipient\naccount, receiving customers from other accounts.\n\n**In progress** copies are copies that are currently processing or where the\nsender account has initiated the copy, but you as the recipient haven’t\nauthorized and accepted it. For **Pending** copies, you need to authorize and\naccept the copy to proceed. Most **In progress** copies in this state finish\nwithin 72 hours. Copies of fewer than 10,000 customers typically complete within\na couple of hours.\n\n**Previously shared with you** copies are copies that were successful or\ncanceled from another account to your account.\n\n**Authorized senders** navigates to the Authorized accounts page, which shows\nthe accounts authorized to send you their data. You need to accept the data copy\nrequests from these accounts. After you accept, these accounts can see your\nbusiness name when they enter your account ID during the sharing step. You can\nrevoke permission from any accounts in this list, which prevents them from\nseeing your business name during the sharing process. When you revoke\npermission, future copy requests must be authorized and accepted. Only account\nowners, admins, and data migration specialists can add and revoke authorized\naccounts.\n\n## Permissions restrictions\n\nOnly the account owner or a Data Migration Specialist can perform actions from\nthe sender account. Only the account owner, an account admin, or a Data\nMigration Specialist can perform actions from the recipient account and download\nthe mapping file.\n\nLearn how to [add a team member as a Data Migration\nSpecialist](https://docs.stripe.com/get-started/account/teams/roles).\n\n## India account considerations\n\nData copies aren’t permitted between India Stripe accounts and accounts outside\nof India. There are regulations in India that require local storage of certain\npayments data. As part of our continued investment in India and to meet these\nrequirements, we’re updating our systems and have reviewed the data migrations\nwe offer to Stripe users. The data storage requirements prevent us from\nproceeding with the data copy you’ve requested. If you attempt to complete a\ncopy between an India Stripe account and an account outside of India, you\nreceive an error message that says copying isn’t permissible.\n\n#### Note\n\n[Tokenized cards](https://docs.stripe.com/india-network-tokenization) aren’t\ncopied.\n\n## Get Stripe support\n\nIf you run into issues or have any questions when completing the data copy,\ncontact the Data Migration Team with this [intake\nform](https://support.stripe.com/contact/email?topic=migrations). You must be\nlogged in to your Stripe account before clicking this link.\n\nIn the intake form, for migration type, select **Tell us about your other data\nmigration use case**, and fill out the form accordingly. If you’ve already\ninitiated a data copy, provide the migration request ID associated with the copy\nrequest. The migration request ID is in the pending banner or the status page.\n\n## Links\n\n- [User settings](https://dashboard.stripe.com/settings/user)\n- [Customer](https://docs.stripe.com/api/customers/object)\n- [Card](https://docs.stripe.com/api/cards/object)\n- [Source](https://docs.stripe.com/api/sources/object)\n- [Payment method](https://docs.stripe.com/api/payment_methods/object)\n- [Bank account](https://docs.stripe.com/api/customer_bank_accounts/object)\n- [Charges](https://docs.stripe.com/api/charges/object)\n- [PaymentIntents](https://docs.stripe.com/api/payment_intents/object)\n- [Invoices](https://docs.stripe.com/api/invoices/object)\n- [Plans](https://docs.stripe.com/api/plans/object)\n- [Subscriptions](https://docs.stripe.com/api/subscriptions/object)\n- [Coupons](https://docs.stripe.com/api/coupons/object)\n- [Events](https://docs.stripe.com/api/events/object)\n- [Guest customers](https://support.stripe.com/questions/guest-customer-faq)\n- [Card Account\nUpdater](https://stripe.com/guides/optimizing-authorization-rates#card-account-updater)\n- [Stripe account](https://dashboard.stripe.com/login)\n- [Customers](https://dashboard.stripe.com/customers)\n- [Connect](https://dashboard.stripe.com/connect/accounts/overview)\n- [copy status page](https://dashboard.stripe.com/copy-status)\n- [add a team member as a Data Migration\nSpecialist](https://docs.stripe.com/get-started/account/teams/roles)\n- [Tokenized cards](https://docs.stripe.com/india-network-tokenization)\n- [intake form](https://support.stripe.com/contact/email?topic=migrations)",
  "metadata": {
    "title": "Copy PAN data across Stripe accounts | Stripe Documentation",
    "description": "Securely copy sensitive primary account number data within Stripe.",
    "sourceURL": "https://docs.stripe.com/get-started/data-migrations/pan-copy-self-serve"
  }
}