{
  "content": "# Stripe Connector for Google Play\n\n## Manage your revenue recognition in Stripe by importing data from Google Play.\n\n[Stripe’s Connector for Google\nPlay](https://docs.stripe.com/stripe-data/import-external-data/connectors/google-play)\nlets you import subscription purchases from Google Play into Stripe Revenue\nRecognition automatically.\n\nSome benefits of using Revenue Recognition for Google Play include:\n\n- **Near real-time availability**: Set up daily, automated imports from Google\nPlay. This minimizes manual work and reduces corrections at month-end.\n- **Improved refund treatment**: Link refunds to original purchases, and\ngenerate more accurate refund journal entries that adjust deferred revenue\ninstead of treating refunds as negative line items.\n- **Audit by order**: Break down numbers on a transactional basis to help with\naudits.\n\n## Get started\n\nTo import data from Google Play, [set up Stripe’s Connector for Google\nPlay](https://docs.stripe.com/stripe-data/import-external-data/connectors/google-play).\nIt can take up to 24 hours for your reports to reflect imported data.\n\n### Backfill historical data\n\nWhen you onboard, the Connector backfills up to 1 year of historical data.\n\n### Handle Google transactions previously imported through manual data import\n\nIf you previously imported data from Google Play using Revenue Recognition’s\n[data\nimport](https://docs.stripe.com/revenue-recognition/data-import#general-import)\nfeature, you want to avoid double-counting Google revenue upon switching to the\nautomated Connector.\n\nTo migrate from manual data imports to the Google Play Connector,\n[delete](https://docs.stripe.com/revenue-recognition/data-import/manage-imported-data#transactions-deletion)\nall Google transactions from the past year that you uploaded manually through\ndata import CSVs. The Connector import then replaces these deleted entries.\n\n#### Limit deletions to 1 year of history\n\nDon’t delete data import CSV uploads for Google transactions that occurred more\nthan 1 year ago because the Connector only backfills up to 1 year of historical\ndata.\n\n## Examples\n\nThe following examples show how the Google Play Connector might record revenue\nin different scenarios.\n\n### Subscription purchase\n\nOn December 3, a subscriber purchases 1 unit of a “News Plan Monthly”\nsubscription.\n\n- The subscription is valid for a month, which means the service period is from\nDec 3 to Jan 3.\n- The customer pays 31 USD.\n\nAt the end of January, the summary might show:\n\nAccountDecemberJanuaryExternal Asset+31Revenue+28+3Deferred Revenue+3-3- Revenue\ngets billed and paid in full on December 3.\n- The bulk of the revenue is recognized in December, with a smaller part\nrecognized in January.\n\n### Subscription refund\n\nOn January 2, a subscriber purchases a three-month subscription that costs 90\nUSD.\n\n- The service period is Jan 2 - April 2.\n- On February 1, the customer receives a full refund, meaning:- The customer\ngets their money back.\n- Recognized revenue is offset by the refund in a contra revenue account.\n- The unused part of the subscription revenue gets cleared from the deferred\nrevenue.\n\nIn this case, the refund reduces the external assets balance by 90 USD. The\ncustomer received 30 days of service, so you must add 30 USD back to the\nexternal refunds balance. The remainder of the deferred revenue, 60 USD in this\ncase, is also cleared. At the end of April, the summary might show:\n\nAccountDecemberJanuaryRevenue+30Deferred Revenue+60-60External\nAsset+90-90External Refunds+30\n### Free trial\n\nStripe doesn’t generate journal entries for free trials.\n\n## Limitations\n\nRevenue Recognition doesn’t support withholding taxes or commission fees\nreported by Google.\n\n## Audit numbers\n\nTo view account balances for a Google order:\n\n- Click a number in the [Monthly\nsummary](https://docs.stripe.com/revenue-recognition/reports/monthly-summary)\nsection.\n- Click the **Invoice** tab to see a list of transactions. Transactions with the\n`GPA` prefix indicate Google orders.\n- Click any Google order to enter the audit view.\n\n## Links\n\n- [Stripe’s Connector for Google\nPlay](https://docs.stripe.com/stripe-data/import-external-data/connectors/google-play)\n- [data\nimport](https://docs.stripe.com/revenue-recognition/data-import#general-import)\n-\n[delete](https://docs.stripe.com/revenue-recognition/data-import/manage-imported-data#transactions-deletion)\n- [Monthly\nsummary](https://docs.stripe.com/revenue-recognition/reports/monthly-summary)",
  "metadata": {
    "title": "Stripe Connector for Google Play | Stripe Documentation",
    "description": "Manage your revenue recognition in Stripe by importing data from Google Play.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/data-import/google-play"
  }
}