{
  "content": "# Manage fraud with Stripe Issuing controls and tools\n\n## Understand how fraud can impact your issuing program and the steps you can take to combat it.\n\nAs a payment facilitation product, Issuing inherently incurs potential fraud\nrisks and liabilities for both businesses and issuers. Because of this, you need\nto understand your responsibility for losses and how to best manage this risk as\npart of using our platform. This document provides guidance on the types of\nfraud, identifies who’s liable when fraud occurs, and outlines the resources\navailable from Stripe to assist you in monitoring for and preventing fraud.\n\n## Fraud in Issuing\n\nPayments has three primary types of fraud:\n\n- **Transaction fraud**: The unauthorized use of a payment card to fraudulently\nobtain money or property\n- **Business fraud**: A person creates a fraudulent account (often with a stolen\nidentity) to commit fraud.\n- **Account takeover (ATO) fraud**: A legitimate account owner’s login is\ncompromised by an unauthorized third party who takes actions on their account.\n\nWhile business fraud and ATO fraud can occur in Issuing, transaction fraud often\nposes a greater risk. This guide focuses on transaction fraud and the tools\navailable to help you combat it.\n\n## Transaction fraud\n\nOn Stripe Issuing, we see transaction fraud in the form of unauthorized charges\non a Stripe-issued card. Transaction fraud can occur at any point in a\ncardholder’s lifecycle. Purchases at legitimate businesses are also subject to\ntransaction fraud. An issued card can be compromised by:\n\n- Physical theft\n- Being lost by the cardholder\n- Compromised credentials through tactics such as:- Phishing\n- Spyware\n- Non-secure checkouts\n- External breaches\n\n### Loss liability\n\nLoss liability stems from an issue with a transaction that results in a\nfinancial loss for one party. Liability usually arises from either transaction\nfraud or a business not fulfilling its obligations on a purchase.\n\nLoss liability is assigned to either the merchant (the provider of the service\nor goods being purchased), you as the Stripe Issuing user, or (in rare cases)\nthe cardholder. This means that when loss liability is allocated to the\n“issuer,” you’re accountable unless an exception applies.\n\nStripe Issuing allows you to design your fraud monitoring system, and make your\nown business logic and transaction decisions. Although Stripe might offer\nassistance with transaction fraud prevention, you’re still responsible for all\nlosses where the Issuer is deemed liable. So you need to build sufficient\ncontrols to monitor, manage, and prevent fraud.\n\n### Liability assignment\n\nIn many cases, the business owns liability for fraudulent transactions. There\nare, however, a few *factors that might result in the liability shifting to\nyou*, the Stripe Issuing user.\n\n- **Card-present Transactions** If the card or a mobile wallet such as Apple Pay\nand Google Pay is present for the transaction, the issuer is generally liable\nfor fraud, with a few exceptions:\n- Cards and wallets need to be electronically read wherever available, that is,\nby using the contact or contactless chip interface or swiping the magnetic\nstripe. For manually entered card numbers, such as with mail order or telephone\norders, *liability is with the business*.\n- If a chip-enabled card is used at a terminal that only supports magnetic\nstripe payments, liability shifts to the merchant.\n\n- However, if the terminal used by the merchant generally supports chip\ntransactions, but the magnetic stripe is used for a given transaction,\n*liability remains with you, as the issuing user*.\n- **Card-not-present transactions** If the card is *not* present for the\ntransaction (that is, online commerce), *liability is determined primarily by\n3DS*.\n\n#### Note\n\n**3DS** [3DS](https://docs.stripe.com/issuing/3d-secure) is an additional layer\nof authentication that a merchant can request on authorizations it believes to\nbe high risk (and thus likely to result in the issuer being responsible for\nfraud liability in the event of a dispute). This additional layer of\nverification (usually through a form of multi-factor authentication such as a\none-time passcode) triggers a “liability shift” where fraud liability shifts\nfrom the merchant to the issuer, regardless of the circumstance.\n\nWhen 3DS is requested by a business for a specific card authorization, the\ncardholder might need to complete additional authentication to complete the\ntransaction. However, whether the authentication is triggered depends on whether\nyou’ve enrolled the card in 3DS and whether there are any exemptions or\n“frictionless” flows, which automatically bypass any configured 3DS requests.\n3DS enrollment isn’t required in the US and is turned off by default;\naccordingly, US issuers don’t consistently enroll their cards because they don’t\nwant any unnecessary friction for their cardholders. In the context of Stripe\nIssuing, when a merchant triggers 3DS, fraud liability usually automatically\nshifts to you, as the Stripe Issuing user, regardless of whether you have 3DS\nenabled on your cards. Accordingly, having 3DS enabled helps you reduce the risk\nof financial liability for fraudulent transactions. To learn more, you can [read\nabout 3DS for Stripe Issuing](https://docs.stripe.com/issuing/3d-secure).\n\n### Digital Wallet Usage\n\nRegardless of 3DS considerations, the use of a Stripe Issuing card in an Apple\nPay or Google Pay wallet for a card-not-present transaction also *shifts\nliability to the issuer*.\n\n## Transaction fraud controls and tools\n\nGiven the risk that liability transaction fraud can create, you need to take\nproactive measures to monitor for and prevent it. The following are controls and\ntools that you can add to your Stripe Issuing program. We recommend using as\nmany controls and tools as possible to limit your program’s transaction fraud\nrisk.\n\nControl/toolBenefitsDrawbacks[3D\nSecure](https://docs.stripe.com/issuing/3d-secure) (3DS)Reduces loss liability\non certain transactions by introducing an additional layer of cardholder\nverification.Cardholders experience an additional verification step for some\ntransactions.[Spending\ncontrols](https://docs.stripe.com/issuing/controls/spending-controls)Sets rules\non cards and cardholders to control spending.Limited capability to apply a\ncomplex set of rules.[Real-time\nwebhook](https://docs.stripe.com/issuing/controls/real-time-authorizations)Approves\nor rejects an authorization decision in real-time based on all data available at\nthe point of sale.Requires integration into the Stripe webhook.Stripe Defense\nLayerAutomatically blocks high-risk transactions based on Stripe’s own risk\nmodelingSome legitimate transactions might be declined.[Verification\nData](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-verification_data)Declines\nauthorizations when the CVV or expiration date don’t match on the\nauthorization.Custom configuration isn’t available.[Token\nManagement](https://docs.stripe.com/issuing/controls/token-management)Allows you\nto suspend or deactivate digital wallet tokens associated with fraudulent\nactivity.Requires integration into the Tokens API.[Card\nmanagement](https://docs.stripe.com/api/issuing/cards/object#issuing_card_object-status)Allows\nyou to suspend or deactivate physical or virtual cards associated with\nfraudulent\nactivity.None.[Disputes](https://docs.stripe.com/issuing/purchases/disputes)Disputes\ncan help you recover funds lost from unauthorized activity.Disputes aren’t\nguaranteed to result in funds recovery and may take time to resolve.\n### Proactive fraud protection controls\n\n#### KYC/KYB\n\nKnow Your Customer (KYC) or Know Your Business (KYB) is the mandatory process of\ncollecting and verifying information about the company or individual who will be\nusing the cards. Information includes the legal entity and personal information\nabout the representative of the business, as well as those who own or control\nthe business.\n\nThe easiest way to manage KYC/KYB is to integrate [Connect\nOnboarding](https://docs.stripe.com/connect/custom/hosted-onboarding), which\nlets Stripe take care of the complexity around the basic obligations.\n\n#### Spending controls\n\nSpending controls allow you to block specific countries or merchant categories\n(for example, casinos), and set spending limits per authorization (such as 100\nUSD) or per month (such as 3000 USD per month). You can apply these controls to\neither individual cards or cardholders. They’re most effective when the expected\nspending pattern is known.\n\nWe recommend implementing a combination of spending limits and merchant category\ncontrols to help limit your exposure in case of unauthorized use. For more\ninformation, see [Spending\ncontrols](https://docs.stripe.com/issuing/controls/spending-controls).\n\n#### 3D Secure\n\n3D Secure (3DS) is an additional layer of authentication used by merchants to\nmake sure an online purchase is from a legitimate cardholder. 3DS is used for\nonline transactions and only works if the merchant requests it and you have it\nenabled for your Issuing program. The additional 3DS step occurs at checkout\nwhere the cardholder is shown an authentication page and is prompted to enter a\nverification code sent to their phone or email.\n\nWe recommend enabling 3DS to reduce fraud loss exposure for online transactions.\nLearn more about [3DS and how to enable\nit](https://docs.stripe.com/issuing/3d-secure).\n\n### Real-time fraud protection controls\n\n#### Real-time webhook\n\nYou can approve or decline authorization requests in real-time based on the data\navailable to you at the point of authorization. This gives you control over\nauthorization outcomes and enables you to implement your own fraud-prevention\nlogic. Use Stripe’s real-time webhook to target a specific fraud pattern while\nminimizing the impact on other spending behaviors. For example, you can use\nauthorization data on the location of the authorization to block specific\ngeographies, currencies, and merchants. Learn more about the [real-time webhook\nand how it\nworks](https://docs.stripe.com/issuing/controls/real-time-authorizations).\n\n#### Stripe Defense Layer\n\nBy default, Stripe offers several automatic controls to help reduce your fraud\nexposure without changing loss liability. Among other considerations, Stripe\nattempts to block authorizations that:\n\n- Appear to be card testing.\n- We estimate to be extremely high risk based on our own risk modeling.\n\nThese defenses usually impact a very small subset (less than 0.5%) of\nauthorizations, are purely additive, and shouldn’t be considered a substitute\nfor your own risk management program. Ultimately, you need to identify the ideal\nbalance between user experience and risk management that works best for your\nprogram’s specific characteristics. The Stripe Defense Layer doesn’t affect\nliability.\n\n#### Fraud challenges\n\nFraud Challenges provide an additional layer of verification for users to\nconfirm purchases via SMS. This helps minimize accidental blocks of legitimate\npurchases that may initially appear high-risk. After confirming the purchase,\nthe cardholder can retry the transaction. For more information, see [Fraud\nchallenges](https://docs.stripe.com/issuing/controls/fraud-challenges).\n\n#### Authorization signals\n\nAuthorization Signals allow you to make real-time decisions to reject or approve\nan authorization, based on:\n\n- [Verification\nData](https://docs.stripe.com/issuing/controls/advanced-fraud-tools/authorization-signals#verification-data):\nWhether card values provided at checkout match with the ones on file\n- [Fraud Disputability\nAssessment](https://docs.stripe.com/issuing/controls/advanced-fraud-tools/authorization-signals#fraud-disputability-assessment):\nThe likelihood of whether an authorization can be disputed in the event of fraud\n- [High-Risk Merchant\nAlerts](https://docs.stripe.com/issuing/controls/advanced-fraud-tools/authorization-signals#high-risk-merchant-alerts):\nThe risk level of a merchant based on dispute activity\n- Card testing risk: The likelihood of a card testing attack\n\nTo learn more, see [authorization\nsignals](https://docs.stripe.com/issuing/controls/advanced-fraud-tools/authorization-signals).\n\n### Post-fraud transaction tools\n\n#### Token management\n\nManage digital wallet tokens through the API to quickly shut down digital wallet\ncards that have been associated with fraudulent activity. Read more about\n[enabling token management and the\nAPI](https://docs.stripe.com/issuing/controls/token-management).\n\n#### Card management\n\nIf you or your cardholder suspect unauthorized activity, you can temporarily\ndeactivate a card with the Dashboard or API to block further unauthorized use\nwhile you investigate. If the activity was authorized, you can preserve the\ncard’s credentials and reactivate it. Whenever you confirm unauthorized use,\nimmediately cancel the card. Read additional details on [card management and how\nto use the\nAPI](https://docs.stripe.com/api/issuing/cards/object#issuing_card_object-status).\n\n#### Disputes\n\nWhen fraudulent transactions occur, you can file disputes with Visa or\nMastercard through the Dashboard or API for those transactions with the reason\n‘Fraudulent’. In some cases, depending on what verification is conducted at the\npoint of sale, the merchant might be liable for the fraudulent transaction. Read\nmore about [handling\ndisputes](https://docs.stripe.com/issuing/purchases/disputes).\n\n## User-facing controls and education\n\nYou can adjust various aspects of Stripe’s fraud controls, and educate your\ncardholders to reduce how often they’re needed.\n\n### User configurations\n\nDepending on your use case and workflow, you can request adjustments to Stripe’s\ndefault controls, such as:\n\n- Relaxing 3DS requirements\n- Increasing transaction amount caps\n\nWhile Stripe can accommodate these requests on a case-by-case basis, you’re\nultimately responsible for any increased risk or loss liability that results\nfrom such requests.\n\n### Educate your cardholders\n\nEducate your cardholders about how to keep their card information safe. Teach\nthem to pay close attention to the activity on their accounts to increase the\nlikelihood of them—and you—catching fraudulent activity early. Make your\ncardholders aware of the following preventative measures:\n\n- **Check for card skimmers in physical stores:** Verify no cameras or skimming\nequipment are present on the payment terminal. Check for anything inserted in,\nor attached to, the card reader, ports, display, or keypad.\n- **Transact at trustworthy businesses:** Only provide your card information to\nmerchants that you’re familiar with and trust.\n- **Cancel a card as soon as it’s lost or stolen:** Take immediate action to\nprevent unauthorized use before a fraudulent actor can obtain your card\ncredentials. To continue spending, create a new card after canceling the lost or\nstolen one.\n\n## Monitor metrics\n\nThe following are metrics we recommend monitoring to help identify and measure\nfraud on your Issuing-enabled accounts.\n\n### Leading metrics\n\nLeading metrics are metrics that can help you identify potential fraud in its\nearly stages.\n\n- Authorization declines due to incorrect verification data (CVC2, expiry date),\nover time.\n- Authorization rate, over time.\n- Authorizations outside of geographic footprint, over time.\n- Authorizations by acquiring merchant country, over time.\n- Authorizations by merchant category code, over time.\n- [Force\ncaptures](https://docs.stripe.com/issuing/purchases/transactions?issuing-capture-type=force_capture),\nover time.\n\n### Lagging metrics\n\nLagging metrics are metrics that can help you assess how much fraudulent\nactivity has impacted your Issuing program:\n\n- Percentage of total spend that has been disputed for fraud, over time.\n- Dispute win-loss rate, over time.\n- Absolute dispute losses, over time.\n- Acquiring merchants with the highest percentage of transactions disputed.\n\n## Managing fraud\n\nThe potential for fraud in Issuing necessitates thorough monitoring and\nproactive fraud management. By understanding your roles and responsibilities and\neffectively leveraging Stripe’s resources, you can reduce these risks to levels\nthat you deem appropriate for your business.\n\nKeep the following in mind as you decide on your approach to fraud management:\n\n**How much fraud you should expect to see**: The average volume of monthly fraud\nvaries significantly based on industry, geography, business model, and so on.\nMost users file fraud disputes on 0.1% or less of their transaction volume, but\nit can vary greatly, depending on your issuing activity. It’s unusual to have no\nfraud whatsoever, except in rare business models or if you have low volumes.\n\n**Definition of a dispute**: A dispute occurs when an account holder challenges\na charge on their card statement with their card issuer. The reason for the\ndispute varies—the account holder might not recognize the charge, perceive it as\nfraudulent, or feel dissatisfied with the goods or services they purchased.\nDisputes can help issuers recover funds in the event of fraudulent activity.\n\n**Additional Stripe fraud signals and controls**: Stripe Issuing currently\noffers an Enhanced Risk Suite beta for API-centric users that are interested in\nusing advanced signals to help identify and prevent transaction fraud. If you’d\nlike to learn more, please [contact\nsupport](mailto:issuing-beta-feedback@stripe.com).\n\n## Links\n\n- [3DS](https://docs.stripe.com/issuing/3d-secure)\n- [Spending\ncontrols](https://docs.stripe.com/issuing/controls/spending-controls)\n- [Real-time\nwebhook](https://docs.stripe.com/issuing/controls/real-time-authorizations)\n- [Verification\nData](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-verification_data)\n- [Token Management](https://docs.stripe.com/issuing/controls/token-management)\n- [Card\nmanagement](https://docs.stripe.com/api/issuing/cards/object#issuing_card_object-status)\n- [Disputes](https://docs.stripe.com/issuing/purchases/disputes)\n- [Connect Onboarding](https://docs.stripe.com/connect/custom/hosted-onboarding)\n- [Fraud challenges](https://docs.stripe.com/issuing/controls/fraud-challenges)\n- [Verification\nData](https://docs.stripe.com/issuing/controls/advanced-fraud-tools/authorization-signals#verification-data)\n- [Fraud Disputability\nAssessment](https://docs.stripe.com/issuing/controls/advanced-fraud-tools/authorization-signals#fraud-disputability-assessment)\n- [High-Risk Merchant\nAlerts](https://docs.stripe.com/issuing/controls/advanced-fraud-tools/authorization-signals#high-risk-merchant-alerts)\n- [authorization\nsignals](https://docs.stripe.com/issuing/controls/advanced-fraud-tools/authorization-signals)\n- [Force\ncaptures](https://docs.stripe.com/issuing/purchases/transactions?issuing-capture-type=force_capture)",
  "metadata": {
    "title": "Manage fraud with Stripe Issuing controls and tools | Stripe Documentation",
    "description": "Understand how fraud can impact your issuing program and the steps you can take to combat it.",
    "sourceURL": "https://docs.stripe.com/issuing/manage-fraud"
  }
}