{
  "content": "# Revenue recognition\n\n## Learn about using the NetSuite revenue recognition engine with Stripe Billing.\n\nThe Stripe Connector for NetSuite automatically syncs data from subscription\ninvoices to NetSuite to enable revenue recognition calculation. The connector\npasses the start and end dates from the Stripe subscription periods to the\nNetSuite invoice lines.\n\n#### Note\n\nThe connector supports NetSuite Advanced Revenue Management (ARM) only. NetSuite\nclassic revenue recognition (also called legacy revenue recognition) and [Stripe\nRevenue Recognition](https://docs.stripe.com/revenue-recognition) aren’t\nsupported. If you don’t use NetSuite ARM, no action is needed from you.\n\n## How it works\n\n- During onboarding, you specify a revenue recognition rule that the connector\nuses when it creates an item. You can set up this rule using a [field\nmapping](https://docs.stripe.com/connectors/netsuite/field-mappings).\n- When the connector [creates an\ninvoice](https://docs.stripe.com/connectors/netsuite/invoice-automation) from a\nStripe subscription, it specifies a period start and end date. The connector\ncopies these dates to the NetSuite invoice at the line item level.\n- When the connector creates a full or partial refund for an invoice, the credit\nmemo created against the invoice uses the same revenue recognition schedule as\nthe invoice.\n- At the end of each accounting period, you manually create a revenue\nrecognition journal entry. When this occurs, revenue moves from the deferred\nrevenue account to your earned income account.\n\n## Revenue date range\n\nStripe and NetSuite define the revenue date range differently. While Stripe\ndefines the date range as up to *but not including* the end date, NetSuite\ndefines the date range as up to *and including* the end date.\n\nThis means the last day of the revenue period in NetSuite is one day less than\nthe corresponding end date of the revenue period in Stripe. The connector\nhandles this difference to comply with the NetSuite date range definition by\nadding a day to the Stripe end date and using that value as the NetSuite end\ndate.\n\n## Invoice and line item dates\n\nEach line item on a Stripe invoice contains a period start and end date. These\ndates get copied to the NetSuite invoice line item’s Stripe start and end dates,\nby default. If you require another set of start and end date fields in NetSuite,\nyou can create a script or workflow to copy the dates from the Stripe start and\nend dates.\n\n## Modified revenue recognition dates\n\nWhen the connector creates a NetSuite transaction based on another transaction\n(for example, a credit memo created from an invoice), the revenue recognition\nschedule copies directly from the original transaction. Because this is a\npoint-in-time copy, any subsequent changes to the revenue recognition schedule\non the new transaction won’t reflect on the original source transaction. This\napplies even if a revenue recognition journal entry hasn’t generated for the\noriginal transaction.\n\nFor example, you have an invoice in your NetSuite account with a revenue\nrecognition schedule of January 1 to June 1. If you create a credit memo for the\ninvoice on February 15 and manually update the revenue recognition dates, the\ndates on the invoice won’t change.\n\n## Closed accounting periods and earned revenue\n\nWhen using revenue recognition, open accounting periods affect how refund\nrevenue for credit memos earn over time.\n\nFor example, if the September accounting period closes before you can create the\ncredit memo, the September refund revenue moves to October. Two identical\nentries for October appear in the credit memos revenue recognition schedule.\n\nYou must create the revenue recognition journal entries before closing the\nperiod. If you don’t, the following occurs:\n\n- Refund revenue for credit memos created after the last journal entry for\ninvoices with revenue earned in the closing period won’t be accounted for.\n- Revenue in the period about to close won’t move out of the deferred revenue\naccount.\n- Revenue recognition looks like it’s attempting to book revenue for a month\nthat’s already closed.\n\n## Coupons\n\nCoupons appear as non-posting discount items. Instead of posting to an income\naccount, these items bundle with the applicable NetSuite item. When calculating\nthe revenue recognition impact for a product item in a NetSuite invoice, the\nnon-posting discount amount subtracts from the total.\n\n## Refunds and credit memos\n\nWhen the connector creates a full or partial refund for a Stripe subscription\ninvoice, it also creates a credit memo and customer refund. The credit memo uses\nthe same revenue recognition schedule as the invoice, regardless of the revenue\nalready earned on the invoice.\n\nFor example, in September you created an invoice for 120 USD with a 12 month\nstraight-line by accounting period revenue recognition schedule. The current\ndate is October 15, and the September accounting period isn’t closed yet. The\nconnector creates a credit memo for the total amount of the invoice created in\nSeptember. The revenue recognition schedule for the credit memo is the same as\nthe invoice schedule, despite different creation months. This means the credit\nmemo contains a refund of 10 USD for September and 10 USD for October.\n\n## Credit memos created by customer balance\n\nCredit memos represent the payments against an invoice by a customer balance.\nYou can recognize the credit against the invoice because the credit memo copies\nthe invoice’s revenue recognition schedule.\n\n## Manual revenue recognition\n\nYou can use the connector’s revenue recognition system without using NetSuite\nAdvanced Revenue Management (ARM). The connector can import revenue recognition\ndata (the revenue period for a specific line item) into NetSuite. Then you can\nset up manual or custom automated systems to recognize revenue.\n\n## Customize the deferred revenue account\n\nYou can customize the deferred revenue account using [field\nmappings](https://docs.stripe.com/connectors/netsuite/field-mappings). For\nexample, you might integrate the following, where the metadata value is the\ninternal ID of the deferred revenue account:\n\n```\nservice_sale_item: {\n \"metadata.netsuite_deferred_revenue_account\" : \"deferred_revenue_account_id\"\n}\n\n```\n\n## Links\n\n- [Stripe Revenue Recognition](https://docs.stripe.com/revenue-recognition)\n- [field mapping](https://docs.stripe.com/connectors/netsuite/field-mappings)\n- [creates an\ninvoice](https://docs.stripe.com/connectors/netsuite/invoice-automation)",
  "metadata": {
    "title": "Revenue recognition | Stripe Documentation",
    "description": "Learn about using the NetSuite revenue recognition engine with Stripe Billing.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/revenue-recognition"
  }
}