{
  "content": "# Requirements for online Bacs Direct Debit mandate collection\n\n## Host your own Bacs Direct Debit mandate collection form.\n\nAs a Stripe user you can host your own Bacs Direct Debit mandate collection\nforms, allowing you to customize the mandate collection process. There are\nspecific requirements around both what you need to display and what you need to\ncollect from your customers when obtaining a Bacs Direct Debit mandate from\nthem. Use the information in this document to create your own Bacs Direct Debit\ncollection form. [Contact us](https://support.stripe.com/contact).\n\n## Information to be collected from the payer\n\nCollect the following information from the payer:\n\n- Bank or building society account number\n- Sort code\n- Account holder name\n- Billing address (unless it has already been provided)\n- Agreement from the payer that they’re the account holder and only person\nrequired to authorize debits from the account, and that they understand the\nmerchant has partnered with Stripe to collect Direct Debit payments. You should\ncollect this with a checkbox next to the following wording: `I understand that\n[Merchant Name] has partnered with Stripe, who collects Direct Debits on behalf\nof [Merchant Name] and confirm that I am the account holder and the only person\nrequired to authorize debits from this account.`\n\nUse the following example form for a fictional company named ‘Rocket Rides’ as a\nreference when creating your information collection form:\n\n![Screenshot of a payment form for the fictional company Rocket Rides with\ncontextualized examples of the information you need to collect from the\npayer.](https://b.stripecdn.com/docs-statics-srv/assets/bacs-mandate-collection-example.c88809add0cd96b47eec366a89c59b35.png)\n\n## Information to be displayed to the payer\n\nDisplay the following information to the payer:\n\n- Your postal and/or customer support email address\n- Your general inquiries or customer service contact number\n- Notification of the advance notice period, which is 2 working days\n- The company name that will appear against the Direct Debit on the payer’s bank\nstatement\n- A hyperlink or unedited copy of [Stripe’s Direct Debit\nguarantee](https://stripe.com/legal/bacs-direct-debit-guarantee)\n- The entered bank details so that the payer can confirm them\n- A final screen explaining that the setup of the Direct Debit Instruction is\ncomplete and that an email confirmation will follow within 3 working days\n\nUse the following example confirmation screen for a fictional company named\n‘Rocket Rides’ as a reference when creating your own form:\n\n![Screenshot of a payment confirmation form with the payer's direct debit\ndetails.](https://b.stripecdn.com/docs-statics-srv/assets/bacs-mandate-collection-confirmation-example.4918520e67e84b054742c93925b7dff5.png)\n\n## Links\n\n- [Contact us](https://support.stripe.com/contact)\n- [Stripe’s Direct Debit\nguarantee](https://stripe.com/legal/bacs-direct-debit-guarantee)",
  "metadata": {
    "title": "Requirements for online Bacs Direct Debit mandate collection | Stripe Documentation",
    "description": "Host your own Bacs Direct Debit mandate collection form.",
    "sourceURL": "https://docs.stripe.com/payments/bacs-debit/mandate-collection-requirements"
  }
}