{
  "content": "# Import Bacs data to Stripe\n\n## Learn how to import your Bacs data from your current payment processor to Stripe.\n\nYou can migrate your data from your current payment processor to your Stripe\naccount using the Bacs bulk change process. We work with other payment\nprocessors and Bacs sponsor banks throughout the migration to securely migrate\nyour Bacs data. A Bacs migration takes at least 6 weeks to complete.\n\nTo export Bacs data from Stripe to another payment processor, see [Export Bacs\ndata from Stripe](https://docs.stripe.com/payments/bacs-debit/export-data).\n\n[Submit your Bacs import migration\nrequest](https://docs.stripe.com/payments/bacs-debit/import-data#submit-bacs-request)\nStart the migration process by submitting a data migration request.\n\n- Navigate to the [Stripe Support form for data\nmigrations](https://support.stripe.com/contact/email?topic=migrations). If\nyou’re not signed in, select **Sign in** and enter the credentials of the\naccount that you want to migrate your data to.\n- Select **Import data from a third party into a Stripe account**.\n- Select **Bacs** as the data type you want to import.\n- Complete the remaining fields and select **Send email**.\n\nWithin three days of receiving your request, our Data Migrations team emails you\nto request a signed Bulk Change Deed.\n\nYou need a Service User Number (SUN) on Stripe to migrate your Bacs data to your\nStripe account. You can either use Stripe’s shared SUN or upgrade to Custom\nBranding and use a custom SUN.\n\nSUN typeDescriptionPriceStripe’s shared SUNStripe’s name will appear on\nstatements, payment pages, and emails.FreeCustom SUNAdd your business’s name and\nbrand on statements, payment pages, and emails.50 GBP per active month\nTo use Stripe’s shared SUN, select this option when initiating your migration\nrequest.\n\nTo request your own custom SUN on Stripe:\n\n- In the Dashboard, navigate to [Payment\nMethods](https://dashboard.stripe.com/test/settings/payment_methods).\n- Expand Bacs Direct Debit and click **Configure**.\n- Select the option to upgrade your Bacs Direct Debit plan.\n- Specify your Business Display Name.\n- Specify your Business Support Email.\n- Check the box to confirm that you understand the conditions and select\n**Customise**.\n[Print, sign, and send your Bulk Change\nDeed](https://docs.stripe.com/payments/bacs-debit/import-data#sign-bulk-change-deed)\nTo complete the migration, your current Bacs provider needs to sign a bulk\nchange deed. This agreement authorizes the transfer of your mandates from your\ncurrent payment processor to Stripe.\n\n#### Caution\n\n[Sign\nin](https://dashboard.stripe.com/login?redirect=https%3A%2F%2Fdocs.stripe.com%2Fpayments%2Fbacs-debit%2Fimport-data)\nto download the Bulk Change Deed.\n\n[Determine your switch\ndate](https://docs.stripe.com/payments/bacs-debit/import-data#determine-switch-date)\nAfter we receive your Bulk Change Deed, Stripe’s Data Migrations team works with\nyou, your current payment processor, and our sponsor bank to agree on a switch\ndate. The actual import into Stripe takes place on your switch date.\n\n[Send communications to your\ncustomers](https://docs.stripe.com/payments/bacs-debit/import-data#send-communications)\nThe Letter to Payers explains why the migration is needed, how it affects\nPayers, and the Direct Debit Guarantee.\n\nDownload the pre-approved Letter to Payers template and send it to your\ncustomers at least 2 days before your switch date. You can’t make any edits\noutside of the highlighted fields. If you want to make edits to the Letter to\nPayers, a review is required by Stripe’s sponsor bank.\n\n#### Caution\n\n[Sign\nin](https://dashboard.stripe.com/login?redirect=https%3A%2F%2Fdocs.stripe.com%2Fpayments%2Fbacs-debit%2Fimport-data)\nto download the Letter to Payers template.\n\nYou can decide how to communicate the letter to your customers. For example\nemail, mail, and text message are all valid communication options. Not alerting\npayers to this change can result in failed payments and disputes.\n\nThe payer might see two references to the business in the bank portal for 1-3\nbusiness days when Stripe imports the business’s existing mandates. This is\nbecause one is the mandate with the former provider, and the other is Stripe’s\nmandate.\n\n[Wait for your data\nimport](https://docs.stripe.com/payments/bacs-debit/import-data#wait-for-import)\nYour current payment processor needs to send on your existing mandates and\npayers bank account details after we’ve gained authority for them.\n\nYour current payment processor cancels your mandates and our Data Migrations\nteam completes the import of these mandates on the agreed-upon date. Our Data\nMigrations team sends you a confirmation email when your import is complete. You\ncan’t charge your customers on your current payment processor after they cancel\nthe mandates on the switch date.\n\nThis table shows the Bacs timeline in business days from the time (T) that a\npayment is made to when a new mandate must be collected:\n\nT+0Migration complete and mandate submittedT+3Mandate is active and the payment\nis submittedT+5Funds leave the customer’s bank accountT+6Funds are available in\nStripe\nTimelines and document information might differ when exporting data from Stripe\nto a new payment processor. See [Export Bacs data from\nStripe](https://docs.stripe.com/payments/bacs-debit/export-data) for more\ninformation.\n\n### File formatting requirements\n\nExport data files must meet the following data standards for us to proceed with\nan import:\n\n- The file must be in CSV format.\n- The file must be UTF-8 encoded.\n- Delimit rows by a single newline character `\n` (not `\\r\n`).\n- Delimit columns by `,`\n- You must wrap all fields containing commas in double quotes `\"`. We recommend\nwrapping all fields in double quotes.\n- Leave empty fields entirely empty (no character in between delimiters). You\nmust *not* denote a missing field with `NULL`, `N/A`, or any other value.\n- Escape any double quotes that are part of the content with another double\nquote per the CSV RFC. For example: `\"``William` `\"\"``Bard of Avon``\"\"`\n`Shakespeare``\"`\n- Fields can’t contain newline characters (`\\r` or `\n`) within a field. Example of what to avoid: `101 1st Ave\nApt 1`\n- All rows must have the same number of columns.\n- Columns support any order.\n- You must encrypt sensitive data files with our [PGP\nkey](https://docs.stripe.com/get-started/data-migrations/pan-import#migration-pgp-key)\nbefore submitting through SFTP.\n\n## Bacs data fields\n\nFieldRequiredAdditional infoOld customer IDRequiredWe create a customer ID for\neach unique old customer ID provided.NameRequiredMust include the first and last\nname of the person on the mandate.Sort codeRequiredMust be 6 digits in length\nand include leading zeros.Account numberRequiredMust be 8 digits in length and\ninclude leading zeros.EmailRequiredStripe requires your customer’s email so we\ncan send out notifications. Contact us if your customers don’t have email\naddresses.Address line 1RequiredFirst line of the address for the customer’s\nBacs mandate.CityRequiredCity address for the customer’s Bacs\nmandate.PostalRequiredZip code of the address for the customer’s Bacs\nmandate.CountryRequiredMust be in the form of the ISO 2 letter country\ncode.PhoneOptionalPhone number of the account holder.Address line\n2OptionalSecondary details of the address for the customer’s Bacs\nmandate.StateOptionalState of the address for the customer’s Bacs mandate.DDI\ndateOptionalAdditional metadata (date the Bacs mandate was created).Date of\nfirst collectionOptionalAdditional metadata (date the mandate was first\ncharged).Stripe customer IDOptionalStripe customer ID to map the mandates to if\nrequired.Old source IDOptionalUnique representation of a payment\nmethod.Customer/Bacs MetadataOptionalAny additional metadata.\n\n## Links\n\n- [Export Bacs data from\nStripe](https://docs.stripe.com/payments/bacs-debit/export-data)\n- [Stripe Support form for data\nmigrations](https://support.stripe.com/contact/email?topic=migrations)\n- [Payment Methods](https://dashboard.stripe.com/test/settings/payment_methods)\n- [Sign\nin](https://dashboard.stripe.com/login?redirect=https%3A%2F%2Fdocs.stripe.com%2Fpayments%2Fbacs-debit%2Fimport-data)\n- [PGP\nkey](https://docs.stripe.com/get-started/data-migrations/pan-import#migration-pgp-key)",
  "metadata": {
    "title": "Import Bacs data to Stripe | Stripe Documentation",
    "description": "Learn how to import your Bacs data from your current payment processor to Stripe.",
    "sourceURL": "https://docs.stripe.com/payments/bacs-debit/import-data"
  }
}