{
  "content": "# Statement descriptors\n\n## Learn how statement descriptors work.\n\nStatement descriptors explain charges or payments on bank statements. Using\nclear and accurate statement descriptors can reduce chargebacks and disputes.\nBanks and card networks require the inclusion of certain types of information\nthat help customers understand their statements, and statement descriptors\nprovide this information.\n\nWhen you activate your account, you can set a single statement descriptor\n(static statement descriptor) that appears on all customer statements. For card\ncharges, you can also create a statement descriptor that contains a static\nprefix associated with your account but with a dynamic suffix associated with\neach charge. This enables you to specify details about the product, service, or\npayment on bank or card statements.\n\nMost banks display this information consistently, but some might display it\nincorrectly or not at all.\n\n## Statement descriptor requirements\n\nA complete statement descriptor—either a single static descriptor or the\ncombination of a prefix and suffix—must meet the following requirements:\n\n- Contains only Latin characters.\n- Contains between 5 and 22 characters, inclusive.\n- Contains at least one letter (if using a prefix and a suffix, both require at\nleast one letter).\n- Doesn’t contain any of the following special characters: `<`, `>`, `\\`, `'`\n`\"` `*`.\n- Reflects your Doing Business As (DBA) name.\n- Contains more than a single common term or common website URL. A website URL\nonly is acceptable if it provides a clear and accurate description of a\ntransaction on a customer’s statement.\n\nA static prefix, also called a shortened descriptor in the Dashboard, must\ncontain between 2 and 10 characters, inclusive. The remaining characters are\nreserved for the dynamic suffix.\n\n## Set the static statement descriptor\n\nYou set a static statement descriptor or the shortened descriptor (prefix) in\nthe [Dashboard](https://dashboard.stripe.com/settings/public). This value\nappears on all customer statements for charges or payments.\n\nA static statement descriptor is sufficient if:\n\n- Your business provides only a single product or service.\n- Your customers understand a static value for any transaction with your\nbusiness.\n- You prefer to provide the same statement descriptor for all transactions.\n\nFor card charges, consider a static prefix with dynamic suffix if:\n\n- You provide multiple products or services.\n- Your customers might not understand a single value for all their transactions\nwith your business.\n- You prefer to provide transaction-specific details on the statement\ndescriptor.\n\nYou can set both the statement descriptor for non-card charges and the shortened\nstatement descriptor for card charges.\n\nIf you set the statement descriptor and don’t set a prefix (shortened\ndescriptor), then for card payments Stripe uses the statement descriptor as the\nprefix. If the account statement descriptor is longer than 10 characters, we\ntruncate it as needed to fit the character limit.\n\n## Set a dynamic suffix\n\nDynamic suffixes are supported only for card payments. Use the suffix to specify\ndetails about the transaction so your customer can understand it clearly on\ntheir statement. The suffix is concatenated with the prefix, the `*` symbol, and\na space to form the complete statement descriptor that your customer sees.\n\nMake sure that the total length of the concatenated descriptor is no more than\n22 characters, including the `*` symbol and the space. If the prefix is\n`RUNCLUB` (7 characters), the dynamic suffix can contain up to 13 characters—for\nexample, `9-22-19 10K` (11 characters) or `OCT MARATHON` (12 characters). The\ncomputed statement descriptor is `RUNCLUB* 9-22-19 10K` or `RUNCLUB* OCT\nMARATHON`.\n\nFor card charges, providing a dynamic statement descriptor requires the\n`statement_descriptor_suffix` value. For non-card charges, if you set a value\nonly for `statement_descriptor` on a PaymentIntent, Stripe uses it in place of\nthe account statement descriptor (static descriptor).\n\nThe following examples show how to add a suffix to the PaymentIntent object.\n\n```\ncurl https://api.stripe.com/v1/payment_intents \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d amount=1099 \\\n -d currency=usd \\\n -d \"payment_method_types[]\"=card \\\n -d statement_descriptor_suffix=\"example descriptor\"\n```\n\n## Set the statement descriptor on non-card charges\n\nUse the `statement_descriptor` parameter to set the complete statement\ndescriptor for non-card charges.\n\nWhen creating a PaymentIntent, attempting to set this parameter for card charges\nresults in a 400 error. For payments made with a card, use\n`statement_descriptor_suffix` instead.\n\n## Set Japanese statement descriptors\n\nJapanese businesses can set kanji and kana statement descriptors. Providing\nclear and easy to understand statement descriptors is important to reduce\nconfusion and chargebacks. We recommend setting statement descriptors in all\nthree supported scripts (kanji, kana, and Latin characters).\n\nYou can change your account’s\n[static](https://docs.stripe.com/get-started/account/statement-descriptors#static)\nkanji and kana statement descriptors and shortened descriptors (prefix) in the\n[Dashboard](https://dashboard.stripe.com/settings/public).\n\nFor card charges, you can set [dynamic\nsuffixes](https://docs.stripe.com/get-started/account/statement-descriptors#dynamic)\nin kanji and kana on PaymentIntents and Checkout Sessions. We compute the full\ndescriptor that cardholders see by concatenating the shortened prefix and\nseparators, in the same way as `statement_descriptor_suffix`.\n\nThe following example shows how to set kanji and kana suffixes on a\nPaymentIntent.\n\n```\ncurl https://api.stripe.com/v1/payment_intents \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d amount=1000 \\\n -d currency=jpy \\\n -d \"payment_method_types[]\"=card \\\n -d statement_descriptor_suffix=\"example descriptor\" \\\n-d \"payment_method_options[card][statement_descriptor_suffix_kanji]\"=\"漢字サフィックス\"\n\\\n -d \"payment_method_options[card][statement_descriptor_suffix_kana]\"=\"カナサフィックス\"\n```\n\n### Requirements\n\nWhile Japanese statement descriptors share some requirements with [\nrequirements](https://docs.stripe.com/get-started/account/statement-descriptors#requirements),\nthe following table shows additional requirements for kanji and kana\ndescriptors.\n\nKanjiKanaMaximum total length1722Minimum prefix length12Maximum prefix\nlength1010Supported character typeKanji, kana, and LatinKanaValidation rule`< >\n\\ ' \" * ＊` are not allowedOnly kana, spaces, dashes, and dots are allowed\n#### Note\n\nTotal length is the length of either the static descriptor or the concatenated\ndescriptor (prefix + separator + suffix). Descriptors exceeding the maximum\nlength are truncated.\n\n### Issuer behavior\n\nJapanese statement descriptors are available only when both of the following are\ntrue:\n\n- The card is a Visa or Mastercard issued in Japan.\n- The charge is processed by a Japanese business or on behalf of a Japanese\nbusiness.\n\nFor applicable charges, most issuers use a Japanese statement descriptor rather\nthan a Latin one. However, it’s ultimately up to the issuer to decide whether to\nshow kanji, kana, or Latin characters on the cardholder’s statement.\n\nThe\n[calculated_statement_descriptor](https://docs.stripe.com/api/charges/object#charge_object-calculated_statement_descriptor)\nin API responses is always the Latin statement descriptor, but that doesn’t\nprevent the issuer from using a Japanese statement descriptor.\n\n### Statement descriptor display timing\n\nKanji and kana statement descriptors are sent to issuers at time of payment\ncapture. As a result, they usually take a few days to appear on cardholder\nstatements. In the meantime a temporary descriptor might be visible to\ncardholders:\n\n- **Visa, Mastercard:** The -language statement descriptor.\n- **JCB, Diners Club, and Discover:** The account’s default statement\ndescriptor.\n\n## Links\n\n- [Connect](https://docs.stripe.com/connect)\n- [Set statement descriptors with\nConnect](https://docs.stripe.com/connect/statement-descriptors)\n- [Dashboard](https://dashboard.stripe.com/settings/public)\n-\n[static](https://docs.stripe.com/get-started/account/statement-descriptors#static)\n- [dynamic\nsuffixes](https://docs.stripe.com/get-started/account/statement-descriptors#dynamic)\n- [\nrequirements](https://docs.stripe.com/get-started/account/statement-descriptors#requirements)\n-\n[calculated_statement_descriptor](https://docs.stripe.com/api/charges/object#charge_object-calculated_statement_descriptor)",
  "metadata": {
    "title": "Statement descriptors | Stripe Documentation",
    "description": "Learn how statement descriptors work.",
    "sourceURL": "https://docs.stripe.com/get-started/account/statement-descriptors"
  }
}