{
  "content": "# Before going live\n\n## Best practices to build a production-ready Stripe Identity integration.\n\n- Make sure your use case and business are supported\nReview the [supported use cases](https://docs.stripe.com/identity/use-cases) and\n[terms of service](https://stripe.com/identity/legal) to make sure that your\nbusiness can use Stripe Identity.\n- Setup branding\nThe verification experience shows your company name, logo, and color. Make sure\nto configure the [branding\nsettings](https://dashboard.stripe.com/settings/branding) for your account\nbefore going live.\n- Limit the number of submission attempts\nTo prevent fraudsters from abusing your verification flow and incurring charges\non your account, we recommend that you limit the number of times a user can\nverify themselves.\n- Limit how much sensitive information you store\nAs much as possible, store only references to the verification and use the API\nto [retrieve the\nVerificationSession](https://docs.stripe.com/api/identity/verification_sessions/retrieve)\nwhen you need access to sensitive information. This simplifies your integration\nand limits your exposure from a security perspective, and helps you comply with\nprivacy laws (such as GDPR) that require you to minimize data retention.\n- Always authenticate your user\nWe recommend that you authenticate your user before showing or sending them to\nStripe Identity. This allows you to keep relevant internal references and adds a\nlayer of security to prevent fraudsters from abusing your verification flow.\n- Provide an alternative verification method\nStripe Identity may not be able to verify all of your users. For example, your\nuser might decline to be verified using biometric technology, they might attempt\nto verify with an unsupported document type, or they might not be covered by\nIdentity’s [verification\nchecks](https://docs.stripe.com/identity/verification-checks). We recommend that\nyou provide alternative ways to verify your user, such as reaching out to your\nsupport team. In some jurisdictions, privacy laws (such as GDPR) might require\nyou to offer a non-biometric verification option for users who decline to\nconsent to using their biometric information.\n- Follow webhook best practices\nIf your integration depends on [webhooks](https://docs.stripe.com/webhooks),\nmake you sure you’ve\n[tested](https://docs.stripe.com/identity/handle-verification-outcomes#test)\nthat your integration handles Identity events correctly and that you’re\nfollowing the [Best practices for using\nwebhooks](https://docs.stripe.com/webhooks#best-practices).\n- Follow the Stripe development checklist\nFollow the [Development\nchecklist](https://docs.stripe.com/get-started/checklist/go-live) to ensure a\nsmooth transition when taking your integration live.\n- Update your privacy policy if necessary\nStripe Identity collects sensitive information, such as facial and identity\ndocument images. Make sure that your own privacy policy tells your customers\nabout all the ways you may use or reuse the collected identity data and that\nthis data is shared with Stripe. You could add the following paragraph to your\npolicy if it doesn’t already include information about how their data is\ndisclosed to Stripe:\n\nWe use Stripe for identity document verification. Stripe collects identity\ndocument images, facial images, ID numbers and addresses as well as advanced\nfraud signals and information about the devices that connect to its services.\nStripe shares this information with us and also uses this information to operate\nand improve the services it provides, including for fraud detection. You may\nalso choose to allow Stripe to use your data to improve Stripe’s biometric\nverification technology. You can learn more about Stripe and read its privacy\npolicy at https://stripe.com/privacy.\n- Provide a URL to your privacy policy\nMake sure your [account\nsettings](https://dashboard.stripe.com/settings/account?support_details=true)\ninclude a link to your privacy policy. This URL will be linked from Stripe\nIdentity.\n- Explain ID verification and Stripe Identity to your customers\nAdd information to your site answering common questions about identity\nverification and your use of Stripe Identity. See the [FAQ\ntemplate](https://docs.stripe.com/identity/explaining-identity).\n- Explain to your users how to delete their data from Stripe’s servers\nWhen your users request their data to be deleted, [redact the\nVerificationSession](https://docs.stripe.com/identity/verification-sessions#redact)\nand let your users know that they’ll need to contact Stripe support to remove\ntheir data from Stripe’s servers. You could add the following paragraph to your\napplication:\n\nWe use Stripe for identity document verification. Stripe retains a copy of all\nthe data provided as part of a verification. You may also have consented to\nallow Stripe to use your data to improve their technology. You can delete your\ninformation from Stripe’s servers or revoke your consent by visiting\nhttps://support.stripe.com.\n\n## See also\n\n- [Is my use case supported?](https://docs.stripe.com/identity/use-cases)\n- [Development checklist](https://docs.stripe.com/get-started/checklist/go-live)\n- [Take webhooks live](https://docs.stripe.com/webhooks#register-webhook)\n\n## Links\n\n- [supported use cases](https://docs.stripe.com/identity/use-cases)\n- [terms of service](https://stripe.com/identity/legal)\n- [branding settings](https://dashboard.stripe.com/settings/branding)\n- [retrieve the\nVerificationSession](https://docs.stripe.com/api/identity/verification_sessions/retrieve)\n- [verification checks](https://docs.stripe.com/identity/verification-checks)\n- [webhooks](https://docs.stripe.com/webhooks)\n- [tested](https://docs.stripe.com/identity/handle-verification-outcomes#test)\n- [Best practices for using\nwebhooks](https://docs.stripe.com/webhooks#best-practices)\n- [Development checklist](https://docs.stripe.com/get-started/checklist/go-live)\n- [account\nsettings](https://dashboard.stripe.com/settings/account?support_details=true)\n- [FAQ template](https://docs.stripe.com/identity/explaining-identity)\n- [redact the\nVerificationSession](https://docs.stripe.com/identity/verification-sessions#redact)\n- [Take webhooks live](https://docs.stripe.com/webhooks#register-webhook)",
  "metadata": {
    "title": "Before going live | Stripe Documentation",
    "description": "Best practices to build a production-ready Stripe Identity integration.",
    "sourceURL": "https://docs.stripe.com/identity/before-going-live"
  }
}