{
  "content": "# Configure the reboot time window\n\n## Customize the reboot time window for your readers.\n\nBy default, BBPOS WisePOS E and Stripe Reader S700 readers reboot every 24 hours\nat midnight. If your business is open or processing payments during this time,\nyou might want to set a custom reboot window to avoid any interruptions.\n\nYou can set a specific time period for the devices to reboot according to their\nregistered location’s local time. For example, if you register a device in a\nlocation with a local time corresponding to UTC-8:00, but it’s managed from a\nlocation in UTC-5:00, the scheduled reboot time is UTC-8:00.\n\n#### Note\n\nTo avoid disruption, not every reader in the same registered location updates\nsimultaneously. Instead, the readers reboot randomly within the configured time\nperiod.\n\nDashboardAPI\nTo change the reboot window, navigate to the relevant configuration you want to\nchange and edit it. Add a new configuration first if you don’t have an existing\none.\n\n- Navigate to the [Manage\nlocations](https://dashboard.stripe.com/terminal/locations) page.\n- Find the specific location you want to change.\n- Click the overflow menu () > **Edit configuration**.\n- Click **Edit** or **Override** next to the **Reboot time** icon.\n- Select a start and end time. If `start_hour` is less than `end_hour`, we\nconsider them as values for the same day. If `start_hour` is greater than\n`end_hour`, we consider the `end_hour` a value for the next day.\n- Click **Update**.\n- Apply the configuration changes by clicking **Apply changes** on the\nconfiguration drawer.\n\nStripe sets the new reboot window within 10 minutes. If the reader has already\nrebooted for the day, the reboot window takes effect during the next time\nperiod.\n\n## Links\n\n- [Manage locations](https://dashboard.stripe.com/terminal/locations)",
  "metadata": {
    "title": "Configure the reboot time window | Stripe Documentation",
    "description": "Customize the reboot time window for your readers.",
    "sourceURL": "https://docs.stripe.com/terminal/fleet/reboot-time"
  }
}