{
  "content": "# Advanced fraud tools\n\n## Reduce fraud with Issuing’s advanced tooling.\n\nThe Stripe Issuing advanced fraud tools help you identify and prevent\ntransaction fraud through API signals and tooling. This guide helps you\nunderstand how to use these signals and features to drive down transaction fraud\nwhile minimizing the impact on legitimate transactions.\n\n## Getting started with advanced fraud tooling\n\nAdvanced fraud tools provides resources that you can incorporate into decision\nmaking for Issuing authorizations and to prevent unauthorized use. Learn more\nabout [real time\nauthorizations](https://docs.stripe.com/issuing/controls/real-time-authorizations).\n\nUsing advanced fraud tools allows you to:\n\n- Receive signals assessing several fraud vectors on every authorization,\nallowing you to make more informed authorization approval and decline decisions.\n- Receive notifications that an issued card has been compromised, allowing you\nto proactively cancel and replace high risk cards.\n- Trigger SMS-based fraud challenges on any authorization, driving down\nfraudulent activity while mitigating the impact to legitimate transaction\nactivity.\n\n### Use signals for your authorization logic\n\nAs a first step, we recommend back-testing your authorization activity and past\ntransaction fraud against the Stripe API signals to determine the optimal\napprove and decline thresholds to set for your portfolio.\n\nWhen setting thresholds, set them for one of three outcomes, depending on the\nneeds of your business:\n\n- **Approval rate maximization**: Best if you prefer to approve more\nauthorizations, even if it means more transaction fraud.\n- **Minimize fraud**: Best if you’re trying to keep fraud to a minimum, even if\nit means good transactions are more likely to be declined.\n- **Balance of approval rate and fraud reduction**: Best if you want a blend of\nthe previous two options.\n\nIn most cases, fraud prevention and approval rate maximization are inversely\nrelated, but you might identify thresholds where you can apply both at the same\ntime, depending on your portfolio composition. If you’re a new user without much\nhistory to backtest, see our recommended thresholds to start. We recommend\nrefining these over time based on your fraud outcomes to layer in additional\nsignals or adjust the thresholds based on performance.\n\nMaximize approval rateBalance approval rate and risk preventionMaximize risk\npreventionBlock authorizations with [fraud\nscore](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-fraud_risk-fraud_score)\nabove 75Block authorizations with [fraud\nscore](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-fraud_risk-fraud_score)\nabove 50Block authorizations with [fraud\nscore](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-fraud_risk-fraud_score)\nabove 25\nYou can also test API behavior by simulating authorizations with specific fraud\nsignals in test mode through either the Issuing dashboard, or using the API.\nLearn more about [test mode](https://docs.stripe.com/test-mode).\n\nTo compare your past activity with Stripe API signals, start by identifying\ntransactions where a fraud dispute was filed, defined as having an\n[evidence.reason](https://docs.stripe.com/api/issuing/disputes/object#issuing_dispute_object-evidence-reason)\nof `fraudulent`. Then, compare that set of transactions to the set of\ntransactions flagged by each signal. The amount of overlap between them\nindicates how likely a signal is to predict future fraud disputes.\n\nMake sure to analyze a representative sample of recent transactions, but\nconsider that disputes can take several weeks to report. We recommend looking\nonly at transactions that occurred within the last 6 months, but not within the\nlast 60 days.\n\nFor example, select a 90-day period ending 60 days ago. Within that period,\ncompare the set of authorizations scored as\n[risk_level](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-fraud_risk-risk_level)\n= `high` to the set of transactions that resulted in a fraud dispute. If that\nsignal flagged 90% of transactions that resulted in a dispute, but only a small\nnumber of transactions that didn’t, then it’s probably a reliable indicator for\nyou. Alternatively, if that signal flagged only 5% of actually disputed\ntransactions, then it probably isn’t very reliable for you.\n\nWhen defining your authorization logic, implement rules that accurately prevent\nfraudulent disputes but have limited impact on legitimate authorizations. Aim\nfor a precision of ~10%, meaning that at least 1 in 10 authorizations declined\nby your logic are actually fraudulent.\n\n### Identify and replace compromised cards\n\nAdvanced fraud tools notify you through the [Cards\nAPI](https://docs.stripe.com/api/issuing/cards) when Stripe suspects an issued\ncard has been compromised, making it more likely to drive unauthorized use in\nthe future. We recommend automatically canceling and reissuing cards when this\noccurs. Learn more about [card\nreplacement](https://docs.stripe.com/issuing/manage-fraud#card-management).\n\n### Send SMS-based fraud challenges in elevated risk scenarios\n\nEven with advanced fraud tools API signals, it might not always be clear whether\nto approve or reject an authorization. For example:\n\n- Rejecting a cardholder authorization might leave them without recourse on an\nimportant purchase.\n- Cardholders do regularly engage in legitimate spend activity that might look\nanomalous (for example, a business trip abroad).\n- The authorization looks legitimate but the user is newer to your platform and\nrequires additional scrutiny.\n\nFraud challenges allow you to conduct additional verification on authorizations\nwhile mitigating the impact on good card spend. When triggered, fraud challenges\ndecline an authorization and send an SMS to a cardholder’s phone number and asks\nthe them to verify they recognize the authorization.\n\n- Unless a fraudulent actor has access to the phone number on file, they won’t\nbe able to complete this step, stopping the fraud vector.\n- If the SMS fraud challenge is successfully delivered, a legitimate cardholder\nwill be able to complete the prompt, allowing them to retry the authorization\nand get through on a second authorization attempt. This reduces the risk that\nthe cardholder gets stranded at the point of sale, unable to make an important\npurchase.\n\nLearn more about [fraud\nchallenges](https://docs.stripe.com/issuing/controls/advanced-fraud-tools#fraud-challenges).\n\n### Advanced fraud tools feature set\n\nFeatureCategoryDescription[Fraud\nchallenges](https://docs.stripe.com/issuing/controls/advanced-fraud-tools#fraud-challenges)API\ntoolingTrigger SMS-based verification of authorizations. Use this to conduct\nadditional verification of higher risk authorization activity.[Fraud risk\nassessment](https://docs.stripe.com/issuing/controls/advanced-fraud-tools#fraud-risk-assessment)Authorization\nsignalThe Stripe ML model scores the riskiness of every authorization to help\nyou assess whether to approve or reject it.[Merchant dispute\nrisk](https://docs.stripe.com/issuing/controls/advanced-fraud-tools#merchant-dispute-risk)Authorization\nsignalThe dispute risk of the acquiring business on an Issuing authorization,\nbased on Stripe’s history with the business. The higher the risk value, the more\nlikely the authorization will result in a dispute. Available at the point of\nauthorization.[Card testing\nrisk](https://docs.stripe.com/issuing/controls/advanced-fraud-tools#card-testing-risk)Authorization\nsignalThe likelihood that the authorization is part of a card testing event. The\nhigher the risk value, the higher the likelihood that card testing is taking\nplace. Available at the point of authorization.[Fraud disputability\nlikelihood](https://docs.stripe.com/issuing/controls/advanced-fraud-tools#fraud-disputability-likelihood)Authorization\nsignalThe likelihood that an authorization can be disputed in the event of\nfraud. If an authorization is likely to be disputable, your odds of recovery in\nthe event of fraud are higher. Available at the point of\nauthorization.[Compromised card\nalerting](https://docs.stripe.com/issuing/controls/advanced-fraud-tools#compromised-card-alerting)Card\nsignalThe Stripe assessment of whether card details have been compromised in a\nrisk event, putting it at increased risk for future unauthorized activity.\n## Fraud challenges\n\nFraud challenges provide you with the ability to request additional, SMS-based\nverification in situations you prefer not to outright decline potentially risky\nauthorizations.\n\nFalse positive declines can occur in fraud protection. To allow cardholders to\noverride potential false-positive declines and limit disruption, you can trigger\nSMS-based verification.\n\nSMS verification works as an override option to a decline. For cardholders, the\nprocess looks like this:\n\n- Attempt an authorization, but receive a fraud-related decline.\n- Successfully complete a fraud challenge by replying to an SMS, sent to the\ncardholder’s phone number on file with Stripe.\n- Try the authorization again and receive approval.\n\nIf you enable fraud challenges, Stripe automatically triggers SMS verification\nfor authorizations that we consider to be high risk.\n\nIf the cardholder successfully completes the verification within 60 minutes, the\nbusiness is allow-listed on that card for 7 days. Subsequent authorizations\nduring that time won’t encounter fraud-related declines.\n\nLearn more about the [fraud challenge\nflow](https://docs.stripe.com/issuing/controls/fraud-challenges).\n\n## Authorization signals\n\nDuring authorization, we provide a comprehensive set of signals that you can use\nto make informed approve or decline decisions in real-time webhook responses.\n\nSignalDescription[Fraud risk\nassessment](https://docs.stripe.com/issuing/controls/advanced-fraud-tools#fraud-risk-assessment)The\nStripe ML model scores the fraud risk of every authorization to help you assess\nwhether to approve or reject it.[Merchant dispute\nrisk](https://docs.stripe.com/issuing/controls/advanced-fraud-tools#merchant-dispute-risk)The\ndispute risk of the acquiring business on an Issuing authorization, based on\nStripe’s history with the business. The higher the risk value, the more likely\nthe authorization results in a dispute. Available at the point of\nauthorization.[Card testing\nrisk](https://docs.stripe.com/issuing/controls/advanced-fraud-tools#card-testing-risk)The\nlikelihood that the authorization is part of a card testing event. The higher\nthe risk value, the higher the likelihood that card testing is taking place.\nAvailable at the point of authorization.[Fraud disputability\nlikelihood](https://docs.stripe.com/issuing/controls/advanced-fraud-tools#fraud-disputability-likelihood)The\nlikelihood that an authorization can be disputed in the event of fraud. If an\nauthorization is likely to be disputable, your odds of recovery in the event of\nfraud are higher. Available at the point of authorization.\n## Fraud risk assessment\n\n[Request access](https://support.stripe.com/contact) if you’re interested in our\nfraud risk assessment.\n\n## Merchant dispute risk\n\nReceive detailed risk assessments of the acquiring merchant, or seller, involved\nin an authorization.\n\n### Make informed decisions based on risk level\n\nIf you have data on an acquiring merchant’s risk level and dispute likelihood,\nyou can make more informed decisions about approving authorizations. Stripe\nmakes that assessment by evaluating all of the acquiring transaction activity\nfor a business on Stripe Issuing, including data such as its historical dispute\nrate.\n\n[Merchant dispute\nrisk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-merchant_dispute_risk)\nprovides the dispute rate and risk for a given acquiring merchant across all\nStripe Issuing transaction activity. The higher the value, the more frequently\nthe merchant’s past authorizations have resulted in a dispute. This value can be\nuseful when deciding whether to approve the first purchase at a particular\nacquiring merchant by one of your cards.\n\n### Determine the risk level\n\nTo determine the risk level, examine the [merchant dispute\nrisk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-merchant_dispute_risk)\nhash. The following example demonstrates how to use each value.\n\n#### Example responses\n\nA normal risk authorization, where only 5% of past authorizations from this\nmerchant have resulted in a dispute:\n\n```\n{\n \"id\": \"iauth_1CmMk2IyNTgGDVfzFKlCm0gU\",\n \"object\": \"issuing.authorization\",\n // ...\n \"risk_assessment\": {\n \"merchant_dispute_risk\": {\n \"risk_level\": \"normal\",\n \"dispute_rate\": 5\n }\n }\n}\n```\n\nA high-risk authorization, where 57% of past authorizations from this merchant\nhave resulted in a dispute:\n\n```\n{\n \"id\": \"iauth_1CmMk2IyNTgGDVfzFKlCm0gU\",\n \"object\": \"issuing.authorization\",\n // ...\n \"risk_assessment\": {\n \"merchant_dispute_risk\": {\n \"risk_level\": \"high\",\n \"dispute_rate\": 57\n }\n }\n}\n```\n\nLearn more about [merchant dispute\nrisk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-merchant_dispute_risk).\n\n## Card testing risk\n\nCard testing is a prevalent form of fraud where fraudulent actors test stolen\ncard numbers or cycle through primary account numbers (PANs) until they find a\nvalid one. They use this valid PAN at a business with weak verification\ncontrols. To counteract this, Stripe assesses the likelihood of your involvement\nin a card testing attack, takes action on your behalf, and notifies you through\nthe API about the severity of the incident. Additionally, we assess if any cards\nmight have been compromised during the attack.\n\n### Make informed decisions based on card testing risk\n\nStripe automatically intervenes in the most obvious card testing scenarios. We\noffer a balanced approach in normal-risk situations to avoid being overly\nconservative. These cases require careful consideration of various factors,\nincluding the authorization and cardholder details. As a result, we recommend\nthe careful evaluation of all relevant considerations before making a decision\non whether to block an authorization.\n\nWe assess card testing risk by, among other things, evaluating the frequency and\nintensity of “card does not exist” declines associated with a specific bank\nidentification number (BIN) or business. These declines are the most definitive\nsignificant indicator because they often exhibit a noticeable increase in speed\nand frequency compared to regular card declines.\n\n### Determine card testing risk\n\nTo determine card testing risk, examine the [card testing\nrisk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-card_testing_risk)\nhash. The following example demonstrates how to use each value. We also provide\nthe following fields:\n\n- [Invalid account number decline\nrate](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-card_testing_risk-invalid_account_number_decline_rate_past_hour):\nThe percentage of declines because of a card number not existing in the past\nhour, taking place at the same business. Higher rates correspond to a greater\nprobability of card testing activity, meaning fraudulent actors might be\nattempting different card number combinations to guess a correct one.\n- [Invalid credentials decline\nrate](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-card_testing_risk-invalid_credentials_decline_rate_past_hour):\nThe percentage of declines because of incorrect verification data (such as CVV\nor expiry) in the past hour, taking place at the same business. Higher rates\ncorrespond to a greater probability of fraudulent actors attempting to use valid\ncard credentials at businesses with verification requirements. This value\nspiking means fraudulent actors likely have a valid PAN but can’t supply valid\nverification data.\n\n#### Example responses\n\nA normal risk authorization:\n\n```\n{\n \"id\": \"iauth_1CmMk2IyNTgGDVfzFKlCm0gU\",\n \"object\": \"issuing.authorization\",\n // ...\n \"risk_assessment\": {\n \"card_testing_risk\": {\n \"risk_level\": \"normal\",\n \"invalid_account_number_decline_rate_past_hour\": 2,\n \"invalid_credentials_decline_rate_past_hour\": 1\n }\n }\n}\n```\n\nA high-risk authorization:\n\n```\n{\n \"id\": \"iauth_1CmMk2IyNTgGDVfzFKlCm0gU\",\n \"object\": \"issuing.authorization\",\n // ...\n \"risk_assessment\": {\n \"card_testing_risk\": {\n \"risk_level\": \"highest\",\n \"invalid_account_number_decline_rate_past_hour\": 79,\n \"invalid_credentials_decline_rate_past_hour\": 83\n }\n }\n}\n```\n\nLearn more about [card testing\nrisk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-card_testing_risk).\n\n## Fraud disputability likelihood\n\nStripe’s fraud disputability assessment evaluates whether an authorization can\nbe disputed in the event of fraud.\n\n### Make informed decisions based on authorization disputability\n\nKnowing whether or not you can dispute an authorization in the event of fraud at\nthe time of authorization allows you to make informed decisions. For example,\nconsider an authorization that’s otherwise classified as “normal risk”:\n\n- If you know that you can dispute the authorization if fraud occurs, you can\napprove it.\n- If you know that you can’t dispute the authorization (if fraud occurs), you\ncan opt to decline it or trigger a fraud challenge for additional verification.\n\nStripe assesses the disputability likelihood by comparing the characteristics of\nthe authorization (such as whether 3DS was used or if the card was present with\na chip). We make this assessment against network rules for disputes to\nproactively determine what would happen in the event of a dispute.\n\n### Determine the likelihood that a dispute can be filed\n\nTo determine the disputability likelihood of an authorization in the event of\nfraud, examine the [fraud disputability\nlikelihood](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-fraud_disputability_likelihood)\nfield. This field populates with various enums that inform you about whether you\ncan dispute the authorization. We label every authorization as `very_likely`,\n`neutral`, `very_unlikely`, or `unknown`:\n\n- When authorizations receive a score of `very_likely`, it’s highly probable\nthat disputes filed based on these authorizations are accepted by the card\nnetwork. The card network rarely rejects `very_likely` authorization disputes.\nWhen they do, it’s typically because of exceptional circumstances. These\ncircumstances might include a card filing a fraud dispute for the second time or\nexceeding the allowable number of disputes for a card within a specific\ntimeframe defined by Visa or MasterCard.\n- When authorizations receive a score of `very_unlikely`, disputes are almost\nalways automatically rejected by the card network.\n- When authorizations receive a score of `neutral`, Stripe assesses that the\ndispute outcome depends on various factors. Historically, these disputes are\nmore likely to be accepted by the card network. However, this behavior might\nchange at any given point.\n\nMost issuing activity is classified as `very_likely`, but how often each of\nthese values populate depends on the composition of your issuing activity. For\nexample, online authorizations are more likely have `very_likely` values than in\nperson authorizations. Learn more about [fraud disputability\nlikelihood](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-fraud_disputability_likelihood).\n\n## Compromised card alerting\n\nStripe notifies you through the API when we believe a card might have been\ncompromised. This helps you know when to cancel and reissue a card, file\ndisputes, or notify a cardholder.\n\n### Prevent subsequent abuse and initiate cardholder communications\n\nCanceling a card suspected to be compromised can help you prevent future\nfraudulent use of PANs that have been compromised. You can use these indicators\nto initiate communications and a reissuance workflow for cardholders. If Stripe\nobserves that a card has been compromised in a risk event, we flag the card as\ncompromised.\n\n### Mitigate risk and take action\n\nWhen Stripe determines that a card number or PAN has likely been compromised in\none or more of the following risk events, Stripe marks the card as compromised.\n\n- A card testing attack where a successful authorization took place\n- The cardholder verified through SMS that they didn’t attempt a past\nauthorization on the card\n- A fraud dispute has been filed on the card in the past\n- The PAN was found in a dark web search\n\nWhen a risk event takes place, we update the [fraud\nwarning](https://docs.stripe.com/api/issuing/cards/object#issuing_card_object-fraud_warning)\nhash to notify you. The\n[started_at](https://docs.stripe.com/api/issuing/cards/object#issuing_card_object-fraud_warning-started_at)\nvalue corresponds to the date that the risk event took place. If a subsequent\nrisk event takes place, both values update to reflect the most recent event.\n\nIf either value is populated, we recommend contacting the cardholder, canceling\nthe card, and issuing a new one. This mitigates the risk of subsequent\nunauthorized use on what a fraudulent actor likely assumes is a valid PAN that\nthey can make purchases with.\n\n### Using advanced fraud tools through the Stripe Dashboard\n\nIf you want to use the authorization signals of advanced fraud tools for fraud\nprevention through the Stripe Dashboard, Stripe offers a rules engine. To\nrequest access, please contact Stripe using the contact form at [Stripe\nSupport](https://support.stripe.com/?contact=true).\n\n## Links\n\n- [real time\nauthorizations](https://docs.stripe.com/issuing/controls/real-time-authorizations)\n- [fraud\nscore](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-fraud_risk-fraud_score)\n- [test mode](https://docs.stripe.com/test-mode)\n-\n[evidence.reason](https://docs.stripe.com/api/issuing/disputes/object#issuing_dispute_object-evidence-reason)\n-\n[risk_level](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-fraud_risk-risk_level)\n- [Cards API](https://docs.stripe.com/api/issuing/cards)\n- [card\nreplacement](https://docs.stripe.com/issuing/manage-fraud#card-management)\n- [fraud\nchallenges](https://docs.stripe.com/issuing/controls/advanced-fraud-tools#fraud-challenges)\n- [fraud challenge\nflow](https://docs.stripe.com/issuing/controls/fraud-challenges)\n- [Request access](https://support.stripe.com/contact)\n- [Merchant dispute\nrisk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-merchant_dispute_risk)\n- [card testing\nrisk](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-card_testing_risk)\n- [Invalid account number decline\nrate](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-card_testing_risk-invalid_account_number_decline_rate_past_hour)\n- [Invalid credentials decline\nrate](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-risk_assessment-card_testing_risk-invalid_credentials_decline_rate_past_hour)\n- [fraud disputability\nlikelihood](https://docs.stripe.com/api/issuing/authorizations/object#issuing_authorization_object-fraud_disputability_likelihood)\n- [fraud\nwarning](https://docs.stripe.com/api/issuing/cards/object#issuing_card_object-fraud_warning)\n-\n[started_at](https://docs.stripe.com/api/issuing/cards/object#issuing_card_object-fraud_warning-started_at)\n- [Stripe Support](https://support.stripe.com/?contact=true)",
  "metadata": {
    "title": "Advanced fraud tools | Stripe Documentation",
    "description": "Reduce fraud with Issuing’s advanced tooling.",
    "sourceURL": "https://docs.stripe.com/issuing/controls/advanced-fraud-tools"
  }
}