{
  "content": "# Adobe Commerce Connector version history\n\n## Learn about backward compatibility changes in Adobe Commerce Connector versions (Magento 2).\n\n## Version 4.1\n\nVersion 4.1.0 introduces changes to handle scenarios where orders could be\nplaced and invoiced without collecting payment. These scenarios include:\n\n- Purchases of trial subscriptions.\n- Subscriptions with future start dates.\n- Upgrades or downgrades of existing subscription plans.\n\nPreviously, the module automatically refunded and closed these orders with an\noffline credit memo. Now, to improve tax reporting:\n\n- Automatic refunds are deprecated.\n- Order items in these scenarios have a custom price of 0.\n- These items are excluded from shipping amount calculations.\n\nThis results in orders with zero subtotal, shipping, and tax amounts. When\nregular products are purchased with subscriptions, the subtotal, shipping, and\ntax amounts only reflect the regular order items. These changes ensure the order\ngrand total matches the collected payment amount on the order date.\n\nAdditionally, version 4.1 changes how partial captures and refunds are handled:\n\n- Previously, partial captures or refunds from the Stripe dashboard\nautomatically created invoices or credit memos in Magento.\n- These documents didn’t include order items, using manual totals or adjustment\nfees or refunds instead.\n- This approach caused issues with tax reporting.\n\nIn version 4.1:\n\n- Only full captures and full refunds result in automatic invoices or credit\nmemos.\n- For partial captures or refunds, merchants should use the Magento admin panel.\n- This ensures correct tax breakdown on documents and accurate reporting to the\nStripe API.",
  "metadata": {
    "title": "Adobe Commerce Connector version history | Stripe Documentation",
    "description": "Learn about backward compatibility changes in Adobe Commerce Connector versions (Magento 2).",
    "sourceURL": "https://docs.stripe.com/connectors/adobe-commerce/payments/versions"
  }
}