{
  "content": "# Acceptance analyticsPublic preview\n\n## Understand what influences card payment acceptance, reasons behind payment failures or declines, and ways to maximize your payment success rate.\n\nOn the [Payments analytics](https://dashboard.stripe.com/acceptance) page in the\nStripe Dashboard, you can analyze your payment success rate, authorization rate,\nand payments to find out where exactly payments fail, why they fail, and how to\nuse this information to increase your revenue. To view your analytics, go to\n**Payments** > **Analytics** >\n[Acceptance](https://dashboard.stripe.com/acceptance).\n\n#### Public preview\n\n[Payments analytics](https://dashboard.stripe.com/acceptance) is in public\npreview. If you want access to the public preview, we invite you to [join the\nwaitlist](https://docs.stripe.com/payments/analytics).\n\n## Understand payment attempts\n\nWhen your customers attempt to pay, Stripe sends the charge details through the\ncard networks, like Visa, Mastercard, or China UnionPay. The card networks then\nsend the requests to the relevant card issuing banks, who either [authorize or\ndecline](https://docs.stripe.com/declines) the payments.\n\nA payment attempt can fail at multiple stages, even before a payment is sent to\nthe card network. For example, it might fail 3D Secure authentication (3DS) or\nbe blocked by [Stripe Radar](https://docs.stripe.com/radar). After the payment\nis sent to the card network, issuers can decline it for several reasons, such as\na lack of sufficient funds on the card account or incorrect card information.\nOccasionally, issuers incorrectly decline legitimate payments for suspected\nfraud.\n\nPayments analytics provides the following data for card payments:\n\n- Payment success and network authorization rate, which you can view as either\nraw or deduplicated\n- Pivot charts for common dimensions (also available as filters)\n- Reasons for failed payments (authentication issue, blocked, or card network\ndecline reasons)\n- The uplift provided by Stripe’s payments optimizations features\n\n## Available data\n\nData on this page includes attempted and authorized card payments. Authorized\nvolume figures don’t take into account whether the payments were ultimately\ncaptured. Learn more about the distinction between [authorization and\ncapture](https://docs.stripe.com/payments/place-a-hold-on-a-payment-method).\n\n## Configure your data set\n\nThe filters at the top of the Payments analytics page apply to all metrics,\ncharts, and tables on the page.\n\nStripe processes your data daily starting at 12:00 am UTC and ending at 11:59pm\nUTC. All data shown is in the UTC time zone.\n\n### Specify currency\n\nThe `Currency` filter is set to your settlement currency by default. To change\nthe currency, click **Currency** , and select the currency you want from the\nlist.\n\n## Download acceptance data\n\nYou can download all of the data used to generate the report. To download these\nanalytics, click **Download** at the top of each chart.\n\nDownloads provide payments that match the filters at the top of the report. The\ndownload dialog is only set to one currency filter (by default, the currency of\nthe business).\n\nIf you’re a [Sigma\nuser](https://docs.stripe.com/stripe-data/access-data-in-dashboard), you can\nview your data in Sigma, and have access to the specific queries used to\ngenerate each chart.\n\n### Specify Connect\n\nConnect platforms see direct charge activity aggregated across all of their\nconnected accounts. Use the **Connected accounts** filter at the top of the\nreport to include connected account data or to exclude it and display only\nplatform data. Data from Standard accounts is only visible to platforms if\n[Platform\ncontrols](https://docs.stripe.com/connect/platform-controls-for-stripe-dashboard-accounts)\nare enabled.\n\n## Metrics definitions\n\nYou can review your analytics with two metrics: payment success rate or\nauthorization rate.\n\n### Payment success rate\n\nPayment success rate measures the success of all payment attempts through all\nstages of the payment process: 3D Secure authentication, Stripe or Radar blocks,\nand card network authorization. It’s the number of charges authorized by the\ncard network divided by the number of unique payment attempts submitted through\nStripe. We include all payment attempts except [invalid API\ncalls](https://docs.stripe.com/declines#invalid-api-calls).\n\n### Authorization rate\n\nThe network authorization rate measures the success of payment attempts that\nreach the card networks. It is the number of payments authorized by the card\nissuer divided by the number of unique payment attempts submitted to the card\nnetwork for authorization. We don’t include [invalid API\ncalls](https://docs.stripe.com/declines#invalid-api-calls), payments that fail\n3D Secure authentication, and [blocked\npayments](https://docs.stripe.com/declines#blocked-payments) in the denominator\nbecause these failures occur before Stripe sends the authorization request to\nthe issuer.\n\n## Comparison chart\n\nThe following table shows which types of payment attempts are included in the\ntwo metrics.\n\nPayment success rateAuthorization rateInvalid API requestsFailed 3D Secure\nauthentication paymentsBlocked paymentsIssuer declinesAuthorized payments\n## Example calculations\n\nThe following is an example authorization rate calculation for authorization\nrate and payment success rate.\n\nCalculation componentComponent valueTOTAL PAYMENT REQUESTS TO\nSTRIPE103,000Invalid API requests(3,000)Valid API requests100,000Failed\nauthentication attempts(1,000)Blocked payment attempts(1,000)Total payment\nattempts that reach card network98,000Authorized payments93,000Payment Success\nRate93% = (93,000 / 100,000)Network Authorization Rate94.9% = (93,000 / 98,000)\n## Deduplicated versus raw rates\n\nSome payment attempts are repeat attempts of the same unique purchase; for\nexample, a customer’s original payment attempt is declined because they entered\nthe wrong CVC and they later resubmit the payment after correcting their error.\nWe include all attempts except invalid API requests in the calculation. The raw\nrate counts all of these attempts to make the same purchase, whereas the\ndeduplicated rate groups the retried attempts together and calculates the\nacceptance rate based on the final outcome.\n\nThe following tables shows example calculations using deduplicated rate and raw\nrate.\n\nRaw rateDeduplicated rateCalculation stepResultPayment A, Attempt 1FailedPayment\nA, Attempt 2FailedPayment A, Attempt 3AuthorizedRaw Rate (Counts all\nattempts)33.3% = (1 / 3) (1 authorized attempt / 3 total attempts)\nWhen looking at deduplicated rates, you might see a temporary drop in your\nsuccess or authorization rates for the past month if not all payment retries\nhave been attempted yet.\n\nYou can also schedule repeat attempts yourself, a practice known as “dunning,\"\nwhich is common for businesses with recurring revenue. If you perform dunning\nthrough [Stripe Billing](https://docs.stripe.com/billing), Stripe highlights the\naffected portion of the chart using your Billing settings.\n\n### How Stripe identifies repeat attempts\n\nFor payments through [Stripe Invoices](https://docs.stripe.com/api/invoices), we\ngroup attempts on the same Invoice together. For payments with\n[Customers](https://docs.stripe.com/api/customers), we group attempts on the\nsame Customer if they’re attempted close to each other in time and for the same\namount. For all other payments, we group on the same card number for attempts\nclose to each other in time and for the same amount.\n\n## Key metrics report\n\nThis report shows the key metrics for your chosen filters, including the rate,\nnumber of authorized payments, and payment volume that was authorized. The time\nseries compares the rate to a `previous_period`, which you can customize. By\ndefault, the comparison period starts right before your chosen timeframe and\nrepresents the same length of time.\n\n## Payments report\n\nThe Payments report allows you to view card acceptance metrics across several\ncommon acceptance-driving dimensions. Each of the top-level filters has a\ncorresponding pivot chart. Pairing the filtering capabilities with the pivot\ncharts in the Payments chart provides a view that lets you monitor how different\ngroups of payments perform over time. You can switch through each tab to compare\nrates, payment count breakdowns (in absolute numbers or as a share of payments),\nand payment volumes.\n\nUse all of these tabs to see how changes in the rate relate to changes in\npayment counts or volume. You can dig deeper into any trends you want to explore\nwith Sigma or use the itemized download to filter across available charge\nattributes. For example, [card\ntesting](https://docs.stripe.com/disputes/prevention/card-testing) can lead to a\nreduction in the rate and a sudden spike in payment count.\n\nAnalyze payments across many options, such as which card brands, countries, or\ninput methods your customers use to pay.\n\n### Card type\n\nOn average, credit success rates are higher than debit success rates, which in\nturn are higher than prepaid success rates. This is usually because payments\nmade with debit and prepaid cards are more likely to be declined for having\ninsufficient funds to complete the purchases.\n\n### Card country\n\nCard country refers to the country of the card issuer, rather than the physical\nlocation of your customer at the time of payment. On average, domestic success\nrates are higher than those on cross-border payments (where the card country and\nyour business are located in different regions). This pivot may also help you\nidentify where your customers are based.\n\n### Transaction type\n\nThe card networks divide card payments into two types, depending on whether the\ncustomer is participating in the payment flow: [Customer-Initiated Transactions\n(CITs) and Merchant-Initiated Transactions\n(MITs)](https://docs.stripe.com/payments/cits-and-mits). Card issuers assign\ndifferent characteristics and risk profiles to these transaction types, so there\ncan be varying success rates between the two.\n\n### Input method\n\nDigital wallets such as Apple Pay and Android Pay typically have higher success\nrates than normal online card charges because they’re tokenized and\ndevice-authenticated, creating a higher level of trust for the card issuer.\n\nIf you use [Stripe Terminal](https://docs.stripe.com/terminal), you might also\nsee **Card present** as an input method option, which represents in-person\npayments. Industry-wide, card present success rates are typically higher than\ncard not present ones. The physical card must be present at the time of purchase\nfor in-person payments, so these payments often have lower risk profiles for\ncard issuers than online payments do.\n\n### Saved card status\n\nYou can use previously saved card details to charge customers later. This is\nmost often used for subscriptions. A saved card is also referred to as a\nCredential-on-File (CoF). Success rates are typically higher for saved cards\nthan non-saved cards.\n\n### Postal code response\n\nAddress Verification Service (AVS) is an identity verification tool that allows\nbusinesses to detect and prevent potentially fraudulent credit or debit card\npayments by comparing the billing address provided by a customer with the\nbilling address on-file with the customer’s card issuer, to confirm they match.\nAddress verification is primarily supported by card issuers in the United\nStates, Canada, and the United Kingdom.\n\nThe following table shows example values for the Postal code response metric.\n\nValueDefinitionNot sentPostal code was not sent to the card networksPassedPostal\ncode was sent to the card networks and passed validationFailedPostal code was\nsent to the card networks and failed validationUncheckedPostal code was sent to\nthe card networks but no validation was performed\n### CVC response\n\nThe [CVC](https://docs.stripe.com/disputes/prevention/verification#cvc-check)\n(also referred to as CVV) is the three- or four-digit verification number\nprinted directly on a card, usually on the signature strip or the front of the\ncard. When a card payment is submitted to a card network for authorization,\nStripe sends the CVC if it is provided . Similar to AVS, the card issuer checks\nthe CVC against the information they have on-file for the customer as an\nadditional verification. If the provided information doesn’t match, the CVC\nverification check fails, which may result in a declined payment. A failed CVC\ncheck can indicate the payment is fraudulent, so review it carefully before\nfulfilling the order.\n\nThe following table shows example values for the CVC response metric.\n\nValueDefinitionNot sentCVC was not sent to the card networksPassedCVC was sent\nto the card networks and passed validationFailedCVC was sent to the card\nnetworks and failed validationUncheckedCVC was sent to the card networks but no\nvalidation was performed\n### Network token usage\n\nA [network\ntoken](https://stripe.com/guides/understanding-benefits-of-network-tokens#what-are-network-tokens)\n(NT) is a non-sensitive, 16-digit numeric substitute for a “front-of-card”\nnumber also referred to as a primary account number (PAN). When paired with a\ncryptogram, a network token can be sent to the card network in the authorization\nmessage instead of a PAN.\n\nUnlike PANs, network tokens are payment credentials that can be dynamically\nrestricted to specific businesses and channels, reducing the risk and impact of\npotential security breaches and intrusions. Businesses also use NTs for\nauthorization rate uplift; networks contain the latest mapping between NTs and\nPANs, so Stripe can continue to use the same NT even if the underlying PAN\nchanges, and avoid declines on legitimate payment attempts.\n\n### Further analyze “other”\n\nFor dimensions with several options, the pivot chart will include an “other”\ncategory to group the low volume data points that aren’t represented on the\nchart. For example, you might want to see the full set of card issued countries\nin your data. To do so, you can view the data in Sigma or download the data.\n\n## Failed payments\n\nUse this chart to find out why payments failed or declined.\n\n### Before the payment is sent to the card network\n\nThe following sections describe failures that occur before the payment is sent\nto the card network.\n\n#### Authentication failed\n\nYou can request payments\n[authentication](https://docs.stripe.com/payments/3d-secure/authentication-flow)\nwith 3D Secure (3DS) using the API or with a Radar rule. Stripe might also\ntrigger 3DS to comply with certain regulations, such as [Strong Customer\nAuthentication (SCA)](https://stripe.com/guides/strong-customer-authentication)\nrequirements in Europe. The failed authentication payment requests represent\nsituations where the customer didn’t finish the steps for authentication or\nfailed the authentication for other reasons. To learn more about authentication\nfailures, see [Payment analytics](https://docs.stripe.com/payments/analytics).\n\n#### Block payments by reason\n\nStripe Radar blocks high-risk payments, such as those with mismatched CVC or\npostal code values. This automated fraud prevention product evaluates each\npayment, without requiring any action from you. The blocked payments represent\nthe ones blocked by Stripe, obtaining initial authorization from the card issuer\nbut refrains from charging the card. This precaution helps prevent potential\nfraudulent payments that might lead to disputes. See Blocked payments by reason\nbelow for more information about block reasons.\n\n### After the payment is sent to the card network\n\nThe following sections describe failures that occur after the payment is sent to\nthe card network.\n\n#### Issuer declines\n\nWhen a payment request is submitted to the card issuer, they use automated\nsystems and models to determine whether to authorize it. If the issuer declines\na payment, Stripe shares the [reason](https://docs.stripe.com/declines/card) the\nissuer gave for the decline. In some cases, the issuer provides specific reasons\nfor the decline with a [decline code](https://docs.stripe.com/declines/codes).\nHowever, many payments are categorized into generic declines (the most common of\nwhich is `do_not_honor`). Card issuers can only discuss the specifics with their\ncardholders, not with you or Stripe, for privacy and security.\n\nFor most businesses, the most common decline reasons provided for issuer\ndeclined payments fall into a few categories. Below are explanations and\nrecommended actions to take for some common network decline reasons. To learn\nmore about the full list of potential reasons why card issuers decline payments,\nsee [decline codes](https://docs.stripe.com/declines/codes).\n\n- **Insufficient funds**: The account doesn’t have sufficient funds to cover the\npayment amount at the time of authorization. Prompt the customer to try a\ndifferent payment method, or obtain approval from the customer to retry the\npayment at a later date.\n- **Do not honor and other generic responses (like Generic decline or Service\nnot allowed)**: The issuer has chosen not to provide the specific reason for\ntheir decision. Prompt the customer to contact their card issuer for more\ninformation, or to try a different payment method. Retrying the payment yourself\nmight also be successful.\n- **Incorrect number, incorrect CVC, and other incorrect card information\nresponses**: The customer has entered incorrect card information or card\ninformation that’s no longer valid. Make sure you have [automatic card\nupdates](https://docs.stripe.com/saving-cards#automatic-card-updates) enabled.\nContact the customer through multiple channels, such as email, text messages, or\nin-app notifications to re-enter their payment details or contact their card\nissuer if problems persist. Otherwise, try a different payment method.\n- **Transaction not allowed**: The issuer has declined the payment for\nunspecified reasons, which might be related to the card, or might be\npayment-specific. In the latter case, the merchant spend category might not be\nallowed on the card for example (such as FSA cards for ineligible items). The\ncustomer should contact their card issuer for more information (retries are\nunlikely to be successful until the issuer has been contacted) or try a\ndifferent payment method.\n- **Lost card or Stolen card**: The customer has reported the card as either\nlost or stolen. Retries won’t be successful, and the customer should contact\ntheir card issuer for more information. Don’t report the specific reason to the\ncustomer in case the legitimate cardholder isn’t the one attempting the\npurchase.\n\n## Blocked payments chart\n\nUse this chart to learn why some payments were blocked.\n\n### Rule match - Radar\n\nSome payments are blocked because of a rule that you configured in Radar. This\ndoesn’t include payments that Radar blocked by default because of their risk\nscore.\n\n### Post authorization rule match - Radar\n\nSome payments are blocked after the card issuer has authorized the payment\nbecause of a configured rule in Radar. Specifically, Radar rules that require a\nresponse from the card issuer, such as ensuring postal code or CVC match what\nthe card issuer had on-file. This doesn’t include payments that Radar blocked by\ndefault because of their risk score.\n\n### High risk - Radar\n\nSome payments are blocked by Radar by default because of their risk score. Radar\ndetermines this score using machine learning, and you can adjust the minimum\nscore that it blocks by default. There are some Radar rules that block payments\nafter they have been authorized.\n\n### Stripe\n\nSome payments are blocked by Stripe for other reasons not included above. For\nexample, the payment was initiated by a card on deny-lists that are globally\nknown to be fraudulent, or a payment made from sanctioned countries.\nAdditionally, Stripe may block payments that are suspected to be connected to\n[card testing](https://docs.stripe.com/disputes/prevention/card-testing).\n\n## Payment optimizations chart\n\nStripe’s [solutions for maximizing authorization\nrates](https://stripe.com/guides/optimizing-authorization-rates#how-stripe-can-help)\nhelp prevent legitimate charges from being declined. These features include\nAdaptive Acceptance, Card account updater, and Network tokens.\n\n### Adaptive Acceptance\n\nIf Stripe receives a decline response from the issuer, machine learning models\nimmediately evaluate if Stripe should retry the request, and how to adjust the\nauthorization request to improve the likelihood of acceptance. This retry\nrequest happens in real time before Stripe returns a charge response to you. The\nuplift shown in this report is from payments that Adaptive Acceptance\nsuccessfully retried after an initial issuer decline.\n\n### Card account updater\n\nCard numbers and expiration dates regularly change, so outdated card information\nis a common source of declines for online businesses. Stripe integrates with\nmajor card networks to update saved card payment information automatically to\nmake sure you have the latest card details. The uplift shown in this report is\nfrom successful payments on cards that were updated within 180 days of the\npayment date.\n\n### Network tokens\n\nNetwork tokens are secure payment credentials that serve as substitutes for card\nnumbers. Network tokens ensure that you process payments with the most\nup-to-date credentials, because they stay current even if the underlying card\ndata changes. Stripe has built integrations with major card networks to tokenize\nyour cards, and machine learning models to determine when to use a network token\nto provide you the maximum success rate. The uplift shown in this report is from\nsuccessful payments run with network tokens that received updates to the\nunderlying credentials within 180 days of the payment date.\n\n## See also\n\n- [Glossary](https://docs.stripe.com/payments/analytics/glossary)\n- [Authentication\nanalytics](https://docs.stripe.com/payments/analytics/authentication)\n- [Payment methods\nanalytics](https://docs.stripe.com/payments/analytics/payment-methods)\n\n## Links\n\n- [Payments analytics](https://dashboard.stripe.com/acceptance)\n- [join the waitlist](https://docs.stripe.com/payments/analytics)\n- [authorize or decline](https://docs.stripe.com/declines)\n- [Stripe Radar](https://docs.stripe.com/radar)\n- [authorization and\ncapture](https://docs.stripe.com/payments/place-a-hold-on-a-payment-method)\n- [Sigma user](https://docs.stripe.com/stripe-data/access-data-in-dashboard)\n- [Platform\ncontrols](https://docs.stripe.com/connect/platform-controls-for-stripe-dashboard-accounts)\n- [invalid API calls](https://docs.stripe.com/declines#invalid-api-calls)\n- [blocked payments](https://docs.stripe.com/declines#blocked-payments)\n- [Stripe Billing](https://docs.stripe.com/billing)\n- [Stripe Invoices](https://docs.stripe.com/api/invoices)\n- [Customers](https://docs.stripe.com/api/customers)\n- [card testing](https://docs.stripe.com/disputes/prevention/card-testing)\n- [Customer-Initiated Transactions (CITs) and Merchant-Initiated Transactions\n(MITs)](https://docs.stripe.com/payments/cits-and-mits)\n- [Stripe Terminal](https://docs.stripe.com/terminal)\n- [CVC](https://docs.stripe.com/disputes/prevention/verification#cvc-check)\n- [network\ntoken](https://stripe.com/guides/understanding-benefits-of-network-tokens#what-are-network-tokens)\n-\n[authentication](https://docs.stripe.com/payments/3d-secure/authentication-flow)\n- [Strong Customer Authentication\n(SCA)](https://stripe.com/guides/strong-customer-authentication)\n- [reason](https://docs.stripe.com/declines/card)\n- [decline code](https://docs.stripe.com/declines/codes)\n- [automatic card\nupdates](https://docs.stripe.com/saving-cards#automatic-card-updates)\n- [solutions for maximizing authorization\nrates](https://stripe.com/guides/optimizing-authorization-rates#how-stripe-can-help)\n- [Glossary](https://docs.stripe.com/payments/analytics/glossary)\n- [Authentication\nanalytics](https://docs.stripe.com/payments/analytics/authentication)\n- [Payment methods\nanalytics](https://docs.stripe.com/payments/analytics/payment-methods)",
  "metadata": {
    "title": "Acceptance analytics | Stripe Documentation",
    "description": "Understand what influences card payment acceptance, reasons behind payment failures or declines, and ways to maximize your payment success rate.",
    "sourceURL": "https://docs.stripe.com/payments/analytics/acceptance"
  }
}