{
  "content": "# Managing customer supportPrivate preview\n\n## Support your Capital customers using Stripe-approved messaging.\n\nStripe handles all servicing cases and is the first line of support for your\nusers’ inquiries. In every outreach we send to users, we include a support email\n([capital+support@stripe.com](mailto:capital+support@stripe.com)) they can\ncontact if they have questions. All Stripe interfaces also include this support\nemail.\n\nThe servicing functions that Stripe handles include:\n\n- Reviewing applications\n- Collecting payments\n- Maintaining records of payments and balances\n- General administration of the financing\n- Responding to any borrower inquiries\n- Following up on any delinquencies\n\nIf your support team chooses to field basic, frontline user inquiries, we offer\npre-approved, compliant training materials and templates to create public\nsupport references. Refer to the [approved support\nresponses](https://docs.stripe.com/capital/servicing#approved-support-responses)\nfor these materials.\n\n## Approved support responses\n\nUse the following approved support responses to establish documentation and\ntemplates for user communication hosted on your site.\n\n#### Note\n\nFor any material changes to this content, submit your materials to the [Change\nRequest\nForm](https://form.asana.com/?k=8K51UWmWhttehNFD5qBLdg&d=974470123217835)) in\nthe following supported formats: Google Doc or PDFs. All user-facing materials\nneed to be approved by our product legal team, compliance team, and banking\npartner before being sent to users.\n\n[Pre-approved FAQ](https://docs.stripe.com/capital/servicing#pre-approved-faq)\nUse the following pre-approved copy for FAQs hosted on your website or your user\ndashboard.\n\n**How do you determine who qualifies for an offer?**\n\nEligibility is determined based on a combination of factors, including overall\nsales volume and history with [Brand Name]. Eligible US businesses will receive\nan email [and Dashboard notification] if they have an offer available.\n\n**Do I have to pay interest?**\n\nNo, you’ll pay one flat fee that does not change. You won’t pay any interest on\ntop of this fee.\n\n**Will applying for an offer affect my personal credit rating?**\n\nNo, there is no personal credit check. All offers are based on your history with\n[brand name].\n\n**Can I request a different offer amount?**\n\nWhen you log into your [brand name] Dashboard, you can use a slider to choose a\ncustom amount (up to the maximum offer amount). The loan fee and repayment rate\nadjust based on the amount you choose.\n\n**When do I need to pay the flat fee?**\n\nYou’ll automatically pay the flat fee through a percentage of your sales until\nthe total amount owed is repaid. The fee isn’t charged up-front.\n\n**How does repayment work?**\n\nRepayment is collected automatically through a percentage of your [brand name +\npayment] sales as they’re processed which means you pay down more when business\nis busy and less if things slow down. As long as you meet your minimum payment\nrequirement, what you pay each day adjusts to your sales.\n\n**What is a minimum payment?**\n\nA minimum payment is the minimum amount that you’re expected to repay every\nrepayment period. That period will be determined during underwriting and based\non the total term of your loan offer. If your automatic repayments do not meet\nthis minimum, you’ll be required to pay the remaining amount at the end of the\nperiod. You can view your minimum payment amount in the Dashboard or in your\nloan agreement.\n\n**How do I make my minimum payment?**\n\nIf your payments deducted from sales cover the minimum payment requirement for\npayment period, no action will be taken. If you have not met the minimum payment\namount by the end of the payment period, Stripe will automatically debit your\nbank account or account balance the balance needed to meet your minimum payment.\nThere’s no action needed on your part.\n\n**After I accept an offer, how quickly will I get my funds?**\n\nIf your application is approved, you’ll see the funds in your bank account\ntypically in as soon as 2 business days. To make sure that funds are disbursed\nsuccessfully, you must set a valid bank account as your primary payout method.\n\n**Can I have my Capital funds paid out to a card?**\n\nWe currently don’t support disbursal of funds to a card. To make sure that funds\nare disbursed successfully, you must set a valid bank account as your primary\npayout method.\n\n**What happens when my offer expires?**\n\nEach offer is available for 30 days. After that point, your business will\nautomatically be re-evaluated to see if you’re eligible for an additional offer.\n\n**Can I repay my loan early?**\n\nYes, you can make additional payments or pay the total amount owed in full at\nany point by clicking the ‘Make Payment’ button in your Dashboard. There are no\nadditional fees for early repayment.\n\n**Will repaying early qualify me for a new offer?**\n\nOnce you repay the total amount owed, you’ll automatically be evaluated for a\nnew offer. Repaying early does not automatically qualify you for a new offer.\n\n**How should I report these funds on my taxes?**\n\nTax reporting is often dependent on your specific situation, so we encourage you\nto talk with a tax advisor to ensure appropriate accounting. In general, Stripe\nCapital funds would not be considered taxable income at the time of receipt, and\nthe amounts withheld to satisfy your obligations are not tax deductible.\n\n**Who can I contact to learn more about the Stripe Capital program?**\n\nIf you have additional questions about how our financing program through Stripe\nCapital works, you can contact our partners at\n[capital+support@stripe.com](mailto:capital+support@stripe.com).\n\n[Pre-approved user support article\ntemplate](https://docs.stripe.com/capital/servicing#support-article-template)\nUse the following pre-approved copy for a support article about Stripe Capital\nthat can be hosted on your website. This template uses a stand-in platform name\n“Rocket Rides”, which you can replace with your platform name.\n\n### Stripe Capital\n\nRocket Rides has partnered with Stripe to offer eligible businesses access to\nfast, flexible financing through the Stripe Capital program.\n\n### Eligibility\n\nRocket Rides businesses are automatically reviewed for eligibility on a daily\nbasis, and we’ll send you an email if your business qualifies for an offer. The\ncriteria for eligibility is based on a number of factors including your\ntransaction volume and history with Rocket Rides.\n\nEligible US businesses will receive an email if they have an offer to apply for\navailable.\n\n### Offer structure\n\nIf eligible, you’ll receive an email with your personalized offers and you can\nchoose the one that works best for your business. Each offer will outline:\n\n- The financing amount: the dollar amount that will be deposited into your bank\naccount\n- The flat fee: the fee you’ll pay over time in exchange for the financing\namount – there are no other fees and or compounding interest\n- The total amount owed: the sum of the financing amount and the flat fee\n- The repayment rate: the percentage of your daily card transactions processed\nthrough Rocket Rides that will be withheld to repay the total amount owed.\n\nHere’s an example offer you might receive:\n\n- financing amount: 17,000 USD\n- flat fee: 1700 USD\n- total amount owed: 18,700 USD\n- repayment rate: 12\n\nIf you accepted the example offer above and were approved, you would receive\n17,000 USD in the bank account associated with your Rocket Rides account within\n1-2 days along with your usual payout. Stripe would then withhold 12% of your\ndaily transaction total in addition to the usual processing fees until you’ve\npaid down the total amount owed of 18,700 USD (the 17,000 USD advanced plus the\n1,700 USD flat fee).\n\n### Repayment\n\nYou’ll automatically repay the financing over time through a percentage of your\ntransactions according to your repayment rate. The repayment process will begin\nautomatically 1-2 business days after the funds have been deposited into your\naccount. The more card sales you process through Rocket Rides Payments, the\nfaster you’ll repay.\n\nIf you would prefer to repay faster or repay the entire outstanding balance, you\ncan arrange to make a manual payment in addition to the withheld amounts by\nclicking the ‘Make Payment’ button in your loan overview page. There are no\nadditional fees for early repayment.\n\nRepaying early doesn’t guarantee subsequent financing offers. Accounts are\nautomatically reviewed for additional offers on a daily basis and we’ll send you\nan email if you qualify for any additional offers.\n\nYou’re expected to repay a minimum amount every repayment period. That period\nwill be determined during underwriting and based on the total term of your loan\noffer. If the total payments deducted from your sales cover the minimum payment\nrequirement, then you’ll continue to pay back your loan through a percentage of\nyour transactions.\n\nHowever, if payments deducted from your sales over that period happen to fall\nbelow the minimum payment requirement, you’ll be required to pay the remaining\namount. Stripe automatically debits your bank account or account balance for the\nbalance needed to meet your minimum payment. You can view your minimum payment\namount in the Dashboard or in your loan agreement.\n\nTo see a daily summary of your repayment progress, see the loan overview page.\n\n[Pre-approved user support\nresponses](https://docs.stripe.com/capital/servicing#user-support-responses)\nUse the following template answers when responding to commonly asked user\nquestions. For additional questions not listed on here, refer the user to\n[capital+support@stripe.com](mailto:capital+support@stripe.com).\n\nEscalate all complaints to\n[capital+support@stripe.com](mailto:capital+support@stripe.com). Stripe has a\npartnership requirement with our partner banks to report on all complaints that\nare received regarding the Capital program. To learn how to manage complaints,\nsee [Regulatory\ncompliance](https://docs.stripe.com/capital/regulatory-compliance#managing-complaints).\nThe following are some examples of trigger words to help identify complaints:\n\n- angry\n- attorney\n- deceived\n- discrimination\n- lawsuit\n- litigation\n- mad\n- mislead\n- predatory\n- sue\n- unfair\n\n### Pre-loan and general questions\n\n### User has an active loan\n\n## See also\n\n- [Compliance\nrequirements](https://docs.stripe.com/capital/regulatory-compliance)\n- [Metrics and reporting](https://docs.stripe.com/capital/reporting)\n\n## Links\n\n- [Change Request\nForm](https://form.asana.com/?k=8K51UWmWhttehNFD5qBLdg&d=974470123217835)\n- [Regulatory\ncompliance](https://docs.stripe.com/capital/regulatory-compliance#managing-complaints)\n- [Compliance\nrequirements](https://docs.stripe.com/capital/regulatory-compliance)\n- [Metrics and reporting](https://docs.stripe.com/capital/reporting)",
  "metadata": {
    "title": "Managing customer support | Stripe Documentation",
    "description": "Support your Capital customers using Stripe-approved messaging.",
    "sourceURL": "https://docs.stripe.com/capital/servicing"
  }
}