{
  "content": "# Stripe customer balance in NetSuite\n\n## Use the connector to represent Stripe customer balances in NetSuite.\n\nThe connector represents a Stripe [customer\nbalance](https://docs.stripe.com/billing/customer/balance) in NetSuite only\nafter it’s used.\n\nThe connector creates a credit memo against an invoice for the amount paid when:\n\n- The invoice is paid by a customer’s balance.\n- The invoice is marked as paid.\n\nIf the invoice is only partially paid by the customer’s balance, a corresponding\nStripe charge for the remaining balance must exist before the connector can\ncreate a credit memo. The connector won’t create a credit memo for a partially\npaid invoice that’s open with an outstanding amount.\n\nThe credit memo that represents the customer balance contains:\n\n- `Stripe: [invoice ID]. This credit memo was created by a Stripe customer's\nbalance.`\n- The line item from the invoice\n\n## NetSuite items used for customer balances\n\nIf a customer balance isn’t completely used on the first invoice created after\ndowngrading a product price, the connector does the following:\n\n- Applies the credit memo representing the customer balance to future invoices\n- Represents the credit memo as a Stripe Customer Balance item in NetSuite\n\nThe connector uses a global item to track customer balance usage in NetSuite\nbecause there isn’t a way to determine what the customer balance represents. You\ncan optionally use a unique item for all customer balance credits. This allows\nyou to make sure all discounts given through the customer balance post to a\nspecific general ledger account. You can then run reports by item and see a\nbreakout of customer balance usage.\n\n## Negative invoices\n\nNetSuite doesn’t support negative amounts on invoices. The connector handles\nthis scenario by creating an invoice with all line items with a zero amount. The\nconnector represents a customer balance amount (the negative amount on an\ninvoice) when it’s used on subsequent invoices.\n\nFor example, say you downgrade the price for a customer’s subscription. The\nprorated, unused amount on the subscription product price is greater than the\namount of the prorated, new product price. If this occurs, the Stripe invoice\nhas a negative amount total, which is added to the customer balance.\n\n## See also\n\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation)\n- [Invoice payment\npage](https://docs.stripe.com/connectors/netsuite/invoice-payment-page)\n- [Customer payment\npage](https://docs.stripe.com/connectors/netsuite/customer-payment-page)\n\n## Links\n\n- [customer balance](https://docs.stripe.com/billing/customer/balance)\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation)\n- [Invoice payment\npage](https://docs.stripe.com/connectors/netsuite/invoice-payment-page)\n- [Customer payment\npage](https://docs.stripe.com/connectors/netsuite/customer-payment-page)",
  "metadata": {
    "title": "Stripe customer balance in NetSuite | Stripe Documentation",
    "description": "Use the connector to represent Stripe customer balances in NetSuite.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/stripe-customer-balance-netsuite"
  }
}