{
  "content": "# Stripe Issuing marketing guidelines\n\n## Learn about marketing guidelines for Issuing programs in the United Kingdom and Europe.\n\n#### Note\n\nRequirements as of 1 June 2022\n\n# Scope of application\n\nThese marketing guidelines only apply when you’re marketing Stripe’s Issuing\nproduct and services. If you’re only using Stripe Issuing for your own business\nexpenses (and not to facilitate or provide services to your customers) then we\nwouldn’t expect you to carry out any marketing of Stripe’s products and services\n(so these marketing guidelines wouldn’t apply).\n\n# Basic Requirements\n\nTo offer and promote Stripe’s Issuing products in the United Kingdom and\ncountries within Europe, your user interfaces and advertising must adhere to the\nguidelines outlined in this document. We’re providing these guidelines to help\nyou navigate the financial regulations that govern the messaging you can use to\ndescribe our Issuing product. Deviation from these guidelines can result in poor\nuser experiences and potential regulatory consequences for both you and Stripe.\nAs such, consult both your in-house Legal team and Stripe’s compliance team\n([platform-compliance@stripe.com](mailto:platform-compliance@stripe.com)), if\nit’s unclear how to apply these guidelines to your user interfaces or\nadvertising.\n\nWe’ve organized the relevant information for you in the following components:\n\n- Messaging guidelines\n- Pre-approved messages\n- Language\n- Prohibited types of marketing\n- User agreements\n- Required legal disclosures\n- Record keeping and monitoring\n\n# Messaging Guidelines\n\nIn the context of marketing, financial regulations require user interfaces and\nadvertising to be fair, clear, and not misleading (taking into account how the\nadvertising is communicated and whom it is directed to).\n\nAll statements must be factual and no important facts can be omitted.\n\n- A misleading statement or omission is “important” if it’s likely to affect the\nchoice of a product or the attitude towards it.- Price and cost are considered\nimportant and should therefore be revealed in the main message.\n- Advertising must not emphasize any potential benefits of the product without\nalso giving a fair and prominent indication of any relevant risks:\n- Statements must be factual and verifiable\n- Disclaimers may not contradict factual statements, they may only explain or\nmodify them.\n- Advertising shouldn’t describe a feature of a product or service as\n“guaranteed,” “protected,” or “secure,” or use a similar term unless (1) those\nphrases constitute a fair, clear, and not misleading description of the feature\nof product and (2) the advertising communicates all of the necessary\ninformation, and presents that information with sufficient clarity and\nprominence, and uses the terms fair, clear, and not misleading.\n- Advertising relating to a currency transfer service is likely to be misleading\nif it presents an exchange rate in a way that’s likely to give the impression\nthat the rate is available to a person or a class of persons but in reality that\nrate is unlikely to be obtained by that person or class of persons with respect\nto a typical transaction.\n\nAll materials must clearly, prominently, and correctly state important terms,\nincluding:\n\n- Costs, benefits, and other fundamental points of the products or services\noffered\n- Related products or services offered as an option or requirement to obtain\ncertain terms\n- Important limitations or conditions on the terms or availability of products\nand services, such as time limitations for favorable rates, promotional\nfeatures, expiration dates, prerequisites for obtaining specific products or\nservices, or conditions for canceling services\n- Certain “trigger” words that might require additional legal statements (for\nexample, “free,” “until,” “pre-approved,” “fixed”)\n- If advertising compares a product or service with that offered by another\nprovider, the provider must make sure that the comparison is meaningful and\npresented in a fair and balanced way.\n\nYou must draw the user’s attention to fundamental terms, such as limitations and\nconditions, which are important for the user to make an informed decision.\n\n- Consider the four **location principles** for providing information:\nprominence, presentation of information (text size, formatting, on-screen\nreadability), placement of qualifying information, and proximity of all\ninformation relevant to the evaluated messages.\n- Consider the “big impression” and whether you’re conveying important\ninformation or possibly ignoring it.\n\nAvoid images that imply affiliation with, or endorsement of, celebrities, or\ngovernment entities.\n\nEvaluating marketing materials from a “common user” point of view.\n\n- To determine whether an act or practice is misleading, consider whether your\nuser’s interpretation or reaction to a statement, omission, act, or practice is\nreasonable in the given circumstances. In other words, whether an act or\npractice can be unfair or deceptive depends on how a member of the expected\naudience (its customers) would interpret the statement.\n\nProof of the claim\n\n- Advertised claims must be substantiated, whether explicit or implicit.\n“Evidence” means that there must be a reasonable basis for each claim.- You must\ndisclose limitations necessary to make sure that the claim isn’t false,\nfraudulent, or misleading.\n- You must distinguish “exaggerations,” which don’t need to be substantiated,\nfrom allegations. Exaggerations are subjective and generally can’t be proved\nwhether they’re true or false.\n- Be careful with using “absolute” terms in the claim like “all,” “only,” or\n“always” without qualification, these words suggest that there can be no\nexceptions to the claim.\n\nYou must refrain from terms that could imply that this product can be used for\nconsumer purposes.\n\n- Don’t refer to contractor earnings as “wages.”\n- Don’t use terms like “Personal Account” or “Consumer Account” to describe the\nproduct.\n- Don’t use marketing phrases that promote consumer use cases (for example,\n“Spend funds to buy the things you love!”).\n- Don’t describe the card as a “credit card.” This is a commercial prepaid\nprogram.\n- Don’t market “transferring money” or “sending money” without approved language\nfrom Stripe.\n- Don’t use words like “bank account,” “deposit account,” “checking account” or\nsimilar terms that connote a traditional bank account product.\n- Don’t market through advertising mediums which are exclusively dedicated to\nconsumers.\n\nDisparaging remarks about other financial products\n\n- Don’t disparage debit, credit, bank accounts, banks, or other financial\nproducts used or issued by financial institutions.\n\nUse of “Registered” or ® markings\n\n- Generally, the brand requirements are that the brand name use the required\nregistration marks. However, after you mention the brand name once, you can stop\nusing it—this is for the same document or material only (for example, your card\ncarrier). We recommend that you use “superscript” in all ® representations.\n\nMarketing of other products and services\n\n- If you advertise products or services other than those provided by Stripe, you\nmust make it clear that those products or services aren’t provided by Stripe.\n- If those products or services are regulated financial products, you must not\nadvertise them unless you have the requisite regulatory authorization.\n\nInternational Marketing\n\n- Although you can ship cards to international addresses for locally domiciled\ncardholders, you must not engage in marketing the Issuing Program to persons\nlocated outside of your relevant jurisdiction (either the UK or Europe as\nappropriate). This includes advertising or promoting Issuing through marketing\nchannels such as social media, email, and paid search results. As with all other\naspects of the Issuing program, you must comply with Card Network rules in\nconnection with marketing activities.\n\n## Summary checklist\n\nYour marketing team should be familiar with these guidelines as they design\nadvertising campaigns and web pages that market your Stripe Issuing program.\nHere are some additional considerations for your content:\n\nIf mentioning specific product details like, terms, costs, fees, dollar\nbenefits, or any ‘numbers’, make sure they’re accurate:\n\n- Ask: Is it true? How do you know it’s true? Can you prove it with stored data\nor a reputable source, if asked?\n- Ask: Can most users achieve any promised results, and can you prove it, if\nasked?\n- Ask: Do those figures require additional information so users know how they’re\nachievable? If so, have you disclosed that additional information?\n- Ask: Are the product details explained fully?\n\nHere are claims that end up requiring a lot of documentation, and are therefore\noften avoided:\n\n- Hard to prove claims like: “free”—if you’d like to use this claim contact\n[platform-compliance@stripe.com](mailto:platform-compliance@stripe.com)\n- Absolute claims: “best,” “#1 or number 1,” “every,” “only,” “all,” “always,”\n“will get”, or “you’ll get”\n- Credit-related statements: “pre-approved,” “fixed,” “earn interest”\n- Don’t leave out key details users should know before signing up\n\nAlways prohibited\n\n- Fake testimonials or quotes about the services\n\n# Language\n\nWhen marketing services and products offered by Stripe, you must use either (a)\n or (b) one of the official or commonly used languages of the country\nwhere your customer resides.\n\n# Prohibited types of marketing\n\nUnless approved by Stripe in writing, you must not market Stripe’s products and\nservices through any of the following types of marketing channels:\n\n- Telemarketing\n\n# User agreements\n\nYou must present user agreements to your prospective customers before they\nsubmit their application. This allows businesses to fully understand the terms\nand conditions of the product before entering into a contract to use Stripe\nIssuing services. There are a few user agreements that prospective customers\nneed access to depending on their geographic location, including:\n\n- [Stripe Services Agreement - UK](https://stripe.com/gb/legal/ssa)\n- [Stripe Services Agreement - EU](https://stripe.com/ie/legal/ssa)\n- Your platform’s terms and conditions\n\nYour platform’s terms and conditions must clearly outline any fees or credits\nthat you plan to offer your customers and any activities or qualifications that\nthey need to meet for the fee or credit to be applied.\n\nAdditionally, your customers’ cardholders should be prompted to accept the\n[Authorized User Terms](https://stripe.com/en-gb/issuing/authorized-users)\nbefore activating their cards.\n\n# Pre-approved messages\n\nBecause marketing regulations can be cumbersome, we provide pre-approved\nmessaging for communicating the key points of the Stripe Issuing program in your\nuser-facing materials.\n\nWe allow non-substantive changes to these messages as long as the key\ninformation remains the same. Any substantive changes require approval from\nStripe’s compliance team. Approvals can take up to 10 business days to process.\n\nCategorySuggested MessagingLimitations on card program useCardholders can only\nuse the Card Program for commercial purposes (which means the payment of\nbusiness expenses), and not for personal, family, or household\npurposes.CurrencyAll Card Program cards are GBP or EUR denominated.Where cards\ncan be accepted for paymentCard Program cards can be used anywhere that accepts\nVisa cards.Where cards can be issuedCard Program cards can only be issued to\ncardholders who are UK or European incorporated companies or sole traders\nresiding in the United Kingdom or Europe and who have a verifiable physical UK\nEuropean street address (no P.O. Boxes).Speed of virtual card issuanceInstantly\naccess your own virtual cardSpeed of physical card issuanceReceive your physical\ncard in a matter of days\n# Required Legal Disclosures\n\nFor legal reasons, we require that all marketing, including user interfaces and\nadvertisements, include this disclosure:\n\nFor UK users:\n\nCards are issued by Stripe Payments UK Limited, which is an electronic money\ninstitution authorized by the Financial Conduct Authority (firm reference\nnumber: 900461) for the issuing of electronic money. Cards are issued under the\nVisa card scheme pursuant to a license from Visa Europe Limited.\n\nFor European users:\n\nCards are issued by Stripe Technology Europe Limited, an electronic money\ninstitution authorized by the Central Bank of Ireland (firm reference number:\nC187865). Cards are issued under the Visa card scheme pursuant to a license from\nVisa Europe Limited.\n\nIncluding this disclosure is an essential element of managing your Stripe\nIssuing program. It gives your users the information they need to validate the\nlegitimacy of the program and escalate complaints to our regulators, if needed.\n\nThe disclosure may be placed on your marketing in an area of your choosing, as\nlong as the location follows the location principles described in the\n[“Messaging\nGuidelines”](https://docs.stripe.com/issuing/marketing-guidance-europe-uk#messaging-guidelines)\nabove. Typically our customers opt to place the disclosures towards the end of\ntheir webpage, social media, or email marketing.\n\n## Space constrained advertisements\n\nIf you’re planning to market through a medium with character limitations which\nprohibits the full disclosure as set out above (such as in a social media\nadvertisement), include a shortened version of the required legal disclosure,\nand a link within the advertisement that redirects a user to a webpage with the\nfull legal disclosure.\n\n“Cards issued by Stripe”\n\n# Record keeping and monitoring\n\nTo demonstrate your adherence to the requirements listed above, we ask that you\nkeep thorough records of all marketing materials, customer data, account\ninformation, and other disclosures you make to customers for at least 5 years.\n\nStripe might occasionally ask you for copies of your marketing materials to make\nsure they adhere to these guidelines. You must provide copies of these materials\nwithin 10 business days of receiving a review request and agree to make any\nchanges that Stripe requests as a result of the review.\n\n## Links\n\n- [Stripe Services Agreement - UK](https://stripe.com/gb/legal/ssa)\n- [Stripe Services Agreement - EU](https://stripe.com/ie/legal/ssa)\n- [Authorized User Terms](https://stripe.com/en-gb/issuing/authorized-users)",
  "metadata": {
    "title": "Stripe Issuing marketing guidelines | Stripe Documentation",
    "description": "Learn about marketing guidelines for Issuing programs in the United Kingdom and Europe.",
    "sourceURL": "https://docs.stripe.com/issuing/marketing-guidance-europe-uk"
  }
}