{
  "content": "# Select a report\n\n## Find the right report to fit your financial workflow.\n\nStripe has a variety of different reports that provide information about your\ntransactions. Start with the task you’re looking to perform and use the table\nbelow to identify the best report.\n\nTaskSuggested report- Download monthly transaction history\n- View monthly totals by transaction category\n- [Reconcile](https://docs.stripe.com/reports/select-a-report#reconciliation)\nyour Stripe balance like a bank account\n- Download a list of your payouts\n[Balance](https://docs.stripe.com/reports/balance)- Break down the individual\ntransactions included in each payout to your bank account\n- Download the detail for multiple payouts at a time\n[Payout reconciliation](https://docs.stripe.com/reports/payout-reconciliation)\n## Reconciling your cash\n\nThe [Balance](https://docs.stripe.com/reports/balance) and [Payout\nreconciliation](https://docs.stripe.com/reports/payout-reconciliation) reports\nboth provide downloadable transaction history including custom metadata, and you\ncan use either to reconcile your cash. The reports group transactions in\ndifferent ways to facilitate different types of reconciliation.\n\n### The Balance report\n\nThe Balance report resembles a bank statement and is optimized for users who\ntreat their Stripe account similar to a bank account in their accounting system.\nThe Balance report helps you to record all activity that occurred in Stripe\nduring a date range. Payouts are recorded as simple transfers between your\nStripe account and your bank account, which don’t correspond to any specific\npayments. Like a bank account, the balance is reconciled at the end of the\nperiod to confirm that all transactions have been accounted for.\n\n### The Payout reconciliation report\n\nThe Payout reconciliation report is optimized for users on automatic payout\nplans who model their Stripe balance as a temporary clearing account in their\naccounting system. This report helps you to reconcile each payout against the\ntransactions included in that batch after it settles.\n\n### Reconciling between the reports\n\nMost reconciliation workflows don’t require using both reports, but it can be\nhelpful to understand how they fit together.\n\nThe following table shows an account on a [two day rolling\nschedule](https://docs.stripe.com/payouts#payout-schedule) with 5 days of\nactivity. The account was opened on the 1st of the month and accepted 10 USD in\ncharges from its customers on its first day. Those funds became available on the\n3rd, and the account received its first payout to its bank account because of\nthe 2 day payout schedule.\n\nDAYTRANSACTIONSPAYOUTSBALANCE AT EOD1st10 USD10 USD2nd20 USD30 USD3rd30 USD10\nUSD50 USD4th50 USD20 USD80 USD5th70 USD30 USD120 USD\nGiven the above account activity and a [date\nrange](https://docs.stripe.com/reports/options#date-range) of **3rd–5th**, the\n[Balance summary](https://docs.stripe.com/reports/balance) would include the\nfollowing data.\n\nBALANCE SUMMARYStarting balance30 USDBalance change from activity150 USDTotal\npayouts-60 USDEnding balance120 USD\nThe [Balance change from activity](https://docs.stripe.com/reports/balance)\nsection of the Balance report includes all transactions that occurred from the\n3rd through the 5th. The total of these transactions matches the **Balance\nchange from activity** line item in the balance summary of 150 USD.\n\nThe [Payout\nreconciliation](https://docs.stripe.com/reports/payout-reconciliation) report\nincludes transactions from the 1st through the 3rd because these transactions\nwere paid out within the selected date range of 3rd–5th. The sum of these\ntransactions matches the **Total Payouts** line item of the balance summary of\n-60 USD.\n\nThe [Ending balance\nreconciliation](https://docs.stripe.com/reports/payout-reconciliation) section\nat the bottom of the Payout reconciliation report includes transactions from the\n4th and 5th because these transactions weren’t paid out within the selected date\nrange of 3rd–5th. The sum of these transactions matches the **Ending balance**\nline item in the balance summary of 120 USD.\n\n## Including transactions in a given date range\n\nWhen you run a report, you select the reporting period using the controls in the\ndashboard, or by specifying start and end dates via the API. Each report uses a\ndifferent type of date to determine which transactions fall within the reporting\nperiod.\n\nReportRelevant DateReport\nColumn[Balance](https://docs.stripe.com/reports/balance)Date of change in Stripe\nbalanceBalance transaction `created` (*)[Payout\nreconciliation](https://docs.stripe.com/reports/payout-reconciliation)Date\nautomatic payout is available`automatic_payout_effective_at`\n(*) except automatic payout transactions, which impact your Stripe balance based\non the `available_on` date\n\n## Links\n\n- [Reconcile](https://docs.stripe.com/reports/select-a-report#reconciliation)\n- [Balance](https://docs.stripe.com/reports/balance)\n- [Payout reconciliation](https://docs.stripe.com/reports/payout-reconciliation)\n- [two day rolling schedule](https://docs.stripe.com/payouts#payout-schedule)\n- [date range](https://docs.stripe.com/reports/options#date-range)",
  "metadata": {
    "title": "Select a report | Stripe Documentation",
    "description": "Find the right report to fit your financial workflow.",
    "sourceURL": "https://docs.stripe.com/reports/select-a-report"
  }
}