{
  "content": "# How Stripe Capital Works\n\n## Learn how Stripe Capital provides financing for eligible businesses.\n\nStripe Capital offers financing for eligible users processing payments through\nStripe. Under the Stripe Capital program, business financing doesn’t have late\nfees, early payment fees, or origination fees. Instead, the total amount you pay\nis your advance amount plus a flat fee. Your payments are withheld directly from\nyour sales on Stripe.\n\n## Eligibility and financing types\n\nStripe uses a [combination of eligibility\ncriteria](https://docs.stripe.com/capital/eligibility) (including overall\nprocessing volume and history on Stripe) to extend a financing offer. If your US\nbusiness is eligible, and has at least three months of processing history,\nStripe might send you an email and Dashboard notification to advise you of an\navailable offer.\n\nEach offer specifies the type of financing being offered, which might be a loan\nor merchant cash advance. You can’t request a particular financing type under\nthe Stripe Capital program.\n\n- *Merchant cash advance:* A merchant cash advance is a purchase of a merchant’s\nfuture receivables by YouLend; it’s not a loan or credit transaction. Purchased\nreceivables are withheld from the merchant’s payment processing volume in a\npercentage specified in the YouLend Advance Agreement. Unlike a loan, there’s no\nfixed payment schedule or periodic debits. Instead, a merchant’s payments vary\nbased on payment processing volumes.\n- *Loans:* Business-purpose term loans are made by Celtic Bank to eligible\nmerchants. These loans have a maximum term, and periodic payments. If\nwithholdings from payment processing receivables don’t meet a minimum amount\n(typically on a 30 or 60-day basis), shortfalls are debited from a linked bank\naccount.\n\n## Review your offer\n\nYour offer is typically valid for 30 days, after which we re-evaluate your\nbusiness to see if you’re eligible for an additional offer. Go to the [Capital\ntab](https://dashboard.stripe.com/capital) in the Stripe Dashboard to customize\nthe amount of your offer up to the maximum offer amount. The offer terms adjust\nbased on the amount you choose. If you’re seeking financing at a later time,\ncontinue checking your email and the **Capital** tab of the Dashboard to make\nsure you’re reviewing your most current offer. In some cases, we extend\nadditional offers to you while you’re actively paying your current financing.\n\nAfter you select an offer, we review your application. There might be requests\nfor additional information related to your business to complete the review of\nyour application. If you’re approved, we transfer the funds to your Stripe\naccount, typically in as few as 1-2 business days. To make sure funds\nsuccessfully disburse from your Stripe account, you must set a valid bank\naccount as your primary payout method.\n\n## No impact to your personal credit\n\nApplying for financing through Stripe Capital might require a personal credit\ncheck under some circumstances, but this credit check doesn’t affect your\npersonal credit score.\n\n## Build your business credit history\n\nWhen you apply for financing through Stripe Capital, Stripe might obtain your\nbusiness’s credit history through the Small Business Financial Exchange.\n\nAdditionally, Stripe Capital may report performance or payment history to the\nSmall Business Financial Exchange, who uses this information to build a\nfinancial profile for your business, which can help your business get access to\nfinancing from other providers.\n\n## Linked accounts\n\nYou always have control over the bank accounts that you share with Stripe and\ncan [update or disconnect your linked\naccounts](https://docs.stripe.com/get-started/account/linked-external-accounts)\nat any time.\n\n## Pay down your financing\n\nThe total cost of your financing is your loan or advance amount plus a flat fee.\nPayment of your financing occurs automatically by deducting a percentage of your\nStripe sales, known as the *repayment rate*. This means you pay more when your\nbusiness has higher sales and less if business slows down. The single flat fee\nisn’t charged upfront—it’s paid over the length of the financing.\n\nThere’s no prepayment penalty, and you can make additional payments or pay the\ntotal amount you owe in full at any point in the [Capital\ntab](https://dashboard.stripe.com/capital) of your Dashboard.\n\nStripe automatically evaluates you for a new offer as you pay down your\nfinancing, regardless of whether you make additional payments or pay it off\nearly.\n\n## Financing payments\n\nStripe Capital financing is generally paid through withholding from payment\nprocessing receivables at a rate specified in your financing agreement.\nDepending on your financing type, there may be periodic minimum payment\nrequirements and a finite term.\n\nSpecifically, if you took out a loan, you must repay a minimum amount toward\nyour loan every payment period. Amounts withheld as a percentage of your sales\nat the payment rate count toward your minimum. However, if the total amount you\nrepay through sales doesn’t meet the minimum, you must pay the remaining amount\nat the end of the period. If you haven’t met the minimum by the end of each\npayment period, Stripe automatically debits the balance needed to meet your\nminimum from your bank account or account balance. You can also make manual\npayments toward your minimum through your Dashboard.\n\nYou can view your minimum in the [Capital\ntab](https://dashboard.stripe.com/capital) of your Dashboard or in your loan\nagreement.\n\nIf you’re unable to meet your minimum for one or more periods, reach out to\nsupport and we’ll work with you to get back on track and meet your loan\nobligations. If you continue to miss your minimums, we might take additional\naction, as detailed in your loan agreement.\n\n#### Fixed payment loans\n\nIf your loan has a fixed monthly payment instead of a minimum payment, Stripe\nstops withholding from your Stripe sales when you meet the fixed payment amount.\nIf your sales withholdings don’t meet the fixed payment by the end of the\npayment period, Stripe automatically debits the balance. You can also make\nmanual payments at any time through your Dashboard using the **Make payment**\noption. Your financing agreement will specify whether there is a fixed payment\namount.\n\n### Examples\n\nThe following example scenarios demonstrate how the minimum payment process\nworks for loans.\n\n**Example 1: You successfully meet your minimum through daily sales\ndeductions.**\n\n- Your minimum amount is 2,000 USD for the 60-day period ending on March 1.\n- In that period, you repaid 2,500 USD of your loan balance through Stripe\ndeducting a fixed percentage of your sales volume (the repayment rate).\n- You’ve successfully met your minimum plus an additional 500 USD toward your\ntotal balance for this payment period.\n- In the next 60-day period, you still must meet the minimum of 2,000 USD.\n\n**Example 2: You don’t meet your minimum through daily sales deductions.**\n\n- Your minimum is 2,000 USD for the 60-day period ending on March 1.\n- In that period, you repaid 1,500 USD of your loan balance through Stripe\ndeducting a fixed percentage of your sales volume (the repayment rate).\n- On March 1, you still owe 500 USD toward your minimum (2,000 USD – 1,500 USD =\n500 USD) and you must pay the remaining balance of your minimum.\n- On March 1, Stripe automatically debits 500 USD from your bank account or\naccount balance to meet your minimum.\n\n## Security interests\n\nStripe Capital loan agreements typically include security interests taken as\ncollateral for your loan. A UCC-1 financing statement might be filed in\nconnection with your loan based on several factors, including the size of your\nloan, facts and circumstances about your business, and so on. After you finish\npaying off your loan, you can [contact us](mailto:capital@stripe.com) with a\nrequest to terminate a UCC-1 filing.\n\nFor merchant cash advances, a security interest may be taken under certain\ncircumstances, as specified in the Stripe Capital advance agreement.\n\n#### Unknown secured party\n\nCreditors sometimes use a third party to file and maintain lien positions as the\nregistered agent of the creditor. Wolters Kluwer is Stripe Capital’s third-party\nrepresentative. If you’re unsure of what creditor the third party is acting on\nbehalf of, we recommend that you contact the third party directly.\n\n## Taxes\n\nTax reporting often depends on your specific situation, so we encourage you to\ntalk with a tax advisor. In general, funds through Stripe Capital wouldn’t be\nconsidered taxable income at the time of receipt, and the amounts withheld to\nsatisfy your obligations aren’t tax deductible.\n\nStripe Capital loans are issued by Celtic Bank, powered by Stripe. Stripe\nCapital merchant cash advances are provided by YouLend.\n\n## Links\n\n- [combination of eligibility\ncriteria](https://docs.stripe.com/capital/eligibility)\n- [Capital tab](https://dashboard.stripe.com/capital)\n- [update or disconnect your linked\naccounts](https://docs.stripe.com/get-started/account/linked-external-accounts)",
  "metadata": {
    "title": "How Stripe Capital Works | Stripe Documentation",
    "description": "Learn how Stripe Capital provides financing for eligible businesses.",
    "sourceURL": "https://docs.stripe.com/capital/how-stripe-capital-works"
  }
}