{
  "content": "# Stripe refunds in NetSuite\n\n## Use the connector to automatically reconcile Stripe refunds to NetSuite bank deposits.\n\nThe Stripe Connector for NetSuite automates the refund reconciliation process\n(for example, for subscriptions, credit notes, revenue recognition, and so on).\nThe connector syncs refunds from Stripe into NetSuite and represents the refunds\nbased on the payment status (applied, partially applied, not applied, and so\non).\n\n## How it works\n\nWhen you use the connector, the automated refund reconciliation process occurs\nas follows:\n\n- Stripe issues a refund through the Stripe API or Dashboard.\n- The connector evaluates whether or not the charge applies to a transaction. If\nnot, the connector creates a customer refund directly against the customer\npayment.\n- If the charge applies to a transaction, the connector evaluates whether or not\nthe charge applies to an invoice. If not, the charge is a cash sale, which the\nconnector doesn’t support.\n- If the charge applies to an invoice, the connector creates a credit memo and\ncustomer refund to represent the refund.\n\n## Refunds for charges applied to an invoice\n\nThe connector creates a credit memo and customer refund and applies the credit\nmemo to the customer refund for any charge applied to an invoice that’s\nrefunded. This happens so that entries are made to income and cash accounts.\n\nIf a payment applies to an invoice that differs from the invoice it was\noriginally applied to, the connector uses the new invoice to create a credit\nmemo.\n\nIf you remove a payment from an invoice and refund the amount, the connector\ndetects this action and won’t create a credit memo. Instead, the refund applies\ndirectly to the unapplied payment.\n\n## Refunds for charges without an invoice\n\nThe connector won’t create a credit memo if you create a refund for a charge\nthat isn’t associated with an invoice. Instead, the refund applies directly to\nthe unapplied payment.\n\n## Refunds caused by failed asynchronous payments\n\nPayment methods with delayed notification, such as [ACH Direct\nDebit](https://docs.stripe.com/payments/ach-direct-debit), can take days to\nreceive acknowledgement of success or failure. The connector applies these\npayments immediately and considers them successful until proven failed.\n\nIf a payment fails, the connector:\n\n- Unapplies the payment that previously showed as pending from the invoice.\n- Refunds the failed payment in NetSuite. To reverse the impact of the original\nfailed payment on the general ledger, the connector creates a refund and applies\nit to the payment.\n\nThe refund in NetSuite shows a message with details from Stripe about why the\noriginal payment failed.\n\n## Refunds on transactions prior to the record sync start date\n\nIf you have data from the past that you want to sync to NetSuite, ask your\nimplementation partner to set a record sync start date on your account. Make\nsure the record sync start date includes the transactions (payments, refunds,\nchargebacks, invoices, and payouts) that you want to import into NetSuite.\n\nIf you need to issue a refund for a transaction created before the record sync\nstart date, you must do so manually:\n\n- Create the refund in Stripe.\n- Manually create the refund in NetSuite by creating a credit memo and a\ncustomer refund.\n- The connector automatically skips the refund during the reconciliation\nprocess. You’ll need to manually reconcile this refund to the bank deposit.\n\nAlternatively, you can create the refund in Stripe and then allow the connector\nto create an entry on the deposit (payout) to an income account to represent the\nrefund. This method posts the refund to a single income account instead of\ncontrolling the revenue account used. The entry isn’t connected to the original\ninvoice and the connector doesn’t create a credit memo or customer refund\nrecord.\n\nTo have refunds summarized on the deposit, ask your implementation partner to\nenable the `Summarize transactions before backfill` feature in your Stripe app\nsettings. Consult with your implementation partner to understand all accounting\nand technical implications.\n\n## Refunds and deposit automation\n\nThe connector uses the `CustomerRefund` record to post refunds to an\n`Undeposited Funds` account in your NetSuite instance. After Stripe includes the\nrefund in a payout, the connector links the refund to a NetSuite deposit and the\nrefund moves from the `Undeposited Funds` account to the cash account.\n\n## Stripe fee refunds\n\nRefunds for Stripe fees aren’t represented on the `CustomerRefund` or\n`CreditMemo` records. The connector records these fees as line items on the\nNetSuite deposit in the `Other Deposits` list. Learn more about how the\nconnector handles different [types of\nfees](https://docs.stripe.com/connectors/netsuite/stripe-payouts-netsuite#fee-types).\n\n## Partial refunds\n\nThe connector supports partial refunds and handles invoices based on the number\nof items:\n\n- If the invoice contains a single item, the connector creates a credit memo\nusing the single line item on the original invoice, and the refund amount.\n- If the invoice contains multiple items, the connector can’t determine which\nline items to refund. Because Stripe doesn’t associate a refund with specific\nline items, the connector represents the refund with a non-inventory sale item\ncalled a `Stripe Partial Refund Item`. If you enabled revenue recognition on\nyour account, the item uses the schedule and deferred revenue account specified\nin your settings.\n\n## Customize the refund general ledger impact\n\nWhen creating a credit memo for a refund, the connector includes the original\nitems on the invoice, by default.\n\nYou can’t specify a refund account for an item in NetSuite. When you issue the\ncredit memo with the original items on an invoice, the contra-income entries\n(reversal of the revenue) apply to the same account as the original items.\n\nIf you don’t want to use the same income account, you can delete the original\nitems on the credit memo. If configured, the connector automatically creates\ncredit memos with a unique global item (the `Stripe Refund Item`) instead of the\noriginal items on the invoice.\n\nUse this approach if you want the refund to post to a specific account, or you\nsell physical products and don’t want the refund’s credit memo to affect\ninventory levels.\n\nThe `Stripe Refund Item` posts to your default income account. You can customize\nwhere to post refund items and credit memos. To do so, edit the account of the\nitem in NetSuite. You can also edit the name or any other aspect of the item,\nand the connector won’t override those modifications.\n\n## See also\n\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Stripe payouts in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-payouts-netsuite)\n- [Invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation)\n- [Invoice payment\npage](https://docs.stripe.com/connectors/netsuite/invoice-payment-page)\n\n## Links\n\n- [ACH Direct Debit](https://docs.stripe.com/payments/ach-direct-debit)\n- [types of\nfees](https://docs.stripe.com/connectors/netsuite/stripe-payouts-netsuite#fee-types)\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Stripe payouts in\nNetSuite](https://docs.stripe.com/connectors/netsuite/stripe-payouts-netsuite)\n- [Invoice\nautomation](https://docs.stripe.com/connectors/netsuite/invoice-automation)\n- [Invoice payment\npage](https://docs.stripe.com/connectors/netsuite/invoice-payment-page)",
  "metadata": {
    "title": "Stripe refunds in NetSuite | Stripe Documentation",
    "description": "Use the connector to automatically reconcile Stripe refunds to NetSuite bank deposits.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/stripe-refunds-netsuite"
  }
}