{
  "content": "# Troubleshoot SSOPublic preview\n\n## Learn how to resolve common errors that might occur when configuring SSO.\n\nWhen setting up SSO for your account, you can test your SSO configuration before\nsaving it to prevent misconfiguring SSO and locking out your users. If the test\nwizard discovers errors, use this guide to understand and resolve them.\n\nErrorDescriptionResolutionThe SAML request has expiredThe SAML request included\na timestamp that’s no longer valid. SAML requests are typically time-sensitive\nto make sure the user authenticated recently.Try signing in again to generate a\nfresh SAML assertion from your identity provider.Invalid SAML responseThe SAML\nresponse received from the Identity Provider (IdP) doesn’t conform to the\nexpected format or contains incorrect information.Review the SAML response using\ntools like [SAML\nTracer](https://chromewebstore.google.com/detail/saml-tracer/mpdajninpobndbfcldcmbpnnbhibjmch?hl=en)\n(for Chrome) or a similar tool.Invalid issuer IDThe issuer ID (also called\nEntity ID) in the SAML response doesn’t match the issuer ID configured in\nStripe.Log into your identity provider and navigate to the integration settings.\nConfirm that the issuer ID for your Stripe app matches the issuer ID you\nconfigured in Stripe.Invalid identity provider URLThe identity provider URL\nconfigured in Stripe that directs users to login to the identity provider is\nincorrect or unreachable.Log into your identity provider and navigate to the\nintegration settings. Confirm that the identity provider URL for your Stripe app\nmatches your configuration in Stripe.Invalid identity provider certificateThe\ncertificate provided by the identity provider is invalid or not trusted.Make\nsure that you’re using the correct IdP certificate. You can often find the\nlatest certificate in the IdP dashboard under security settings. If the\ncertificate has changed, download the new one and replace the existing\ncertificate in your SSO configuration.User doesn’t belong to the verified\ndomainThe user attempting to authenticate doesn’t belong to the allowed\ndomain.Check the domain associated with the user’s email address. If they need\nto be granted access, verify their account configuration in the identity\nprovider. Make sure that the user’s email address matches the domain allowed for\nSSO. If you need to make changes, update the user’s account in the IdP.No roles\nwere found for the userNo roles were found in the SAML response for the\nuser.Make sure that the identity provider is configured to send role assertions\nfor the user. Review the roles associated with the user in the IdP, and verify\nthey’re properly assigned. For a list of available roles and how to configure\nthem, see our [Roles\nDocumentation](https://docs.stripe.com/get-started/account/sso/troubleshooting#link-to-roles-docs).Invalid\nrole assignment from identity providerThe role assertion in the SAML response is\neither missing or invalid.Confirm that your identity provider is set up to send\nthe necessary role assertions. Review the IdP’s configuration and role mappings.\nIf role assertions are missing, consult the IdP documentation or IdP support on\nhow to properly configure them. Detailed instructions can be found in our [Role\nAssertion\nGuide](https://docs.stripe.com/get-started/account/sso/troubleshooting#link-to-role-assertion-guide).\n## Other common errors\n\nThe following examples are additional error messages that you might encounter\nand possible solutions.\n\n### Configure your app error\n\nWhen configuring your application, you might see an error message indicating an\nissue with authentication:\n\n```\n{\"error\":{\"message\":\"Required field\",\"param\":\"RelayState\"}}\n```\n\nThis might indicate that you’re starting authentication from an identity\nprovider that doesn’t support service provider-initiated authentication. We\nsupport only identity provider-initiated authentication where the identity\nprovider also supports service provider-initiated authentication. This issue\nmight also occur if your identity provider isn’t correctly passing the\n`RelayState` parameter from the authentication request back with your assertion.\n\n### Sign into Stripe error\n\nWhen signing into Stripe, you might see the following error message:\n\n```\nSAML. Error: Invalid signature type\n\n```\n\nThis error indicates that the SAML response isn’t signed with the correct\nalgorithm. The signature algorithm must be `RSA-SHA256`, and the digest\nalgorithm must be `SHA256`. We enforce these standards for security reasons\nbecause `SHA-256` is the industry-standard hashing algorithm. `SHA-1`, the\nprevious standard, is no longer considered secure. Refer to your identity\nprovider’s documentation for guidance on configuring your integration to use\n`SHA-256`.\n\n### UI log in error\n\nIf you can’t use the UI to log in with SSO after configuration, it might\nindicate that your domain isn’t validated. Make sure the exact domain that you\nuse for your email is verified in the [User\nauthentication](https://dashboard.stripe.com/account/user_authentication) page.\n\nIf you’ve validated the same domain in multiple accounts with different identity\nprovider configurations, we can’t determine which identity provider to use. To\nresolve this, use the following URL with your verified domain to directly sign\ninto your account with SSO. This URL includes the domain and account for\nauthentication. By changing the account token at the end of the URL, you can\nauthenticate against a different account.\n\n```\n\nhttps://dashboard.stripe.com/login/saml_direct/domain/{{YOUR_DOMAIN}}/merchant/{{STRIPE_ACCOUNT_ID}}\n\n```\n\nIf you have another account that isn’t controlled by SSO and haven’t validated\nyour email address for that account, validate your email address and try again.\n\n### Missing role error\n\nIf you encounter an error indicating you need to have a role when trying to sign\nin after configuring SSO, this means we haven’t received a role for the user in\nthe SAML assertion from the identity provider. Verify that the assertion being\nsent to Stripe contains the following attribute.\n\n```\n<saml2:AttributeStatement>\n<saml2:Attribute Name=\"Stripe-Role-\"\nNameFormat=\"urn:oasis:names:tc:SAML:2.0:attrname-format:basic\">\n <saml2:AttributeValue>role_id\n </saml2:AttributeValue>\n </saml2:Attribute>\n</saml2:AttributeStatement>\n```\n\nIf the assertion already contains this attribute, make sure that you’re sending\na valid `role_id`.\n\n### CSRF token error\n\nIf you encounter a CSRF token error, verify that you’ve correctly configured the\nURLs in your identity provider. Pay close attention to the **SSO URL** and\n**Audience URI** or **Entity ID** as indicated in the documentation, and ensure\nyou’ve entered them accurately in your identity provider setup.\n\n### Locked out of the Dashboard\n\nIf only one team member is locked out of the Stripe Dashboard, it usually\nindicates an incorrect configuration within the identity provider. Typically,\nthe problem is that the SAML authentication request doesn’t include a role for\neach Stripe account the team member needs to access. The team member must\nconsult with their identity provider’s administrator to verify their\nconfiguration is correct.\n\nIf all team members are locked out of the Stripe Dashboard, it might be due to\nmisconfigured SSO settings or an issue with the identity provider, such as an\noutage. In this scenario, the account representative must contact [Stripe\nsupport](https://support.stripe.com/contact). After identity verification, we\nchange the account’s SSO configuration from `Required` to `Optional`, allowing\nthe identity provider’s administrator to sign in and fix the configuration.\n\n## SSO limitations\n\nStripe doesn’t support the following SSO features:\n\n- **User deletion in SAML**: Due to the limitations of SAML, Stripe doesn’t get\nnotified when user access is revoked in the IdP. If users attempt to log in\nagain through SSO after their current session expires, Stripe automatically\nrevokes their access. To remove access instantly, delete the users in your [Team\nsettings](https://dashboard.stripe.com/settings/team).\n- **System for Cross-domain Identity Management (SCIM)**: SCIM is a protocol\nthat an IdP uses to synchronize user identity lifecycle processes—such as\nprovisioning, deprovisioning access, and populating user details—with a service\nprovider such as Stripe.\n\nIf a team member is added to your identity provider, Stripe handles Just-in-Time\ncreation for that team member. This means that if the team member signs in with\nSSO to the Stripe Dashboard and doesn’t have an existing Stripe account, we\ncreate one for them. When you change a team member’s Dashboard role, Stripe\nupdates their role the next time they sign in.\n\n- **Mobile app authentication**: We don’t support SSO through Stripe’s mobile\napps.\n- **Configure SSO session length**: The SSO session length is set to 12 hours\nand isn’t configurable.\n- **Native IdP-initiated login**: Support for authentication through the Service\nProvider necessary for Identity Provider-initiated login to work. Native\nIdP-initiated login isn’t supported due to security concerns with the SAML\nprotocol.\n\nFor example, a man-in-the-middle attack might intercept the SAML assertion and\nreplay it later to gain unauthorized access to an account. When team members\nattempt to sign in using their IdP, Stripe treats the request as a Service\nProvider-initiated login and authenticates the team member as expected.\n\n## SSO supported features\n\nStripe supports the following SSO features:\n\n- **Team members with different roles**: When signing in, your identity provider\nmust send the correct team member’s role in the AttributeStatement. For a\nworking example, see Okta’s [Mapping dynamic team member roles to\ngroups](https://docs.stripe.com/get-started/account/sso/okta#assign-stripe-roles).\n- **Sign in to multiple accounts using one SAML assertion**: Send Stripe an\nassertion from your identity provider with multiple role attributes that contain\nall the account ids that you want to configure access to. For example:\n\n```\n<saml2:AttributeStatement>\n<saml2:Attribute Name=\"Stripe-Role-STRIPE-ACCOUNT-ID1\"\nNameFormat=\"urn:oasis:names:tc:SAML:2.0:attrname-format:basic\">\n <saml2:AttributeValue>role_id\n </saml2:AttributeValue>\n </saml2:Attribute>\n<saml2:Attribute Name=\"Stripe-Role-STRIPE-ACCOUNT-ID2\"\nNameFormat=\"urn:oasis:names:tc:SAML:2.0:attrname-format:basic\">\n <saml2:AttributeValue>role_id\n </saml2:AttributeValue>\n </saml2:Attribute>\n</saml2:AttributeStatement>\n```\n- **Disable SSO**: You can set the **enforcement mode** of your account to\n**Off** from the [User\nauthentication](https://dashboard.stripe.com/account/user_authentication) page\nto disable SSO. This removes access for any user who can only access the team\nwith SAML. This includes any user who doesn’t have a password set.\n- **Migrate to another IdP**: To migrate to another IdP, update your SSO\nsettings from the [User\nauthentication](https://dashboard.stripe.com/account/user_authentication) page.\nWhen updating SSO settings, first set the **enforcement mode** of your account\nto **optional**.\n\nThis ensures that if there’s an issue, you can still sign in to the Stripe\nDashboard with your email and password. If you have a test account, update your\nSSO settings in your test account first and validate the new settings before\nupdating your other accounts.\n\n## Links\n\n- [SAML\nTracer](https://chromewebstore.google.com/detail/saml-tracer/mpdajninpobndbfcldcmbpnnbhibjmch?hl=en)\n- [User\nauthentication](https://dashboard.stripe.com/account/user_authentication)\n- [Stripe support](https://support.stripe.com/contact)\n- [Team settings](https://dashboard.stripe.com/settings/team)\n- [Mapping dynamic team member roles to\ngroups](https://docs.stripe.com/get-started/account/sso/okta#assign-stripe-roles)",
  "metadata": {
    "title": "Troubleshoot SSO | Stripe Documentation",
    "description": "Learn how to resolve common errors that might occur when configuring SSO.",
    "sourceURL": "https://docs.stripe.com/get-started/account/sso/troubleshooting"
  }
}