{
  "content": "# Website checklist\n\n## Make sure your website aligns with card network standards and e-commerce best practices.\n\nThis page contains a list of the common elements—such as accurate product\ndescriptions, clear policies, and proper security features—that each business on\nStripe should address on its website. Adhering to these recommendations reduces\nthe risk of customer confusion and disputes. It also helps you meet Stripe’s\nstandards and the standards set by the credit card networks.\n\nOur [Stripe Shop Terms of Use](https://stripe.com/stripe-shop/legal) are\navailable under the [Creative Commons Attribution 4.0 International\nLicense](http://creativecommons.org/licenses/by/4.0/). To ensure compliance with\ncard network rules, feel free to use the Stripe Shop Terms as a starting point\nas you build your site.\n\n- A description of what you are selling\nBesides only listing the name of the product or service, you can help customers\nwith their purchasing decision by providing detailed text descriptions of what\nyou’re selling. For physical goods, include multiple pictures and information\nabout material, colors, and other details. This is also an important measure to\nprotect against potential disputes: setting the right expectations up front\ngives your customers a clear idea of what they get for their money.\n\nIf we review your website and find that it isn’t clear what you’re selling, we\nmay contact you with recommendations for improving the description.\n- The purchase currency\nTo support international purchasers, clearly display the currency associated\nwith the prices on your site. Listing only the currency symbol may not be\nenough, so be as explicit as possible when showing prices.\n- Customer service contact information\nMake sure your customers can find multiple contact methods on your site,\nincluding direct communication channels, such as email addresses, phone numbers,\nand live chat (something besides contact forms). Low-friction communication is\nkey to providing a good customer experience and heading off misunderstandings\nearly on, helping to avoid disputes.\n\n​​If we review your website and can’t find a clear way to contact you, we may\nask that you add some contact options to the site.\n- Your fulfillment policies\nFor most businesses, you must clearly explain your order fulfillment policies to\nyour customers. Some examples of policies required for many businesses include:\n\n- Refund policy: Describe the conditions under which customers can receive a\nrefund.\n- Shipping or delivery policy: Describe shipping methods, times, and rates, as\nwell as eligible destinations.\n- Return policy and process: Describe the conditions under which customers can\nreturn purchased goods and the return process.\n- Cancellation policy: Describe the conditions under which customers can cancel\nsubscriptions or reservations.\n\n#### Note\n\nBusinesses that have no fulfillment process, such as those that only offer\nin-person services or that only process charitable donations, don’t have to\ninclude fulfillment policies.\n\nCommunicating clear and fair fulfillment policies builds customer trust and can\nprotect you against disputes. If your website doesn’t include sufficient\ninformation about your fulfillment policies, we might request that you add it.\nIf you aren’t sure what information you need to add, or you want us to review\nupdates that you’ve made in response to our request, [contact Stripe\nSupport](https://support.stripe.com/).\n- Legal or export restrictions applicable to your business\nCertain products and services are subject to restrictions. Properly disclosing\nany applicable restrictions and how they may impact your customers helps build\ntrust with them.\n- Your website's privacy policy\nConsumer data privacy is now a priority for legislation and governments around\nthe world. Clearly explaining your website’s privacy policy helps you both\ncomply with privacy laws and helps your customers understand how their data is\nprotected, used, or disclosed.\n- Your business address\nIf you have a physical address, listing it on your website adds credibility for\nyour business.\n- The terms of any promotions you are offering\nClearly disclose the conditions of any promotion, discount, or trial that you\noffer to customers. Display a link or disclaimer text so that it’s visible when\ncustomers agree to participate. Transparency around these conditions can help\navoid confusion and disputes.\n- The security of your website and customer payment information\nMake sure that your customers know that you comply with the PCI standards. You\ncan learn more about what [PCI\ncompliance](https://docs.stripe.com/security/guide#validating-pci-compliance)\nmeans for Stripe by reading about [integration\nsecurity](https://docs.stripe.com/security). Ensure that your website\n(especially your payment form) uses HTTPS and other security best practices and\nis not susceptible to [card\ntesting](https://docs.stripe.com/disputes/prevention/card-testing). You must\nalso explain that your customer’s payment information is handled safely when\ndoing business with you.\n- The logos of the credit cards you accept\nYou can reduce friction in the checkout process by displaying the brand logos of\nthe credit cards that you accept, making it clear to customers that you accept\ntheir preferred card.\n\n## Card network policies\n\nThese guidelines are based on the rules published by the card networks. As an\nonline merchant, it’s your responsibility to ensure that you’re compliant with\nthese rules, including the [Visa Rules and\nRegulations](https://usa.visa.com/dam/VCOM/download/about-visa/visa-rules-public.pdf),\nthe [Mastercard\nRules](https://www.mastercard.us/en-us/business/overview/support/rules.html),\nthe [American Express Merchant Operating\nGuide](http://www.americanexpress.com/merchantopguide), and the Discover Network\nRules (please [contact Discover](https://www.discover.com/contact-us/) for a\ncopy).\n\n## Links\n\n- [Stripe Shop Terms of Use](https://stripe.com/stripe-shop/legal)\n- [Creative Commons Attribution 4.0 International\nLicense](http://creativecommons.org/licenses/by/4.0/)\n- [contact Stripe Support](https://support.stripe.com/)\n- [PCI\ncompliance](https://docs.stripe.com/security/guide#validating-pci-compliance)\n- [integration security](https://docs.stripe.com/security)\n- [card testing](https://docs.stripe.com/disputes/prevention/card-testing)\n- [Visa Rules and\nRegulations](https://usa.visa.com/dam/VCOM/download/about-visa/visa-rules-public.pdf)\n- [Mastercard\nRules](https://www.mastercard.us/en-us/business/overview/support/rules.html)\n- [American Express Merchant Operating\nGuide](http://www.americanexpress.com/merchantopguide)\n- [contact Discover](https://www.discover.com/contact-us/)",
  "metadata": {
    "title": "Website checklist | Stripe Documentation",
    "description": "Make sure your website aligns with card network standards and e-commerce best practices.",
    "sourceURL": "https://docs.stripe.com/get-started/checklist/website"
  }
}