{
  "content": "# Choose settlement preference\n\n## Learn about settlement modes for PayPal payments.\n\nSettlement choice determines how you access and manage funds, use the Dashboard,\nperform reconciliation, and so on.\n\n## Getting started\n\nIf you’re a Connect user, your funds always settle on Stripe, similar to other\npayment methods. If you operate as a direct business, when you [connect your\nPayPal and Stripe accounts](https://docs.stripe.com/payments/paypal/activate)\nyou can set the funds settlement preference for your PayPal payments. Read this\nguide to learn more about differences between PayPal and Stripe settlement\noptions.\n\nIf you already use PayPal through Stripe, you can check your current settlement\npreference on the [Payment Methods\nSettings](https://dashboard.stripe.com/settings/payment_methods) page in the\nStripe Dashboard.\n\n## Money flow and payouts\n\nIf you settle funds from the PayPal payments on Stripe, you can access the money\nfrom your Stripe balance according to your\n[payouts](https://docs.stripe.com/payouts) schedule, similar to other payment\nmethods at Stripe. The funds from the payments you receive are immediately\ntransferred from PayPal to your Stripe balance, without the need for you to take\nany action.\n\nIf you settle PayPal payments to PayPal, you’ll need to manage payouts on\nPayPal.\n\n## Refunds and disputes\n\nSettlement on Stripe uses the funds available in your Stripe account if you want\nto refund a payment or need to cover the funds from a dispute, similarly to\nother payment methods on Stripe. If PayPal charges a fee when a dispute closes,\nit’s withdrawn from your Stripe balance through a [Balance\nTransaction](https://docs.stripe.com/reports/balance-transaction-types) of type\n`adjustment`.\n\nFor settlement on PayPal, you can still manage refunds and disputes from your\nStripe Dashboard, but the relevant funds are the funds on your PayPal account.\nIf you settle on PayPal, Stripe doesn’t transfer any funds from your PayPal\naccount to your Stripe account or vice-versa. Make sure there is always a\npositive balance in both accounts to cover expected refund amounts or disputes,\nand fees that PayPal might charge when the dispute closes.\n\n## Dashboard\n\nIf you settle your funds from PayPal payments on Stripe, the Stripe Dashboard\nfunctionality is the same as with other payment methods on Stripe.\n\nIf you settle your PayPal funds on a PayPal account, the [balance\ntransaction](https://docs.stripe.com/api#balance_transaction_object) linked to\nthe corresponding payment has a zero amount regardless of the payment, because\nfunds settle in your PayPal balance, and no money goes to your Stripe balance.\n\nAdditionally, the Gross and Net volume charts won’t reflect your sales volume\nfrom PayPal if you settle your funds on a PayPal account. In this case, we\nrecommend using the Payment methods report to track the volume from PayPal\nsales.\n\nThe payment details view is also different if you settle your PayPal funds to\nyour PayPal account. The **Net** value reflects the change on the net volume of\nyour Stripe balance. This is a negative value of the fee amount that Stripe\ntakes for the payment.\n\n## Reconciliation impact\n\nReconciliation is the process of matching and verifying payments that have been\nreceived and processed with the corresponding PayPal orders.\n\nWhen settling your funds on Stripe, you get automatic transactions\nreconciliation.\n\nIf you settle on PayPal, you need to manually reconcile the transactions. Learn\nabout how Stripe provides support for PayPal [transaction\nreconciliation](https://docs.stripe.com/payments/paypal/payout-reconciliation).\n\n## Changing your settlement preference\n\nIf for any reason you need to change your current settlement mode, you can\ninitiate the process from the Stripe Dashboard.\n\n- Go to the [Payment Methods Settings\npage](https://dashboard.stripe.com/settings/payment_methods).\n- Find PayPal settings.\n- Click **Contact Support to change**. You’ll be redirected to the FAQ page\nwhere you can file a support ticket.\n- File a support ticket to request a change.\n\nThe change shows up in the PayPal settings accordingly.\n\n## Currency conversions\n\nA currency conversion occurs when the [presentment\ncurrency](https://docs.stripe.com/currencies#presentment-currencies) differs\nfrom the settlement currency. See [currency\nconversions](https://docs.stripe.com/connect/currencies#currency-conversions)\nfor additional detail. Prevent currency conversions by adding a [settlement\ncurrency](https://docs.stripe.com/payouts/multicurrency-settlement#enable-multi-currency-settlement)\nfor every currency you present to your customers.\n\n## Links\n\n- [connect your PayPal and Stripe\naccounts](https://docs.stripe.com/payments/paypal/activate)\n- [Payment Methods\nSettings](https://dashboard.stripe.com/settings/payment_methods)\n- [payouts](https://docs.stripe.com/payouts)\n- [Balance\nTransaction](https://docs.stripe.com/reports/balance-transaction-types)\n- [balance transaction](https://docs.stripe.com/api#balance_transaction_object)\n- [transaction\nreconciliation](https://docs.stripe.com/payments/paypal/payout-reconciliation)\n- [presentment\ncurrency](https://docs.stripe.com/currencies#presentment-currencies)\n- [currency\nconversions](https://docs.stripe.com/connect/currencies#currency-conversions)\n- [settlement\ncurrency](https://docs.stripe.com/payouts/multicurrency-settlement#enable-multi-currency-settlement)",
  "metadata": {
    "title": "Choose settlement preference | Stripe Documentation",
    "description": "Learn about settlement modes for PayPal payments.",
    "sourceURL": "https://docs.stripe.com/payments/paypal/choose-settlement-preference"
  }
}