{
  "content": "# Credit transfers (Sources)Deprecated\n\n## Learn about bank transfers with Stripe.\n\n#### Warning\n\nStripe doesn’t recommend using credit transfers, which you integrate using the\ndeprecated [Sources API](https://docs.stripe.com/api/sources). Use the\n[PaymentIntents](https://docs.stripe.com/api/payment_intents) and\n[PaymentMethods](https://docs.stripe.com/api/payment_methods) APIs to [accept\nbank transfer payments](https://docs.stripe.com/payments/bank-transfers).\n\nCredit transfers let customers send money to you directly from their bank\naccount. Credit transfers are often used by:\n\n- Software or services businesses accepting large, one-off payments from other\nbusinesses.\n- Businesses that want a low-cost alternative to cards for large one-time\nconsumer payments, like car or auction purchases.\n\nCredit transfers might not be a good fit for your business if:\n\n- You accept many low value transactions. Customers have to initiate credit\ntransfers through their bank account, and can send the wrong amount.\n- You need payments to complete at a specific time. It might take a customer\nhours or even days to send payment through their bank and credit transfers have\nvarying speeds by market.\n- You frequently send refunds. Most credit transfer methods don’t support\nrefunds directly. To refund a transaction, Stripe contacts the customer to find\nthe best way to refund them. The customer might not always respond.\n\n## Payment flow\n\nAt checkout, you instruct the customer to send funds to an account number\nprovided by Stripe (known as a “virtual account number”). The customer initiates\nthe transfer from their bank’s site, app, ATM, or in-person branch.\n\n![Figure describing the four step payment flow. First, customer elects pay by\ncredit transfer. Next, they receive a virtual bank account number created by\nStripe. Then, they send payment through their bank to the virtual account\nnumber. Finally, they're notified payment is\ncomplete.](https://b.stripecdn.com/docs-statics-srv/assets/payment_flow.eb89dee4d8cf3a2bd038b6c790fd0cf4.svg)\n\nSome credit transfer methods let you control the amount the customer sends, or\nreuse virtual account numbers.\n\n## Product support\n\nPayment method Customer country PaymentIntents Checkout Connect Invoicing\nSubscriptions Payment Element Payment Links Mobile Payment Element [Multibanco\n(beta)](https://docs.stripe.com/sources/multibanco)Portugal\n\n## Links\n\n- [Sources API](https://docs.stripe.com/api/sources)\n- [PaymentIntents](https://docs.stripe.com/api/payment_intents)\n- [PaymentMethods](https://docs.stripe.com/api/payment_methods)\n- [accept bank transfer\npayments](https://docs.stripe.com/payments/bank-transfers)\n- [Multibanco (beta)](https://docs.stripe.com/sources/multibanco)",
  "metadata": {
    "title": "Credit transfers (Sources) | Stripe Documentation",
    "description": "Learn about bank transfers with Stripe.",
    "sourceURL": "https://docs.stripe.com/payments/sources/credit-transfers"
  }
}