{
  "content": "# Choose which type of card to issue\n\n## Decide on physical or virtual cards for your cardholders.\n\nStripe offers several options for the types of cards that can be issued to\ncardholders. This page describes these options at a high level, including\ntradeoffs and use cases for each.\n\nYou can issue multiple card types simultaneously for your card program and can\nalso transition to different options as your business needs change. For example,\nif you wanted to create a custom card, you could issue an instant physical card\nwhile you’re working with the Stripe team to manufacture your custom design. The\nfollowing options aren’t mutually exclusive.\n\nVirtual cardsPhysical cardsOverviewCards with no physical representation, but\nwhich include all the card information required for digital transactions. [Read\nmore about virtual cards](https://docs.stripe.com/issuing/cards/virtual).Cards\nthat can be physically personalized and shipped to cardholders. [Read more about\nphysical cards](https://docs.stripe.com/issuing/cards/physical).Best forVirtual\ncards are best for use cases where card transactions are expected to be\ncompletely digitized, or if you plan to use your card to complete a backend\nprocess, such as fulfilling a customer’s order with a third party. Examples of\nuse cases that would benefit from virtual cards would be B2B payments (a\nbusiness is paying a supplier for a good or service) or buy now, pay later\npayments (a business is paying a merchant).Physical cards are best when you\nexpect to support a high degree of in-person point-of-sale transactions and you\ndon’t want to rely on digital wallets alone. Use cases such as fleet or\ncontractor purchases or expense management often require physical cards.\n**Customization**\n\nNot applicable for virtual cards.\n\nPhysical cards have two customization options:\n\n- Standard cards-black or white templated cards that you can personalize with\nyour business name or logo and instantly send to cardholders. These are best if\nyou want to prioritize speed-to-market, if basic branding is sufficient for your\ncardholders, or if you need to issue only a few cards.\n- Custom cards-you can fully customize cards to best feature your branding\ngoals. These are best if your physical card is a core identifier of your\nbusiness or if you want to build brand affinity with your cardholders. However,\ncustom cards are subject to minimum orders of 2,500 cards and require\nsignificant planning and investment.\n\nFor more on the types of physical cards available, see [Physical\ncards](https://docs.stripe.com/issuing/cards/physical).\n\n**Creating cards**\n\nVirtual cards can be created using the Dashboard or API. Once created, cards are\nimmediately generated and available for use.\n\nYou can create physical cards using the Dashboard or API. After they’re created,\ncards are printed and shipped out within a few days. From there, time of\ndelivery to the cardholder depends on the shipping speed you choose. See\n[Shipping your cards](https://docs.stripe.com/issuing/cards/physical/ship-cards)\nfor more details.\n\n*Note: Custom cards must be manufactured, tested, and stocked in inventory\nbefore they can be printed out and shipped. Lead times and prices will vary\ndepending on the level of customization. See Stripe Support for more details.*\n\n**Cost**\n\nVirtual cards are 0.10 USD each in the US, 0.10 GBP in the UK and 0,10 EUR in\nthe EU.\n\nStandard cards are 3.50 USD each in the US, 3.50 GBP in the UK, and 3,50 EUR in\nthe EU. Shipping costs apply for each region.\n\nCustom card prices depend on the level of customization of your card design. See\n[Stripe Support](https://support.stripe.com/topics/issuing) for more details.\n\nDigital Wallet support[Digital\nwallets](https://docs.stripe.com/issuing/cards/digital-wallets) support all of\nour card types. A cardholder can add a representation of your virtual or\nphysical card to their digital wallet for Apple Pay, Google Pay, or Samsung Pay.\nBecause of market variations, the lead times for digital wallets vary depending\non region and might require partnering with Stripe. See [Stripe\nSupport](https://support.stripe.com/topics/issuing) for more details.\n\n## Links\n\n- [Read more about virtual cards](https://docs.stripe.com/issuing/cards/virtual)\n- [Read more about physical\ncards](https://docs.stripe.com/issuing/cards/physical)\n- [Shipping your\ncards](https://docs.stripe.com/issuing/cards/physical/ship-cards)\n- [Stripe Support](https://support.stripe.com/topics/issuing)\n- [Digital wallets](https://docs.stripe.com/issuing/cards/digital-wallets)",
  "metadata": {
    "title": "Choose which type of card to issue | Stripe Documentation",
    "description": "Decide on physical or virtual cards for your cardholders.",
    "sourceURL": "https://docs.stripe.com/issuing/choose-cards"
  }
}