{
  "content": "# Marketing Treasury-based services\n\n## Create precise messaging for your users that complies with regulations.\n\nMany states have statutory prohibitions on references to “banking,\" “banks,\" and\n“bank accounts” when the entities making these references are not state- or\nfederally-chartered banks or credit unions. Imprecise terminology of Stripe\nTreasury accounts might draw scrutiny from regulators.\n\n## Recommended Terms\n\nFor your platform to efficiently leverage Stripe Treasury, you need to brand and\ncommunicate the nature of the product while being mindful of regulations. Refer\nto the following list of recommended terms to use in your messaging when\nbuilding out your implementation of the product.\n\n- Money management, or money management account or solution\n- Cash management, or cash management account or solution\n- [Your brand] account\n- Financial services\n- Financial account\n- Financial product\n- Financial service product\n- Store of funds\n- Wallet or open loop wallet\n- Stored-value account\n- Open-Loop stored-value account\n- Prepaid access account\n- Eligible for FDIC “pass-through” insurance\n- Funds held at [Partner Bank], Member FDIC\n\n## Terms to Avoid\n\nAvoid the terms in this list for any marketing programs you create because only\nfinancial institutions licensed as banks can use them.\n\n- Stripe or [Your Brand] bank\n- Bank account\n- Bank balance\n- Banking\n- Banking account\n- Banking product\n- Banking platform\n- Deposits\n- Mobile banking\n- [Your Brand] pays interest\n- [Your Brand] sets interest rates\n- [Your Brand] advances funds\n- Phrases that suggest your users receive banking products or services directly\nfrom bank partners, for example:- Create a [Bank Partner] bank account\n- A better way to bank with [Bank Partner]\n- Mobile banking with [Bank Partner]\n\n## Cash back compliance marketing guidance\n\nAs a platform, you can provide your customers with cash back, calculated in\nrelation to their Treasury balance. We understand that this can be a great value\nproposition as part of your product. When you market and disclose cash back to\nyour potential and existing customers, don’t conflate cash back with yield or\ninterest. We’ve outlined best practices for your marketing disclosures below. If\nyou have any questions on how to present cash back in your marketing, reach out\nto our compliance team at\n[platform-compliance@stripe.com](mailto:platform-compliance@stripe.com)\n\n- Recommended Terms:- Always refer to cash back as “cash back,” “rewards,” or\nother terms that don’t imply interest.\n- Always disclose prominently in your marketing materials that the cash back\nprogram is subject to change and the conditions under which it might change.\n- Notify your existing customers whenever the cash back program has changed.\nProminently display the calculation method in their Dashboard.\n- Terms to avoid- Never refer to cash back as “interest” or “yield.”\n- Don’t reference the Fed Funds Rate as a benchmark for calculating cash back.\n- Don’t imply that cash back is is pass-through interest from a bank partner.\n\n### How to talk about FDIC insurance eligibility\n\nStripe Treasury balances are stored value accounts that are held “for the\nbenefit of” our Stripe Treasury users with our bank partners, Evolve Bank &\nTrust and Goldman Sachs Bank USA. We disclose to you which of our partners hold\nyour funds. For FDIC insurance to apply to a user’s balance in a “for the\nbenefit of” account, we must satisfy the rules for FDIC pass-through deposit\ninsurance, unlike a bank account directly with an FDIC insured bank.\n\nWe understand that FDIC insurance eligibility can be a valuable feature to your\ncustomers. Stripe has approved the variations of the phrase “FDIC Insurance\n**eligible**” noted below on marketing materials, as long as certain conditions\nare met. **Specifically**, the statement of FDIC insurance eligibility must\nalways be paired with two disclosures:\n\n- Stripe Treasury Accounts are eligible for FDIC pass-through deposit insurance\nif they meet certain requirements. The accounts are eligible only to the extent\npass-through insurance is permitted by the rules and regulations of the FDIC,\nand if the requirements for pass-through insurance are satisfied. The FDIC\ninsurance applies up to 250,000 USD per depositor, per financial institution,\nfor deposits held in the same ownership capacity.\n- You must also disclose that neither Stripe nor you are an FDIC insured\ninstitution and that the FDIC’s deposit insurance coverage only protects against\nthe failure of an FDIC insured depository institution.\nThe following terms that incorporate the term “eligible” are approved:Don’t use\nthe following terms:- “Eligible for FDIC insurance”\n- “FDIC insurance-eligible accounts”\n- “Eligible for FDIC pass-through insurance”\n- “Eligible for FDIC insurance up to the standard maximum deposit insurance per\ndepositor in the same capacity\"\n- “Eligible for FDIC insurance up to $250K”\n- “FDIC insured”\n- “FDIC insured accounts”\n- “FDIC pass-through insurance guaranteed”\n\nWe have also prepared these FAQs that you can use when your customers have\nquestions about FDIC insurance eligibility or any of the disclosures:\n\nIs FDIC insurance impacted if a customer holds deposits in other accounts with\nthe same institution?It can be. It’s your responsibility to know which insured\ninstitutions hold your funds. If you have other business-purpose accounts with\nthe same institution where Treasury funds are held, the FDIC might aggregate all\nof your business account balances with that institution in applying the 250,000\nUSD limit. The FDIC generally does not, however, aggregate your personal\naccounts with your business accounts.Does FDIC insurance eligibility protect\nfrom fraud or financial loss?No, FDIC insurance eligibility is applicable only\nin the event of a bank failure.How do I know if the requirements for FDIC\npass-through insurance are met?Stripe Treasury accounts are designed to be\neligible for FDIC pass-through insurance. The FDIC makes the final determination\nabout the availability of pass-through insurance at the time of a bank’s\nfailure.",
  "metadata": {
    "title": "Marketing Treasury-based services | Stripe Documentation",
    "description": "Create precise messaging for your users that complies with regulations.",
    "sourceURL": "https://docs.stripe.com/treasury/marketing-treasury"
  }
}