{
  "content": "# App listing guidelines\n\n## Follow the specifications and guidelines to define the contents of your app listing page before publishing to the App Marketplace.\n\nListing your app in the [Stripe App\nMarketplace](https://marketplace.stripe.com/) requires you to follow the\nspecifications, and we provide guidelines for you to follow. You can also read\nthe [App review\nrequirements](https://docs.stripe.com/stripe-apps/review-requirements) that set\nexpectations for the app review process.\n\n## App listing guidelines and specifications\n\nContentSpecificationsGuidelinesExampleName35 characters max. Must not contain\nany of the following words or names: `Stripe`, `app`, `free`, `paid`.Appears\nalongside your app logo throughout the Marketplace and on your app listing\npage.EmailWorldIcon logoImage must be high-resolution, at least 300x300 pixels,\n1:1 aspect ratio (square), .PNG or .JPG format, and under 10MB.Appears alongside\nyour app name throughout the App Marketplace and on your app listing page.Built\nby80 characters max.Name of the individual or organization that built and\nmaintains the app.EmailWorld, IncCategorySelect the category that best describes\nyour app.If another category is more appropriate, Stripe adjusts it and notifies\nyou during app review.- Support\n- Sales\nSubtitle80 characters max.Appears alongside your app name throughout the\nMarketplace and on your app listing page. This is a concise phrase summarizing\nthe value of app.See and edit a customer’s support history from the Stripe\nDashboardAbout1000 characters max.Briefly describe what your company does, who\nyour products are for, and the value they deliver for people. An ideal\ndescription is one to two sentences, overviewing your main product or overall\ncompany, followed by a brief description of your Stripe app. Avoid hyperbole,\nmarketing jargon, keyword stuffing or unprovable claims (for example, “The\nworld’s best support product”).EmailWorld is an email delivery service for\ngrowing e-commerce businesses. The EmailWorld app brings our advanced messaging\ncapabilities into Stripe so you can reach your audience in just a few\nclicks.Works withAutomatically populatedYour app manifest automatically\npopulates this, which lets users know what parts of the Stripe Dashboard your\n[app drawer](https://docs.stripe.com/stripe-apps/design#available-surfaces)\nworks with.- Payments\n- Customers\nFeaturesAdd up to three key app features that highlight specific use cases of\nyour app.Each feature should explain how the app interacts with and enhances\nStripe, and not describe your company overall.﹂Title80 characters max.Appears\nalongside your key feature visual and description. This is a concise phrase\nsummarizing the use case a user can achieve with your app, in plain language.Get\nemail insights on Stripe customers﹂Description300 characters max.A concise\ndescription of the feature. A good description touches on two things: both a\nclear description of how the feature actually works, and also the benefit\nsomeone experiences as a result of using it.View email activity, such as opens\nand clicks, as it relates to your Stripe customers. Now you can assess how well\nyour campaigns lead to sales without having to toggle between tabs.﹂ImageMust be\nhigh-resolution, a minimum of 1600 pixels wide (no height minimum), PNG or JPG\nformat, and 10MB or less.Use the [Figma UI\ntoolkit](https://docs.stripe.com/stripe-apps/design#figma-ui-toolkit) to design\nand export a high quality feature image. Show your app in the context of the\nStripe Dashboard. Don’t use screenshots showing real customer data or\nscreenshots of your app in test mode.PricingCommunicate whether your app is free\nor requires a paid subscription.- Free\n- Free trial available\n- Paid subscription required\nPricing pageRequired if your app requires a paid subscription.Provide a link to\na pricing page that explains your pricing model to a prospective user.Support\nchannelAt least one support channel is required.Provide up to two support\nchannels. This way, users can quickly identify the best support channel for\ntheir needs and contact you to troubleshoot any issues.- `help@helptable.com`\n- `helptable.com/support`\nBased inSelect each location where your company has headquarters.United\nStatesSupported languages is pre-selected and required. Stripe can only\nsupport at this time. If you’d like to support additional languages,\nreach out to Stripe.Privacy policyProvide a link to your privacy policy.\nThis is a URL where users can read the privacy policy for both your company and\nyour app.`emailworld.com/privacy-policy`Terms of serviceOptionalProvide a link\nto your Terms of Service. This needs to be a URL where users can read the terms\nof service for both your company and your and app.Company websiteOptionalProvide\na link to your company’s website.FAQ pageOptionalProvide a link to your app’s\nFAQ page.Technical documentationOptionalProvide a link to your app’s technical\ndocumentation page. The documentation should explain everything from installing\nyour Stripe app to how to get the most out of its\nfeatures.PermissionsAutomatically populatedYour app manifest automatically\npopulates this. This lets users know which permissions the app requires.\n## See also\n\n- [Publish your app](https://docs.stripe.com/stripe-apps/publish-app)\n- [App review\nrequirements](https://docs.stripe.com/stripe-apps/review-requirements)\n\n## Links\n\n- [Stripe App Marketplace](https://marketplace.stripe.com)\n- [App review\nrequirements](https://docs.stripe.com/stripe-apps/review-requirements)\n- [app drawer](https://docs.stripe.com/stripe-apps/design#available-surfaces)\n- [Figma UI\ntoolkit](https://docs.stripe.com/stripe-apps/design#figma-ui-toolkit)\n- [Publish your app](https://docs.stripe.com/stripe-apps/publish-app)",
  "metadata": {
    "title": "App listing guidelines | Stripe Documentation",
    "description": "Follow the specifications and guidelines to define the contents of your app listing page before publishing to the App Marketplace.",
    "sourceURL": "https://docs.stripe.com/stripe-apps/listing-guidelines"
  }
}