{
  "content": "# Section 83(b) elections\n\n## Learn about common considerations for Section 83(b) elections.\n\n#### Note\n\nStripe Atlas doesn’t provide tax or legal advice. Consult tax and legal\nprofessionals for advice on how to meet ongoing legal, tax, and accounting\nobligations that apply to you and your company.\n\nA Section 83(b) election is a form that lets the Internal Revenue Service (IRS)\nknow you’d like to have your founder stock taxed at the time of purchase rather\nthan at the time of vesting. In many cases, a Section 83(b) election can save\nyou a significant amount on your future taxes.\n\nIf you make a Section 83(b) election, most importantly, you won’t pay taxes when\nyour stock vests. Instead, you choose to pay very little (if any at all) taxes\nat the time of stock purchase, and you won’t owe taxes until you actually sell\nyour stock.\n\n[Atlas files 83(b) elections for all C-corp\nfounders](https://support.stripe.com/questions/atlas-filing-your-83%28b%29-election-using-auto-83%28b%29).\nLLC founders don’t need to file an 83(b) tax election, as equity in an LLC\ncreated with Atlas doesn’t vest.\n\n## Benefits of the Section 83(b) election for newly incorporated startups\n\nStartup lawyers recommend filing a Section 83(b) election if founders purchase\ntheir stock when the company is still at its early stage. If you recently\nincorporated your startup, are currently a US taxpayer, or plan to become one in\nthe future, this filing could save you a significant amount on future taxes. Not\nall stock is eligible for a Section 83(b) election, but if you’re incorporating\na C corporation through Atlas, your company’s stock is eligible because it’s\nsubject to a vesting schedule of 4 years with a one-year cliff.\n\n## Section 83(b) elections for non US residents\n\nIf you live outside the US but file US tax returns, startup lawyers recommend\nmaking a Section 83(b) election because it might save you on future US taxes.\n\nIf you do not currently file US tax returns but think you might become a US\ntaxpayer in the future, making a Section 83(b) election is important. Not doing\nso could result in additional US tax liability when your stock vests.\n\nIf you are not currently a US taxpayer and do not anticipate becoming one in the\nfuture, making a Section 83(b) election doesn’t matter because it affects only\nUS tax liability.\n\nThe IRS requires a US Taxpayer Identification Number (TIN) at the time of\nfiling. This can be either a Social Security Number (SSN) or an Individual\nTaxpayer Identification Number (ITIN). If you don’t have either of these when\nyou incorporate with Stripe Atlas, Stripe informs the IRS that you’re a non-US\ntaxpayer, and you intend to apply for an ITIN upon becoming a US taxpayer.\nConsult a tax advisor about if and when to get an ITIN.\n\n## Tax impact of a Section 83(b) election in detail, with an example\n\nThis election impacts when you owe taxes and the amount that you’re taxed on\nyour founder’s stock.\n\n- Without a Section 83(b) election, you aren’t taxed at the time stock is issued\nto you. However, every time your stock vests in the future, you have to pay\nordinary income taxes to the extent your stock value (often referred to as “fair\nmarket value”) has increased from the date you purchased your stock. When you\nsell your stock, you’ll owe capital gains tax on the difference between the\nvalue of your stock at sale and the value you were taxed on at vesting. (Capital\ngains tax rates on property held for more than one year are generally lower than\nordinary income tax rates. The length of time you hold your stock is called the\n“holding period.\" If you don’t make a Section 83(b) election, your holding\nperiod begins when the stock vests.)\n- With a Section 83(b) election, you only owe ordinary income taxes at the time\nof stock issuance to the extent the value of the purchased stock is greater than\nwhat you pay. If you pay fully for your stock at the time of your stock\npurchase, you should owe no additional income taxes. This is because our stock\npurchase agreement template presumes your stock value equals the issuance price\n(also called par value), reflecting that your company doesn’t have significant\nassets in it yet. If your company is beyond the “raw idea” stage, when the stock\nvalue as assessed by a 409a valuation is higher than the issuance price, consult\nwith your tax advisor. When you later sell your shares, you’re taxed on the\ncapital gains, which is the difference between the stock’s value per share when\nyou sell it and the value when the stock was issued to you. Another advantage of\nmaking a Section 83(b) election is that your holding period begins earlier (when\nyou’re issued the stock), which is typically a year earlier than when you vest\nthe first round of the initial grant.\n\nFor example, your company issues you 200,000 shares valued at 0.0001 USD per\nshare and you pay 0.0001 USD per share using cash. With an 83(b), you don’t have\nan income inclusion in the year the stock is issued as you paid for the value of\nthe shares. If you don’t pay for the value of the shares using cash or other\nassets, a Section 83(b) election means you choose to include as ordinary income\nin the year the shares are issued the full value of the stock (20 USD). If half\nof your stock vests 1 year later and the other half vests 2 years later, you\nhave no tax consequences because you made a Section 83(b) election. If 3 years\nfrom now you sell your stock for 2.00 USD per share (total of 400,000 USD), then\nyou pay capital gains taxes on 399,980 USD (400,000 USD minus 20 USD).\n\nIf you don’t make a Section 83(b) election, you don’t have tax consequences on\nissuance of stock subject to vesting. However, if the value of your shares is\n0.50 USD per share when half vest in 1 year then you would pay ordinary income\ntaxes on 49,990 USD (0.50 USD value minus 0.0001 USD paid per share, multiplied\nby 100,000 shares) at vesting. If the value of your shares is 1.00 USD per share\nwhen the second half vest in 2 years from issuance, then you’d pay ordinary\nincome taxes on 99,990 USD (1.00 USD value minus 0.0001 USD paid per share,\nmultiplied by 100,000 shares) at vesting. If you sell your stock in 3 years for\n2.00 USD per share (total of 400,000 USD), then you pay capital gains taxes on\n250,000 USD (400,000 USD minus 20.00 USD paid for the shares, minus 149,980\nUSD).\n\nNon-founder employees receiving stock subject to vesting are also eligible for a\nSection 83(b) election, but might have additional tax considerations at the time\nof stock issuance. We suggest they consult with their tax advisors before making\nthe election.\n\n## Links\n\n- [Atlas files 83(b) elections for all C-corp\nfounders](https://support.stripe.com/questions/atlas-filing-your-83%28b%29-election-using-auto-83%28b%29)",
  "metadata": {
    "title": "Section 83(b) elections | Stripe Documentation",
    "description": "Learn about common considerations for Section 83(b) elections.",
    "sourceURL": "https://docs.stripe.com/atlas/83b-election"
  }
}