{
  "content": "# Advanced fraud detection\n\n## Learn about tools developers can use to maximize Stripe's ability to prevent fraudulent payments.\n\n[Stripe.js](https://docs.stripe.com/js) is Stripe’s JavaScript library designed\nto enable businesses to securely collect sensitive payment information from the\ncustomer’s browser. The Stripe [iOS\nSDK](https://docs.stripe.com/mobile/ios/basic) and [Android\nSDK](https://docs.stripe.com/mobile/android/basic) are the mobile app\ncounterparts to Stripe.js.\n\nStripe.js and the mobile SDKs provide advanced fraud detection by looking at\nsignals about device characteristics and user activity that help distinguish\nbetween legitimate and fraudulent transactions. These signals power Stripe’s\nfraud prevention systems, such as [Radar](https://docs.stripe.com/radar). The\nsignals are transmitted to Stripe’s back end by periodically making requests to\nthe `m.stripe.com` endpoint.\n\nAlso, on each page where you load Stripe.js, it may load hCaptcha. hCaptcha is a\ntype of CAPTCHA that helps stop fraud and provides additional signals to Stripe\nwhile being low friction for legitimate customers. To opt out of use of hCAPTCHA\nintegration, reach out to [Stripe\nSupport](https://support.stripe.com/contact/login).\n\nOur goal is to maximize payments from legitimate customers while minimizing\nfraud. Fraud can be one of the most challenging aspects of running an online\nbusiness. Even businesses that don’t typically see significant amounts of fraud\ncan see sudden, unexpected, and costly attacks. Stripe prevents more than 500\nmillion USD in payment fraud for Stripe businesses every month. To do that, we\ncollect and analyze information that helps us identify bad actors and bots,\nincluding both transactional data (such as amount, customer shipping address,\ndate, and so on) and advanced fraud detection signals (device and activity\nsignals).\n\nThe details of what we collect and how we use it are disclosed in our [privacy\npolicy](https://stripe.com/privacy) and [cookie\npolicy](https://stripe.com/cookies-policy/legal).\n\n## Types of signals\n\n### Device characteristics\n\nDevice characteristics are signals about a customer’s browser, screen, or\ndevice. They help Stripe identify configurations consistent with anomalous\nbrowsing behavior, as well as compare this behavior to similar patterns observed\nacross other businesses on Stripe’s network. Combinations of these parameters\nthat are rare or unlikely to reflect a real user’s computing environment can\nexpose fraudulent transactions.\n\n### Activity indicators\n\nAdvanced fraud detection signals also include activity indicators from actual\nshoppers that help us distinguish legitimate shoppers from fraudulent purchasers\nand bots. For example, bots tend to move through a website and checkout form\nmuch faster than a real person would; card numbers are also frequently\ncopy-pasted rather than typed. These signals include mouse activity indicators\nand how long a user spends on different pages when shopping, which are both\npredictive of bot-like behavior across the duration of a session.\n\nStripe gathers data about the contents of the page only if they correspond to\ninput fields in Stripe Elements. For example, Stripe might collect an email\naddress to prefill Link signup and login. If the Stripe Element doesn’t have an\nemail field, Stripe won’t collect that information from the contents of the\npage. This information is never saved. Signals corresponding to user activity\nare scoped to a single shopping session on a single site or app and aren’t\nlinked across different shopping sessions, sites, or apps.\n\n## When signals are collected\n\nThe more activity Stripe’s fraud engines can observe, the better Stripe’s fraud\nprevention will be. Stripe therefore encourages including Stripe.js on every\npage of the shopping experience, not just the checkout page. This level of\nStripe.js coverage gives Stripe the richest possible set of such signals to\ndistinguish fraudulent purchasers from real customers.\n\nIf Stripe.js isn’t used at all, the business must take on the full\nresponsibility of [PCI\ncompliance](https://docs.stripe.com/security/guide#validating-pci-compliance),\nand additional fraud risk.\n\nThe iOS and Android SDK collect advanced fraud detection signals for an app when\nthe SDK object is instantiated. The data is only transmitted to Stripe during a\ntokenization request.\n\n## Data privacy\n\nThis advanced fraud detection signal data is never used for advertising and\nwon’t be rented, sold, or given to advertisers, as outlined in our [privacy\npolicy](https://stripe.com/privacy). Stripe only uses this data for fraud\ndetection and security purposes, and retains it for as long as it’s useful for\nthe purposes of fraud detection and security.\n\nInternally, this data is subject to strict access control policies enforced by\nStripe, and restricted to a small number of Stripe employees working on fraud\nprevention and security.\n\n## Disable advanced fraud detection\n\nStripe users can decide to disable the collection of advanced fraud detection\nsignals on their own websites and apps. Doing so increases their risk of fraud,\nespecially [card\ntesting](https://docs.stripe.com/disputes/prevention/fraud-types#card-testing).\nStripe will continue to collect fraud detection signals on Stripe domains, like\non [Stripe Checkout](https://docs.stripe.com/payments/checkout) payment pages.\n\nAdditionally, disabling advanced fraud detection doesn’t affect the collection\nof events logged when a customer interacts with Stripe-managed fields in your\ncheckout page (we use these events to prevent fraud and make sure Stripe\nElements is working) nor basic device information collected during [3D Secure 2\nauthentication](https://support.stripe.com/questions/3d-secure-2-device-information)\n(we’re required to send this information to the issuing bank for their risk\nanalysis).\n\n### Stripe.js\n\nTo disable advanced fraud detection signals with\n[Stripe.js](https://docs.stripe.com/js/including), set `advancedFraudSignals` as\na query parameter in the Stripe.js script tag, or update to the latest version\nof the [Stripe.js module](https://github.com/stripe/stripe-js), use the `pure`\nexport, and call `setLoadParameters`:\n\n```\n<script src=\"https://js.stripe.com/v3/?advancedFraudSignals=false\"></script>\n```\n\n### iOS SDK\n\nTo disable advanced fraud detection signals with the [Stripe iOS\nSDK](https://github.com/stripe/stripe-ios), update to iOS SDK v19.1.1 or later.\nWhen configuring the Stripe SDK, set the `advancedFraudSignalsEnabled` property:\n\n```\nStripeAPI.defaultPublishableKey = \"pk_test_TYooMQauvdEDq54NiTphI7jx\"\nStripeAPI.setAdvancedFraudSignalsEnabled(false)\n```\n\n### Android SDK\n\nTo disable advanced fraud detection signals with the [Android\nSDK](https://github.com/stripe/stripe-android), update to Android SDK v14.4.0 or\nlater. When configuring the Stripe SDK, set the `advancedFraudSignalsEnabled`\nproperty before instantiating or accessing any Stripe SDK objects:\n\n```\nclass MyApp : Application() {\n override fun onCreate() {\n super.onCreate()\n\n Stripe.advancedFraudSignalsEnabled = false\n\n PaymentConfiguration.init(\n applicationContext,\n \"pk_test_TYooMQauvdEDq54NiTphI7jx\"\n )\n }\n}\n```\n\n## Links\n\n- [Stripe.js](https://docs.stripe.com/js)\n- [iOS SDK](https://docs.stripe.com/mobile/ios/basic)\n- [Android SDK](https://docs.stripe.com/mobile/android/basic)\n- [Radar](https://docs.stripe.com/radar)\n- [Stripe Support](https://support.stripe.com/contact/login)\n- [privacy policy](https://stripe.com/privacy)\n- [cookie policy](https://stripe.com/cookies-policy/legal)\n- [PCI\ncompliance](https://docs.stripe.com/security/guide#validating-pci-compliance)\n- [card\ntesting](https://docs.stripe.com/disputes/prevention/fraud-types#card-testing)\n- [Stripe Checkout](https://docs.stripe.com/payments/checkout)\n- [3D Secure 2\nauthentication](https://support.stripe.com/questions/3d-secure-2-device-information)\n- [Stripe.js](https://docs.stripe.com/js/including)\n- [Stripe.js module](https://github.com/stripe/stripe-js)\n-\n[https://js.stripe.com/v3/?advancedFraudSignals=false](https://js.stripe.com/v3/?advancedFraudSignals=false)\n- [Stripe iOS SDK](https://github.com/stripe/stripe-ios)\n- [Android SDK](https://github.com/stripe/stripe-android)",
  "metadata": {
    "title": "Advanced fraud detection | Stripe Documentation",
    "description": "Learn about tools developers can use to maximize Stripe's ability to prevent fraudulent payments.",
    "sourceURL": "https://docs.stripe.com/disputes/prevention/advanced-fraud-detection"
  }
}