{
  "content": "# High risk merchant lists\n\n## Learn the criteria for inclusion in MATCH and VMSS lists.\n\nCard networks, such as Visa and Mastercard, operate databases known as\nTerminated Merchant Files (TMFs) that contain information about accounts that\nhave been closed by credit card processors around the world for high chargebacks\nor violations of card brand rules.\n\nAll payment processors must check these databases when accepting a new user, and\nmust also add merchants to the database if they close the account and it meets\nTMF criteria.\n\nBeing placed on a TMF can have serious effects. While they’re only supposed to\nbe informational tools during the account application process, many entities\nrefuse to accept businesses or individuals listed on a TMF. For this reason,\nit’s important to be aware of TMF criteria and make sure you avoid becoming\neligible.\n\nThe most common lists are Mastercard’s MATCH and Visa’s VMSS. In the following\nsections, we describe how MATCH and VMSS qualification works and what happens to\nMATCH entries.\n\n## MATCH\n\nMATCH stands for Mastercard Alert to Control High-risk Merchants system. MATCH\nis Mastercard’s database of Terminated Merchant Files (TMFs) that contain\ninformation about accounts that have been closed by credit card processors\naround the world for high chargebacks or violations of card brand rules.\n\n### Criteria for MATCH qualification\n\nWhen a relationship ends between a business and a credit card processor, the\nprocessor must determine whether the business meets criteria to be placed on\nMATCH.\n\nIf any MATCH criteria are satisfied, the processor must add information about\nthe business to MATCH within one business day of termination or within one\nbusiness day of the account becoming eligible for MATCH after termination.\n\n#### MATCH qualitative criteria\n\nThe majority of MATCH criteria, or “reason codes,” involve breaches of card\nnetwork rules, including illegal activity and collusion. These 11 reason codes,\nand the exact Mastercard definition, are listed below.\n\nThe Identity Theft reason code should be used when a fraudulent account is\nopened with stolen information, and the listing of this information on MATCH\nshould not hamper the legitimate identity holder from opening a processing\naccount. It instead serves as a warning to the credit card processor that the\napplication may contain stolen identity information.\n\nCode ReasonDescription1Account Data CompromiseAn occurrence that results,\ndirectly or indirectly, in the unauthorized access to or disclosure of Account\ndata.2Common Point of PurchaseAccount data is stolen at the Merchant and then\nused for fraudulent purchases at other Merchant locations.3LaunderingThe\nMerchant was engaged in laundering activity. Laundering means that a Merchant\npresented to its Acquirer Transaction records that were not valid Transactions\nfor sales of goods or services between that Merchant and a bona fide\nCardholder.7Fraud ConvictionThere was a criminal fraud conviction of a principal\nowner or partner of the Merchant.8Mastercard Questionable Merchant Audit\nProgramThe Merchant was determined to be a Questionable Merchant as per the\ncriteria set forth in the Mastercard Questionable Merchant Audit\nProgram.9Bankruptcy/Liquidation/InsolvencyThe Merchant was unable or is likely\nto become unable to discharge its financial obligations.10Violation of\nStandardsWith respect to a Merchant reported by a Mastercard Acquirer, the\nMerchant was in violation of one or more Standards that describe procedures to\nbe employed by the Merchant in Transactions in which Cards are used, including,\nby way of example and not limitation, the Standards for honoring all Cards,\ndisplaying the Marks, charges to Cardholders, minimum/ maximum Transaction\namount restrictions, and prohibited Transactions set forth in Chapter 5 of the\nMastercard Rules manual.11Merchant CollusionThe Merchant participated in\nfraudulent collusive activity.12PCIDSS Non-ComplianceThe Merchant failed to\ncomply with Payment Card Industry (PCI) Data Security Standard (DSS)\nrequirements.13Illegal TransactionsThe Merchant was engaged in illegal\nTransactions.14Identity TheftThe Acquirer has reason to believe that the\nidentity of the listed Merchant or its principal owners was unlawfully assumed\nfor the purpose of unlawfully entering into a Merchant Agreement.\n#### MATCH quantitative criteria\n\nTwo MATCH reason codes have specific numeric thresholds defined by Mastercard\nfor when processors must add accounts to MATCH.\n\nThese reason codes, which involve chargeback and fraud activity on an account,\nare the most common reasons for being added to MATCH, and can affect businesses\nthat are not engaged in illegal or rule-violating activity. These reason codes\nare as follows:\n\nCode ReasonDescription4Excessive ChargebacksWith respect to a Merchant reported\nby a Mastercard Acquirer, the number of Mastercard chargebacks in any single\nmonth exceeded 1% of the number of Mastercard sales Transactions in that month,\nand those chargebacks totaled USD 5,000 or more.5Excessive FraudThe Merchant\neffected fraudulent Transactions of any type (counterfeit or otherwise) meeting\nor exceeding the following minimum reporting Standard: the Merchant’s\nfraud-to-sales dollar volume ratio was 8% or greater in a calendar month, and\nthe Merchant effected 10 or more fraudulent Transactions totaling USD 5,000 or\nmore in that calendar month.\n### Additional information on excessive chargebacks and fraud\n\nThese MATCH reason codes are separate from card brand chargeback and fraud\nmonitoring programs operated by Visa and Mastercard. However, as defined, the\nexcessive chargebacks criteria only applies to activity on Mastercard cards,\neven though MATCH is required by all major card networks. If dispute activity\ndoes not take place on a Mastercard card, it would not qualify toward MATCH\ncounts. Other card networks may ask for businesses to be listed on MATCH if\nthose businesses hit the “excessive” stages of their card brand monitoring\nprograms or are fined as part of those programs.\n\nA month is defined as a calendar month. For example, if a processor were\nevaluating MATCH eligibility from the month of January, they would look at the\nnumber of transactions in January and the number of chargebacks in January—not\nthe number of chargebacks from transactions made in January.\n\nOnce a business meets the excessive chargebacks or fraud MATCH criteria in a\ncalendar month, the merchant must be added to MATCH if the processing\nrelationship is terminated, even if the processing relationship is not ended in\nthat calendar month. For example, if a business only meets MATCH criteria in\nFebruary, and the processing relationship is not ended until September, the\nprocessor is still required to add information to MATCH even though the\nqualifying activity took place in February. Additionally, even if a business\ndoes not meet MATCH criteria when the relationship is initially terminated, it\ncan still qualify for MATCH if the criteria are met afterward—for example, if\nchargebacks are initiated after termination.\n\n#### Example qualification data\n\nTake the following sample data from a calendar month:\n\n- Number of Mastercard transactions: 125\n- Number of Mastercard chargebacks: 6\n- Ratio of chargebacks to transactions: (6/125) = 4.8\n- Volume of Mastercard chargebacks: $6250\n\nIn this case, the business would qualify for MATCH for excessive chargebacks if\nthe processing relationship later terminates. It does not matter if chargebacks\nare later reversed or won by the merchant.\n\nThere is no minimum number of chargebacks for MATCH qualification for excessive\nchargebacks.\n\n### Information added to MATCH\n\nThe card networks require that the following information be added to MATCH if\navailable:\n\n- Business Legal Name and DBA\n- Business Address\n- Business Phone Number\n- Business Tax ID\n- Business URL\n- Principal Owner Name\n- Principal Owner Address\n- Principal Owner Phone Number\n- Principal Owner Tax ID\n- Account Opening Date and Termination Date\n- MATCH Reason Code\n\nMastercard does not assess the accuracy of MATCH listings.\n\n### Removal from MATCH\n\nUnfortunately, Stripe—or any other processor—usually cannot remove an account’s\ninformation from MATCH upon request. A processor can only remove a MATCH entry\nif:\n\n- The processor added the business to MATCH in error.\n- The listing is for MATCH reason code 12 (Payment Card Industry Data Security\nStandard Noncompliance) and the processor has confirmed that the business has\nbecome compliant with the Payment Card Industry Data Security Standard.\n\nIf you believe either of those two situations exist, you’ll need to reach out to\nthe processor that listed your information on MATCH to be removed. Records\nremain on the MATCH system for five years before being automatically purged by\nMastercard.\n\n### Next steps if you’re listed on MATCH\n\nIf you’re listed on MATCH, you’re likely to find out when you attempt to sign up\nfor a new processor. MATCH is only supposed to be used as an informational tool\nby processors during the application process; however, the presence of a MATCH\nlisting often means that an application is declined.\n\nYou’ll need to reach out to your previous processor to find out why your\ninformation was added to MATCH. Note, however, that MATCH criteria are\ndetermined by Mastercard and processors are required to follow this criteria.\nStripe cannot remove a merchant that met the “excessive chargebacks” criteria\neven if the business has remediated the issues leading to chargebacks, for\nexample.\n\nDue to banking partner restrictions, Stripe generally cannot process for\nbusinesses listed on MATCH unless extenuating circumstances apply, such as the\ncase of a legitimate merchant who previously had their identity information\nstolen.\n\nIf you require assistance with a dispute, [contact Stripe\nsupport](https://support.stripe.com/contact).\n\n## VMSS\n\nVMSS is Visa’s database of Terminated Merchant Files (TMFs) that contain\ninformation about accounts that have been closed by credit card processors\naround the world for high chargebacks or violations of card brand rules.\n\n### Criteria for VMSS Qualification\n\nWhen a relationship ends between a business and a credit card processor, the\nprocessor must determine whether the business meets the criteria to be placed on\nVMSS.\n\nIf any VMSS criteria are satisfied, the processor must add information about the\nterminated business to VMSS.\n\n#### VMSS qualitative criteria\n\nThe majority of VMSS criteria, or “reason codes,” involve breaches of card\nnetwork rules, including illegal activity and collusion. See the 13 reason codes\nand the exact Visa definition below.\n\nThe `Identity Theft` reason code applies when a fraudulent account is opened\nwith stolen information, and the listing of this information on VMSS should not\nhamper the legitimate identity holder from opening a processing account. It\ninstead serves as a warning to the credit card processor that the application\nmight contain stolen identity information.\n\nCode ReasonDescription23Transaction LaunderingThe Merchant or Third Party Agent\nmisrepresented the source of submitted transactions (unauthorized aggregation),\nand/or submitted transactions on behalf of another Merchant\n(factoring).24Illegal TransactionsThe Merchant or Third Party Agent submitted\nunlawful and/or prohibited transactions into the payment system.25Visa Risk\nCompliance Program IdentificationThe Merchant or Third Party Agent was\nterminated at the Acquirer’s discretion after identification in a Visa risk\ncompliance program and did not adequately remediate.26Merchant CollusionThe\nMerchant or Third Party Agent colluded to commit fraud.27Common Point of\nPurchase (CPP)The Merchant or Third Party Agent was identified as a location\nwhere account data from legitimate transactions was compromised for use in\nsubsequent fraudulent activity (including skimming) and did not adequately\nremediate.28Fraud ConvictionThe principal owners of a Merchant outlet or Third\nParty Agent was/were convicted of a fraud\ncrime.29Bankruptcy/Liquidation/InsolvencyThe Merchant or Third Party Agent\ncannot fulfill its financial obligations due to potential or actual bankruptcy,\ninsolvency, or suspension of business operations.30Violation of Merchant or\nThird Party Agent AgreementThe Merchant or Third Party Agent breached their\nagreement.31Violation of the Visa RulesThe Merchant or Third Party Agent\nviolated the Visa Rules exposing the Acquirer of the payment system to undue\nrisk.32Account Information Security Program NoncomplianceThe Merchant or Third\nParty Agent was non-compliant with the Payment Card Industry Data Security\nStandard (PCI DSS) and/or the Payment Application Data Security Standard\n(PA-DSS) requirements.33Account Data CompromiseThe Merchant or Third Party Agent\nsuffered a data breach, directly or indirectly resulting in an unauthorized\ndisclosure of payment account and/or transaction information.34Merchant Identity\nTheftThe Merchant application was submitted using principal owner and /or\ncorporate officer information belonging to individuals that were never party to\nthe Merchant agreement.35Disqualification from the Visa Payment SystemVisa\ndisqualified the Merchant or Third Party Agent from participating in the Visa\npayment system.\n#### VMSS quantitative criteria\n\nTwo VMSS reason codes have specific numeric thresholds defined by Visa for when\nprocessors must add accounts to the VMSS list.\n\nThese reason codes, which involve chargeback and fraud activity on an account,\nare the most common reasons for being added to VMSS, and can affect businesses\nthat aren’t engaged in illegal or rule-violating activity. These reason codes\nare as follows:\n\nCode ReasonDescription21Excessive FraudThe Merchant or Third Party Agent\nsubmitted excessive fraudulent transactions (US$250,000 fraud amount and 1.8\npercent (180 basis points) fraud-to-sales amount ratio in any single month) into\npayment system, and did not adequately remediate.22Excessive DisputesThe\nMerchant or Third Party Agent generated excessive disputes (1,000 dispute count,\nand 1.8 percent (180 basis points) dispute-to-sales amount ratio in any single\nmonth) into payment system and did not adequately remediate.\n### Removal from VMSS\n\nStripe—or any other processor—usually can’t remove an account’s information from\nVMSS upon request. A processor can only remove a VMSS entry if the processor\nthemselves added the business to VMSS in error.\n\n### Next steps if you’re listed on VMSS\n\nIf you’re listed on VMSS, you might not know until you attempt to sign up for a\nnew processor. VMSS is only supposed to be used as an informational tool by\nprocessors during the application process; however, the presence of a VMSS\nlisting often leads to an application being declined.\n\nYou’ll need to contact your previous processor to find out why your information\nwas added to VMSS. However, VMSS criteria are determined by Visa and processors\nare required to follow this criteria. Stripe can’t remove a business that met\nthe “excessive chargebacks” criteria under any circumstances. For example, this\nis true even if the business has remediated the issues leading to chargebacks.\n\nBecause of banking partner restrictions, Stripe generally can’t process for\nbusinesses listed on VMSS unless extenuating circumstances apply, such as the\ncase of a legitimate business who previously had their identity information\nstolen.\n\nIf you require assistance with a dispute, [contact Stripe\nsupport](https://support.stripe.com/contact).\n\n## Links\n\n- [contact Stripe support](https://support.stripe.com/contact)",
  "metadata": {
    "title": "High risk merchant lists | Stripe Documentation",
    "description": "Learn the criteria for inclusion in MATCH and VMSS lists.",
    "sourceURL": "https://docs.stripe.com/disputes/match"
  }
}