{
  "content": "# Stripe charges in NetSuite\n\n## Use the connector to automatically reconcile Stripe charges and payments to NetSuite.\n\nThe Stripe Connector for NetSuite automates the reconciliation process for any\ncharges or payments processed by Stripe. The connector represents these charges\nor payments in NetSuite based on how they’re created.\n\nIn NetSuite, a charge always represents the payment amount, not the amount\nthat’s deposited to your bank account. The charge is in the currency of the\ncustomer’s payment method, and doesn’t include any Stripe fees. Fees and\ncurrency conversion appear on the deposit record, because charges in NetSuite\nare often applied against a NetSuite invoice. This ensures that the payment\neliminates the accounts receivable balance created by the NetSuite invoice.\n\n## How it works\n\nWhen you use the connector, the automated reconciliation process occurs as\nfollows:\n\n- A Stripe payment initiates through your back-end system or the Dashboard.\n- The connector creates a payment in NetSuite and, if applicable, applies it to\na NetSuite invoice.\n- After 2 days, the connector creates a deposit for the payment and moves it to\nthe correct general ledger account.\n\nStripe\n\nConnector\n\nNetSuite\n\nGL account\n\nStripe initiates a payment\n\nThe connector creates a payment in NetSuite and applies it to a NetSuite invoice\n\nThe connector creates a deposit for the payment and moves it to a general ledger\naccount\n\nA high level overview of the reconciliation process for charges or payments\n## Charges for invoices\n\nIf you use [Stripe Billing](https://docs.stripe.com/billing), invoices\nautomatically generate at the end of each billing period. The connector syncs\nthat invoice to NetSuite, and then creates a payment that it applies to the\ninvoice. If you enabled revenue recognition, the connector syncs the start and\nend dates of the subscription to NetSuite.\n\n## Charges without an invoice\n\nAll charges that initiate from [Stripe Billing\nsubscriptions](https://docs.stripe.com/subscriptions) have an associated\ninvoice. If needed, you can also create a single charge that’s associated with a\ncustomer instead of an invoice. For example, you can use this method if your\nsupport representative needs to charge a customer an additional one-off fee.\n\n## Charges for Stripe customers\n\nThe connector syncs charges to NetSuite as a `CustomerPayment` under the\ncustomer associated with the charge. If specified, the connector adds the\ncharge’s `description` attribute to the `CustomerPayment` memo.\n\n### Charges and accounts receivable\n\nThe connector creates transaction records in NetSuite for charges applied to an\ninvoice. These transaction records debit the accounts receivable account.\n\nIf a charge isn’t applied to a Stripe invoice or created through the [invoice\npayment page](https://docs.stripe.com/connectors/netsuite/invoice-payment-page),\nthe following happens:\n\n- The connector won’t create the NetSuite transaction record nor debit accounts\nreceivable.\n- The payment creates credits to accounts receivable, without a corresponding\ndebit.\n\nFor charges without an invoice, you need to manually debit the accounts\nreceivable account by creating a journal entry or creating a NetSuite invoice\nfor the customer.\n\n### Asynchronous payments\n\nStripe supports [asynchronous\ncapture](https://docs.stripe.com/payments/payment-intents/asynchronous-capture)\nof certain payment methods (for example, [ACH Direct\nDebit](https://docs.stripe.com/payments/ach-direct-debit). These payment methods\ndon’t provide immediate notification of a successful or failed payment.\n\nPayment statusNetSuite actionPendingThe connector syncs the payment immediately\ninto NetSuite. This ensures that payment applications in NetSuite remain on\nschedule and don’t impact other automated NetSuite workflows.FailedThe connector\ncreates a customer refund and applies it to the original charge. If applied to a\nNetSuite invoice, the connector unapplies the payment. The invoice status\nchanges from `Paid in full` to `Open`, and the reason for payment failure gets\nadded to the customer refund.\nBalance transactions represent actual money movement and determine at which\npoint you can account for them in an accounting system like NetSuite. When a\npayment has a balance transaction ID (for example, `txn_123`), the connector can\ncreate the payment in NetSuite. The balance transaction ID can post to the\npayment hours after it’s created, and is confirmation from the bank that the\npayment is valid. The actual funds for asynchronous payments won’t transfer\nimmediately.\n\nIf a payment fails and doesn’t generate a balance transaction ID, the connector\ntakes no action in NetSuite. There’s no confirmation of money movement, so the\nconnector can’t close the payment with a refund or credit memo.\n\n## Charges without Stripe customers\n\nYou can create a charge without providing additional information about the\ncharge. For example, if you create a charge without creating a customer first,\nthe charge won’t associate with a customer. The connector then syncs the charge\nto NetSuite as a customer payment under the `Stripe Unallocated Charges` global\ncustomer.\n\n## See also\n\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Invoice payment\npage](https://docs.stripe.com/connectors/netsuite/invoice-payment-page)\n- [Customer payment\npage](https://docs.stripe.com/connectors/netsuite/customer-payment-page)\n\n## Links\n\n- [Stripe Billing](https://docs.stripe.com/billing)\n- [Stripe Billing subscriptions](https://docs.stripe.com/subscriptions)\n- [invoice payment\npage](https://docs.stripe.com/connectors/netsuite/invoice-payment-page)\n- [asynchronous\ncapture](https://docs.stripe.com/payments/payment-intents/asynchronous-capture)\n- [ACH Direct Debit](https://docs.stripe.com/payments/ach-direct-debit)\n- [Deposit\nautomation](https://docs.stripe.com/connectors/netsuite/deposit-automation)\n- [Customer payment\npage](https://docs.stripe.com/connectors/netsuite/customer-payment-page)",
  "metadata": {
    "title": "Stripe charges in NetSuite | Stripe Documentation",
    "description": "Use the connector to automatically reconcile Stripe charges and payments to NetSuite.",
    "sourceURL": "https://docs.stripe.com/connectors/netsuite/stripe-charges-netsuite"
  }
}