{
  "content": "# Respond to disputes\n\n## Learn how to challenge or accept a dispute.\n\nWhen an account owner files a dispute against a payment, their bank alerts\nStripe. We then notify you through the following channels:\n\n- Email.\n- The Stripe Dashboard.\n- A `charge.dispute.created` event (if your integration is set up to receive\nevents to an [event destination](https://docs.stripe.com/event-destinations)).\n- A push notification (if you’ve subscribed).\n\nEach of the dispute notification channels provides a link to the **Dispute**\ndetails page in your Dashboard, where you can learn more about the reason for\nthe dispute and take appropriate action.\n\nYou can see a detailed list of all disputed payments on the [Disputes\ntab](https://dashboard.stripe.com/disputes) in the Dashboard. To review or\nrespond to a dispute, open its details page by selecting it in the list.\n\nWhen you receive a dispute notification, take action to resolve it before the\ndeadline. If you don’t respond, you automatically lose the dispute and can’t\nretrieve the disputed funds.\n\n[Review the dispute\ncategory](https://docs.stripe.com/disputes/responding#review-reasons)\nWhen you get a dispute, you can see the corresponding category or reason in your\n[Dashboard](https://dashboard.stripe.com/disputes) and see the same information\nas the `reason` attribute for the [Dispute\nobject](https://docs.stripe.com/api#dispute_object-reason).\n\nEach dispute category specifies different response requirements and\nrecommendations to effectively address the cardholder’s root claim. Your first\nstep is to review our response guidelines for the [dispute\ncategory](https://docs.stripe.com/disputes/categories#dispute-category-types).\nThis helps you collect the best evidence to counter the dispute claim.\n\n### Inquiries\n\n[Inquiries](https://docs.stripe.com/disputes/how-disputes-work#inquiries) appear\nas disputed payments in the Dashboard, but they actually represent a pre-dispute\nstage that’s typically issued when an account owner doesn’t recognize a\ntransaction on their account. Respond in this stage to resolve any questions and\nprevent a formal dispute escalation, which saves you time, fees, and your rating\nwith the card networks.\n\n#### Note\n\nIf an inquiry escalates to a chargeback, you must submit another response for\nthe dispute.\n\n### Fraudulent disputes\n\nTo help you navigate fraudulent disputes, Stripe offers Visa CE 3.0 Eligibility\nand liability shift.\n\n#### Visa CE 3.0 Eligibility\n\nFor fraudulent disputes with the Visa 10.4 (Card absent fraud) code, Stripe\nautomatically evaluates your transaction history to determine eligibility with\n[Visa Compelling Evidence\n3.0](https://docs.stripe.com/disputes/categories#visa-ce-30). If your dispute is\neligible, we notify you in the Dashboard and in the dispute email. In these\ncases, we encourage [submitting\nevidence](https://docs.stripe.com/disputes/responding#respond), because this\neligibility typically translates to a significantly higher likelihood of\noverturning the dispute in your favor.\n\n#### Liability shift\n\nFor fraudulent disputes that might be covered by the [liability\nshift](https://docs.stripe.com/payments/3d-secure/authentication-flow#disputed-payments)\nrule, Stripe automatically provides most of the evidence, such as the Electronic\nCommerce Indicator (ECI) from [3D\nSecure](https://docs.stripe.com/payments/3d-secure).\n\n[Understand the\ncomplaint](https://docs.stripe.com/disputes/responding#understand)\nWhen possible, the **Dispute** details page provides you with a copy of the\nbank’s submission to Stripe based on the account owner’s claim. These are actual\ndocuments attached by card networks and can provide additional information about\nthe disputed transaction, such as a text description from the account owner\ndescribing the specific complaint. When responding to the dispute, make sure to\nproperly address the issue described in these files.\n\nIf the dispute is still open and the bank has provided these files, select\n**Review the claim details** under step 1 of the checklist modal in the\nDashboard to view them.\n\nThe **Dispute** details page might also provide you with a way to email the\naccount owner. We recommend contacting them, as it might give you insight to\nbetter understand the complaint and help you decide how to proceed. Be sure to\nkeep a record of all communication with your customer during this process, as it\nprovides evidence to submit with your response.\n\n[Accept or challenge the\ndispute](https://docs.stripe.com/disputes/responding#decide)\nWhen you have a clear picture of the dispute details, decide whether to accept\nor challenge the dispute. If you prefer to handle disputes programmatically,\n[use the API](https://docs.stripe.com/disputes/api) to respond to disputes.\nConsider the following in your determination:\n\n- Make sure the account owner’s claim is valid. If it’s not, gather the evidence\nrequired to disprove the claim.\n- See if you can convince the account owner to withdraw their dispute if you\nresolve their complaint amicably. For example, you could offer a store credit or\na replacement item.\n- Check to see if the dispute is [CE 3.0\nEligible](https://docs.stripe.com/disputes/responding#visa-ce-30-eligibility).\nIf it is, consider responding because Stripe provides most of the required\nevidence from your transaction history.\n- Check to see if the dispute is covered by the [liability\nshift](https://docs.stripe.com/disputes/responding#liability-shift) rule. If it\nis, consider responding with evidence on top of what Stripe automatically\nprovides, such as the 3D Secure outcome.\n\nWhen you’ve decided how to respond, select the corresponding button on the\n**Dispute** details page in the Dashboard:\n\n- **Accept dispute**: Submits a response to the issuing bank affirming that you\naren’t contesting the refunded amount.\n- **Counter dispute**: Opens a form that guides you through the submission\nprocess, prompts you for evidence relevant to both the dispute and response\ntype, and allows you to upload supporting files.\n[Submit evidence through the\nDashboard](https://docs.stripe.com/disputes/responding#respond)\nYou have only one opportunity to submit your response. Stripe immediately\nforwards your response and all supporting files to the issuing bank. You can’t\nedit the response or submit additional files, so make sure you’ve assembled all\nyour evidence before you submit.\n\n- **Open the dispute response form**: Click **Counter dispute** to open the\nStripe dispute response form.\n- **Tell us about the dispute**: In the first page of the form, tell us why you\nbelieve the dispute is in error and the product type of the original purchase.\nThis information, along with the dispute category, helps Stripe recommend the\nmost relevant evidence to support your challenge on the next page of the form.\nFor example, you don’t need to provide shipping details for an online service.\nWhen your integration supports it, Stripe automatically captures the product\ntype based on the original payment.\n- **Assemble your evidence**: The second page of the form has a dynamic set of\nsections representing the most relevant details you can provide for your\nindividual case.\n\nIn the **Supporting Files** section, use the File Upload tool to attach evidence\nthat matches the checklist of evidence types relevant to your dispute type and\ncounter argument. For each uploaded file, specify which type of evidence it\nsatisfies. You can only submit one file per type of evidence, so if you have\nseveral files representing one type of evidence, combine them into a single,\nmulti-page file.\n\nConsider the following guidelines to make sure your supporting files are\neffective:\n\n- Consult the evidence recommendations for your specific [dispute\ncategory](https://docs.stripe.com/disputes/categories#dispute-category-types).\n- For fraudulent disputes in particular, if your dispute is [Visa CE 3.0\neligible](https://docs.stripe.com/disputes/responding#visa-ce-30-eligibility),\nlook for the Required for CE 3.0 badge throughout the response form. In most\ncases, Stripe pre-populates these fields with the required data from your\ntransaction history.\n\n- If the field is pre-populated, don’t edit it because you might affect\neligibility.\n- If the field is empty, add the requested information, such as the product\ndescription.\n\nIf your dispute might be covered by the [liability\nshift](https://docs.stripe.com/disputes/responding#liability-shift) rule, we\npopulate [3D Secure](https://docs.stripe.com/payments/3d-secure) information\nsuch as the Electronic Commerce Indicator (ECI) automatically for you.\n- Organize each piece of evidence according to the evidence type it satisfies—be\nas succinct as possible.\n- Combine items of the same evidence type into a single file.\n- Limit your evidence file size to the combined maximum of 4.5 MB.\n- Limit your Mastercard evidence file length to the combined maximum of 19\npages.\n- Banks evaluating the dispute won’t review any external content, so don’t\ninclude:\n\n- Audio or video files\n- Requests to call or email for more information\n- Links to click for further information (for example, file downloads or links\nto tracking information)\n- **Background evidence**: The other sections of the second page vary depending\non the dispute type and your answers on the first page. When your integration\nsupports it, Stripe automatically captures the data for these sections and\npre-populates both the API evidence object attributes and the form fields in the\nDashboard. If any of these fields aren’t pre-populated, include as much\ninformation as you can before you submit your response. These sections can\ninclude:\n\n- Shipping details\n- Refund policy details\n- Customer details\n- Product details\n\nThe more information your integration [collects and passes to\nStripe](https://docs.stripe.com/disputes/prevention/best-practices#collect-information)\nwhen your customer makes a payment, the better your ability to prevent disputes\nand fraud from occurring, and challenge them effectively when they do.\n- **Submit evidence**: Click the checkbox to acknowledge your understanding that\nyour response is final. After you submit it, Stripe automatically puts the\nevidence you provide into a format accepted by the issuing bank and submits it\nfor consideration. At this point, you can’t amend what you’ve submitted or\nprovide any additional information, so make sure to include every relevant\ndetail.\n\nIn some cases, you might have multiple disputes associated with a single\npayment. If this occurs, consider responding to each dispute individually.\n\n[Check the dispute status](https://docs.stripe.com/disputes/responding#status)\nAfter you submit a response, the status of the dispute changes to `under\nreview`. When the issuer informs Stripe of its decision, we inform you of the\noutcome by email, in the `charge.dispute.closed` event, and by updating the\ndispute status in the Dashboard and the `Dispute` API object to one of the\nfollowing:\n\n- `won`: Indicates that the bank decided in your favor and overturned the\ndispute. In this case, the issuing bank returns the debited chargeback amount to\nStripe, and Stripe passes this amount back to you. For businesses in Mexico, the\ndispute fee might also be returned. Otherwise, the dispute fee isn’t returned.\n- `lost`: Indicates that the bank decided in the account owner’s favor and\nupheld the dispute. In this case, the refund is permanent and the dispute fee\nisn’t returned.\n\nIn some cases, the bank provides additional details about the dispute decision.\nSelect **View issuing bank response** under **Relevant documents** in the\ndispute details to view them.\n\n## See also\n\n- [Prevent disputes and fraud](https://docs.stripe.com/disputes/prevention)\n- [Dispute monitoring\nprograms](https://docs.stripe.com/disputes/monitoring-programs)\n- [Calculate dispute rates](https://docs.stripe.com/disputes/measuring)\n\n## Links\n\n- [Fraud Stripe Apps](https://marketplace.stripe.com/categories/fraud)\n- [event destination](https://docs.stripe.com/event-destinations)\n- [Disputes tab](https://dashboard.stripe.com/disputes)\n- [Dispute object](https://docs.stripe.com/api#dispute_object-reason)\n- [dispute\ncategory](https://docs.stripe.com/disputes/categories#dispute-category-types)\n- [Inquiries](https://docs.stripe.com/disputes/how-disputes-work#inquiries)\n- [Visa Compelling Evidence\n3.0](https://docs.stripe.com/disputes/categories#visa-ce-30)\n- [liability\nshift](https://docs.stripe.com/payments/3d-secure/authentication-flow#disputed-payments)\n- [3D Secure](https://docs.stripe.com/payments/3d-secure)\n- [use the API](https://docs.stripe.com/disputes/api)\n- [collects and passes to\nStripe](https://docs.stripe.com/disputes/prevention/best-practices#collect-information)\n- [Prevent disputes and fraud](https://docs.stripe.com/disputes/prevention)\n- [Dispute monitoring\nprograms](https://docs.stripe.com/disputes/monitoring-programs)\n- [Calculate dispute rates](https://docs.stripe.com/disputes/measuring)",
  "metadata": {
    "title": "Respond to disputes | Stripe Documentation",
    "description": "Learn how to challenge or accept a dispute.",
    "sourceURL": "https://docs.stripe.com/disputes/responding"
  }
}