{
  "content": "# Stripe Reader S700 accessories\n\n## Learn about Stripe's accessory line for Stripe Reader S700.\n\nAvailable in: \n## S700 Case\n\nThe S700 Case protects your Stripe Reader S700 against damage from drops at\ncountertop height. Its compact design allows your customers to access all\npayment methods (tap, chip, and swipe). You can access the headphone jack, USB\nport, and volume buttons without removing the case.\n\nThe S700 Case is also compatible with the S700 Dock. This allows you to protect\nyour reader if you transition from docked to mobile applications.\n\n!\n\nS700 Case\n\n!\n\nS700 Case with reader\n\n## S700 Hub\n\nThe S700 Hub provides drop-in I/O expansion to your POS configuration. The\n10/100M LAN port provides physical ethernet connectivity. Additionally, if you\nneed USB connectivity between your POS and peripheral devices such as cash\ndrawers, printers, or barcode scanners, the S700 Hub has 2x USB-A ports. The\ncommunication ports on the hub are activated when the Stripe Reader S700 is\nconnected to the hub. Use of alternative hubs might result in unreliable\ncommunication or charging of the Stripe Reader S700.\n\n#### Warning\n\nThe S700 Hub doesn’t connect Stripe Reader S700 to peripheral devices, such as a\nbarcode scanner or printer. It connects peripheral devices to your POS device,\nsuch as a tablet or cash register.\n\nThe S700 Hub provides power to Stripe Reader S700 and connected peripherals\nthrough a built-in 6 foot USB-C cable. We recommend using the power adapter\nsupplied with Stripe Reader S700 for full power capabilities. If you need an\nadditional or replacement power adapter, order the S700 Charger in the [Stripe\nDashboard](https://dashboard.stripe.com/terminal/shop).\n\nThe S700 Hub can provide a total of 1A shared between the two USB-A ports.\nAccessories that require high power, such as printers, must have their own power\nsource. Different devices such as cell phones might require different charging\nprotocols that aren’t supported by the S700 Hub.\n\n!\n\nS700 Hub\n\n!\n\nHub with Stripe Reader S700 on dock\n\n!\n\nHub directly connected to Stripe Reader S700\n\n!\n\nExample I/O configurations with S700 Hub\n\n## S700 Dock\n\nUse the S700 Dock to display the Stripe Reader S700 for customers on a\ncountertop. The dock is compatible with the Stripe Reader S700 with and without\na case. The Stripe Reader S700 attaches to the dock using magnets for correct\nelectrical contacts, and includes a locking nut for a more secure connection.\nAdditionally, there are three mounting points on the bottom of the dock to\noptionally secure to a countertop or other surface.\n\n!\n\nStripe Reader S700 (sold separately) above S700 Dock\n\n!\n\nDock mounting features to Stripe Reader S700\n\n!\n\nDock mounting feature to countertop\n\n!\n\nIn addition to mounting the Stripe Reader S700 to a countertop surface, the S700\nDock also provides power and USB connectivity pass-through to Stripe Reader\nS700. This provides continuous power to Stripe Reader S700, keeping it powered\nthroughout the day. You can also use the S700 Dock with the Hub to create a\ncomplete countertop I/O solution.\n\n#### Warning\n\nReader S700 is an internet connected device and doesn’t support payment\nconnectivity through USB connection.\n\n!\n\nExample power pass-through configuration with S700 Dock\n\n!\n\nExample power and data pass-through configuration with S700 Dock and S700 Hub\n(sold separately)\n\nThe Dock includes both front and rear exit cable management options, allowing\nflexible routing of the USB-C power cable.\n\n#### Note\n\nThe S700 Dock doesn’t include a USB-C power cable. The power cable supplied with\nStripe Reader S700 is intended for the S700 Dock.\n\n!\n\nUnderside of the Dock showing front and rear exit cable management (Right angle\ncable is included with Stripe Reader S700)\n\n!\n\nFront and rear cable exit options\n\n## S700 power adapter and USB-C cable\n\nStripe Reader S700 includes a region-specific AC-to-USB-C power adapter. You can\nreplace the adapter or order an additional adapter in the [Stripe\nDashboard](https://dashboard.stripe.com/terminal/shop).\n\nUS adapter\n\nUS adapter\n\nUK adapter\n\nUK adapter\n\nEU adapter\n\nEU adapter\n\nAU adapter\n\nAU adapter\n\nStripe Reader S700 also ships with a USB-C cable. One end of this cable provides\na right angle connection designed to connect into the side of the reader or into\nthe dock. You can replace the adapter or order an additional adapter in the\n[Dashboard](https://dashboard.stripe.com/terminal/shop).\n\n## S700 Stand\n\nStripe recommends using a third-party stand for Stripe Reader S700. See the\n[Hardware accessories\nsection](https://support.stripe.com/questions/recommended-resources-and-partners-for-stripe-terminal#hardware-accessories)\nof this support article for more information about recommended vendors.\n\n## Links\n\n- [Stripe Dashboard](https://dashboard.stripe.com/terminal/shop)\n- [Hardware accessories\nsection](https://support.stripe.com/questions/recommended-resources-and-partners-for-stripe-terminal#hardware-accessories)",
  "metadata": {
    "title": "Stripe Reader S700 accessories | Stripe Documentation",
    "description": "Learn about Stripe's accessory line for Stripe Reader S700.",
    "sourceURL": "https://docs.stripe.com/terminal/payments/stripe-reader-s700/accessories"
  }
}