{
  "content": "# Insights\n\n## Learn how to identify risks and understand signals from verification checks.\n\nStripe Identity’s machine learning system considers a variety of signals when\nverifying a user’s identity. It examines a number of factors to produce insights\nthat can give further clarity into Stripe’s decision. These insights are more\nnuanced than the top-level verification decisions, and you can use them to\nassist with manual reviews or customer support processes.\n\nSee the following definitions:\n\n- **Insights**: The name Stripe uses to refer to the collection of all insights.\n- **Insight**: The specific attribute scored (for example, blur, authenticity).\nIt’s of either type `Level` or `Label`.- **Level**: These insights provide a\ncomputed level, which is a score that translates to low, elevated, or high.\nInsights of this type evaluate the potential risk to verification.\n- **Label**: These insights provide a binary value of being either present or\nabsent. Some of these insights evaluate a potential risk to verification, but\nothers might be neutral, with no inherent risk associated with them.\n\n## Document insights\n\nThese are the insights produced on [document\nchecks](https://docs.stripe.com/identity/verification-checks?type=document):\n\nNameTypeDescriptionActivity on Stripe network`Label`Indicates whether the\nidentity presented fails to match a Stripe-known identity. It’s not uncommon for\nan identity to be unknown, though it does represent higher risk than a known\nuser.Barcode or machine-readable zone`Level`Indicates if the machine-readable\nzone or barcode is present and decoded, but was manipulated.Document\nauthenticity`Level`Indicates whether the document presented might have been\ndigitally manipulated or is otherwise inauthentic.Fraud`Level`This comprehensive\nscore evaluates various signals related to document verification, including\nsignals from Stripe Network data.Image blurriness`Level`Indicates the severity\nof the blurriness of the document image presented during the verification\nprocess.Physical document detection`Level`Indicates whether the document\npresented is a screenshot of a document.Risky behavior on the Stripe\nnetwork`Label`Indicates whether the identity presented matches a Stripe-known\nidentity with a history of high risk activity.\n## Selfie insights\n\nThese are the insights produced on [selfie\nchecks](https://docs.stripe.com/identity/verification-checks?type=selfie):\n\nNameTypeDescriptionDuplicate selfie`Label`Indicates whether the selfie presented\nmatches a selfie from a previous identity verification.Duplicate selfie with a\ndata mismatch`Label`Indicates that the selfie presented matches a selfie from a\nprevious identity verification, but the extracted document data from each\ndoesn’t match.Selfie and document match`Level`Indicates whether the selfie isn’t\na high confidence match with the face on the document.Selfie\nliveness`Level`Indicates that the selfie presented might not have been a live\nperson in front of the camera, such as a photograph or screen presentation\nattack.\n## Dashboard usage\n\nThe Dashboard page for a submitted VerificationSession contains a panel showing\nthe insights generated for this session.\n\n## Links\n\n- [document\nchecks](https://docs.stripe.com/identity/verification-checks?type=document)\n- [selfie\nchecks](https://docs.stripe.com/identity/verification-checks?type=selfie)",
  "metadata": {
    "title": "Insights | Stripe Documentation",
    "description": "Learn how to identify risks and understand signals from verification checks.",
    "sourceURL": "https://docs.stripe.com/identity/insights"
  }
}