{
  "content": "# Correct tax forms\n\n## File corrections to tax forms.\n\n#### Getting your 1099 forms\n\nIf you work for a platform that pays you using Stripe, learn how to get your\n[1099 tax forms](https://support.stripe.com/express/topics/1099-tax-forms).\n\nIn some cases, you need to correct the values in a 1099 tax form after you’ve\nfiled it. If you try to update a tax form that you already filed, you see a\n**Correct** button instead of an Edit button in the form.\n\n## Correction Reasons\n\nYou might need to issue a correction for several reasons:\n\n- To change the identity data of your connected account. For example, users may\nrequest changes to their name, address, or tax identification information\n- To change form totals\n- To handle forms with `Rejected` state filing status. If you have forms with\n*federal* filing status of `Rejected`, please reach out to [Stripe\nsupport](https://support.stripe.com/contact/login).\n\n### Rejection reasons\n\nHere are the most common rejection reasons:\n\nAttributeExample rejection reasonsTINMissing, invalid, mismatched with IRS\nrecordsAddressNon- characters, malformed zip codes, missing fields (for\nexample, city, empty Line 1 address)NameMissing, non- or non-alphabetical\ncharacters\nThe `Rejected` status implies that the form was either rejected by the IRS or\nstate after submission, or that the state refused to accept the information\nduring submission.\n\nYou can file a correction to update information on a form that has been rejected\nby a state (if federal filing status shows up as “rejected”, please contact\n[Stripe support](https://support.stripe.com/contact/login)). Stripe 1099\nintelligently files Corrections if the form was initially accepted or\nReplacements if it was rejected.\n\n### Delivery failures\n\nIf the delivery status is `Failed`, that means we couldn’t deliver the tax form\nto the mailing address on file. There could be two reasons for this:\n\n- **Misconfigured address** - The address is missing or invalid. For example, it\nincludes non- characters, the zip code doesn’t have the correct number of\ndigits, or the city is missing.\n- **Non-deliverable address** - The address doesn’t exist and our delivery\npartners can’t use it to deliver first-class mail.\n\n## Supported corrections\n\nYou can correct most boxes on a tax form. Depending on when you submit a\ncorrection and what you’re correcting, [penalties may\napply](https://www.irs.gov/irm/part20/irm_20-001-007r#idm140612976878064).\n\nThe IRS generally allows you to correct totals or payee information.\n\n- When you correct totals, a single form replaces the original and includes the\noriginal payee information, new totals, and a checked **Corrected** checkbox.\n- When you correct payee information, two forms replace the original:\n\n- The first form includes the original payee information, zeros for all totals,\nand a checked **Corrected** checkbox.\n- The second form includes the new payee information, original totals, and an\nunchecked **Corrected** checkbox (because this is the first form received by the\nnew payee).\n\nThe IRS imposes certain requirements on tax form corrections.\n\nYou can’t correct:\n\n- The payee name and form totals in the same form\n- The payee tax identification number and form totals in the same form\n- Tax forms that the IRS hasn’t accepted\n- The form type (for example, 1099-MISC to 1099-NEC)\n\n## Create a correction\n\nYou can only correct tax forms that the IRS has accepted. There are a few ways\nto start corrections, each of which results in a corrected form that shows up as\na **Ready Correction**.\n\n#### Note\n\nIf you want to update information for the connected account permanently, make\nthe changes programmatically using the Accounts API or the Connected Accounts\ndetails page and you can then use **Quick Correct** as shown below. Without\ndoing this first, you’ll be updating the information only on the tax form. This\ndoesn’t persist onto the connected account details and you’ll have to re-enter\nthis information next tax season.\n\n- **Use the Tax form editor**\n\n- Select the form on the [Tax\nreporting](https://dashboard.stripe.com/connect/taxes/forms) page.\n- Click **Correct** to create a correction.\n- Make the necessary changes.\n- Save the changes.\n- **Use a CSV import**\n\n- Select the form and export it as a CSV.\n- Open the CSV in a compatible tool to make and save the necessary changes.\n- Import the updated CSV using the import mode **Correct**.\n\nCorrections use the same [CSV\nschema](https://docs.stripe.com/connect/modify-tax-forms?method=csv#1099-csv-schema)\nas updates and are filed regardless of filing threshold. This allows you to zero\nout a tax form that was accidentally filed or to correct a tax form to have a\nlower volume. The\n[Filing_requirement](https://docs.stripe.com/connect/modify-tax-forms?method=csv#tax-form-status)\nallows you to specify whether or not to file a correction.\n- **Use Quick Correct**\n\nIf the identity (name, address, TIN) of the connected account has been updated\nin Stripe and now differs from what’s on the filed form, a pencil icon appears\nnext to the “Payee details” for platform admin accounts. Hovering over the\npencil and clicking **Correct** generates a corrected form to match the identity\nvalues of the connected account.\n\nWhen you click **Correct** to update the values in the tax form, it updates all\nvalues that are different in the connected account than the tax form. You can’t\nchoose which fields to update values for. Verify all changes before filing the\nupdated forms. For example, if a connected account user made a typo in their\naddress, the incorrect address is updated in the corrected form.\n\nTo list the forms with identity values that differ between the connected account\nand the tax form in order to find potential corrections, add a Payee details\nfilter with a value of “Payee has updated identity info”.\n\n## View or cancel a correction\n\nTax form corrections have a **Correction** badge in the tax forms list and on\nthe detail pane in the Dashboard. You can download previous versions of a tax\nform from the detail pane. To cancel a correction before filing, click **Cancel\ncorrection** from the menu on the detail pane.\n\n![View or cancel tax form\ncorrections](https://b.stripecdn.com/docs-statics-srv/assets/view-cancel-correction-new.2c0d2cdae64ec49be826b5e641ea5b89.png)\n\n## File a correction\n\nOnce you have successfully created a correction via one of the methods above,\nthe corrected form will move to “Ready” column of your Tax Forms page after a\npage refresh regardless of whether the form is above filing threshold.\n\nIf you want to file the correction, select the correction and click the file\nbutton. If you want to skip filing one of the corrections, set the filing\nrequirement to `NOT_REQUIRED` in the Tax Form Editor or [import a CSV\nfile](https://docs.stripe.com/connect/modify-tax-forms?method=csv#tax-form-status).\n\nIf you selected to e-deliver your tax forms through an interface built by\nStripe, your connected account receives an\n[email](https://docs.stripe.com/connect/platform-express-dashboard-taxes-communication)\nnotifying them that the corrected form is available within the interface.\n\n## Links\n\n- [1099 tax forms](https://support.stripe.com/express/topics/1099-tax-forms)\n- [Stripe support](https://support.stripe.com/contact/login)\n- [penalties may\napply](https://www.irs.gov/irm/part20/irm_20-001-007r#idm140612976878064)\n- [Tax form\neditor](https://docs.stripe.com/connect/modify-tax-forms?method=dashboard)\n- [Tax reporting](https://dashboard.stripe.com/connect/taxes/forms)\n- [CSV\nschema](https://docs.stripe.com/connect/modify-tax-forms?method=csv#1099-csv-schema)\n-\n[Filing_requirement](https://docs.stripe.com/connect/modify-tax-forms?method=csv#tax-form-status)\n- [Quick\nCorrect](https://docs.stripe.com/connect/modify-tax-forms?method=dashboard#quick-correct:-payee-details)\n-\n[email](https://docs.stripe.com/connect/platform-express-dashboard-taxes-communication)",
  "metadata": {
    "title": "Correct tax forms | Stripe Documentation",
    "description": "File corrections to tax forms.",
    "sourceURL": "https://docs.stripe.com/connect/correct-tax-forms"
  }
}