{
  "content": "# Terminal network requirements\n\n## Make sure your network is ready for Terminal, and troubleshoot common issues.\n\nTerminal network requirements vary depending on the readers you use and the way\nyou build your integration. If your network doesn’t meet the requirements\noutlined below, your Terminal integration won’t work as expected.\n\nIf you plan to use Terminal readers in remote locations with unfamiliar or\nunknown network conditions, be prepared to handle unexpected network-related\nissues. When using smart readers, we recommend a [server-driven\nintegration](https://docs.stripe.com/terminal/payments/setup-integration?terminal-sdk-platform=server-driven)\nto minimize the number of potential network issues you might encounter.\n\n## Mobile readers\n\n[Mobile readers](https://docs.stripe.com/terminal/mobile-readers) rely on your\npoint of sale device for internet connectivity and have the following network\nrequirements:\n\n- Your point of sale device must be connected to the internet, and must be able\nto connect to [Stripe’s infrastructure](https://docs.stripe.com/ips).\n- The operating environment must be free of interference that prevents Bluetooth\ndevices from working normally (for example, excessive microwave oven use\nproduces interference on the 2.4GHz band, and can disrupt Bluetooth\nconnections).\n\nThe following mobile readers are available.\n\n- [Stripe Reader M2](https://docs.stripe.com/terminal/readers/stripe-m2)\n- [BBPOS WisePad 3](https://docs.stripe.com/terminal/readers/bbpos-wisepad3)\n\n## Smart readers\n\n[Smart readers](https://docs.stripe.com/terminal/smart-readers) connect directly\nto your network and use that connection to access the internet and Stripe. When\nusing one of our Terminal SDKs, your point of sale device and the smart reader\nalso communicate directly with each other over your local network.\n\nThe following smart readers are available.\n\n- [Stripe Reader\nS700](https://docs.stripe.com/terminal/readers/stripe-reader-s700)\n- [BBPOS WisePOS E](https://docs.stripe.com/terminal/readers/bbpos-wisepos-e)\n\nSmart readers have the following network requirements:\n\n- Your network must support IPv4.- IPv6-only networks aren’t supported.\n- Some readers can connect to IPv6 networks through DHCP, but must also be\nassigned an IPv4 address. Changing advanced settings such as static IP, router,\nsubnet mask, and DNS are not supported with IPv6.\n- Terminal readers must be assigned a [private IP\naddress](https://en.wikipedia.org/wiki/Private_network).\n- Both the Terminal reader and your point of sale device must be able to connect\nto [Stripe’s infrastructure](https://docs.stripe.com/ips).\n- If your Terminal readers support both WiFi and Ethernet, use one or the other,\nnot both—attempting to use WiFi and Ethernet at the same time results in an\nunstable connection and intermittent downtime.- If you use WiFi, you can use a\ndock without connecting an Ethernet cable (for example, for charging or\naccessories only).\n- WiFi networks must use WPA/WPA2/WPA3-Personal or WPA2/WPA3 EAP-PEAP Enterprise\nencryption, and must be password protected.- Verifone P400 readers only support\nWPA-Personal or WPA2-Personal encryption.\n- Ethernet networks must support 10/100 Ethernet devices.\n- If your network uses dynamic IP address assignment, your DHCP server\nconfiguration needs to allow Terminal readers to retain the same IP address for\nat least an entire workday.\n- If your network limits the duration of network sessions (including idle\nsessions), the minimum session length for Terminal readers must be at least an\nentire workday.\n- If you use one of our Terminal SDKs on a separate point of sale device (for\nexample, not an app running on the Terminal reader itself), you must also meet\nthe following requirements:- The reader must be on the same local network as\nyour point of sale device.\n- The reader must be able to communicate directly with your point of sale device\nthrough your local network.\n- The DNS servers used by your point of sale device must be able to resolve\ninternet-routable hostnames to local IP addresses.\n\n## Troubleshooting\n\nWhen network-related issues occur, experienced personnel should be physically\npresent to diagnose and correct problems. Make sure you account for this when\nplanning your Terminal integration, deployment, and maintenance.\n\n#### Note\n\nBecause of the large variety of network configurations and infrastructure,\nStripe can only help with basic network questions. The operation and\ntroubleshooting of your network is your responsibility.\n\nIf you encounter an issue, determine whether the cause is the network or\nsomething else. You can rule out the network as the cause of an issue by\ntemporarily moving one or more of your Terminal readers and point of sale\ndevices to a different network and internet connection—then check to see if the\nsame issue occurs there. Mobile hotspots work well for this kind of testing.\n\nIf the issue persists on a different network and Internet connection, perform\nadditional testing and debugging of your integration’s code. If you need help,\n[contact support](https://support.stripe.com/contact) and provide as much\ntechnical detail as possible (for example, error messages, logs, and so on).\n\nIf the issue only happens on your network, try the following:\n\n- Make sure your network meets all of the requirements listed above, especially\nif anything about the network has changed recently.\n- Check your firewall and other security configurations to make sure access to\n[Stripe’s infrastructure](https://docs.stripe.com/ips) isn’t being blocked.\n- Try a different connection for both the Terminal reader and your point of sale\ndevice (for example, switch from WiFi to Ethernet).\n- For WiFi, make sure all devices have good signal strength.\n- For Ethernet, try using different network cables.\n- Confirm smart readers have the expected IP and subnet assigned.\n- If you’re using smart readers and our Terminal SDK on a separate point of sale\ndevice:- On your point of sale device, try resolving\n`10-42-42-42.test.device.stripe-terminal-local-reader.net` to an IP address.\nThat hostname should resolve to the IP `10.42.42.42`. If it resolves to a\ndifferent IP, or if DNS resolution fails, configure your point of sale device to\nuse [Cloudflare DNS servers](https://1.1.1.1/dns/) (`1.1.1.1` and `1.0.0.1`) or\n[Google DNS servers](https://developers.google.com/speed/public-dns) (`8.8.8.8`\nand `8.8.4.4`) and try again.\n- Check your router’s configuration to see if connections between wireless\n(WiFi) clients and wired (Ethernet) clients are being blocked.\n- Make sure you can ping the Terminal reader’s IP address from your point of\nsale device.\n\n## Links\n\n- [server-driven\nintegration](https://docs.stripe.com/terminal/payments/setup-integration?terminal-sdk-platform=server-driven)\n- [Mobile readers](https://docs.stripe.com/terminal/mobile-readers)\n- [Stripe’s infrastructure](https://docs.stripe.com/ips)\n- [Stripe Reader M2](https://docs.stripe.com/terminal/readers/stripe-m2)\n- [BBPOS WisePad 3](https://docs.stripe.com/terminal/readers/bbpos-wisepad3)\n- [Smart readers](https://docs.stripe.com/terminal/smart-readers)\n- [Stripe Reader\nS700](https://docs.stripe.com/terminal/readers/stripe-reader-s700)\n- [BBPOS WisePOS E](https://docs.stripe.com/terminal/readers/bbpos-wisepos-e)\n- [private IP address](https://en.wikipedia.org/wiki/Private_network)\n- [contact support](https://support.stripe.com/contact)\n- [Cloudflare DNS servers](https://1.1.1.1/dns/)\n- [Google DNS servers](https://developers.google.com/speed/public-dns)",
  "metadata": {
    "title": "Terminal network requirements | Stripe Documentation",
    "description": "Make sure your network is ready for Terminal, and troubleshoot common issues.",
    "sourceURL": "https://docs.stripe.com/terminal/network-requirements"
  }
}