{
  "content": "# Artwork templates\n\n## Add your artwork to the design templates.\n\nStripe provides design templates (Adobe Illustrator) for cards, carriers, and\nenvelopes. We recommend the following best practices to optimize the artwork for\nthe printing process. If you’re not familiar with Illustrator templates, Stripe\ncan help review and update the template to meet the criteria.\n\nUpload card artwork in design template\n\n**General**\n\n- **Card size:** 85.6 mm x 53.98 mm.\n- **Artwork size:** Minimum 87.6 mm x 55.98 mm, including a 1 mm bleed on all\nsides.\n- **Logos and text:** Keep a 2 mm distance from the card edge to avoid important\nelements being cut off.\n- **Thin linework:** Minimum line thickness accepted is .08 mm or .25 point\n(pt).\n\n**Type and logos**\n\n- **Minimum type size for San Serif Fonts:** 4.5 pts.\n- **Minimum type size for Serif Fonts:** 5 pts.\n- Position logos and text at least 2 mm away from non-printed elements such as\nchips, holograms, signature panels, magnetic stripes, and so on.\n- Create type and logos in a vector program for cleaner artwork and maintain\nsharpness and clarity.\n- Provide the fonts used in your artwork to avoid font compatibility issues.\n\n**Linked images**\n\n- Raster images (JPG, TIFF, PNG) work best in a minimum resolution of 350 ppi\nfor good print quality.\n- Include all linked images with your artwork.\n- Linked images must be in CMYK, grayscale, multichannel, or duotone color mode\n(avoid RGB color mode).\nUpload carrier artwork in design template- **Bleeds**: Include 1/8 (0.125\")\nbleeds on all sides of the artwork. This ensures that there’s enough room for\ntrimming during the printing process.\n- **File Resolution**: For any artwork or photos, make sure they have a\nresolution of at least 300 dpi (dots per inch). Additionally, include all\nplaced, linked, or embedded images with the final files.\n- **Color and Treatments**: For better color matching, we recommend choosing PMS\ncolors for reference. Specify the color mode directly in the Illustrator file or\ninclude an accompanying CMF (Color Matching File) document. The paper used for\nthe cards can’t have thermographic, high gloss, coated, or varnish finishes. The\ncarriers provided are suited for laser printing.\nAdditional best practices- **Limit light colors**: Exercise caution when using\nlight colors for large areas, as there might be a more noticeable color shift\nfrom card to card.\n- **Limit dark gradients**: Dark gradients in your artwork might lead to\nunexpected results, so we suggest limiting their use.\n- **Use black and gray**: Avoid using CMYK builds to achieve black and gray\ncolors. Instead, create the artwork using solid black, a percentage of black, or\na PMS gray to make sure more accurate and consistent results.\n- **Avoid border designs**: Due to slight movement during the cutting process,\nit’s challenging to guarantee perfectly even borders all the way around the\ncard. Keep this in mind if your artwork includes a border design.\n- **Large solid gray areas**: For large, solid gray areas, we recommend using\nspecific PMS colors. Light Gray—PMS 428, Medium Gray—PMS 430, and Dark Gray—PMS\n430, as they provide consistent results.\n- **Matte finish and solid color artwork**: Cards that are mostly black or have\nsolid color artwork with a matte finish might show surface scratches more easily\ncompared to a gloss finish and varied artwork.",
  "metadata": {
    "title": "Artwork templates | Stripe Documentation",
    "description": "Add your artwork to the design templates.",
    "sourceURL": "https://docs.stripe.com/issuing/cards/artwork-templates"
  }
}