{
  "content": "# Custom Canadian pre-authorized debit mandate agreements\n\n#### Caution\n\nIt is unlikely your business needs to create a custom mandate agreement. By\ndefault, the Stripe.js library provides an all-in-one solution for your\ncustomers to provide and verify their bank account and accept a valid mandate.\n\n## Do you need a custom mandate agreement?\n\nHere are some reasons *not to* create a custom mandate agreement:\n\n- You want to send customized emails\n- You want to specify custom payment schedule terms\n\nIt is possible to send customized emails using the same mandate agreement text\nprovided in the customer payment details collection solution. Simply match the\nsame text provided by Stripe in your own emails.\n\nIf you want to specify a custom payment schedule, this can be done using the\nStripe API. The mandate agreement automatically displayed to your customers will\nuse the payment schedule terms you provide.\n\nHere are some reasons you might want to create a custom mandate agreement:\n\n- You want to obtain authorization from your customer to not send debit\nnotification emails\n- You want to provide different or additional cancellation or recourse terms\nthat satisfy [Payments Canada\nrules](https://www.payments.ca/sites/default/files/h1eng.pdf)\n\nThe mandate agreement provided by default is specifically written to serve the\nneeds of almost all businesses on Stripe. It uses the most flexible timelines\nfor confirmation and cancellation allowed by Canadian banks and satisfies all\nrequirements given by the [Payments Canada Rules for pre-authorized\ndebits](https://www.payments.ca/sites/default/files/h1eng.pdf). Though there are\nvery few reasons to create a custom agreement, not all businesses are the same.\nThis page will help your business create a valid mandate agreement that will\nprotect both you and your customers.\n\n## Background\n\nIn addition to collecting a customer’s name and bank account information, you\nmust collect specific debit mandate (often called a pre-authorized debit\nagreement). This mandate gives your business authorization to debit the\ncustomer’s bank account on a specified schedule. Your business must present and\ncollect a mandate agreement with clear and specific terms for one-time or\nrecurring debits that meets the requirements given by the [Payments Canada\nrules](https://www.payments.ca/sites/default/files/h1eng.pdf).\n\nParts of the agreement will be pre-defined based on the mandate you create [with\nthe Stripe\nAPI](https://docs.stripe.com/payments/acss-debit/accept-a-payment#web-create-payment-intent)\n(for example the `interval_description` defining your payment timeline or\ntriggers) and existing information about your customers. This page will guide\nyou through the remaining required parts of a mandate agreement, but your\nbusiness will ultimately be responsible for any disputes arising from its\ncontents.\n\nAfter your customer accepts the mandate agreement, you can immediately debit the\nfirst payment due from your customer’s account. You must send your customer\nconfirmation of the accepted mandate agreement, including collected payment\ndetails. The mandate agreement must include terms that allow you to immediately\ndebit the bank account and send the confirmation within 5 days after your\ncustomer has accepted the mandate agreement. By default, Stripe sends a\n[customizable agreement confirmation\nemail](https://docs.stripe.com/payments/acss-debit#mandate-and-debit-notification-emails)\nmatching the [sample\nbelow](https://docs.stripe.com/payments/acss-debit/custom-pad-agreement#sample-pre-authorized-debit-agreement).\n\nPre-debit notification emails informing your customer that a charge is being\nmade and the amount of the charge is a requirement, as well. However, the time\nlimit for these can be modified or they can be waived entirely in the agreement.\n\n## Mandate agreement requirements\n\nA properly formatted PAD mandate agreement must include the following\ninformation in order to meet regulatory requirements:\n\nRequirementDescriptionExample Text\nBusiness Contact Information\n\nThe mandate agreement must contain accurate contact information that the\ncustomer can use to contact your business by a method of communication your\ncustomer uses.\n\nRocket Rides\n\nAttn: Billing Department\n\n123 First Avenue\n\nToronto, ON\n\nM2J 3R7\n\nEmail: billing@rocket-rides.com\n\nDate of Agreement AcceptanceSomewhere in the agreement presented to customer,\nthe date of the agreement acceptance must be shown.Accepted on: April 8,\n2024Pre-authorized debit TypeThis value is determined by the type of transaction\nfor which you are collecting this mandate agreement. It must be based on the\nmandate object `transaction_type` value.- Personal\n- Business\nAuthority to Debit Account with Variable AmountsA clear statement outlining your\ncustomer’s agreement that your business is authorized to debit the account\ngiven.By clicking [“submit application”, “submit” or “I accept”], you accept\nthis agreement and authorize Rocket Rides to debit the specified bank account\nfor any amount owed for charges resulting from the use of services or purchase\nof products.\nPayment Schedule or Triggers\n\nRequired only if [Mandate](https://docs.stripe.com/api/mandates)\n`payment_schedule` is `interval` or `combined`.\n\nThe mandate agreement must display the\n[Mandate](https://docs.stripe.com/api/mandates) `interval_description` value,\nwhich should contain an explicit schedule of payments or triggering events for\ndebits.\n\n- On the 5th of every month or the next business day.\n- On April 30, 2020.\n- When issued invoices become due.\n- When your RocketBucks balance goes below $20.\n\nSporadic Authorization\n\nRequired only if [Mandate](https://docs.stripe.com/api/mandates)\n`payment_schedule` is `sporadic` or `combined`.\n\nThe mandate agreement must state that your business will obtain authorization\n(such as providing a username and password) from your customer for each sporadic\npayment you process.\n\n*Rocket Rides* may debit the specified account for sporadic payments only after\nobtaining your authorization.\n\nModification of PAD Confirmation PeriodIn order to improve the speed with which\nyou can do business, Stripe performs verification on customer bank accounts that\nallows your business to begin debiting after a PAD is accepted so long as the\nCustomer has agreed to this in the mandate agreement.You agree that any payment\ndue will be debited from your account immediately upon acceptance of this PAD\nagreement and that confirmation of this PAD agreement will be sent within five\ncalendar days after acceptance.\nModification of Pre-Notification Period\n\nStripe supports the ability to send required pre-debit notification emails to\nyour customer (or provide webhooks that notify you to send them) when debits are\ninitiated. Your customer must agree to waive the pre-notification period. This\ntext must be bolded, highlighted or underlined in the mandate agreement text.\n\nPre-notifications are required if not expressly waived. If you opt out of\nsending these emails, the text for waiving the pre-notification must be included\ninstead, also bolded, highlighted or underlined.\n\n- **You waive the right to receive pre-notification and prior confirmation of\nthe amount or timing of any PAD.**\n- **You additionally agree that you don’t require advance notice of the amount\nor timing of any PAD before Rocket Rides processes the debit.**\nRecourse / Reimbursement StatementThe mandate agreement must contain this exact\ntext in its entirety.You have certain recourse rights if any debit doesn’t\ncomply with this PAD agreement. For example, you have the right to receive\nreimbursement for any debit that isn’t authorized or isn’t consistent with this\nPAD Agreement. To obtain more information on your recourse rights, contact your\nfinancial institution or visit\n[www.payments.ca](https://www.payments.ca/).Cancellation of AgreementA statement\noutlining a customer’s ability to revoke their authorization at any time,\nspecifying an amount of notice required by your business.You can amend or cancel\nthis authorization at any time by providing the business with thirty days’ prior\nnotice at billing@rocket-rides.com. To obtain a sample cancellation form, or\nfurther information on canceling a PAD agreement, contact your financial\ninstitution or visit [www.payments.ca](https://www.payments.ca/).Notice of Use\nof a Payment Service ProviderThe mandate agreement must disclose Stripe as the\npayment service provider.Rocket Rides partners with [Stripe](http://stripe.com/)\nto provide payment processing.\n## Sample pre-authorized debit mandate agreement\n\nThis sample document illustrates what a complete mandate agreement might look\nlike, both in your payment flow and in the confirmation email sent to your\ncustomers.\n\nRocket Rides123 First Avenue Toronto, ON M2J 3R7 Email: billing@rocket-rides.com\nPre-authorized debit agreementDateApril 30, 2020TypeBusinessAccount\nHolderEmailInstitutionTransitAccount #\nBy clicking submit, you accept this agreement and authorize *Rocket Rides* to\ndebit the specified bank account for any amount owed for charges resulting from\nthe use of services or purchase of products.\n\nPayments will be debited from the specified account according to the following\nschedule:`On the 5th of every month`\n\nDisplaying payment schedules or triggers is only required if `payment_schedule`\nis `interval` or `combined`\n\n*Rocket Rides* may debit the specified account for sporadic payments only after\nobtaining your authorization\n\nDisplaying terms for sporadic payments is only required if `payment_schedule` is\n`sporadic` or `combined`\n\nWhere a scheduled debit date is not a business day, *Rocket Rides* will debit on\nthe next business day.\n\nYou agree that any payment due will be debited from your account immediately\nupon acceptance of this PAD agreement and that confirmation of this PAD\nagreement will be sent within five calendar days after acceptance. You waive the\nright to receive pre-notification and prior confirmation of the amount or timing\nof any PAD. You further agree that you don't require advance notice of the\namount or timing of any PAD before Rocket Rides processes the debit.\n\nYou have certain recourse rights if any debit doesn't comply with this PAD\nagreement. For example, you have the right to receive reimbursement for any\ndebit that isn't authorized or isn't consistent with this PAD Agreement. To\nobtain more information on your recourse rights, contact your financial\ninstitution or visit [www.payments.ca](https://www.payments.ca/).\n\nYou can amend or cancel this authorization at any time by providing the business\nwith thirty days' prior notice at billing@rocket-rides.com. To obtain a sample\ncancellation form, or further information on cancelling a PAD agreement, please\ncontact your financial institution or visit\n[www.payments.ca](https://www.payments.ca/).\n\n*Rocket Rides* partners with [Stripe](https://stripe.com/) to provide payment\nprocessing.\n\nSubmit\n\n## Links\n\n- [Payments Canada rules](https://www.payments.ca/sites/default/files/h1eng.pdf)\n- [with the Stripe\nAPI](https://docs.stripe.com/payments/acss-debit/accept-a-payment#web-create-payment-intent)\n- [customizable agreement confirmation\nemail](https://docs.stripe.com/payments/acss-debit#mandate-and-debit-notification-emails)\n- [Mandate](https://docs.stripe.com/api/mandates)\n- [www.payments.ca](https://www.payments.ca/)\n- [Stripe](http://stripe.com)\n- [www.payments.ca](https://www.payments.ca)\n- [Stripe](https://stripe.com)",
  "metadata": {
    "title": "Custom Canadian pre-authorized debit mandate agreements | Stripe Documentation",
    "description": "",
    "sourceURL": "https://docs.stripe.com/payments/acss-debit/custom-pad-agreement"
  }
}