{
  "content": "# Deliver your 1099 tax forms\n\n## Learn about 1099 form delivery requirements and how to deliver your tax forms, including e-delivery and postal delivery.\n\n#### Getting your 1099 Forms\n\nIf you work for a platform that pays you via Stripe and want to learn about your\n1099 forms and how to get them, see [1099 tax\nforms](https://support.stripe.com/express/topics/1099-tax-forms) on the Stripe\nSupport site.\n\nRevenue authorities (such as the IRS) typically require that you deliver a copy\nof the tax form to the payee, in addition to [filing the tax\nform](https://docs.stripe.com/connect/file-tax-forms). Per IRS recommendations,\nthe tax form you deliver is a “ B” with the payee taxpayer identification\nnumber (TIN) redacted to the last four digits.\n\nThe IRS requires you to provide tax forms to payees using postal mail unless\nyou’ve obtained consent from the payee to only deliver the forms electronically.\nIf you don’t obtain consent for e-delivery, you can still e-deliver as long as\nyou also mail the copy of the tax form to the payee. For more information, see\nthe IRS [Requirements for Furnishing Information Returns\nElectronically](https://www.irs.gov/government-entities/federal-state-local-governments/requirements-for-furnishing-form-1099-g-electronically).\n\nYou must deliver tax forms by the first business day on or after January 31. For\npostal delivery, tax forms must be postmarked by this date.\n\nTax forms are always delivered to payees the first time they’re filed with a\nrevenue authority. This includes e-filing with the IRS as well as states. If a\ntax form is both e-filed with the IRS and to a state, it’s only delivered on the\nfirst of these events.\n\n## Delivery options\n\nThere are three options for delivering tax forms:\n\n- **E-delivery with a Stripe-built product:** Use a Stripe-hosted Dashboard\n(Stripe Express Dashboard) or Stripe Embedded Components to collect e-delivery\nconsent and deliver tax forms.\n- **E-delivery with Tax Forms API** Preview: Use the Tax Forms API to directly\ncontrol and manage the entire e-delivery flow.\n- **Postal delivery:** Use Stripe to send tax forms using postal delivery.\n\n## E-delivery with interfaces built by Stripe\n\nYour connected accounts can access their e-delivered tax forms through an\ninterface built by Stripe. If you implemented Stripe Embedded Components, the\nlink directs your connected account to the Embedded Component. Otherwise, they\ncan access the tax forms through the interface that they typically use for\nnon-tax reporting interactions. For instance:\n\n- If a connected account views their payments through the Stripe Express\nDashboard, their 1099 forms are e-delivered there. If you handle the complete\nonboarding and management process for your connected accounts and did not\nconfigure Embedded Components for tax reporting, the Express Dashboard is\naccessible.\n\nDespite your platform’s eligibility, some connected accounts might not qualify\nfor e-delivery through an interface built by Stripe. The following connected\naccounts aren’t eligible for e-delivery:\n\n- Multi-user accounts\n- Vendors without a Stripe account\n- Users who have multiple accounts on your platform with the same email address\nTo view a full list of the types of connected accounts that aren’t eligible for\ne-delivery through an interface built by Stripe, see [Which accounts get access\nto\ne-delivery](https://docs.stripe.com/connect/express-dashboard-taxes#which-accounts-get-access-to-e-delivery).\n\nConnected account users must provide e-delivery consent to view and download\ntheir forms online. The e-delivery consent is applicable to all future\nelectronic deliveries. Enable postal delivery to make sure that eligible\naccounts receive their tax forms. Consult your tax advisors if you want to\ncompletely opt out of paper delivery.\n\n### Prerequisites for using tax form e-delivery\n\nMake sure that the email address is available and current for the connected\naccounts on your platform where you own the user experience. You can confirm\nthat an email address for an account is available. Use the following command to\nview the email address for a connected account:\n\n```\ncurl https://api.stripe.com/v1/accounts/{{CONNECTED_ACCOUNT_ID}} \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n --data-urlencode email=\"jennyrosen@gmail.com\"\n```\n\n### Turn on e-delivery\n\nTo turn on e-delivery for your account, open the [Tax forms\nsettings](https://dashboard.stripe.com/settings/connect/tax_forms) page in the\nDashboard, then choose **Optimize for e-delivery** in the **Delivery settings**\nsection.\n\nAdditionally, you can select the **Have Stripe collect tax information\nautomatically** option to have Stripe email your connected accounts and ask them\nto update their tax information and delivery preferences. Learn more about\n[e-delivery for connected\naccounts](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough).\n\n### File and deliver 1099 forms with a Stripe-hosted Dashboard\n\nStripe-hosted Dashboards are surfaces where eligible Connect platforms can\ndeliver 1099s to their users.\n\n- **Express Dashboard:** Only connected accounts who have access to the Express\nDashboard for non-tax reporting purposes and connected accounts where you own\nthe full onboarding and management process can have their 1099 forms delivered\nto this Dashboard.\n\nToward the end of January, when you click **File**, your finalized tax forms are\nautomatically sent out to your connected accounts. They receive another email\nnotifying them that their tax forms are ready, with a link to download the forms\ndirectly from the **Tax Forms** tab in the Stripe-hosted Dashboard. If a\nconnected account user later consents to e-delivery, it applies only to future\nyears because paper forms were already sent for the current year.\n\n![Connect tax forms page showing forms that are ready to download in the Express\nDashboard](https://b.stripecdn.com/docs-statics-srv/assets/connect-tax-form-ready-download.45cd97db253255d3fd8878606e74050c.png)\n\nThe Connect tax forms page in the Express Dashboard\n\n### File and deliver 1099 forms with Stripe Embedded Components\n\nIf your connected accounts currently interact with Stripe Embedded Components or\nyou own the full onboarding and management process for your connected accounts,\nyou can deliver 1099 forms with Stripe Embedded Components.\n\nYou need to implement the [Documents\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/documents)\nfor your Connected Account to access their 1099 Tax Forms. You should also\nimplement the [Account management\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/account-management)\nto collect paperless delivery consent, and allow your connected accounts to make\nany necessary edits to their account information.\n\n#### Note\n\nE-delivery consent appears only if the connected account has a populated email\naddress. For connected accounts where you’re responsible for requirement\ncollection, including [custom\naccounts](https://docs.stripe.com/connect/custom-accounts), Stripe doesn’t set\nthe `email` field. You can update the connected account’s email address in the\n[Dashboard](https://docs.stripe.com/connect/express-dashboard-taxes#how-do-i-update-the-email-address).\n\n## E-delivery with Tax Forms API\n\n#### Private preview\n\nThe Tax Forms API is available in limited preview. We are no longer adding users\nto the preview for the 2024 tax season.\n\nYou can use the Tax Forms API to deliver forms to your users directly. With the\nAPI, you build and brand the e-delivery flow in your platform and Stripe doesn’t\ninteract with your users directly. You also need to manage the collection of\ne-delivery consent, how your users access the e-delivered forms, and any user\nidentity changes or corrections that go through your platform.\n\nWe’ll use a fictitious account StripeDelivers, a delivery platform to walk\nthrough the API.\n\n### Getting started\n\nStripe recommends disabling e-delivery and outreach from Stripe — otherwise your\nusers will also have their e-delivered forms accessible through the Stripe\nExpress Dashboard.\n\n### Collect paperless delivery consent\n\nPer [IRS\nrequirements](https://www.irs.gov/government-entities/federal-state-local-governments/requirements-for-furnishing-form-1099-g-electronically),\na StripeDelivers account holder who wants to receive tax correspondence\nelectronically instead of by mail must opt out of receiving postal mail. When an\naccount holder provides or revokes consent, the app sends a `POST` request to\nupdate the connected account’s tax form settings. If an account holder provides\nconsent, Stripe doesn’t mail a copy of their 1099-K form unless you require\npostal mailing for all accounts in your [delivery\nsettings](https://docs.stripe.com/connect/tax-form-settings#delivery-method-settings).\n\n```\ncurl https://api.stripe.com/v1/accounts/{{CONNECTED_ACCOUNT_ID}} \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -d \"settings[tax_forms][consented_to_paperless_delivery]\"=true\n```\n\n### Retrieving tax forms\n\nStripeDelivers wants to create a view of a connected account’s filed 1099-K tax\nforms in their platform’s app, to satisfy the platform’s IRS tax reporting\nrequirement and inform the account holder of their taxable income.\n\nThe developer needs to upload each 1099-K to the platform’s servers to make them\navailable to the view. The app sends a `GET` request for a list of tax forms\nfrom Stripe’s Tax Forms API on each user request.\n\n```\ncurl -G https://api.stripe.com/v1/tax/forms \\\n -u \"sk_test_BQokikJOvBiI2HlWgH4olfQ2:\" \\\n -H \"Stripe-Version: 2025-02-24.acacia; retrieve_tax_forms_beta=v1;\" \\\n -d type=us_1099_k \\\n -d \"payee[account]\"={{CONNECTED_ACCOUNT_ID}}\n```\n\nWhen a user requests a PDF version of the form, the app sends a `GET` request to\nStripe’s Files API, caches it, and returns it in the response.\n\n```\ncurl https://files.stripe.com/v1/tax/forms/taxform_123/pdf \\\n -u sk_test_BQokikJOvBiI2HlWgH4olfQ2: \\\n -H \"Stripe-Version: 2022-11-15; retrieve_tax_forms_beta=v1;\" \\\n -o \"/tmp/tmp.pdf\"\n```\n\n### Notifications\n\n#### Note\n\nTo receive `tax.form.updated` webhooks, you need to create a webhook endpoint\nwith the Tax Forms API beta `Stripe-Version` header.\n\nStripeDelivers wants to notify an account by email when a form is accepted by\nthe IRS. When StripeDelivers receives a `tax.form.updated` webhook and\ndetermines that the form has moved to `accepted`, it sends an email to the user\nwith a download link.\n\n## Postal delivery\n\nIf you want to mail your tax forms, you must file by January 22, 2025 to\nguarantee the tax forms are postmarked by January 31, 2025. You must also\nprovide a valid US return address to comply with USPS guidelines.\n\nYou can use postal delivery for any deliverable address, including PO boxes. For\ncompliance reasons, Stripe doesn’t allow you to set a PO box as the address for\na connected account; however, you can use [Tax form\neditor](https://docs.stripe.com/connect/modify-tax-forms?method=dashboard) or\n[CSV\nimport](https://docs.stripe.com/connect/modify-tax-forms?method=csv#import-tax-forms)\nto modify the address on the tax form.\n\nYou may have connected accounts that are only eligible for state filing and not\nwith the IRS. When you use Stripe to file your forms with the IRS and states,\nForms 1099 for the state are mailed to these connected accounts after you finish\nfiling.\n\nIf you use CSV import to override the default delivery method, this also affects\nthe state mailing. For example, if you set **postal_delivery** to `false`,\nStripe doesn’t mail the 1099 form to the connected account for state reporting.\n\n## Links\n\n- [1099 tax forms](https://support.stripe.com/express/topics/1099-tax-forms)\n- [filing the tax form](https://docs.stripe.com/connect/file-tax-forms)\n- [Requirements for Furnishing Information Returns\nElectronically](https://www.irs.gov/government-entities/federal-state-local-governments/requirements-for-furnishing-form-1099-g-electronically)\n- [Which accounts get access to\ne-delivery](https://docs.stripe.com/connect/express-dashboard-taxes#which-accounts-get-access-to-e-delivery)\n- [Tax forms settings](https://dashboard.stripe.com/settings/connect/tax_forms)\n- [e-delivery for connected\naccounts](https://docs.stripe.com/connect/platform-express-dashboard-taxes-walkthrough)\n- [Documents\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/documents)\n- [Account management\ncomponent](https://docs.stripe.com/connect/supported-embedded-components/account-management)\n- [custom accounts](https://docs.stripe.com/connect/custom-accounts)\n-\n[Dashboard](https://docs.stripe.com/connect/express-dashboard-taxes#how-do-i-update-the-email-address)\n- [delivery\nsettings](https://docs.stripe.com/connect/tax-form-settings#delivery-method-settings)\n- [Tax form\neditor](https://docs.stripe.com/connect/modify-tax-forms?method=dashboard)\n- [CSV\nimport](https://docs.stripe.com/connect/modify-tax-forms?method=csv#import-tax-forms)",
  "metadata": {
    "title": "Deliver your 1099 tax forms | Stripe Documentation",
    "description": "Learn about 1099 form delivery requirements and how to deliver your tax forms, including e-delivery and postal delivery.",
    "sourceURL": "https://docs.stripe.com/connect/deliver-tax-forms"
  }
}