{
  "content": "# Billing for a multi-entity business\n\n## Integrate Stripe Billing for a business with more than one legal entity.\n\nStripe requires you to have a separate account for each legal entity. Businesses\nmight need to create different legal entities to accommodate international\noperations, set up financial isolation for different business units, or handle\nacquisitions. Use this guide to learn how to set up multiple Stripe accounts for\na business that has multiple legal entities.\n\n## Multiple entities architecture\n\nTo manage multiple legal entities in a scalable way, we recommend using Stripe\nConnect with a [Standard\naccount](https://docs.stripe.com/connect/standard-accounts), where you have a\nplatform account that serves as a single entry point, and multiple connected\naccounts for each line of business.\n\n![Organization with multiple accounts setup using\nConnect](https://b.stripecdn.com/docs-statics-srv/assets/structure_4_before.e35e09f6d8127fb01f240a30834b99b7.png)\n\nA platform account and multiple connected accounts, each representing different\nbusiness lines.\n\nWith this account configuration, each account can maintain its own customers,\nsubscriptions, and product catalog. The platform account provides a single\nintegration point and a single, shared API key that you can use to manage\nmultiple connected Stripe accounts.\n\nPlatform\nUS Account\n\nEUR Account\n\nConnected accountConnected accountCustomerCustomerBankBank\nUS product catalog\n\n[Product object](https://docs.stripe.com/api/products/object)\n\nEUR customer\n\n[Customer object](https://docs.stripe.com/api/customers/object)\n\nEUR product catalog\n\n[Product object](https://docs.stripe.com/api/products/object)\n\nUS customer\n\n[Customer object](https://docs.stripe.com/api/customers/object)\n\nPayoutPayoutDirect chargesDirect chargesStandard account with Connect \nYou create a service on your app to route customers to the right account when\nthey check out. On the backend, your integration passes in the correct account\nID to make a direct charge for the relevant Standard account, which settles\nfunds to that entity’s bank account.\n\n## Metrics and analytics\n\nTo get a consolidated view of metrics for multiple Stripe accounts, use the\nStripe Data Pipeline to [sync your Stripe account with an external\nsystem](https://docs.stripe.com/stripe-data/access-data-in-warehouse). You can\nexport the data for all your accounts to your data warehouse, where you can\napply analytic tools to get business insights.\n\n## Accounting reports\n\nUse [Revenue Recognition](https://docs.stripe.com/revenue-recognition) to export\nand consolidate accounting reports. You can also import data into a single\naccount and get a comprehensive view that way.\n\n## Product catalog\n\nYour product catalog can be part of the platform account or each connected\nStandard account. Where you maintain your catalog depends on your business\nneeds. For example, a company that operates in the US and in the EU likely wants\nto keep the catalog with the connected accounts to help them maintain local\nprices. A company with a global website that serves customers in multiple\ncurrencies likely wants to keep the catalog with the platform account and use\nmulti-currency prices.\n\n### Lookup keys\n\nTo efficiently manage product catalogs for connected accounts, use [lookup\nkeys](https://docs.stripe.com/products-prices/manage-prices?dashboard-or-api=api#lookup-keys).\nProduct IDs and lookup key names only need to be unique for each account.\n\n## Entitlements\n\nTo correctly associate a customer with a Stripe account, store the customer ID\nand Stripe account ID in your database so that when you check the statuses of\ninvoices and subscriptions for entitlements, you know you’re referencing the\ncorrect Stripe account.\n\n## Tax\n\nIf you want to report taxes as a single entity for two Stripe accounts, you can\nmerge the tax reports of those accounts. Export the data then combine the\nreports in a spreadsheet or with a partner such as TaxJar or Avalara.\n\n## Revenue recovery\n\nTo enable [revenue recovery](https://docs.stripe.com/billing/revenue-recovery),\nconfigure invoice templates, subscription lifecycles, and dunning emails for\neach individual Stripe account.\n\n## Payment methods\n\nTo correctly associate a customer with a Stripe account, store the customer ID\nand Stripe account ID in your database. Doing so means that when you check the\nstatuses of invoices and subscriptions for entitlements, you know you’re\nreferencing the correct Stripe account.\n\nTo transition to multiple Stripe accounts, we recommend setting up a platform\naccount and a connected account when you first get started.\n\n### Limitations\n\nPayment method cloning currently has the following limitations:\n\n- You can only clone payment methods that have the\n[type](https://docs.stripe.com/api/payment_methods/object#payment_method_object-type)\nset to `card` or `us_bank_account`.\n- You can’t clone payment methods from one connected account to another\nconnected account.\n- You can’t clone payment methods from a connected account to a platform\naccount.\n\n## Links\n\n- [Standard account](https://docs.stripe.com/connect/standard-accounts)\n- [Product object](https://docs.stripe.com/api/products/object)\n- [Customer object](https://docs.stripe.com/api/customers/object)\n- [sync your Stripe account with an external\nsystem](https://docs.stripe.com/stripe-data/access-data-in-warehouse)\n- [Revenue Recognition](https://docs.stripe.com/revenue-recognition)\n- [lookup\nkeys](https://docs.stripe.com/products-prices/manage-prices?dashboard-or-api=api#lookup-keys)\n- [revenue recovery](https://docs.stripe.com/billing/revenue-recovery)\n-\n[type](https://docs.stripe.com/api/payment_methods/object#payment_method_object-type)",
  "metadata": {
    "title": "Billing for a multi-entity business | Stripe Documentation",
    "description": "Integrate Stripe Billing for a business with more than one legal entity.",
    "sourceURL": "https://docs.stripe.com/billing/multi-entity-business"
  }
}