{
  "content": "# Explain Identity to your customers\n\n## Answer customer questions about ID verification and Stripe Identity.\n\nIf you use Stripe Identity for ID verification, copy and customize these\nquestions and answers to create Frequently Asked Questions (FAQs) around ID\nverification. To obtain Stripe logos, badges, and buttons for your site, visit\nthe **Media assets** section on\n[stripe.com](https://stripe.com/newsroom/information).\n\n## Pre-approved content\n\nIn your Stripe Identity FAQ, address the following questions by using the\nprovided pre-approved copy:\n\n### How does identity verification work?\n\n### What are the best practices for a successful verification?\n\n### Who has access to my verification data?\n\n## Open-ended questions\n\nFor the following questions, provide your preferred answer:\n\nQuestionAdditional informationWhy am I asked to verify my identity?Provide your\npreferred answer. Some users might be hesitant to share their ID information, so\nit’s important to help them understand why you’re asking for this informationWhy\nwas I rejected?You might want to offer alternative methods for verification if a\nuser disputes their results.Can I get verified using a different method?Privacy\nlaws might require you to provide an alternative verification process that\ndoesn’t use biometric technology if the user doesn’t consent to use of their\nbiometric information. Consult your legal counsel for regional requirements.\n**How can I access or delete my verification data?**\n\nProvide your data privacy process.\n\nThe Identity API has a [redaction\nendpoint](https://docs.stripe.com/api/identity/verification_sessions/redact)\nthat allows you to delete the verification data that Stripe Identity stores on\nbehalf of your business. For example, you can use this tool to meet your\ndeletion requirements when an end-user from Europe or California asks you to\ndelete their data, or when you collect an ID from a country such as Germany that\nrequires you to delete an ID card upon completion of the verification even if\nthere’s no deletion request from the end user. If you’ve created additional\ncopies of a user’s data, you might also need to delete these as well.\n\nStripe doesn’t delete data on your behalf when we store the data as your\nprocessor, even if your end-user asks us to, because we recognize you must\nconduct your own legal analysis on whether deletion is appropriate.\n\nIf your end-user reaches out to us requesting deletion, we’ll respond to the\nrequest with respect to any data that we hold as data controller, and also\nrecommend the end-user reach out to you to request deletion.\n\n## Links\n\n- [stripe.com](https://stripe.com/newsroom/information)\n- [redaction\nendpoint](https://docs.stripe.com/api/identity/verification_sessions/redact)",
  "metadata": {
    "title": "Explain Identity to your customers | Stripe Documentation",
    "description": "Answer customer questions about ID verification and Stripe Identity.",
    "sourceURL": "https://docs.stripe.com/identity/explaining-identity"
  }
}