{
  "content": "# Revenue Recognition reports\n\n## Generate and export revenue reports using Revenue Recognition.\n\nRevenue Recognition automatically generates reports that you can view in the\nStripe Dashboard and export as CSV files. These reports include key information\nlike revenue and deferred revenue. They’re available in both aggregate views for\nhigh-level analysis, and detailed views so you can validate data.\n\n## Integration requirements\n\nRevenue Recognition assumes that you’ve properly modeled your business. This\nincludes:\n\n- Modeling subscriptions using [products and\nprices](https://docs.stripe.com/products-prices/overview), and\n[customers](https://docs.stripe.com/billing/customer).\n- Setting taxes using the\n[default_tax_rates](https://docs.stripe.com/api/subscriptions/object#subscription_object-default_tax_rates)\nattribute, not as line items.\n- Setting discounts using the\n[discount](https://docs.stripe.com/api/subscriptions/object#subscription_object-discount)\nobject, not as [invoice](https://docs.stripe.com/api/invoices) items.\n\n#### Caution\n\nRevenue recognition requirements vary based on a number of factors, including\nthe location of your business and the goods and services that you sell. You need\nto make sure that you understand and comply with the requirements applicable to\nyour business, and that you model your business accordingly.\n\n## Dashboard\n\nThe Revenue Recognition section of your Dashboard provides high-level\ninformation regarding the operations and financial health of your business. It\nincludes [graphs for recognized revenue and deferred\nrevenue](https://dashboard.stripe.com/revenue-recognition), a [monthly\nsummary](https://dashboard.stripe.com/revenue-recognition), and a [revenue\nwaterfall\nreport](https://dashboard.stripe.com/revenue-recognition/accounting-reports).\n\nThe Revenue Recognition section is also where you can manage your Stripe\nintegration, such as [uploading your revenue\ndata](https://dashboard.stripe.com/revenue-recognition/data-import), [defining\ncustom rules](https://dashboard.stripe.com/revenue-recognition/rules) on how to\ntreat your revenue, and [mapping to the chart of\naccounts](https://docs.stripe.com/revenue-recognition/chart-of-accounts) that\nyou use in your general ledger.\n\nYou can download any accounting report or statement you’re viewing by clicking\n**Download**. Below is a list of the different report formats available to you\nfor download as a CSV file:\n\nReport formatDescriptionSummaryThis report provides a summary of revenue\nrecognition on your account for the selected period.ProductThis report provides\na detailed view of revenue recognition on your account over the selected period,\norganized by product.PriceThis report provides a detailed view of revenue\nrecognition on your account over the selected period, organized by price. It can\ninclude information such as pricing metadata and pricing intervals.CustomerThis\nreport provides a detailed view of revenue recognition on your account over the\nselected period, organized by customer. It can include information such as\ncustomer name, email, and address.InvoiceThis report provides a detailed view of\nrevenue recognition on your account over the selected period, organized by\ninvoice. It can include information such as charges, refunds, and dispute\nIDs.Line itemThis report provides a detailed view of revenue recognition on your\naccount over the selected period, organized by line item. It can include\ninformation at the granularity of a line item (such as charges, refunds, and\ndispute IDs).MetadataThis report provides a customized summary of revenue\nrecognition on your account for the selected period, grouped by the user\nselected metadata object type and key. This report supports grouping by charge,\ncustomer, invoice, invoice item, product, or subscription metadata. Learn more\nabout metadata [here](https://docs.stripe.com/api/metadata).Event typeThis\nreport is available in the debits and credits reports. It provides a detailed\nview of revenue recognition on your account over the selected period, organized\nby event type. The event type provides a brief description of the recorded\nevent, which can help you understand the nature of each journal entry.Invoice\nevent typeThis report is available in the debits and credits reports. It\nprovides a detailed view of revenue recognition on your account over the\nselected period, organized by invoice and event type. It can include information\nsuch as charges, refunds, and dispute IDs.Line item event typeThis report is\navailable in the debits and credits reports. It provides a detailed view of\nrevenue recognition on your account over the selected period, organized by line\nitem and event type. It can include information at the granularity of a line\nitem (such as charges, refunds, and dispute IDs).\n#### Caution\n\nRevenue Recognition generates reports from transactions processed by Stripe.\nExpect a 72 hour delay before the data displays in the Dashboard.\n\nAlso, all report information is accessible only after you [import the\ndata](https://docs.stripe.com/revenue-recognition/data-import).\n\n### Revenue graphs\n\nThe revenue graphs in the Dashboard provide a high-level view of your business\nby displaying revenue activity over time. The recognized revenue graph shows\nyour net recognized revenue and the deferred revenue graph shows your ending\nbalance per month.\n\nThe monthly and daily charts differentiate between open and closed accounting\nperiods using colors. The figures continue to change until the accounting period\ncloses. Toggling to the daily view provides a day-by-day snapshot of recognized\nand deferred revenue for the selected month. Revenue from metered billing is\nrecognized in full when invoices finalize, or when the accounting period closes.\n\n### AR aging graphs\n\nThe accounts receivable (AR) aging graphs in the Dashboard provide a high-level\nview of your accounts receivable activity over time. Use this information to\nunderstand the financial health of your customers. The balance graph shows the\noutstanding invoice amounts for the specified periods. The summary table shows\nunpaid invoice amounts and categorizes them by how long the invoices have been\noutstanding for the specified period.\n\n### Monthly summary\n\nThe [monthly\nsummary](https://docs.stripe.com/revenue-recognition/reports/monthly-summary)\nprovides a detailed breakdown of activity for the last complete month. Use this\ninformation to understand how your activity affected revenue and to book journal\nentries. You can also see activity that contributed to your net revenue. For\nexample, you can see the portions of new billings that you recognized, and\ncontra revenue items. This section also lists changes to deferred revenue based\non your activity, like portions of new billings that you haven’t recognized and\ncontra revenue items.\n\nThe monthly summary only shows details if you had activity. For example, if you\ndon’t have any contra revenue, the monthly summary doesn’t include it.\n\n### Revenue waterfall\n\nThe [revenue\nwaterfall](https://docs.stripe.com/revenue-recognition/reports/waterfall),\nsometimes called a revenue schedule chart, displays expected recognizable\nrevenue over time. Use this to understand how activity from each period affects\nrevenue in future periods.\n\nThis report shows expected revenue amounts based on historical billings. It\ndoesn’t model future billings and it doesn’t predict future revenue from those\npotential billings. The expected future revenue amounts change as you add future\nbillings.\n\n### CSV reports\n\nYou can download reports as a CSV file at any time. To do this:\n\n- Click **Download** next to the report.\n- If applicable, select the report format.\n- Choose the columns you want to include in the report.\n- Click **Download**.\n\nThe reports you can download include:\n\nReportDescription[Income\nstatement](https://docs.stripe.com/revenue-recognition/reports/income-statement)Detailed\nrevenue and contra revenue breakdown by monthBalance sheetDetailed balance sheet\naccount breakdown by monthDebits and creditsMonthly debit and credit journal\nentries shown at these levels: summary, product, price, customer, invoice, line\nitem, metadata, event type, invoice event type, and line item event typeAccounts\nreceivable agingOutstanding invoice amounts grouped into age buckets shown at\nthese levels: summary, product, price, customer, invoice, line item, and\nmetadataCorrectionsMonthly correction entries shown at these levels: summary,\nproduct, price, customer, invoice, line item, and metadata[Trial\nbalance](https://docs.stripe.com/revenue-recognition/reports/trial-balance)Shows\nthe account balances for each general ledger account during each accounting\nperiod\nThe [income\nstatement](https://docs.stripe.com/revenue-recognition/reports/income-statement)\nreport shows revenue, contra revenue, expenses, gains, and losses. Contra\nrevenue adjustments are deductions from gross revenue. Applying the contra\nrevenue to your gross revenue results in your net income. Use this report to\nbetter understand your net revenue and determine how you want to track contra\nrevenue items.\n\nThe balance sheet report shows the beginning and ending balances for accounts\nlike deferred revenue, accounts receivable, cash, and so on. You can use this\nreport to understand overall inflows and outflows to these accounts, as well as\nhow revenue activity ties to cash.\n\nThe accounts receivable aging report consolidates outstanding invoice amounts\nand groups them into age ranges: not yet due, 1-30 days, 31-60 days, 61-90 days,\n91-120 days, and over 120 days. The report rounds up the ranges (for example, an\ninvoice overdue by 30.5 days falls into the 31-60 days range). You can use this\nreport to understand your collections performance and identify customers with\noutstanding invoices that are potentially collectible.\n\nThe corrections report displays corrected ledger entries, ensuring the accuracy\nand transparency of your accounting data. Corrections occur when changes are\nmade to ledger entries in closed accounting periods. These changes are due to:\n\n- [Data import](https://docs.stripe.com/revenue-recognition/data-import) for\npast transactions\n- Adding, updating, and deleting [chart of accounts\nmappings](https://docs.stripe.com/revenue-recognition/chart-of-accounts) or\n[rules](https://docs.stripe.com/revenue-recognition/rules)\n- Modifying [revenue\nsettings](https://docs.stripe.com/revenue-recognition/revenue-settings)\n- Bug fixes introduced by Revenue Recognition system upgrades\n\nTo allow corrections to backdate to their original periods, reopen the closed\naccounting periods with [accounting period\ncontrol](https://docs.stripe.com/revenue-recognition/revenue-settings/accounting-period-control).\n\nThe [trial\nbalance](https://docs.stripe.com/revenue-recognition/reports/trial-balance)\nreport lists the balances of the accounts at a specific point in time (as of a\nspecific date) and ensures the total of the debit accounts equals the total of\nthe credit accounts. You can use this report to get a snapshot of all the\naccount balances and to reconcile account balances in Stripe with your general\nledger.\n\n## See also\n\n- [Revenue Recognition\nMethodology](https://docs.stripe.com/revenue-recognition/methodology)\n- [Revenue Recognition\nExamples](https://docs.stripe.com/revenue-recognition/examples)\n\n## Links\n\n- [products and prices](https://docs.stripe.com/products-prices/overview)\n- [customers](https://docs.stripe.com/billing/customer)\n-\n[default_tax_rates](https://docs.stripe.com/api/subscriptions/object#subscription_object-default_tax_rates)\n-\n[discount](https://docs.stripe.com/api/subscriptions/object#subscription_object-discount)\n- [invoice](https://docs.stripe.com/api/invoices)\n- [graphs for recognized revenue and deferred\nrevenue](https://dashboard.stripe.com/revenue-recognition)\n- [revenue waterfall\nreport](https://dashboard.stripe.com/revenue-recognition/accounting-reports)\n- [uploading your revenue\ndata](https://dashboard.stripe.com/revenue-recognition/data-import)\n- [defining custom\nrules](https://dashboard.stripe.com/revenue-recognition/rules)\n- [mapping to the chart of\naccounts](https://docs.stripe.com/revenue-recognition/chart-of-accounts)\n- [here](https://docs.stripe.com/api/metadata)\n- [import the data](https://docs.stripe.com/revenue-recognition/data-import)\n- [monthly\nsummary](https://docs.stripe.com/revenue-recognition/reports/monthly-summary)\n- [revenue\nwaterfall](https://docs.stripe.com/revenue-recognition/reports/waterfall)\n- [Income\nstatement](https://docs.stripe.com/revenue-recognition/reports/income-statement)\n- [Trial\nbalance](https://docs.stripe.com/revenue-recognition/reports/trial-balance)\n- [rules](https://docs.stripe.com/revenue-recognition/rules)\n- [revenue\nsettings](https://docs.stripe.com/revenue-recognition/revenue-settings)\n- [accounting period\ncontrol](https://docs.stripe.com/revenue-recognition/revenue-settings/accounting-period-control)\n- [Revenue Recognition\nMethodology](https://docs.stripe.com/revenue-recognition/methodology)\n- [Revenue Recognition\nExamples](https://docs.stripe.com/revenue-recognition/examples)",
  "metadata": {
    "title": "Revenue Recognition reports | Stripe Documentation",
    "description": "Generate and export revenue reports using Revenue Recognition.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/reports"
  }
}