{
  "content": "# Collect tax in Australia\n\n## Learn how to use Stripe Tax to calculate, collect, and report tax in Australia.\n\nIn Australia, Stripe Tax supports calculation and [collection of\nGST](https://www.ato.gov.au/business/gst/).\n\n## When to register for tax collection\n\nSee [Thresholds](https://dashboard.stripe.com/tax/thresholds) to get insights\nabout your potential tax registration obligations in Australia. Stripe also\nnotifies you with email and Dashboard alerts when you need to register to\ncollect tax. Learn more about how the [monitoring tool\nworks](https://docs.stripe.com/tax/monitoring).\n\nRemote sellers must register in Australia if their sales of services or\nlow-value goods to Australian individuals exceed 75,000 AUD in the past 12\nmonths or are expected to in the next 12 months. Sales to GST-registered\nAustralian businesses that are subject to reverse charge don’t count toward the\nthreshold. Non-profit organizations who sell remotely have a higher 150,000 AUD\nthreshold but the threshold monitoring tool doesn’t track this.\n\n**Threshold**: 75,000 AUD (or 150,000 AUD for non-profit organizations)\n\n**Time frame**: Previous or current year.\n\n**Included transactions**: Any taxable transactions that reverse charge doesn’t\napply to.\n\nStripe supports domestic registration in Australia for both Australian\nbusinesses and remote sellers.\n\nIf a remote business sells digital services or low-value goods into Australia\nexclusively through online marketplaces that are responsible for collecting tax\non these sales, the seller isn’t required to register for GST in Australia.\nThese sales don’t count toward the seller’s registration threshold.\n\n## Register to collect tax\n\nFind more information on how to register for GST in Australia on the government\nwebsite:\n\n- [Registration for businesses with an origin address in\nAustralia](https://www.ato.gov.au/Business/GST/Registering-for-GST/)\n- [Registration for remote\nsellers](https://www.ato.gov.au/Business/International-tax-for-business/Non-resident-businesses-and-GST/)\n(businesses based outside of Australia selling into Australia)\n\nAfter you’ve registered to collect tax in Australia, go to\n[Registrations](https://dashboard.stripe.com/tax/registrations?location=au) to\nadd your registrations to Stripe in the Dashboard. This turns on tax calculation\nand collection in Stripe for your transactions in Australia.\n\nLearn more about [how to add your\nregistration](https://docs.stripe.com/tax/registering#track-your-registrations-in-the-tax-dashboard)\nin the Dashboard.\n\n## How we calculate taxes\n\nStripe calculates GST for your transactions in Australia. Stripe assumes most\nsales to be taxable unless specifically exempt. If you’re a remote seller and\nsell services to Australian customers, GST is typically collected on sales to\nindividuals. No tax is charged on sales to business customers who provide their\nAustralian Business Register (ABN) number.\n\nStripe doesn’t calculate GST on sales of imported low-value goods (valued 1,000\nAUD or less) to Australian individuals.\n\n## Report and file your taxes\n\nStripe provides reports of your completed tax transactions. Go to\n[Registrations](https://dashboard.stripe.com/tax/registrations) to access these\nreports. Learn more about [the different types of\nreports](https://docs.stripe.com/tax/reports).\n\nYou’re responsible for filing and remitting your taxes to Australia. Stripe\ndoesn’t file taxes on your behalf. However, we do have trusted partners who can\nhelp manage your filing and remittance.\n\n## Marketplace tax liability\n\nAustralia defines electronic distribution platform (EDP) operators as\nmarketplace operators that might have tax collection obligations. To qualify as\nan EDP, a marketplace operator must set terms or conditions for the sale,\nprocess or enable customer payments, or handle ordering or delivery of the\nproduct. Businesses that only provides payment processing or maintain the\ntechnical infrastructure behind an online marketplace don’t qualify as EDPs. EDP\noperators must collect GST on:\n\n- Sales of imported low-value goods by remote sellers to private individuals in\nAustralia.\n- Sales of digital services by remote sellers to private individuals in\nAustralia.\n\n## Links\n\n- [collection of GST](https://www.ato.gov.au/business/gst/)\n- [Thresholds](https://dashboard.stripe.com/tax/thresholds)\n- [monitoring tool works](https://docs.stripe.com/tax/monitoring)\n- [Registration for businesses with an origin address in\nAustralia](https://www.ato.gov.au/Business/GST/Registering-for-GST/)\n- [Registration for remote\nsellers](https://www.ato.gov.au/Business/International-tax-for-business/Non-resident-businesses-and-GST/)\n- [Registrations](https://dashboard.stripe.com/tax/registrations?location=au)\n- [how to add your\nregistration](https://docs.stripe.com/tax/registering#track-your-registrations-in-the-tax-dashboard)\n- [Registrations](https://dashboard.stripe.com/tax/registrations)\n- [the different types of reports](https://docs.stripe.com/tax/reports)",
  "metadata": {
    "title": "Collect tax in Australia | Stripe Documentation",
    "description": "Learn how to use Stripe Tax to calculate, collect, and report tax in Australia.",
    "sourceURL": "https://docs.stripe.com/tax/supported-countries/asia-pacific/australia"
  }
}