{
  "content": "# Tax customizations\n\n## Learn how to customize tax behavior using Stripe Tax.\n\nSet up Stripe Tax to fit your business needs with tax customizations. Create\nrules that apply to a product tax code in any supported location.\n\nFor example, you can:\n\n- Change the [Software as a service (SaaS) - personal\nuse](https://docs.stripe.com/tax/tax-codes?tax_code=txcd_10103000) tax code from\ntaxable to non-taxable in Louisiana to reflect the uncertainty of how SaaS might\nbe taxed.\n- Apply a 5% tax rate to the\n[Newspapers](https://docs.stripe.com/tax/tax-codes?tax_code=txcd_35020100%09)\ntax code in Poland, instead of the applied rate of 8%, to reflect that your\nproduct is a regional newspaper and not a national one.\n- Treat the [Food for non-immediate\nconsumption](https://docs.stripe.com/tax/tax-codes?tax_code=txcd_40040000) tax\ncode as taxable at the standard rate in New York, to reflect that you sell a\nbagels with cream cheese.\n\nAfter you create a tax customization, you’re responsible for keeping the rate\nand taxability up to date with any changes in tax law. When you remove a tax\ncustomizations, Stripe manages the updates.\n\n## Access tax customizations\n\nCalculations and transactions with tax customizations applied incur no\nadditional charge over other tax calculations or transactions. To enable access\nto tax customizations on your account:\n\n- In the [tax settings](https://dashboard.stripe.com/settings/tax) Dashboard,\nscroll to the **Advanced options** section.\n- Select the **+ Create rules** button in the **Custom tax rules** section.\n- Review the information about tax customizations and click **Continue**.\n- The **Customizations** tab now appears in your [tax\nDashboard](https://dashboard.stripe.com/tax/).\n\n## Create a tax customization\n\nCreate your first tax customization in a sandbox to make sure you get the tax\noutcome you expect:\n\n- In the Dashboard, navigate to the [Customizations\ntab](https://dashboard.stripe.com/tax/customizations) in the Tax page.\n- Click **+ Create customization**.\n- In the section **Product tax code**, choose the product tax code your\ncustomization applies to.\n- *(Optional)* Specify the date and time for the customization rule to become\neffective under **Effective date**. For example, you can set the customization\nrule to start from the first day of the month. If you don’t set a date, the rule\ntakes effect immediately.\n- In the section **Rule location**, choose a jurisdiction where your\ncustomization applies.- You can create a rule that applies to a country or\nstate.\n- For US jurisdictions, you can also create a rule that only applies to a\nspecific city, county, or district.\n- For **Tax type**, choose the type of tax your customization applies to.\n- Click the Tax behavior you want to apply. We indicate whether the product tax\ncode you chose is taxable or non-taxable in that specific location and for the\nparticular tax type (for example, sales tax or VAT).- If you choose **Taxable**,\nyou have two options:- Apply the standard rate. This means that your rule always\nuses the standard rate that Stripe has determined for that product tax code,\ntax, and location. If the standard rate changes, that change also applies to\nyour products.\n- Apply a custom rate. This means that your rule uses the tax rate that you set.\nIf the standard rate changes for that product, your custom rate still applies.\n\n#### Regional considerationsUnited States\n\nYou can’t apply a custom rate in the US when creating a rule for a state that\napplies to all jurisdictions in a state because several cities and counties have\ndifferent tax rates. To determine a custom rate for these jurisdictions, select\na specific city, county, or district in the jurisdiction dropdown.\n- Verify that all of the details in the **Summary** panel are correct. The\n**Rate preview** displays the expected tax rate that applies for a location\nwithin the jurisdiction you chose.- The calculated tax might vary for other\naddresses within the same jurisdiction.\n- In some cases, the tax code, tax, and location you select might be taxed at\nthe location of your business, rather than the destination of the customer. In\nthese cases, the preview displays how tax applies in your business location. We\ndon’t use your tax customization rule in these cases.\n- Click **Create rule** to apply your rule immediately, or at the time and date\nyou chose.\n\n## View and maintain your tax customizations\n\nView all your customization rules in the [Customizations\ntab](https://dashboard.stripe.com/tax/customizations). Click a customization to\nview the following information:\n\n- When the rule was created or edited.\n- Who created or edited the rule.\n- The taxability and rate that’s applied.\n- The tax code, location, and tax the rule applies to.\n\nIf you have a customization in place, Stripe won’t automatically update the\ntaxability or custom rate of your product if something changes. It’s your\nresponsibility to maintain your tax customizations to make sure they reflect\nwhat’s needed for your business.\n\n## Edit a tax customization\n\nIf your customization is scheduled to start in the future, you can edit the\nstart or end time of your customization rule. If your rule is already active,\nyou can edit the end date and time. To change the tax code, location, or tax\nrate, you must archive the rule and create a new one in its place.\n\nTo edit your tax rule:\n\n- In the Dashboard, navigate to the [Customizations\ntab](https://dashboard.stripe.com/tax/customizations) in the Tax page.\n- Find the customization rule you want to edit.\n- Click the overflow menu () next to the rule and choose **Edit rule**.\n- Make your changes to the time and date.\n- Click **Save**.\n\n## Archive a tax customization\n\nYou can archive a customization that you created. After you archive a\ncustomization rule, it no longer applies to your tax transactions and Stripe’s\ndefault behavior applies instead. Rules can’t be unarchived, but you can create\na new rule instead.\n\nTo archive your tax customization:\n\n- In the Dashboard, navigate to the [Customizations\ntab](https://dashboard.stripe.com/tax/customizations) in the Tax page.\n- Find the tax customization you want to archive.\n- Click the overflow menu () next to the rule and choose **Archive rule**.\n- Confirm your changes, then click **Archive**.\n\n## Verify which transactions have a tax customization rule applied\n\nTo verify which tax customization applies to a transaction, view the\n**customizations_applied_ids** column of the [itemized\nexport](https://docs.stripe.com/tax/reports?#itemized-exports).\n\nWe don’t include transactions that contain tax customizations in the US-specific\nlocation reports or summarized reports. Learn more about the [different tax\nreports](https://docs.stripe.com/tax/reports).\n\n## How we pick which customization applies\n\nWhen two rules apply to the same product in the same jurisdiction, Stripe only\napplies the more specific rule.\n\nFor example, this might apply if Stripe treats your product as taxable in the\nstate of Colorado, but you want to treat it as non-taxable in all of Colorado\nexcept for the city of Boulder, where it should be taxed at the standard rate.\n\nTo change this, you can create a rule for the tax code that you apply to your\nproduct for the state of Colorado:\n\n- Navigate to the [Customizations\ntab](https://dashboard.stripe.com/tax/customizations) in the Tax page, then\nchoose **Colorado** from the **Rule location** dropdown.\n- Enable **Include all jurisdictions**.\n- Choose **Sales Tax** from the **Tax type** dropdown.\n- Set **Non-taxable** as the **Tax behavior**.\n\nAdditionally, you can create a second rule for the same tax code to apply tax in\nBoulder, but not elsewhere in Colorado:\n\n- Navigate to the [Customizations\ntab](https://dashboard.stripe.com/tax/customizations) in the Tax page, then\nchoose **Colorado** from the **Choose location** dropdown under **Rule\nlocation**.\n- Disable **Include all jurisdictions**.\n- Choose **Boulder** from the *Choose a jurisdiction** dropdown.\n- Choose **Sales Tax** from the **Tax type** dropdown.\n- Set **Standard rate** as the **Tax behavior**.\n\nYou can’t create a tax customization that applies to the same specific\njurisdiction (for example, Boulder) for the same tax code, during the same time\nperiod.\n\n## When you can’t use customizations\n\nSome parts of a tax calculation can’t be overridden. The following things will\ncontinue to affect the final tax calculation:\n\n- **Sourcing rules**: These rules determine whether tax is calculated using the\ndestination of the buyer or the origin of the seller. If you create a\ncustomization that applies to a jurisdiction, but your product is sourced to the\norigin instead, your customization rule won’t apply.\n- Tiers, thresholds, and taxable basis apply in some jurisdictions:- **Taxable\nbasis**: In certain locations, only a specific portion of the tax code is\ntaxable. For example, in Texas, only 80% of the cost of Software as a service is\nsubject to tax.\n- **Treatment based on price**: Products might be treated differently based on\ntheir price. For example, in New York, clothing is exempt from tax if it costs\nunder 110 USD, but taxable if it exceeds that amount. Even if you create a rule\nfor New York City with a custom rate, sales of clothing in New York under 110\nUSD is still considered exempt.\n\n#### Regional considerationsUnited States\n\nTax customizations in Stripe don’t transfer to TaxJar. When using TaxJar for\nfiling, these customizations aren’t taken into account when TaxJar recalculates\nthe tax you’re expected to file. As a result, tax customizations might not be\nsuitable for your specific use case.\n\n## Tax customizations for Connect platforms\n\n### Connect use cases that qualify for tax customizations\n\n- [Marketplaces](https://docs.stripe.com/tax/tax-for-marketplaces) (Connect\nplatforms that assume responsibility for collecting and remitting taxes for\ntheir connected accounts)\n- Connected accounts with access to the Stripe Dashboard and that are liable for\ncollecting taxes\n\n### Connect software platforms partially supported by tax customizations\n\nA software platform can create a customization for their connected account by\ndoing the following:\n\n- Navigate to the connected account details page from the [Connected\naccounts](https://dashboard.stripe.com/connect/accounts/overview) page.\n- Log in as the connected account.\n- Create a [tax customization in the\nDashboard](https://docs.stripe.com/tax/tax-customizations#create-a-tax-customization).\n\nHowever, you can’t create a tax customization at the software platform level\nthat applies to all of your connected accounts.\n\n## Links\n\n- [Software as a service (SaaS) - personal\nuse](https://docs.stripe.com/tax/tax-codes?tax_code=txcd_10103000)\n- [Newspapers](https://docs.stripe.com/tax/tax-codes?tax_code=txcd_35020100%09)\n- [Food for non-immediate\nconsumption](https://docs.stripe.com/tax/tax-codes?tax_code=txcd_40040000)\n- [tax settings](https://dashboard.stripe.com/settings/tax)\n- [tax Dashboard](https://dashboard.stripe.com/tax/)\n- [Customizations tab](https://dashboard.stripe.com/tax/customizations)\n- [itemized export](https://docs.stripe.com/tax/reports?#itemized-exports)\n- [different tax reports](https://docs.stripe.com/tax/reports)\n- [Marketplaces](https://docs.stripe.com/tax/tax-for-marketplaces)\n- [Connected accounts](https://dashboard.stripe.com/connect/accounts/overview)",
  "metadata": {
    "title": "Tax customizations | Stripe Documentation",
    "description": "Customize tax behavior in Stripe Tax to create tailored tax rules for specific product codes and locations, ensuring compliance with local tax regulations.",
    "sourceURL": "https://docs.stripe.com/tax/tax-customizations"
  }
}