{
  "content": "# Analytics\n\n## Use the Stripe Dashboard to monitor and analyze your recurring revenue.\n\n[Stripe Billing’s](https://dashboard.stripe.com/billing) analytics and\n[downloadable\nreports](https://docs.stripe.com/billing/subscriptions/analytics#downloadable-reports)\nprovide a comprehensive view of your business’s performance. You can monitor\nperformance at a glance, audit performance changes by drilling down into data,\nand compare segment performance with filtering and grouping. You can also use\nbenchmarking to compare your performance against similar businesses on Stripe.\n\n## Preview features\n\nStripe offers early access to some upcoming features. To get early access to a\nbeta feature, enter your email.\n\nPreview programDescriptionSign upUsage MRRAccess usage-based MRR and reporting\nfeaturesClick here to sign up for our preview.\n## Downloadable reports\n\nTo build financial models and begin downstream reporting, download your billing\nmetrics data. The export is in CSV format and includes the following reports:\n\nReportDescriptionMRR per subscriber per monthIncludes the Monthly Recurring\nRevenue (MRR) for each subscriber at the end of each month.Subscription metrics\nsummaryA summary of your monthly subscription metrics. The report includes your\nMRR roll-forward report, active subscriber roll-forward report, trial conversion\nmetrics, and lifetime value metrics.Customer MRR changesIncludes a log of every\nMRR change for each customer, including new subscribers, upgrades, downgrades,\nreactivations, and churn.\n## Configure your metrics definitions\n\nYou can configure metrics from the [Billing\noverview](https://dashboard.stripe.com/billing) page. Click **Configure** to\nchange how Stripe calculates Monthly Recurring Revenue (MRR), Churn, and Active\nSubscribers. Changes take 24-48 hours to appear in your configuration.\n\n### Discounts\n\nYou can configure whether to include or exclude discounts in your MRR\ncalculation. Subtracting discounts from MRR is considered a more conservative\napproach to reporting MRR because it more closely reflects the present value of\nthese customers.\n\nYou can adjust two settings to exclude discounts:\n\n- **Subtract recurring discounts from MRR**: Turn this on for your MRR to\nreflect any recurring discounts applied.\n- **Subtract one-time discounts from MRR**: Turn this on for your MRR to reflect\nany one-time discounts applied.\n\nThese settings apply the same way to all coupons you use on Stripe, including\nsubscription-level coupons, line-item level coupons, and stacked coupons.\nPermanent recurring discounts, are always subtracted from MRR.\n\n### Active subscribers\n\nYou can configure when Stripe considers a subscriber to be active:\n\n- **At the start of the subscription**: If you select this option, a\nsubscription is considered active when the first billing period begins. This is\nthe most common option.\n- **When the first payment is received**: If you select this, the subscription\nis considered active when the first payment is received. Use this if you don’t\nwant to consider subscribers active until they’ve paid their first invoice.\n\n## Audit your metrics with drill-downs\n\nYou can interact with billing charts using the **Explore** functionality.\n\nSome charts, like **MRR growth** and **Churned revenue**, allow you to drill\ndown into data points to see the underlying data. To do this, click **Explore**\non a chart to see the chart and a table of related data points. If a cell in the\ntable is clickable, you can click into it to reveal the underlying events for\nthat data point. This is particularly helpful to understand things like which\ncustomers churned or expanded their subscription in a given period.\n\n#### Public preview\n\nThis feature is currently available for a subset of billing metrics.\n\n## Analyze your metrics with filtering and grouping\n\nYou can interact with billing charts using the **Explore** functionality.\n\nSome charts, like **MRR growth** and **Churned revenue**, allow you to filter\nand group by **Product** or **Price**. To do this, click **Explore** on a chart\nto see the chart and a table of related data points below and options for\nfiltering and grouping above.\n\n#### Public preview\n\nThis feature is currently available for a subset of billing metrics. This\nfeature is not yet available to users processing subscription volume in multiple\ncurrencies.\n\n## Links\n\n- [Stripe Billing’s](https://dashboard.stripe.com/billing)",
  "metadata": {
    "title": "Analytics | Stripe Documentation",
    "description": "Use the Stripe Dashboard to monitor and analyze your recurring revenue.",
    "sourceURL": "https://docs.stripe.com/billing/subscriptions/analytics"
  }
}