{
  "content": "# Choose your physical bundle\n\n## Set up a standard or custom physical bundle.\n\nStripe helps you set up your physical bundle, which consists of a card, a\ncarrier (the letter sent to cardholders on which the card is affixed), and an\nenvelope. You have different options for both the standard and custom bundles.\nFor [bulk orders](https://docs.stripe.com/issuing/cards/physical/bulk-issuance)\nof multiple cards shipped to a single destination, we don’t include carriers.\n\n## Standard bundle options\n\nTo get started, go directly to the\n[Designs](https://dashboard.stripe.com/issuing/personalization-designs) tab in\nthe Issuing Dashboard. We prompt you to create a design by uploading your logo\nand adding your carrier text.\n\nThe standard bundle includes the following:\n\n- **Card:** A plastic black or white card with your logo (company logo).\n- **Carrier:** A standard white tri-fold (paper is folded into three) with black\ntext.\n- **Envelope:** Standard white.\n\nYou can create multiple standard bundle designs with different logos and carrier\ntext.\n\n![A standard black card and standard white tri-fold\ncarrier](https://b.stripecdn.com/docs-statics-srv/assets/standard-black-card.f0b1c7c22ffb2298509950eba3c90f01.png)\n\nA standard black card and standard white tri-fold carrier\n\n![A standard\nenvelope](https://b.stripecdn.com/docs-statics-srv/assets/standard-envelope.4544992b809143229d3f8cc6a6825a5b.png)\n\nA standard envelope\n\n## Custom bundle options\n\nBefore the bundle becomes available in the Issuing Dashboard, we work with you\nto design it and place a manufacturing order. To get started, contact your\naccount executive and review [Order a custom\nbundle](https://docs.stripe.com/issuing/cards/physical/order-custom-bundle). To\nlearn more about this process, see [Manufacturing and\npersonalizations](https://docs.stripe.com/issuing/cards/choose-bundle#manufacturing-personalization).\n\nThe custom bundle includes the following:\n\n- **Card:** Your custom design on a plastic, recycled plastic, or metal card.\n- **Carrier:** Your custom design on a trifold carrier (paper is folded in\nthree) or bifold carrier (paper is folded in half). You can also pair your\ncustom card with the standard white trifold carrier.\n- **Envelope:** White non-descript envelope (default) or we can add your logo or\nbrand color on the exterior.\n\nYour design is printed during manufacturing, and can’t change after we produce\nit. However, you can print an additional logo in black or white on the card\nafter manufacturing.\n\n![A custom card and custom tri-fold\ncarrier](https://b.stripecdn.com/docs-statics-srv/assets/custom-card-trifold.f222d5fee8c084b01bdbc6708d986b09.png)\n\nA custom card and custom tri-fold carrier\n\n![A custom\nenvelope](https://b.stripecdn.com/docs-statics-srv/assets/custom-envelope.e5c9b33cc8953ec94607630e5a11900c.png)\n\nA custom envelope\n\n## Manufacturing and personalization\n\nThe credit card manufacturing process involves creating a card body, typically\nmade of plastic polyvinyl chloride (PVC), layered for increased durability and\nsecurity. We embed chips into the card for secure, contactless transactions. The\ncards then undergo quality control and are shipped in bulk to the\npersonalization site using secure transport. We store your bundle at the site\nand personalize it when you create cards in the Issuing Dashboard.\n\nDuring personalization, the printer adds unique cardholder information to the\nbundle, including the cardholder name, number, expiration, and security code to\nthe card. For the carrier, the printer adds the cardholder shipping address. In\nsome cases, the printer can add an additional logo on the card and activation\ntext on the carrier (for standard carriers only) during this stage.\n\nTo better illustrate the manufacturing and personalization process, see the\nfollowing diagram. Standard bundles are pre-manufactured and managed by Stripe,\nallowing you to skip to step 5 and create and name your bundle design. A custom\nbundle follows all the steps from 1 to 7.\n\n![Manufacturing and\npersonalization](https://b.stripecdn.com/docs-statics-srv/assets/manufacturing-personalization.795103d769b5041160d6c832b9dcf26a.png)\n\nManufacturing and personalization\n\n## Links\n\n- [bulk orders](https://docs.stripe.com/issuing/cards/physical/bulk-issuance)\n- [Designs](https://dashboard.stripe.com/issuing/personalization-designs)\n- [Order a custom\nbundle](https://docs.stripe.com/issuing/cards/physical/order-custom-bundle)",
  "metadata": {
    "title": "Choose your physical bundle | Stripe Documentation",
    "description": "Set up a standard or custom physical bundle.",
    "sourceURL": "https://docs.stripe.com/issuing/cards/choose-bundle"
  }
}