{
  "content": "# How Stripe Capital for Platforms worksPrivate preview\n\n## Learn the basics of Stripe Capital for Platforms.\n\nBefore you begin using Stripe Capital, familiarize yourself with the eligibility\nrequirements, lending process, and structure of financing offers.\n\n## Capital eligibility\n\nStripe determines eligibility and financing terms for each user based on their\npayment activity on Stripe. We automatically determine eligibility as set by our\nbank partner on a daily basis and without action from your platform. While our\ngoal is to offer access to financing to as many users (connected accounts) as\npossible, not all users will be eligible for financing.\n\nStripe Capital is currently limited to businesses that:\n\n- Are based in the US (business representatives must also provide a physical US\nhome address).\n- Are for-profit. Additional restrictions might apply to government, utility,\nand travel businesses. Email\n[capital-review@stripe.com](mailto:capital-review@stripe.com) if your users fit\nwithin the non-profit category.\n- Have an email address linked to their Stripe account (necessary for marketing\nand ongoing servicing). Many Connect platforms don’t automatically provide\nlinked email addresses for their users to Stripe. The Stripe Capital team can\nwork with you to upload and manage these email addresses if your platform\ndoesn’t automatically share emails with Stripe.\n\n## Capital lending process\n\nCapital uses Stripe’s existing knowledge about your user’s business to offer an\nend-to-end lending process. The following are the five phases of the process:\n\nPhaseDescriptionRisk and underwritingStripe Capital automatically underwrites a\nuser based on their Stripe transaction history and volume. This means each user\nthat receives an offer is already pre-qualified for their loan.Offer and\napplicationsNotify eligible customers with Stripe’s no-code email service or\nbuild custom notifications in your own site with the Capital API. All offers\nlink to a co-branded application flow hosted by Stripe. Relevant business\ninformation is pre-populated for your user to review for a quick application\nprocess.Fund disbursementStripe handles sourcing all Capital funds and deposits\nthem to your user’s Stripe account within 2 business days.RepaymentRepayment is\nfully automated and adjusts to daily sales. Stripe deducts a fixed percentage\nfrom each of your user’s sales until they completely repay the total they\nowe.Servicing and collectionsStripe handles servicing and collections if a user\nfails to satisfy on-time payments.\n## Capital offer structure\n\nEach financing offer has four components:\n\nOffer componentDefinitionPrincipal amountThe amount the account is pre-qualified\nto receiveRepayment rateThe percentage of each future transaction to be withheld\nfor repaymentPremium amountA flat fee on top of the principal amount that the\nconnected account user must pay backMinimum paymentA minimum amount that must be\npaid over a specific time period, usually 60 days\nFor example, if there is a financing offer for 20,000 USD at a 15% repayment\nrate with a 2,000 USD flat fee, the loan will have a 2,444.45 USD, 60-day\nminimum payment. After the application is reviewed and approved, the user\nreceives a 20,000 USD payout and Stripe Capital withholds 15% of each\ntransaction processed through Stripe until the user pays back the full\noutstanding balance of 22,000 USD. If the user misses a minimum payment, Stripe\nautomatically debits them the remaining balance for the relevant time period.\n\nSee how this example offer appears in the co-branded application flow:\n\n![anatomy\noffer](https://b.stripecdn.com/docs-statics-srv/assets/offer-anatomy.25435a5c27bd4804965991bf4ba77e00.png)\n\nA user’s financing offer. All loans are issued by Celtic Bank\n\n## Capital emails\n\nThroughout the lending process, Stripe sends transactional and collections\nemails to your connected accounts. These emails are sent by Stripe and aren’t\nplatform owned. Because the primary purpose of these emails is to communicate a\nfinancing update, these are classified as transactional emails, and are\ndelivered even to suppressed or unsubscribed emails.\n\n### Preview and customize emails\n\nYou can customize the core set of transactional co-branded emails that we send\nto your connected accounts in your [Capital communication\nsettings](https://dashboard.stripe.com/settings/connect/communication/email_preview?activeProduct=capital_for_platforms).\n\n#### Customize branding\n\nYou can set your Business name, Logo, Icon, Brand color, and Accent color.\nStripe uses these values in the co-branded emails that we send to your connected\naccounts.\n\n#### Customize email domain\n\nBy default, emails are sent from a stripe.com address. You can [customize the\ndomain](https://docs.stripe.com/get-started/account/email-domain), but not the\nspecific address. We set the address automatically [based on the context of the\nmessage](https://support.stripe.com/questions/custom-email-domain).\n\n#### Preview and test emails\n\nWhen you customize co-branded Stripe Capital emails, you can check their\nappearance and test their links in the preview on the right side of the page.\nSelect a specific email from the **Preview** dropdown list. You can also send\ntest emails to verify that they’re working correctly by clicking **Send email**.\n\n#### View the history of emails sent to connected accounts\n\nYou can see the emails that Stripe has sent to your connected accounts on the\naccount details page under **Emails to this account**. To see the details of an\nemail, including its exact contents, its To: address, and its status (such as\nwhether it was delivered successfully or was opened), click it in the list.\n\n## Capital collections\n\nA loan is characterized as delinquent—and its delinquency level increases—each\ntime any scheduled loan payment remains unpaid by the next minimum due date. A\nscheduled loan payment is missed when an unsuccessful ACH debit attempt occurs\ndue to insufficient funds in the related bank account, closure of the related\nbank account, revoked access to the ACH account, or any event resulting in\nnon-payment of scheduled loan minimum payments. Once an account becomes\ndelinquent, the automated loan payment collection process implements specific\nbusiness rules to collect past-due payments. Alongside the automated collection\nprocess, the loan enters a recovery-focused collection queue once it becomes\ndelinquent.\n\nStripe Capital has designed a collection process strategy for delinquent loans.\nStripe Capital tries to contact all users who haven’t met or risk not satisfying\ntheir minimum payments, making sure these contacts comply with professional\nstandards and legal regulations. Collection representatives work with users to\ntry to maintain a business relationship and satisfy minimum payments according\nto the contractual agreement outlined in the loan agreement\n\nAs part of our strategy to aid users facing business challenges, Stripe Capital\nmay offer extended payment plans to help users make smaller payments and meet\ntheir loan obligations. Users who wish to discuss their financial obligations\ncan reach out to Stripe Capital at\n[capital-support@stripe.com](mailto:capital-support@stripe.com).\n\nEligibility for payment plans is determined by several factors, including a:\n\n- user’s delinquency level.\n- user’s possession of a debitable bank account on file with Stripe.\n- user’s ability to make a qualifying payment.\n- user’s bankruptcy status.\n- user’s ability to pay off balance with terms not exceeding 50% of the original\nloan terms.\n\n## See also\n\n- [Set up Capital](https://docs.stripe.com/capital/getting-started)\n- [How to market Capital](https://docs.stripe.com/capital/marketing)\n- [Regulatory compliance](https://docs.stripe.com/capital/regulatory-compliance)\n\n## Links\n\n- [Capital communication\nsettings](https://dashboard.stripe.com/settings/connect/communication/email_preview?activeProduct=capital_for_platforms)\n- [customize the\ndomain](https://docs.stripe.com/get-started/account/email-domain)\n- [based on the context of the\nmessage](https://support.stripe.com/questions/custom-email-domain)\n- [Set up Capital](https://docs.stripe.com/capital/getting-started)\n- [How to market Capital](https://docs.stripe.com/capital/marketing)\n- [Regulatory compliance](https://docs.stripe.com/capital/regulatory-compliance)",
  "metadata": {
    "title": "How Stripe Capital for Platforms works | Stripe Documentation",
    "description": "Learn the basics of Stripe Capital for Platforms.",
    "sourceURL": "https://docs.stripe.com/capital/how-capital-for-platforms-works"
  }
}