{
  "content": "# RecommendationsPublic preview\n\n## Learn more about the Stripe recommendations that can increase revenue and improve fraud detection.\n\nPayments recommendations are suggestions that Stripe makes that can help\nincrease your revenue or improve fraud protection. View recommendations at\n**Payments** > **Analytics** >\n[Acceptance](https://dashboard.stripe.com/acceptance) in the Stripe Dashboard.\n\n#### Note\n\nCarefully consider any recommendations. It’s up to your business to analyze and\ndecide to act on a recommendation. Recommendations don’t constitute professional\nadvice.\n\nAny estimated impacts such as increases in revenue, are estimates and aren’t\nguaranteed. Stripe doesn’t have all the relevant information about your business\nto guarantee an outcome. Recommendations might require a tradeoff, such as an\nincrease in costs, risk of fraud, or additional applicable legal terms.\n\n## Recommendation availability\n\nRecommendations show up in your account when they’re relevant to your business.\nWe base recommendations on factors such as your account settings and how you\nintegrate with Stripe. Not all businesses receive the same recommendations.\n\nWe base some recommendations on thresholds. For example, if you share data on\nsome of your payments, but not 80% or more, Stripe might recommend that you\nshare that data on more of your payments.\n\nStripe updates recommendations on a daily basis. Natural fluctuations in your\npayments could affect a recommendation’s availability as well as its estimated\nimpact.\n\n## Estimated impact\n\nEach recommendation includes an estimated impact, such as a revenue (otherwise\nknown as payment volume) increase or fraud model improvement. We show all of\nyour revenue increases in your settlement currency.\n\nStripe estimates impact in one of three ways:\n\n- **Based on all payment volume**\n\nStripe takes your most recent month of payment volume, multiplies it by an\naverage increase figure, then multiplies it by 12 to provide an annual estimate.\n\nWe base the average increase on the increase experienced by other businesses\nthat took the action we’re recommending. Stripe regularly runs tests to evaluate\nthis estimated impact. When annualizing the impact, we assume there’s no changes\nto your payment volume over time.\n- **Based on relevant payment volume**\n\nStripe takes your most recent month of relevant payment volume, multiplies this\nby an average increase figure, then multiplies it by 12 to provide an annual\nestimate. Stripe excludes payments that aren’t relevant for the recommendation.\n\nFor example, in the card account updater recommendation, we exclude payments\nusing cards that don’t have an available update.\n- **Not based on payment volume**\n\nStripe doesn’t use your payment volume in the impact estimate, and only looks at\nthe average that we observe. For example, this could include an improvement to\nfraud modeling or conversion rate.\n\n## Enable recommendations\n\nRecommendations are currently in [private\npreview](https://docs.stripe.com/release-phases). If you don’t see\nrecommendations, make sure that you’re logged in to your Stripe Dashboard, and\nhave access to [Payments analytics](https://dashboard.stripe.com/acceptance).\n\n#### Public preview\n\nIf you don’t currently have access to [Payments\nanalytics](https://dashboard.stripe.com/acceptance), sign up for our\n[waitlist](https://docs.stripe.com/payments/analytics).\n\n### How it works\n\nYou can view up to three recommendations at a time. Depending on availability,\nyou might have no recommendations at a given time, or less than three.\n\nIf you want to dismiss a particular recommendation, click **X**. You can share\nfeedback on recommendations by selecting **Feedback** in [Payments\nanalytics](https://dashboard.stripe.com/acceptance).\n\n## See also\n\n- [Glossary](https://docs.stripe.com/payments/analytics/glossary)\n- [Acceptance analytics](https://docs.stripe.com/payments/analytics/acceptance)\n- [Authentication\nanalytics](https://docs.stripe.com/payments/analytics/authentication)\n\n## Links\n\n- [Acceptance](https://dashboard.stripe.com/acceptance)\n- [private preview](https://docs.stripe.com/release-phases)\n- [waitlist](https://docs.stripe.com/payments/analytics)\n- [Glossary](https://docs.stripe.com/payments/analytics/glossary)\n- [Acceptance analytics](https://docs.stripe.com/payments/analytics/acceptance)\n- [Authentication\nanalytics](https://docs.stripe.com/payments/analytics/authentication)",
  "metadata": {
    "title": "Recommendations | Stripe Documentation",
    "description": "Learn more about the Stripe recommendations that can increase revenue and improve fraud detection.",
    "sourceURL": "https://docs.stripe.com/payments/analytics/recommendations"
  }
}