{
  "content": "# Monthly summary\n\n## Learn about the monthly summary report.\n\nThe [monthly summary](https://dashboard.stripe.com/revenue-recognition/)\nprovides a detailed breakdown of activity for the previous month. You can use\nthis information to understand how your billing activity affected your revenue\nand to book journal entries.\n\n![Monthly summary for July\n2020](https://b.stripecdn.com/docs-statics-srv/assets/monthly-summary-v2.ba474e8e2a801fedb0674c40bae653ad.png)\n\nYou can see that the net recognized revenue is 171,601 USD and the ending\nbalance of deferred revenue at the end of July is 310,000 USD.\n\n## Recognized revenue\n\nItems can be broken down into two categories: revenue and contra revenue. The\nfollowing table explains each item under recognized revenue:\n\nItem Category Description Revenue from billings this monthRevenueThe recognized\nrevenue portion from finalized invoice line items and standalone payments\noccurring this month. The revenue of a standalone payment is recognized when the\npayment occurs.Recognized revenue previously deferredRevenueThe recognized\nrevenue portion from invoice line items finalized in previous months.Revenue\nfrom metered subscriptions this monthRevenueThe revenue from metered\nsubscriptions.Revenue from unbilled servicesRevenueThe revenue from unbilled\ninvoice items.Revenue from platform feesRevenueThe revenue from platform fees.\n[Learn how a platform fee impacts\nrevenue](https://docs.stripe.com/revenue-recognition/connect/destination-charges#revenue-collected-with-application_fee_amount).Less\ncanceled unbilled invoice itemsContra revenueThe contra revenue originated from\nthe deleted unbilled invoice items.Less refundsContra revenueThe contra revenue\noriginated from refunds. This contra revenue offsets previously recognized\nrevenue. [Learn how a refund impacts\nrevenue.](https://docs.stripe.com/revenue-recognition/examples/contra#refund)Less\ndisputesContra revenueThe contra revenue originated from disputes. This contra\nrevenue offsets previously recognized revenue. [Learn how a dispute impacts\nrevenue.](https://docs.stripe.com/revenue-recognition/examples/contra#dispute)Less\nvoided billingsContra revenueThe contra revenue originated from voids. This\ncontra revenue offsets previously recognized revenue. [Learn how voiding impacts\nrevenue.](https://docs.stripe.com/revenue-recognition/examples/contra#void)Less\nbad debtContra revenueThe contra revenue originated from marking invoices as\nuncollectible. This contra revenue offsets previously recognized revenue. [Learn\nhow marking an invoice as uncollectible impacts\nrevenue.](https://docs.stripe.com/revenue-recognition/examples/contra#uncollectible)Less\ncredit notesContra revenueThe contra revenue originated from credit notes. This\ncontra revenue offsets previously recognized revenue.Less refunds from platform\nfeesContra revenueThe contra revenue originated from refunding platform fees.\n[Learn how a platform fee refund impacts\nrevenue](https://docs.stripe.com/revenue-recognition/connect/destination-charges#loss-and-contra-revenue-with-issuing-refunds).Less\ntransferContra revenueThe contra revenue originated from separate transfers.\n[Learn how a separate transfer impacts\nrevenue](https://docs.stripe.com/revenue-recognition/connect/charges-transfers).Net\nrevenue-\nThe recognized revenue less the contra revenue.\n## Deferred revenue\n\nThe deferred revenue section gives the breakdown of what changed in the deferred\nrevenue balance. The following table lists the items under this section:\n\nItem Description Starting balanceThe ending balance of the deferred revenue from\nthe previous month.Deferred change from new billings this monthThe deferred\nrevenue from finalized invoice line items and standalone payments occurring this\nmonth. With the exception of unbilled revenue that was recognized in previous\nmonths (that is, included in “Revenue from unbilled services” in previous\nmonths), every invoice line item and standalone payment books its deferred\nrevenue regardless of their revenue recognition schedule.Less recognized\nrevenueThe portion of deferred revenue that was recognized this month.Less\ncredits issuedThe remaining deferred revenue erased due to refunds, disputes,\nvoids, uncollectible invoices, and credit notes. [Learn how a refund impacts the\nremaining deferred\nrevenue.](https://docs.stripe.com/revenue-recognition/examples/contra#refund)Ending\nbalanceThe ending balance of the deferred revenue from this month.\n## Finalized invoice example\n\nThis example includes only one [invoice](https://docs.stripe.com/api/invoices)\nwith the following assumptions:\n\n- The invoice finalizes on July 10, 2020.\n- The invoice has only one line item whose service period is from July 20, 2020\nto September 17, 2020.\n- The amount for the invoice line item is 60 USD, out of which 12 USD is\nrecognized in July and 48 USD is deferred.\n\nThe monthly summary for July 2020 would look like this:\n\nRecognized revenueRevenue from billings this month12 USDNet revenue12\nUSDDeferred revenueStarting balance Jul 1 UTC0 USDDeferred change from new\nbillings this month60 USDLess recognized revenue-12 USDEnding balance Jul 31\nUTC48 USDFuture scheduled billingsStarting balance Jul 1 UTC0 USDEnding balance\nJul 31 UTC0 USD\nContinuing on this example, if the invoice is refunded on August 15, 2020, the\nmonthly summary for August 2020 would look like this:\n\nRecognized revenueLess refunds-12 USDNet revenue-12 USDDeferred revenueStarting\nbalance Aug 1 UTC48 USDLess credits issued-48 USDEnding balance Aug 31 UTC0\nUSDFuture scheduled billingsStarting balance Aug 1 UTC0 USDEnding balance Aug 31\nUTC0 USD\n## Standalone payment example\n\nThe revenue of a standalone payment is recognized when the payment occurs. This\nexample has only one charge with the following assumptions:\n\n- The charge occurs on July 15, 2020.\n- The charge’s amount is 17 USD.\n\nThe monthly summary for July 2020 would look like this:\n\nRecognized revenueRevenue from billings this month17 USDNet revenue17\nUSDDeferred revenueStarting balance Jul 1 UTC0 USDDeferred change from new\nbillings this month17 USDLess recognized revenue17 USDEnding balance Jul 31 UTC0\nUSDFuture scheduled billingsStarting balance Jul 1 UTC0 USDEnding balance Jul 31\nUTC0 USD\n\n## Links\n\n- [monthly summary](https://dashboard.stripe.com/revenue-recognition/)\n- [Learn how a platform fee impacts\nrevenue](https://docs.stripe.com/revenue-recognition/connect/destination-charges#revenue-collected-with-application_fee_amount)\n- [Learn how a refund impacts\nrevenue.](https://docs.stripe.com/revenue-recognition/examples/contra#refund)\n- [Learn how a dispute impacts\nrevenue.](https://docs.stripe.com/revenue-recognition/examples/contra#dispute)\n- [Learn how voiding impacts\nrevenue.](https://docs.stripe.com/revenue-recognition/examples/contra#void)\n- [Learn how marking an invoice as uncollectible impacts\nrevenue.](https://docs.stripe.com/revenue-recognition/examples/contra#uncollectible)\n- [Learn how a platform fee refund impacts\nrevenue](https://docs.stripe.com/revenue-recognition/connect/destination-charges#loss-and-contra-revenue-with-issuing-refunds)\n- [Learn how a separate transfer impacts\nrevenue](https://docs.stripe.com/revenue-recognition/connect/charges-transfers)\n- [invoice](https://docs.stripe.com/api/invoices)",
  "metadata": {
    "title": "Monthly summary | Stripe Documentation",
    "description": "Learn about the monthly summary report.",
    "sourceURL": "https://docs.stripe.com/revenue-recognition/reports/monthly-summary"
  }
}