{
  "content": "# Reviews\n\n## Use reviews to supplement automated systems with human expertise.\n\nWhile Stripe’s automated systems work to prevent fraud on your account, you can\nuse reviews to provide an extra layer of fraud protection by giving payments a\nmanual inspection.\n\nFor example, you might want to review transactions that:\n\n- Have an [elevated\nrisk](https://docs.stripe.com/radar/risk-evaluation#elevated-risk) of fraud\naccording to Stripe’s fraud protection system\n- Were made from outside your country\n- Are greater than a certain amount\n- Use an email address from an unusual domain\n\nThe review queue of Stripe Radar for Fraud Teams allows you to examine unusual\npayments, without having to look at each payment individually. You can create a\ntargeted list of payments to review with criteria that you specify, and review\nthem in the Dashboard.\n\n## Smart Refunds Preview\n\n[Radar for Fraud Teams](https://docs.stripe.com/radar) users can use Smart\nRefunds to proactively refund high risk payments. Smart Refunds leverages\nRadar’s machine learning system to evaluate payments for their likelihood of\nresulting in a dispute in the hours after a transaction completes. If the\ndispute risk meets the threshold for high likelihood, Stripe flags a refund\nrecommendation in your **Reviews** list.\n\n## Interested in getting early access to Smart Refunds?\n\nAccess to Smart Refunds is currently in private preview. If you're interested in\ntrying it out, enter your email address below.\n\nCollect EmailSign upRead our [privacy policy](https://stripe.com/privacy).\n## Review payments\n\nThe Dashboard [review queue](https://dashboard.stripe.com/radar/reviews) is a\nprioritized list of completed or to-be-captured payments that might need further\ninvestigation. You can review payments by:\n\n- [List view](https://docs.stripe.com/radar/reviews#list-view): Scan a list of\nreviews without seeing details about each payment.\n- [Detailed view](https://docs.stripe.com/radar/reviews#detailed-view): Review\ncustomizable payment context for a particular review item.\n\n#### Note\n\nPayments placed into review are typically already successfully processed, unless\nyou [capture authorized payments\nlater](https://docs.stripe.com/payments/place-a-hold-on-a-payment-method). You\ncan approve a payment, refund it, or refund it and mark it as fraudulent.\n\n### List view\n\nThe list view contains information to help you quickly get a sense for each\npayment’s possible risk of fraud.\n\n!\n\nThe manual review queue in the Stripe Dashboard\n\nThe list view highlights:\n\n- The risk level Stripe assigns after evaluating the payment\n- The [customer](https://docs.stripe.com/api/customers) name\n- Payment method information\n- Customer information\n- The amount, date, and time of the payment\n- The client\n\n### Detailed view\n\nSelect the payment within the review queue to view its details page, which might\ncontain [metadata](https://docs.stripe.com/radar/reviews#best-practices) that\ncan help with your decision. You can navigate between payments to review using\nthe **Previous** and **Next** buttons.\n\nThe Stripe Radar machine learning system evaluates hundreds of signals when\nscoring a charge. The [risk\ninsights](https://docs.stripe.com/radar/reviews/risk-insights) section on the\npayment page identifies some of the most relevant signals, along with some key\ndata points that can help assess fraud on a payment. The [related\npayments](https://docs.stripe.com/radar/reviews/risk-insights#related-payments)\nsection shows other payments made to your business that use the same email\naddress, IP address, or card number as the payment you’re currently reviewing.\n\n## Actions\n\nAfter you review a completed payment, you can remove it from the review queue by\ntaking one of the following actions:\n\n- **Approve**: Closes the review with no changes made to the payment. You can\nstill refund and, optionally, report fraud on an approved payment.\n- If you [capture payments\nlater](https://docs.stripe.com/payments/place-a-hold-on-a-payment-method), there\nis also a **Capture** button. You can capture a payment before or after\napproval.\n- **Refund**: Refunds the payment without reporting it to Stripe as fraudulent.\nA completed refund is permanent, you can’t undo it—you must process a new\npayment. If you capture payments later, this button changes to **Cancel**. You\ncan read more about [this review process\nhere](https://docs.stripe.com/radar/reviews/auth-and-capture).\n- **Refund and report fraud**: Refunds the payment and also reports it to Stripe\nas fraudulent, for instance to [save dispute\nfees](https://docs.stripe.com/disputes/prevention/best-practices#consider-proactively-refunding-suspicious-payments).\nThis adds the associated card fingerprint and customer email to your [block\nlists](https://docs.stripe.com/radar/lists#default-lists) and further increases\nthe effectiveness of our fraud prevention.\n\n#### Note\n\nIf a customer [disputes](https://docs.stripe.com/disputes) a payment that’s\ncurrently in your review queue, the review is automatically closed.\n\n### Customize the review queue\n\nWith Stripe Radar for Fraud Teams, you can create\n[rules](https://docs.stripe.com/radar/rules#review-rules) that automatically\nplace payments in review based on your unique business needs. This gives you the\nopportunity to identify payments that might require more investigation before\nyou can make an informed decision.\n\n## Review assignments\n\nAnyone managing the review queue can assign themselves to reviews to avoid\nduplicating effort.\n\nAs a reviewer, you can see which reviews other people are working on and assign\nor remove yourself from reviews. You can also filter the review queue to see\nreviews you own or reviews that are currently unassigned.\n\n#### Note\n\nYou can only change review assignments for yourself, not for other team members.\n\n!\n\nIn the list view, use quick actions or the overflow menu to assign yourself to a\nreview.\n\nTo assign yourself to a review in the [list\nview](https://docs.stripe.com/radar/reviews#list-view), hover over a review and\nclick the person icon or the **Assign to me** button in the overflow menu. In\nthe [detail view](https://docs.stripe.com/radar/reviews#detailed-view), click\n**Assign to me**.\n\nYou can take action on a review assigned to another team member or assign it to\nyourself. The review timeline shows a complete history of assignment changes and\nother actions.\n\n!\n\nThe timeline in the detail view displays a history of assignment changes.\n\n## Listen for review events\n\nYou can listen for webhook events related to review activity to trigger relevant\nresponse handling. Stripe sends the following review events:\n\n- `review.opened`: Indicates that a transaction was added to the review queue,\ngenerating a [review](https://docs.stripe.com/api/radar/reviews) object.\n- `review.closed`: Indicates that a review object closed and provides the\n`reason`.\n\n## Best practices\n\nUse the following best practices to get the most out of reviews and perform them\nefficiently.\n\n- **Focus time on payments where human judgment can add valuable insight to the\ndecision**\n\nAutomated systems can make decisions on the majority of payments but human\ndecision making can significantly improve accuracy when identifying fraud in\nsome cases. Because not every case benefits from human involvement, make sure\nyou choose transactions where the benefit is clear.\n- **Use risk insights and related payments to make an informed decision**\n\nUse the data in the [risk\ninsights](https://docs.stripe.com/radar/reviews/risk-insights) section to see\nhow Stripe Radar came up with a score for a charge. Combining the reasons for a\nscore, knowledge about your business, and human judgement can help you make an\ninformed choice about when to trust or ignore the score assigned by Radar.\n- **Leverage the insights from reviewers to develop hypotheses for fraud\nprevention strategies**\n\nAs reviewers sort through your transactions, they develop intuitions for fraud\nprevention that you can translate into better rules. Collect insights from\nreviewers to [test custom rules on your\naccount](https://docs.stripe.com/radar/testing#rules).\n- **Customize the process by presenting data unique to your business at review\ntime**\n\nPass along any additional customer or order information as metadata so that all\nrelevant information is in the Dashboard at the time of review. Some examples of\nuseful metadata include:\n\n- More information about the order and its shipping information\n- [Google Maps](https://maps.google.com/) and Street View links to the\ncustomer’s shipping address so the reviewer can see if the address might be a\ndrop-shipping or freight-forwarding service\n- **Don’t slow down your customer**\n\nA review implies some amount of time between order placement and delivery. If\nyour business has an inherent delay of this type (for example, you’re shipping\nphysical goods), taking the time to review a transaction doesn’t affect the\ncustomer’s delivery expectation. If you don’t have a built-in delay between\norders and fulfillment with your business, adding a review process might slow\ndown orders and create a bottleneck for good customers. Consider the impact on\ncustomers before you implement a review process.\n\n## See also\n\n- [Rules](https://docs.stripe.com/radar/rules)\n\n## Links\n\n- [elevated risk](https://docs.stripe.com/radar/risk-evaluation#elevated-risk)\n- [Radar for Fraud Teams](https://docs.stripe.com/radar)\n- [privacy policy](https://stripe.com/privacy)\n- [review queue](https://dashboard.stripe.com/radar/reviews)\n- [capture authorized payments\nlater](https://docs.stripe.com/payments/place-a-hold-on-a-payment-method)\n- [customer](https://docs.stripe.com/api/customers)\n- [risk insights](https://docs.stripe.com/radar/reviews/risk-insights)\n- [related\npayments](https://docs.stripe.com/radar/reviews/risk-insights#related-payments)\n- [this review process\nhere](https://docs.stripe.com/radar/reviews/auth-and-capture)\n- [save dispute\nfees](https://docs.stripe.com/disputes/prevention/best-practices#consider-proactively-refunding-suspicious-payments)\n- [block lists](https://docs.stripe.com/radar/lists#default-lists)\n- [disputes](https://docs.stripe.com/disputes)\n- [rules](https://docs.stripe.com/radar/rules#review-rules)\n- [list view](https://docs.stripe.com/radar/reviews#list-view)\n- [detail view](https://docs.stripe.com/radar/reviews#detailed-view)\n- [review](https://docs.stripe.com/api/radar/reviews)\n- [test custom rules on your\naccount](https://docs.stripe.com/radar/testing#rules)\n- [Google Maps](https://maps.google.com)\n- [Rules](https://docs.stripe.com/radar/rules)",
  "metadata": {
    "title": "Reviews | Stripe Documentation",
    "description": "Use reviews to supplement automated systems with human expertise.",
    "sourceURL": "https://docs.stripe.com/radar/reviews"
  }
}