{
  "content": "# Country-specific considerations for cross-border payouts\n\n## Learn about country-specific requirements for receiving payments from other countries.\n\nThe minimum payout amounts for cross-border payouts depend on the recipient\nconnected account’s country. Also, cross-border payouts to connected accounts in\ncertain countries might have additional bank or fund flow restrictions.\n\n## Cross-border minimum payout amounts\n\nThe minimum cross-border payout amount for a given country depends on the lowest\namount that Stripe can support with our banking partners. Typically, the minimum\nis one base unit of the recipient account’s local currency. In some cases,\nStripe sets a higher minimum to account for possible bank fees.\n\n### Cross-border minimum payout amounts per country\n\n## Bank restrictions\n\nMost banks can accept payments from other countries without any special\nrequirements. Some banks in certain countries require additional information\nabout recipient identity or transactions for risk and compliance purposes. The\nreceiving bank often has discretion over what they require for cross-border\ntransactions, which can differ between banks, even within the same country.\n\nIf a connected account onboards to your platform in a country with special\nrestrictions, we send an email to alert them about the possibility of additional\nrequirements. If the receiving bank requires additional information about the\nconnected account, direct them to contact the account.\n\nSome country-specific bank requirements can result in additional fees for a\nconnected account to receive payouts. In those countries, Stripe might also set\na higher minimum payout to account for those fees.\n\nThe following list of country-specific requirements isn’t exhaustive, because\nStripe has no control over them and can’t guarantee notification of changes. If\nyou encounter additional requirements that aren’t listed, please notify [Stripe\nsupport](https://support.stripe.com/).\n\nPossible special requirements include:\n\n### Bangladesh\n\n- Submitting a remittance form.\n- Providing a receipt or invoice as proof that the recipient is legitimately\nreceiving the payment.\n- Paying additional fees.\n\n### Japan\n\n- Visiting a bank location to submit a copy of their ID and additional\npaperwork, if they haven’t previously done so. Banks require a national ID card\nnumber (MyNumber) to be submitted and on file before they can receive or send\ninternational transfers.\n- Providing a receipt or invoice as proof that the recipient is legitimately\nreceiving the payment.\n- Paying additional fees.\n- Supporting payouts only to banks participating in the Foreign Exchange Yen\nClearing System (FXYCS).\n\n### Serbia\n\n- Providing additional information on the purpose of the payment.\n- Providing a receipt or invoice as proof that the recipient is legitimately\nreceiving the payment.\n- Submitting a remittance form.\n\n## Fund flow restrictions\n\nThe following fund flows are generally supported in countries for cross-border\npayouts:\n\n- [Separate charges and\ntransfers](https://docs.stripe.com/connect/separate-charges-and-transfers)\nwithout the `on_behalf_of` parameter\n- Top-up and transfers\n- [Destination charges](https://docs.stripe.com/connect/destination-charges)\n\nDirect charges and destination charges *with* the `on_behalf_of` parameter\naren’t supported. However, some countries have additional limitations.\n\nFor Brazil,\n[India](https://support.stripe.com/questions/stripe-india-support-for-marketplaces),\nand\n[Thailand](https://support.stripe.com/questions/stripe-thailand-support-for-marketplaces),\nonly the following fund flows are supported:\n\n- [Separate charges and\ntransfers](https://docs.stripe.com/connect/separate-charges-and-transfers)\nwithout the `on_behalf_of` parameter\n- Top-up and transfers\n\n## Links\n\n- [Stripe support](https://support.stripe.com/)\n- [Separate charges and\ntransfers](https://docs.stripe.com/connect/separate-charges-and-transfers)\n- [Destination charges](https://docs.stripe.com/connect/destination-charges)\n-\n[India](https://support.stripe.com/questions/stripe-india-support-for-marketplaces)\n-\n[Thailand](https://support.stripe.com/questions/stripe-thailand-support-for-marketplaces)",
  "metadata": {
    "title": "Country-specific considerations for cross-border payouts | Stripe Documentation",
    "description": "Learn about country-specific requirements for receiving payments from other countries.",
    "sourceURL": "https://docs.stripe.com/connect/cross-border-payouts/special-requirements"
  }
}