{
  "content": "# Remediation link process walkthrough\n\n## Learn how to use remediation links to collect verification information from your connected accounts.\n\nRemediation links allow platform users to collect verification information from\ntheir existing connected accounts. You generate account-specific remediation\nlinks in the Dashboard, then send them to connected accounts through any\ncommunication channels, such as email, chat, in-app notifications, or support\ninteractions. When a connected account clicks a remediation link, it takes them\nto a Stripe-hosted page where they can provide updated information directly to\nStripe.\n\n#### Note\n\nIf your connected accounts access Stripe-hosted Dashboards or an interface built\nwith Connect embedded components, use remediation links to address updated\nrequirements. Otherwise, configure your integration to address updated\nrequirements [using account\nlinks](https://docs.stripe.com/connect/handle-verification-updates#collect-updated-information-from-affected-users).\n\nRemediation links are active for 90 days, and an account can access the same\nlink multiple times. Before generating a link, make sure that it goes to the\nright individual by verifying that the account owner is set correctly. If a link\nexpires, you can generate a new one.\n\nOnly the following [user\nroles](https://docs.stripe.com/get-started/account/teams/roles) have permission\nto generate remediation links:\n\n- Administrator\n- Connect Onboarding Analyst\n- Developer\n- Data Migration Specialist\n- Support Associate\n- Support Specialist\n\n#### Note\n\nYou can only generate remediation links in the Dashboard, not using the API. To\nuse the API to direct connected accounts to onboarding, create [Account\nlinks](https://docs.stripe.com/connect/custom/onboarding?verification=hosted#stripe-hosted-onboarding),\nwhich are temporary and can only be used once.\n\nThe page that a remediation link opens depends on the account’s configuration:\n\nConnected account has access to: Remediation link opens:A Stripe embedded\nonboarding component and embedded notification bannerA platform website page\nthat contains the notification banner; configured in the [platform\nDashboard](https://dashboard.stripe.com/settings/connect/site-links)The full\nStripe Dashboard and no embedded onboarding or notification banner (including\nStandard accounts)The Account Status page in the Stripe DashboardThe Express\nDashboard and no embedded onboarding or notification banner (including Express\naccounts)The Stripe Express onboarding flowNo Stripe Dashboard and no embedded\nonboarding or notification banner (including Custom accounts)Stripe-hosted\nonboarding; the account holder must create a Stripe account and verify their\ninformation as the primary account owner or representative\nThis page walks through the process of generating and sending remediation links\nand describes the experience of a connected account when they use a link.\n\n[Generate remediation\nlinks](https://docs.stripe.com/connect/dashboard/remediation-links#generate-remediation-links)\nYou can generate a remediation link for an individual account or export a list\nof remediation links for multiple accounts.\n\n## Generate a link for an individual account\n\nAn account might have requirements that you can generate links for. For such\naccounts, go to the **Actions required** list in the **Activity** section of the\nAccount details page. Click an issue to go to the details page for that\nrequirement.\n\n!\n\nActions required list\n\nPossible remediation paths, if available, appear as a button or dropdown menu.\nGenerate the link by clicking **Request from account**.\n\n!\n\nRequest information from the connected account\n\n!\n\nThe remediation link appears in a dialog.\n\n## Export links for multiple accounts\n\nOn the **Accounts to review** page of your Dashboard, filter the view to include\nthe accounts that you want to generate remediation links for, then click\n**Export**. In the export dialog, select **Remediation link** and any other\ndesired fields, then export the list of accounts.\n\n![Export a list of\naccounts](https://b.stripecdn.com/docs-statics-srv/assets/bulk-export-A2R.56ffa4d9f3eb55c08a1eb71ed46f0904.png)\n\nExport a list of accounts\n\n#### Note\n\nIf a Remediation Link couldn’t be generated, we don’t have enough information to\nverify the account. Make sure that the account data in Stripe includes a primary\naccount representative, with their full name and date of birth, and an external\npayout account.\n\n[Send remediation links to connected\naccounts](https://docs.stripe.com/connect/dashboard/remediation-links#send-remediation-links)\nYou can send remediation links by any communication channel. Because they direct\naccounts to a Stripe-hosted page, we recommend that when you send a link, you\ninform the account that you partner with Stripe for payments. That explains why\nyour link takes them to a Stripe-hosted page.\n\nHere’s an example of an email that a platform might use to send a remediation\nlink:\n\n![Example of a remediation link\nemail](https://b.stripecdn.com/docs-statics-srv/assets/email-action-required.15e5878a481c6a8726e15965bdfaffe1.png)\n\nRemediation link email\n\n[Understand what a connected account sees when they click a remediation\nlink](https://docs.stripe.com/connect/dashboard/remediation-links#understand-what-account-sees)\nThe following example scenarios help you and your support team understand\nremediation links from the perspective of a connected account. Select the\nDashboard that’s applicable to your connected accounts.\n\n#### Note\n\nThe screenshots are representative examples that might not match the actual\nscreens presented to your connected accounts.\n\nEmbedded componentsFull Stripe DashboardExpress DashboardNo Stripe Dashboard\nFor connected accounts that used hosted onboarding and have access to the\nNotification banner embedded component, remediation links point to the platform\nwebsite page that hosts the notification banner. The banner includes information\nand links for the connected account to address any open issues.\n\n#### Note\n\nIf the platform’s Connect settings don’t include the URL of the Notification\nbanner component, a remediation link takes the connected account to hosted\nonboarding. The behavior is the same as it is for other accounts that don’t have\nStripe Dashboard access.\n\n- **The account reviews the notification banner**\n\nClicking the link opens the page containing the notification banner. In some\ncases, the account [might need to log\nin](https://docs.stripe.com/connect/get-started-connect-embedded-components#user-authentication-in-connect-embedded-components).\n\nThe notification banner displays any outstanding tasks.\n\n#### Note\n\nThe notification banner appears only if there are outstanding tasks or other\nnotifications.\n\n![The embedded notification\nbanner](https://b.stripecdn.com/docs-statics-srv/assets/remediation-furever-banner.dec6fe3e17b4bcf0ded7a9dcbdaa6267.png)\n\nEmbedded notification banner\n\n- **The account addresses open tasks**\n\nThe account can address a task by clicking the button in the notification. In\nthis example, clicking **Add information** opens a dialog where they can enter\nthe required information.\n\n![An information collection\ndialog](https://b.stripecdn.com/docs-statics-srv/assets/remediation-furever-dialog.c2f68feec130e92f09cdd5b675fe430d.png)\n\nInformation collection dialog\n\n[Handle an unverified account\nowner](https://docs.stripe.com/connect/dashboard/remediation-links#verification-failure)\nIf a connected account owner fails to verify their identity, we tell them to\ncontact their platform.\n\n![The page shown when a connected account fails to verify their\nidentity](https://b.stripecdn.com/docs-statics-srv/assets/custom-hosted-form-failure.e25c0e547e804a1a3851be7b2155f5e1.png)\n\nIdentity verification failure\n\nIf verification fails, verify that the account information is correct and\ncomplete. Then, reset the remediation link through the banner at the top of the\nconnected account details page.\n\n![The verification failure\nbanner](https://b.stripecdn.com/docs-statics-srv/assets/remediation-account-security-failure.ed976c409d500dc55f8bfe80ca04ceb3.png)\n\nVerification failure banner\n\nFailure reason Platform actionThe account owner or representative has entered\nthe wrong information four times.The banner at the top of the connected account\ndetails page requires you to acknowledge a security check before you can reset\nthe link. Acknowledging the check allows you to reset the link four more times.A\nperson not listed as the account representative is trying to enter account\ninformation.Update the account representative’s name, date of birth, and last 4\ndigits of the SSN, and ask them to try the link again. To instead let the\nrepresentative update their information directly, use the API to create and\nshare an [account\nlink](https://docs.stripe.com/connect/custom/onboarding?verification=hosted#stripe-hosted-onboarding).We\ndon’t have enough account information (such as the bank account number or last\nfour digits of the SSN).Add more account details, including date of birth and\nlast 4 digits of the SSN, then ask the connected account to try the link again.\nTo instead let the representative update their information directly, use the API\nto create and share an [account\nlink](https://docs.stripe.com/connect/custom/onboarding?verification=hosted#stripe-hosted-onboarding).\n\n## Links\n\n- [using account\nlinks](https://docs.stripe.com/connect/handle-verification-updates#collect-updated-information-from-affected-users)\n- [user roles](https://docs.stripe.com/get-started/account/teams/roles)\n- [Account\nlinks](https://docs.stripe.com/connect/custom/onboarding?verification=hosted#stripe-hosted-onboarding)\n- [platform Dashboard](https://dashboard.stripe.com/settings/connect/site-links)\n- [might need to log\nin](https://docs.stripe.com/connect/get-started-connect-embedded-components#user-authentication-in-connect-embedded-components)",
  "metadata": {
    "title": "Remediation link process walkthrough | Stripe Documentation",
    "description": "Learn how to use remediation links to collect verification information from your connected accounts.",
    "sourceURL": "https://docs.stripe.com/connect/dashboard/remediation-links"
  }
}