{
  "content": "# Risk insights\n\n## Understand risk factors and details about a particular payment.\n\nStripe Radar’s adaptive [machine learning\nsystem](https://stripe.com/radar/guide) determines the risk score and risk level\nfor a payment and uses them to decide when to block or mark payments for review.\nThe system evaluates hundreds of signals about each payment, using data from\nStripe’s network across millions of businesses. The risk insights feature,\navailable with Stripe Radar for Fraud Teams, provides a sneak peek into some of\nthe signals that power Radar’s machine learning system.\n\n!\n\nRisk insights for payments\n\nRisk insights also includes information about the customer, such as matching the\ncardholder’s name with the provided email, and the success rate of transactions\non the Stripe network associated with the email address. A low authorization\nrate may indicate suspicious behavior, because previous declines sometimes\nsuggest past attempts at fraudulent transactions.\n\nWe also highlight geography-based information, including the billing, shipping,\nand, IP address locations associated with this payment.\n\n## Risk insights\n\nIf you want to see more Radar’s signals, click the **Show all insights** button\nfrom the risk insights section. This opens a dialog with a list of signals to\nRadar’s machine learning engine.\n\n!\n\nRadar’s risk insights dialog\n\n### Understand fraud factors\n\n#### Fraud factor numbers\n\nSome of the signals in the risk insights dialog have badges with numbers next to\nthem. These badges show the fraud factor for a signal on this payment. A fraud\nfactor represents the likelihood of fraud for charges with a value similar to\nthis signal when compared to the average transaction on Stripe. A fraud factor\nof 3.5x means that charges with a similar value for this signal are 3.5 times\nmore likely to be fraudulent than average. In a higher risk payment, we expect\nto see some fraud factors greater than 1, and in a lower risk payment we expect\nto see some fraud factors less than 1.\n\n!\n\nFraud factors\n\nHover over a fraud factor to see more information about the possible values for\nit. These factors will change over time as the data in our network changes. This\ndata provides context for the distribution of fraud factors for a signal. This\ndialog also provides the network distribution of values for a signal, letting\nyou know whether the current payment has a value that’s common or if it’s rare\nor unique in the Stripe network.\n\n#### Top fraud factors\n\n!\n\nTop fraud factors\n\nThe **Top Fraud Factors** section outside the risk insights dialog notifies you\nwith fraud signals when the payment has values that commonly indicate fraud.\nBecause Radar’s machine learning detects complex patterns across hundreds of\nsignals, it’s still possible for a charge to be correctly identified as fraud,\neven if none of the signals appear suspicious on an individual level.\n\n## Related payments\n\nYou can also view the network of related payments, which includes any other\npayments made to your business using the same customer ID, IP address, or card\nnumber as the payment you’re currently viewing. This can help identify common\nfraud patterns, such as [card\ntesting](https://docs.stripe.com/disputes/prevention/fraud-types#card-testing)\n(many different cards sharing a single IP address) or trial abuse (many\n“customers” share the same card).\n\n!\n\nRelated payments\n\n## See also\n\n- [Review](https://docs.stripe.com/radar/reviews)\n- [Integration checklist](https://docs.stripe.com/radar/integration)\n\n## Links\n\n- [machine learning system](https://stripe.com/radar/guide)\n- [best practices](https://docs.stripe.com/radar/integration)\n- [card\ntesting](https://docs.stripe.com/disputes/prevention/fraud-types#card-testing)\n- [Review](https://docs.stripe.com/radar/reviews)",
  "metadata": {
    "title": "Risk insights | Stripe Documentation",
    "description": "Understand risk factors and details about a particular payment.",
    "sourceURL": "https://docs.stripe.com/radar/reviews/risk-insights"
  }
}